{
    "1 AUGUST": {
        "part1": "2 Samuel 15:24-26",
        "part2": "\"If I shall find favour ...\"",
        "part3": "VERSE 25",
        "part4": "And the king said unto Zadok, carry back the ark of God into the city: if I shall favour in the eyes of the LORD, He will bring me again, and shew me both it, and His habitation.",
        "part5": "After the people had left Jerusalem, King David instructed Zadok and Abiathar to go back with the ark. He was not superstitiously thinking that the ark gave blessing and deliverance as was the mistake of others in the past [1 Samuel 4:3- 11]. At that battle, the Philistines had captured the ark, and Hophni and Phinehas, the two sons of high priest Eli were killed. While David knew its construction was ordered by God, he would not make an idol of it.\n\nThe ark contained manna, Aaron's rod that budded and the tablets of the Law. These reminded the Israelites of God's providence, God's ordained priest's authority and God's holiness and revealed way to live. However, David sought God Himself and would not commit the sin of idolatry by elevating these objects to the level of God. These items were not to be looked to for deliverance.\n\nDavid acknowledges that God is sovereign and were he to re-enter Jerusalem, it would be because of God's favour and grace. He is submitting to God as the sovereign, gracious and personal God that He has revealed Himself to be. David is totally surrendered to God's will and His sustaining grace. He is not merely voicing his desire to return. His trust and reliance run so deep he is prepared, that should God not be pleased with him [v. 26], he will submit to God's ordained outcome. David hopes to see the ark and the temple again for they represented His presence and His habitation, but above all he desired God Himself, not the physical trappings.",
        "part6": "THOUGHT",
        "part7": "The objects in the ark pointed to the Lord Jesus Christ, in whose completed work of salvation on the Cross, we are able to come boldly into God's presence with praise and thanksgiving.",
        "part8": [
            "JUDGES 13",
            "ACTS 19"
        ]
    },
    "2 AUGUST": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 29 for the people in Jerusalem to worship God. He",
        "part4": "Zadok therefore and Abiathar carried the ark of God again to Jerusalem: and they tarried there.",
        "part5": "David's son Absalom had usurped the father's throne. David had to flee after Absalom had commandeered the palace. High priest Zadok brought the Ark of the Covenant along with them when David fled Jerusalem, but he instructed both Zadok and Abiathar (another high priest) to return with the Ark to Jerusalem. The purpose for them to return was twofold: Firstly, to attend to their priestly functions and secondly, to spy on Absalom.\n\nThough he was on the run, David's heart was for the people in Jerusalem to worship God. He was concerned for their spiritual well-being lest they fall away. He wanted Zadok and Abiathar to be guiding, teaching and leading in the worship of God there. David knew how the Jews turned to idols in the past when they lost the guidance of godly priests. This was Zadok and Abiathar's primary responsibility.\n\nDavid was also thinking how he might eventually return. He needed to know what Absalom was planning so he could make his own strategic moves. Both Zadok and Abiathar were to act as David's eyes and ears in Jerusalem. This was the second reason for sending them back.\n\nWe draw near to God through prayer and reading His Word. When we walk with Him, we will be obedient to His teaching. One of His commandments is to love our brothers. David so loved his subjects that he sent Zadok and Abiathar back to Jerusalem with the Ark. We may be pious in church on Sunday but how are we on the other six days? How does our walk with God look like when we are away from the company of God's people?",
        "part6": "",
        "part7": "Lest there should be among you man, or woman, or family, or tribe, whose heart turneth away this day from the LORD our God, to go and serve the gods of these nations; lest there should be among you a root that beareth gall and wormwood. - Deuteronomy 29:18",
        "part8": []
    },
    "3 AUGUST": {
        "part1": "2 Samuel 15:30-31",
        "part2": "David's tears",
        "part3": "VERSE 30",
        "part4": "And David went up by the ascent of mount Olivet, and wept as he went up, and had his head covered, and he went barefoot: and all the people that was with him covered every man his head, and they went up, weeping as they went up.",
        "part5": "King David's prowess was renowned. He had won many wars. He slew the giant. He was battle-seasoned and a valiant soldier. Now he was reduced to a refugee, a fugitive running from a son whom he loved very much. He trudged barefooted up mount Olivet. There he could see Jerusalem. Surely, he reflected on his own sins; how he plotted a loyal servant's death so he could take his wife. David had many other wives and could have many more, but he coveted the only one who belonged to Uriah! What regret must have flooded the heart and mind of David when he saw the royal city lost to a turncoat. There he wept with a heavy heart, remorseful for his sins and sorrowful that a son of his own blood had done this to him. But David prayed. The erstwhile lord and king of Israel was praying to the King of kings, Lord of lords. Our Lord Jesus was also on mount Olivet (Mount of Olives) looking at Jerusalem. And He wept. David wept for himself, but the Lord Jesus was weeping for the people in their sins and a city soon to be destroyed. God loves each one of us, but we were lost in sin and turned against Him. The Lord Jesus wept for the depravity of man. He loved us and was sorrowful for us. He would die to redeem us from our helpless state. Hallelujah, He rose from death and lives again. And if we accept Him as our Saviour, we will also rise and live with Him again.",
        "part6": "THOUGHT",
        "part7": "And when He (our Lord Jesus Christ) was come near, He beheld the city (Jerusalem), and wept over it. - Luke 19:41",
        "part8": [
            "JUDGES 15",
            "ACTS 21"
        ]
    },
    "4 AUGUST": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 32a God instructs us to worship Him in His sanctuary",
        "part4": "And it came to pass, that when David was come to the top of the mount, where he worshipped God.",
        "part5": "He was in desperate straits, hopeless by human standards, but Scripture recorded that David worshipped. He was in an uncomfortable position and place in life, but David did not blame God. Instead, he worshipped Him. His faith did not falter with his circumstances. David wrote Psalm 3 on this occasion. God is never far away but with us at all times. We may have forgotten Him, but He does not forget us.\n\nGod instructs us to worship Him in His sanctuary and to assemble with the brethren. However, when this is not possible, as in this pandemic, we thank Him that we are still able to worship Him at home. Wherever we are, we worship with reverence for the Lord is holy. The place of true worship is in the heart. Therefore, we are to watch our hearts and mind how we worship.\n\nThis is a great mystery. God is already glorious, and our worship contributes not one bit to make Him more glorious. But still, He desires it and thus we worship Him. We need Him in our lives. He created us, loves us, deals with us according to His mercy through grace. Our Lord Jesus gives us eternal life by forgiving our sins. He bestows countless blessings upon us. We are thankful and grateful, so we worship God. It is our expression of love and reverence for Him alone. And it is an honour that He gives us the opportunity to do this.",
        "part6": "",
        "part7": "Give unto the LORD the glory due unto His name; worship the LORD in the beauty of holiness. - Psalm 29:2",
        "part8": [
            "JUDGES 16",
            "ACTS 22",
            "THOUGHT Give unto the LORD the glory due unto His name;",
            "worship the LORD in the beauty of holiness.",
            "- Psalm 29:2"
        ]
    },
    "5 AUGUST": {
        "part1": "Psalm 3",
        "part2": "David's worship of God (II)  PSALM 3:8 Salvation belongeth unto the LORD: Thy blessing as upon Thy people.  To CompLtete THE BiBLeE",
        "part3": "",
        "part4": "Salvation belongeth unto the LORD: Thy blessing is upon Thy people.",
        "part5": "This Psalm gives us insight into the mind of David as he fled from his own son.\n\nIn verse 1, we see David feeling very discouraged. He perceived that many foes had risen against him. This led to his reflection in verse 2, where he shared what other Israelites might have thought of his plight - that even God had forsaken him.\n\nHowever, we see that while David might have been feeling this way, in verse 3 he picked himself up by looking to God. He testified in the subsequent verses that as he cried out to God for deliverance, God answered his prayer. David testified to the inner peace that he experienced so that he was able to sleep each night knowing God would be gracious to him. The psalm ended on a triumphant note as David testified how God had helped him defeat his enemies, and he gave all glory to God. It is not David's strength that is emphasised here. Rather, the king's weaknesses are in full view, but we see God's strength being sufficient for him. And this leads him to engage in sincere and joyful praise.\n\nIn our times of distress, we can look to this Psalm and draw encouragement from it. When we are able to testify of God's goodness in our lives no matter what, then we worship Him in spirit and in truth. Such is sincere experiential worship.",
        "part6": "THOUGHT",
        "part7": "Do I meditate on what God has done for me so that I am able to thank and praise Him in spite of my circumstances?",
        "part8": [
            "JUDGES 17",
            "ACTS 23"
        ]
    },
    "6 AUGUST": {
        "part1": "2 Samuel 15:32b",
        "part2": "Hushai's sympathy",
        "part3": "VERSE 32",
        "part4": "And it came to pass, that when David was come to the top of the mount, where he worshipped God, behold, Hushai the Archite came to meet him with his coat rent, and earth upon his head:",
        "part5": "This is the first time that Hushai is mentioned in the Bible. We know little of who he is save that he later became King David's companion [1 Chronicles 27:33]. Here, however, Hushai appeared as God's answer to David's prayer. When David heard that wise Ahithophel had defected and joined Absalom, he had prayed [2 Samuel 15:31] for God to intervene and make Ahithophel's counsel come to naught.\n\nIn the next verse, we see God beginning to answer this prayer through the appearance of Hushai. The first things that Hushai provided to David was comfort and sympathy. He came with rent coat and earth upon his head as a sign of shared grief. Hushai expressed visibly sympathy and empathy for the king's plight. We do not know what was going through Hushai's mind at that time, but he came and was available to the king in his time of need. Little did he himself know he would be of help to David.\n\nWhen we encounter others in trouble or sorrow, do we have enough love to feel their grief with them? Are we willing to offer support by our actions? We may not know exactly how we can be of help; nevertheless, let us just be there and available as vessels and channels for our Master's use.",
        "part6": "THOUGHT",
        "part7": "Channels only, blessed Master, But with all Thy wondrous pow'r Flowing through us, Thou canst use us, Every day and every hour. - Mary E Maxwell",
        "part8": [
            "JUDGES 18",
            "ACTS 24"
        ]
    },
    "7 AUGUST": {
        "part1": "2 Samuel 15:33-37",
        "part2": "Hushai's loyalty",
        "part3": "VERSE 36",
        "part4": "Behold, they have there with them their two sons, Ahimaaz Zadok's son, and Jonathan Abiathar's son; and by them ye shall send unto me every thing that ye can hear.",
        "part5": "Here we see Hushai's loyalty in supporting David in his moment of need. God's answer to David's prayer for help was timely indeed and came almost instantly in response. We may be impatient when God does not seem to answer us straight away. Just remember God's answers are never late.\n\n\"Here we have met Yahweh's delightful providence again. How it must have heartened David. No sooner does he pray than Yahweh begins to answer his prayer - and that in a way no scriptwriter could have guessed. Our prayers deal with the what: God's answer deals with the what, the how and the when. And how the how can surprise us!\" (Dale Ralph Davis, 2 Samuel). God always gives more than we deserve. And His answers can be surprising indeed.\n\nAt this point in time, Hushai's presence by Absalom's side was more helpful to David than his companionship. David ordered him back to serve Absalom with the motive to thwart Ahithophel's counsel.\n\nIs it right for David to send Hushai on an errand that is morally dubious? Some would argue that war and diplomacy, subterfuge, deception and camouflage should be part of one's stratagem. We have to admit that in this case, Hushai's loyalty to David is commendable, but it is not Christian morality. And even in ordinary life, there are times when expediency overrides ethics. However, we have to bear in mind that this is a historical narrative, meaning to say that we must not assume that God approves everything that is recorded in Holy Scripture. If anything, David's scheme and Hushai's unquestioned loyalty show us that our morality falls far short of God's teaching.",
        "part6": "THOUGHT",
        "part7": "Good ends do not justify bad means.",
        "part8": [
            "JUDGES 19",
            "ACTS 25"
        ]
    },
    "8 AUGUST": {
        "part1": "2 Samuel 16:1",
        "part2": "Ziba",
        "part3": "VERSE 1",
        "part4": "And when David was a little past the top of the hill, behold, Ziba the servant of Mephibosheth met him, with a couple of asses saddled, and upon them two hundred loaves of bread, and an hundred bunches of raisins, and an hundred of summer fruits, and a bottle of wine.",
        "part5": "We first met Ziba in 2 Samuel 9. He was a servant of Saul. When David became king after Saul, he had asked whether anyone remained from Saul's house that he could show his kindness to him [2 Samuel 9:1]. Ziba was the man who led David to Mephibosheth, Jonathan's lame son. David took Mephibosheth in, caring for him as he had promised Jonathan [1 Samuel 20:14-15]. Because of this hesed covenant, this son of Jonathan would eat continually at the king's table [2 Samuel 9:13].\n\nDavid had also left instructions for Ziba, \"Thou therefore, and thy sons, and thy servants, shall till the land for him, and thou shalt bring in the fruits, that thy master's son may have food to eat ...\" [2 Samuel 9:10]. It should be a relief for this servant of the previous king, that the new king not only spared his life, but also retained him to continue what he had been doing before, thus allowing Ziba to maintain his successful and comfortable status quo. And Ziba was not a poor servant, for we are told he had fifteen sons and twenty servants then.\n\nBut Ziba was not a contented man, and he would prove himself an unworthy steward. Seven chapters later, avarice had totally consumed him. He had much, yet wanted more. As David departed in haste from Jerusalem, Ziba devised a wicked plot. Coming before the king with his gifts, Ziba schemed to accuse Mephibosheth and secure David's favour at the expense of his master.",
        "part6": "THOUGHT",
        "part7": "And He said unto them, Take heed, and beware of covetousness: for a man's life consisteth not in the abundance of the things which he possesseth. - Luke 12:15",
        "part8": [
            "JUDGES 20",
            "ACTS 26"
        ]
    },
    "9 AUGUST": {
        "part1": "2 Samuel 16:2-4",
        "part2": "Ziba's opportunism",
        "part3": "VERSE 4",
        "part4": "Then said the king to Ziba, Behold, thine are all that pertained unto Mephibosheth. And Ziba said, I humbly beseech thee that I may find grace in thy sight, my lord,",
        "part5": "Ziba met David with generous and helpful gifts. He prepared saddled donkeys, food and wine to help relieve and refresh David and his men. When David asked about Mephibosheth, Ziba informed that his master was in Jerusalem. Ziba was manipulative. He lied to David insinuating that Mephibosheth was there awaiting the power of Saul's house over Israel to be restored to him. This was pure slander.\n\nThis implied that Mephibosheth had betrayed the king's kindness and was disloyal. It also made Mephibosheth appear to wish for David's destruction. 2 Samuel 19:24-30 tells us Ziba betrayed his master and slandered him. It was a shameless and despicable act since it was untrue and especially when he knew David would be disheartened that the son of his loyal best friend Jonathan had turned against him during his crisis.\n\nZiba had cunningly schemed to gain David's favour. Without verifying Ziba's information or pondering it over, David hastily rewarded Ziba with all the possessions that pertained to Mephibosheth. David should at least have been a little sceptical about Ziba's words and sought counsel from God. The Bible tells us that \"he that answereth a matter before he heareth it, it is folly and shame unto him\" [Proverbs 18:13].\n\nSeek wisdom and discernment from the Lord. Be still in the Lord and set aside time to pray and receive His counsel. Do not be troubled by afflictions. Pray for God's help to be wise and discerning, patiently waiting for His answer. As stated in Proverbs 8:14, \"Counsel is Mine, and sound wisdom: I am understanding; I have strength.\"",
        "part6": "PRAYER",
        "part7": "O God, I pray that You protect us from all evil and give us wisdom to discern good and bad. Guide us to make wise choices in accordance to Your will. May I seek You more and more. Amen.",
        "part8": [
            "JUDGES 21",
            "ACTS 27"
        ]
    },
    "10 AUGUST": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 6 and his servants. Depressing as it already was for",
        "part4": "And he cast stones at David, and at all the servants of king David: and all the people and all the mighty men were on his right hand and on his left.",
        "part5": "David's next encounter was with a man called Shimei as they approached Bahurim, a city northeast of Jerusalem, belonging to the tribe of Benjamin. Shimei was a Benjamite and a distant relative of the former king. Shimei harboured personal hatred and enmity against David. He resented David and attributed the fall of Saul to him.\n\nShimei was enraged and threw stones at David and his servants. Depressing as it already was for David to be betrayed and overthrown by his own son, it must have been even worse for him to bear now these unwarranted curses from Shimei. Shimei's offensive words were unjustified because David did not cause the fall of Saul's kingdom or his death.\n\nDavid wrote Psalm 7 in response to the slanderous accusations of those who claimed he was responsible for Saul's death. Instead of taking revenge himself, David cried out to God for justice against those who persecuted the innocent. He took refuge in the Lord and asked God to deliver him from his pursuers.\n\nOftentimes, we too are hurt by people's unfounded slanders and accusations. Do not rush to take revenge but pray and seek the Lord for comfort and vindication. We can trust that He will help us through our darkest moments and restore us. He is the God of justice, strength and victory.",
        "part6": "",
        "part7": "O Lord my God, in Thee do I put my trust: save me from all them that persecute me, and deliver me. Read Psalm 7.",
        "part8": [
            "RUTH 1",
            "ACTS 28",
            "THOUGHT O Lord my God, in Thee do I put my trust: save",
            "me from all them that persecute me, and deliver",
            "me. Read Psalm 7."
        ]
    },
    "11 AUGUST": {
        "part1": "2 Samuel 16:7-8",
        "part2": "Shimei's curses",
        "part3": "VERSE 8",
        "part4": "The Lord hath returned upon thee all the blood of the house of Saul, in whose stead thou hast reigned; and the Lord hath delivered the kingdom into the hand of Absalom thy son: and, behold, thou art taken in thy mischief, because thou art a bloody man.",
        "part5": "Shimei hurled abusive words at David. He cursed \"come out, come out ... \" which literally is \"go out, be gone out of thy kingdom, as thou deserve\", accusing David to be a man of blood and exulting that God was repaying him for all his deeds. Perhaps he was thinking of Uriah's murder. But certainly, he accused David of being responsible for \"the blood of the house of Saul\" including Abner [2 Samuel 3:27] and Ishbosheth [2 Samuel 4:8], Jonathan, Abinadab, and Malchishua [1 Samuel 31:2-3].\n\nDavid took Shimei's curses with humility. He was unprovoked by Shimei's false accusations, but he must have been grieved by those malicious words. David was scoffed at, mocked, humiliated, unfairly treated and falsely accused. But he turned to the Lord for hope, encouragement and strength. He wrote Psalm 69, where he cried out to God in his distress. He was physically exhausted and mentally devastated. Yet David trusted in the Lord and sought refuge in Him.\n\nWhen we are down and disappointed, rejected and hopeless, do not give up. Seek the Lord's help to overcome in His strength, joy, grace and glory. Then, remember to thank God for what He has done for us. Worship and praise God for His marvellous love and divine power. God our heavenly Father is always in control.",
        "part6": "THOUGHT",
        "part7": "Be submissive, be faithful and be righteous. Always remember God's goodness and mercy. Be thankful and know that God will execute justice in His time.",
        "part8": [
            "RUTH 2",
            "ROMANS 1"
        ]
    },
    "12 AUGUST": {
        "part1": "2 Samuel 16:9-10",
        "part2": "David's response",
        "part3": "VERSE 10",
        "part4": "And the king said, What have I to do with you, ye sons of Zeruiah? so let him curse, because the LORD hath said unto him, Curse David. Who shall then say, Wherefore hast thou done so?",
        "part5": "David did not try to shut up Shimei. He did not close his ears to unpleasant and critical words. David let Shimei speak because he saw the hand of God in every circumstance. David was willing to hear what God might say to him through a cursing critic. Instead of retaliating as his friends wanted to do, David resigned himself to God's providence.\n\nThough God does not cause evil to happen to us, He sovereignly allows it because the testing of our faith strengthens it over time. Dealing with verbal abuse and hurtful comments is exhausting but lashing out in response is never helpful. When David refused to retaliate, he was able to be refreshed. David's reaction models a healthy response to unjust ridicule.\n\nWhat would you have said? Think about a person who is a thorn in your flesh. How relieved you would be if that person was no longer in your life! How tempting it must have been for David to say, \"Deal with him.\" Just a word and all would have been over for Shimei. If you are the subject of hateful remarks, first consider if there is reason for them? If you have caused offence, can you ask for forgiveness and restore the relationship? If the hurtful words were said simply out of spite, what can you take from David's example to follow? How can you handle the situation in a way that will show God's presence in your life?",
        "part6": "THOUGHT",
        "part7": "A soft answer turneth away wrath: but grievous words stir up anger. - Proverbs 15:1",
        "part8": [
            "RUTH 3-4",
            "ROMANS 2"
        ]
    },
    "13 AUGUST": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 11 David's life thereafter was just the reaping of what",
        "part4": "And David said to Abishai, and to all his servants, Behold, my son, which came forth of my bowels, seeketh my life: how much more now may this Benjamite do it? let him alone, and let him curse; for the LORD hath bidden him.",
        "part5": "David saw the hand of God even in being maligned and cursed by Shimei. He knew that God had called him to walk through this valley of humiliation. Shimei added insult to David's injury. But there was some truth to his chastisement of the king. David was hardly innocent. He had taken the life of innocent Uriah and would be called to account by the righteous Judge. He was forgiven but would have to bear the consequences of his actions. The chain of sorrowful events that dogged David's life thereafter was just the reaping of what he had sown in those few unguarded moments when he saw, lusted and took. So, David accepted that the Lord had sent this man to curse him. If the Sovereign God had willed and directed this, then no one could question it, least of all David.\n\nIt is always easy to see the hand of God, when good things are happening to us. But, when bad things happen, we quickly forget God is also in the picture. The bad experience, painful trial or unkind person is all we see. But David did not lose sight of God in the dark moments of his life. He knew the Lord was there and in control.\n\nAre we constantly mindful that God is working in every moment of our life? Whether circumstances are good or bad, God is always working it for good to those who love Him. If we submit to Him, He will ultimately turn the cursing into a blessing and our mourning into rejoicing.",
        "part6": "",
        "part7": "God is always present where you are, and He is always at work.",
        "part8": [
            "1 SAMUEL 1",
            "ROMANS 3",
            "THOUGHT God is always present where you are, and He ts",
            "always at work."
        ]
    },
    "14 AUGUST": {
        "part1": "2 Samuel 16:12",
        "part2": "David's hope",
        "part3": "VERSE 12",
        "part4": "It may be that the LORD will look on mine affliction, and that the LORD will requite me good for his cursing this day.",
        "part5": "Although David had committed no murder on the house of Saul, and Shimei's cursing was nothing but malicious accusations, David felt it was deserved because of his sins, though not for the sin he was being accused of. The venom of Shimei's words was nothing compared to the guilt in David's heart and the pain of Absalom's rebellion. And he sought comfort in the possibility that God might yet overrule this trouble for his own ultimate blessing.\n\nDavid submitted to the Lord's chastening. It was better to be at God's mercy than to take matters into his own hands. He could accept God's judgement because God's grace was greater than David's sin. He spoke not so much with assurance, but only with hope. He knew what his sins deserved but he had hope God would deal mercifully with him.\n\nDavid reminds us that we can turn to the God of grace who will yet bless. At this point in David's life, he was not sure what God was doing to him. But he had hope that God could turn those curses into blessings. If you are struggling with the consequences of your sin, let David's words encourage you. Even as you face the reality of sin in your life, turn to God and seek His forgiveness. The God of grace delights to forgive and restore.",
        "part6": "THOUGHT",
        "part7": "Biblical hope is not wishful thinking, but a confident expectation. \"Blessed is the man that trusteth in the LORD, and whose hope the LORD is.\" - Jeremiah 17:7",
        "part8": [
            "1 SAMUEL 2",
            "ROMANS 4"
        ]
    },
    "15 AUGUST": {
        "part1": "2 Samuel 16:13-14",
        "part2": "Ongoing humiliation and God's provision",
        "part3": "VERSE 14",
        "part4": "And the king, and all the people that were with him, came weary, and refreshed themselves there.",
        "part5": "Shimei would not go away. As David made his way to Bahurim [v. 5], this nasty man followed, cursing and casting stones and dust at them. This was a way of saying, \"I wish you were dead.\"\n\nAt times in life, we may seem to be plagued with a problem that will not go away despite our earnest prayers. The apostle Paul spoke of the thorn in his flesh he had entreated the Lord thrice to remove but it was not to be. Instead, Paul learnt the sufficiency of God's grace and strength through that perpetual painful problem [2 Corinthians 12:7-9].\n\nThen we see here an interesting thing that happened. We are told that David's band came weary to Bahurim, encountered surliness and inhospitality, but found refreshment there, in the unlikeliest of places. It was as though a little candle had been lit and its light was cutting through the fog of gloom.\n\nThis is the secret of God's presence with every child of His. It is not dependant on circumstances, it does not look to people and it can be in any place. Even in the most trying of times in our lives, when everything seems to be going wrong, all hope lost, closest of friends desert us, and enemies curse and throw stones at us, we can find refreshment at our Bahurim because the Lord will meet us there.\n\nWell might David have reflected on this occasion when he penned the 31st Psalm: \"Thou shalt hide them in the secret of Thy presence from the pride of man: Thou shalt keep them secretly in a pavilion from the strife of tongues. Blessed be the LORD: for He hath shewed me His marvellous kindness in a strong city\" [v. 20-21].",
        "part6": "THOUGHT",
        "part7": "And He said unto me, My grace is sufficient for thee: for My strength is made perfect in weakness. - 2 Corinthians 12:9a",
        "part8": [
            "1 SAMUEL 3",
            "ROMANS 5"
        ]
    },
    "16 AUGUST": {
        "part1": "2 Samuel 16:15-19",
        "part2": "Hushai's stratagem and Absalom's Deception",
        "part3": "VERSE 18",
        "part4": "And Hushai said unto Absalom, Nay; but whom the LORD, and this people, and all the men of Israel, choose, his will I be, and with him will I abide.",
        "part5": "Hushai, a loyal friend of David was sent back to defeat the counsel of Ahithophel, who had joined Absalom in his coup. But returning now to Jerusalem was risky, for his friendship with David was no secret. Such a hazardous undertaking surely had little chance of success especially with Ahithophel there providing counsel to Absalom.\n\nAppearing before Absalom, Hushai greeted the king royally. Absalom naturally was suspicious and questioned Hushai's defection from his friend. Instead, Hushai pledged allegiance to the divine appointment and popular choice of the people. But note that Hushai did not name the king to whom he would give allegiance and serve [v. 18- 19]. His answer was astute. These were the right words in a tricky situation. It would allay Absalom's suspicion and doubt. Absalom would feel Hushai was indeed a welcome asset to his cause. Absalom may even have thought this was a confirmation from the Lord that the kingdom was now his, with both Ahithophel and Hushai joining him.\n\nThis account speaks just as much of Absalom's self-delusion as of Hushai's astuteness. Absalom's conceit blinds him to the improbability of Hushai's supposed desertion of David. If he were wise, Absalom would have asked Hushai, \"Is this how you treat your king and friend?\"\n\nThe same question may be asked of Demas who forsook Paul because he loved this present world [2 Timothy 4:10]. Our Lord Jesus directed a similar question to the twelve, \"Will ye also go away?\" [John 6:67], after the multitude returned \"and walked no more with Him\". It may well be asked of backsliders who walk no more with our Saviour.",
        "part6": "THOUGHT",
        "part7": "What a Friend we have in Jesus! Remember therefore your vows of love, loyalty, and service to our Lord Jesus Christ, our royal Friend.",
        "part8": [
            "1 SAMUEL 4",
            "ROMANS 6"
        ]
    },
    "17 AUGUST": {
        "part1": "2 Samuel 16:19",
        "part2": "\"Whom should I serve?\"",
        "part3": "VERSE 19",
        "part4": "And again, whom should I serve? should I not serve in the presence of his son? as I have served in thy father's presence, so will I be in thy presence.",
        "part5": "Hushai's testimony of loyal service and being a trusted friend to the king was well-known and recognised. Such are rare virtues and useful in the royal court. He served not only the appointed king but also the LORD God Himself. Before Absalom, he asserted his disregard for political rivalries but pledged allegiance to whomsoever God, in His providence, had appointed king. All he wished was to be useful to the king and contribute to the growth and prosperity of the kingdom.\n\nIn word and deed, he showed honesty and unflinching loyalty. Such qualities in a man would be the king's delight to have beside him and in his service. \"He that loveth pureness of heart, for the grace of his lips the king shall be his friend.\" [Proverbs 22:11]\n\nWhat a joy and honour to be a personal friend of the highest in the country, to have his trust and be of use to him. Is the Lord Jesus, who is higher than the highest on earth, your King? Hear what He said, \"Henceforth I call you not servants; for the servant knoweth not what his lord doeth: but I have called you friends; for all things that I have heard of my Father I have made known unto you\" [John 15:15]. God called Abraham His friend [Isaiah 41:8]. Christians, what a Friend we have in our Lord Jesus! He is the Word that reveals to us the heart of God, His thoughts, His mind and His will. In Him we can confide our innermost thoughts and secrets. Let us show our frevent love to our King and Friend by our faithful service.",
        "part6": "THOUGHT",
        "part7": "Ye are My friends, if ye do whatsoever I command you. - John 15:14",
        "part8": [
            "1 SAMUEL 5-6",
            "ROMANS 7"
        ]
    },
    "18 AUGUST": {
        "part1": "2 Samuel 16:20-23",
        "part2": "Wicked counsel of Ahithophel",
        "part3": "VERSE 21",
        "part4": "And Ahithophel said unto Absalom, Go in unto thy father's concubines, which he hath left to keep the house; and all Israel shall hear that thou art abhorred of thy father: then shall the hands of all that are with thee be strong.",
        "part5": "To establish Absalom as the new king and for his own self-preservation, Ahithophel sought to cause an irreconcilable divide between son and father, and strengthen the hands of those who supported him in the coup. He advised Absalom to publicly commit abominable fornication with his father's concubines [Deuteronomy 27:20].\n\nIn ancient times among the pagan nations, appropriation of the royal harem was an act demonstrating subjugation and domination of the throne. Ahithophel under the cover of this sought revenge, for he was grandfather of Bathsheba, daughter of Eliam his son [2 Samuel 11:3; 2 Samuel 23:34]. When David ordered the death of Uriah to conceal his adulterous sin and take Bathsheba to be his wife, the seed of hatred and revenge was planted in her grandfather's heart. What David shamefully did with Bathsheba, Ahithophel now counselled Absalom to do the same with David's concubines. What David did to Bathsheba's husband, he plotted to repay in kind to David himself. Absalom willingly submitted to Ahithophel's counsel for he was eyeing the throne. Ahithophel by his counsel was eyeing vengeance.\n\nFallen men with unregenerate hearts are able to conceive and commit the most deplorable acts. Their depraved minds have neither regard for God's holy law nor their own reputation. \"The heart is deceitful above all things, and desperately wicked: who can know it?\" [Jeremiah 17:9]. Ahithophel, the adviser, and Absalom, the actor, were both culpable for this heinous sin in God's eyes. Let us be careful when we give counsel to others that we do it for their good and not for our gain. And let us when seeking man's counsel to always measure it against the perfect standard of God's revealed Counsel.",
        "part6": "THOUGHT",
        "part7": "Now the end of the commandment is charity out of a pure heart, and of a good conscience, and of faith unfeigned. - 1 Timothy 1:5.",
        "part8": [
            "1 SAMUEL 7-8",
            "ROMANS 8"
        ]
    },
    "19 AUGUST": {
        "part1": "2 Samuel 16:23",
        "part2": "Beware of counsel",
        "part3": "VERSE 23",
        "part4": "And the counsel of Ahithophel, which he counselled in those days, was as if a man had enquired at the oracle of God: so was all the counsel of Ahithophel both with David and with Absalom.",
        "part5": "Ahithophel was widely known as the king's counsellor [1 Chronicles 27:33]. He occupied the honoured position at the king's right hand. The counsel he gave was regarded as coming from a \"seer\", one who could see visions from God and even the future. He and the former king made an excellent pair. David could have been writing about their partnership in his psalm, \"We took sweet counsel together, and walked unto the house of God in company\" [Psalm 55:14].\n\nAbsalom also sought Ahithophel's counsel and conspired with him to overthrow David. It is likely he knew the relationship of Ahithophel with Bathsheba and Uriah, and the injustice Ahithophel's family suffered. He could certainly relate to this because his half-brother Amnon had raped his sister Tamar and David did nothing. Sharing the same grievance, they now shared the same goal. In this successful plot, Ahithophel would play a vital role.\n\nTo whom do we go for advice in times of crisis or major decisions? We do well to first seek Him whose name is called Wonderful, Counsellor [Isaiah 9:6] and seek His Word. Joshua and the princes \"asked not counsel at the mouth of the LORD\" when dealing with the Gibeonites and were deceived [Joshua 9:14b]. Then let the Lord lead us if need be, to godly brethren and spiritual leaders. Beware counsel whose end does not glorify God and whose means violate God's Word. \"Do not open your heart to every man but discuss your affairs with one who is wise and who fears God\" (Thomas a Kempis).",
        "part6": "THOUGHT",
        "part7": "Most counselling problems reflect a distorted view of God and a deficient relationship with Christ. - Robert Jones on Counseling the Hard Cases",
        "part8": [
            "1 SAMUEL 9",
            "ROMANS 9"
        ]
    },
    "20 AUGUST": {
        "part1": "2 Samuel 17:1-4",
        "part2": "Going for the kill",
        "part3": "VERSE 2",
        "part4": "And I will come upon him while he is weary and weak handed, and will make him afraid: and all the people that are with him shall flee; and I will smite the king only.",
        "part5": "Chapter 17 begins with Ahithophel giving another piece of advice to Absalom. His advice should be read in light of the preceding verse - that Ahithophel's counsel was regarded as almost divine. Clearly, Ahithophel possessed great wisdom and his advice would be critical to Absalom's success.\n\nAhithophel knew Absalom was not safe as long as David lived. He proposed launching a surprise attack on David with an elite force. They would strike while David was tired and discouraged and before he could rally his troops. Once smitten, David's supporters would flee in fear while the rest would reunite under the new king.\n\nAbsalom and the elders of Israel were pleased with Ahithophel's advice. We can see that Ahithophel indeed had a good grasp of the situation. David and his men were weary and disorganised at that point. Had Ahithophel gone for the kill that night, he likely would have succeeded.\n\nAhithophel had no qualms about killing the king, even offering to lead this \"murderous\" mission personally. This is in stark contrast to David who before had steadfastly refused to harm Saul despite having the opportunities, means, and good \"excuse\" to do so. Whereas David esteemed king Saul as the Lord's anointed, Ahithophel had neither fear nor regard for God's anointed or for God Himself.\n\nAs brilliant as Ahithophel's plan was, the outcome is in the hands of the Lord. We may not know the unrevealed will of our Sovereign God, but we may rest assured that those who despise Him will be lightly esteemed by Him.",
        "part6": "THOUGHT",
        "part7": "... for them that honour Me I will honour, and they that despise Me shall be lightly esteemed. - 1 Samuel 2:30",
        "part8": [
            "1 SAMUEL 10",
            "ROMANS 10"
        ]
    },
    "21 AUGUST": {
        "part1": "2 Samuel 17:3",
        "part2": "Getting rid to unite",
        "part3": "VERSE 3",
        "part4": "And I will bring back all the people unto thee: the man whom thou seekest is as if all returned: so all the people shall be in peace.",
        "part5": "It is interesting to note Ahithophel's argument in verse 3. He reasoned that killing David would unify the nation under Absalom. Lives lost are deemed necessary for unity.\n\nIn the wisdom of the world, it makes eminent sense to get rid of anything that stands in the way of achieving one's goals. Political rivals must be removed before the people can unite under one leader. Even the murder of one's own father may be justified in the name of bringing unity and peace under one kingship.\n\nBut Israel is a nation unlike any other for it is a nation established by God. Ultimately, God is her king; the human king is but a man appointed by God to govern and rule on His behalf. There is no unity except under the kingship of God, administered by His anointed. To Ahithophel, however, power and throne, peace and unity, can be obtained through political manipulation and the use of force.\n\nOur Lord showed us that God's kingdom is not one of violence but of peace. Instead of getting rid of us sinners, He rids us of sin and the wrath we deserve by bearing them Himself on the cross for all who put their trust in Him. It is His atoning sacrifice that brings all believers together as one in the body of our Lord Jesus Christ. So for Christians, unity is not obtained by getting rid of opponents. True unity can only be found at the foot of the cross when we submit to His lordship over our lives.",
        "part6": "THOUGHT",
        "part7": "With all lowliness and meekness, with longsuffering, forbearing one another in love; Endeavouring to keep the unity of the Spirit in the bond of peace. - Ephesians 4:2-3",
        "part8": [
            "1 SAMUEL 11",
            "ROMANS 11"
        ]
    },
    "22 AUGUST": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 5 Absalom. Why would Absalom want a second",
        "part4": "Then said Absalom, Call now Hushai the Archite also, and let us hear likewise what he saith.",
        "part5": "After Ahithophel had given his counsel to Absalom, the usurper sought Hushai's view on Ahithophel's proposal, thus giving him the opportunity to influence Absalom's decision.\n\nIt is inexplicable that Absalom should consult Hushai. Earlier, he had questioned Hushai's loyalty for not having gone with David [2 Samuel 16:17]. Although Hushai proffered some verbal assurance, he had done nothing to prove his allegiance to Absalom. Why would Absalom want a second opinion from him now? Absalom and the elders favoured Ahithophel's plan, and Ahithophel had a stellar reputation as a king's counsellor. One would reasonably expect Absalom to have more confidence in Ahithophel's advice than to consult another whose loyalty was in question.\n\nBut providence would have it that Absalom desired a second opinion. Perhaps he wanted the plan to be as failsafe as possible. This would mark the beginning of his downfall. Absalom did not merely seek Hushai's advice on what he thought best to do, he also divulged Ahithophel's entire plan and invited Hushai to critique it. Once Hushai knew what he was up against, he was able to devise a way to thwart Ahithophel's plan and buy time for David to regroup his forces. He began by boldly asserting to Absalom that his trusted counsellor's advice was \"not good at this time\", and followed that by using cunning rhetoric to undermine Absalom's confidence in Ahithophel's advice. Even as the two influential counsellors vied for the king's heart, we know that it is God's counsel that will ultimately stand.",
        "part6": "",
        "part7": "Remember the former things of old: for I am God, and there is none else; I am God, and there is none like me, declaring the end from the beginning, and from ancient times the things that are not yet done, saying, My counsel shall stand, and I will do all My pleasure. - Isaiah 46:9-10",
        "part8": []
    },
    "23 AUGUST": {
        "part1": "2 Samuel 17:8-10",
        "part2": "Reason: reputation of David",
        "part3": "VERSE 10",
        "part4": "And he also that is valiant, whose heart is as the heart of a lion, shall utterly melt: for all Israel knoweth that thy father is a mighty man, and they which be with him are valiant men.",
        "part5": "Hushai used clever words to convince Absalom that Ahithophel's advice was worthless. In effect, Hushai was telling Absalom: \"Do you really think Ahithophel can kill the king so easily? You know that your father and his men are a mighty force. Furthermore, they are enraged right now. Like bears robbed of their cubs, they will put up a fierce fight and your father is an expert in warfare. He will not camp with his troops but will hide in a place impossible for you to find. It is your men who will be killed. Once rumours of defeat spread, even your bravest soldier will panic. After all, everyone in Israel knows what mighty warriors your father and his men are.\"\n\nAbsalom bought the argument. We know the reality was closer to Ahithophel's assessment - David was exhausted rather than enraged; he was not hiding in any pit; he had not regrouped his forces; and at times he had even become too complacent to lead his army into battle. Nevertheless, David's fame as a mighty warrior preceded him. His reputation, built up over the years, enabled him to command fear and respect for his military prowess even among his enemies.\n\nWhat does your reputation say about you? Does it reflect a transformed life in Christ? Does it enhance your Christian testimony, or does it cause others to doubt the authenticity of your faith? Does it glorify God, or does it give people a reason to slander?",
        "part6": "THOUGHT",
        "part7": "A good name is rather to be chosen than great riches, and loving favour rather than silver and gold. - Proverbs 22:1",
        "part8": [
            "1 SAMUEL 13",
            "ROMANS 13"
        ]
    },
    "24 AUGUST": {
        "part1": "2 Samuel 17:11-13",
        "part2": "Hushai's counter proposal",
        "part3": "VERSE 11",
        "part4": "Therefore I counsel that all Israel be generally gathered unto thee, from Dan even to Beersheba, as the sand that is by the sea for multitude; and that thou go to battle in thine own person.",
        "part5": "Ahithophel called for a swift attack targeted at David himself. Hushai, however, advised Absalom to move cautiously and mobilise a massive force to wipe out David and all his supporters. The army would be gathered from across the land and led by Absalom. They would seek and destroy David and his men. Even if David were to hide in a city, they would tear it down to hunt him out.\n\nMuch as Ahithophel excelled in military strategy, Hushai surpassed him in craftiness. Hushai knew how to appeal to Absalom's vanity for this was Absalom who had surrounded himself with a retinue of chariots, horses and men to impress the citizens [2 Samuel 15:1]. Hushai's plan would allow Absalom a full display of pomp and pageantry at the head of a huge army. And rather than Ahithophel getting the credit for killing David, Absalom would receive the \"honour\" as their commander. Furthermore, this plan would also display his military prowess by eradicating all those alongside David.\n\nIn reality, Absalom's chance of success was grossly exaggerated. Hushai's plan served David's interest, not Absalom's. The time it would take to amass such an army would give David time to recover and regroup. Putting Absalom at the forefront of battle would ensure his ruin. Nevertheless, Absalom fell for Hushai's subterfuge. He who has a deceitful heart is now blinded by his own vanity and becomes the deceived.",
        "part6": "THOUGHT",
        "part7": "The human heart has so many crannies where vanity hides, so many holes where falsehood lurks, is so decked out with deceiving hypocrisy, that it often dupes itself. - John Calvin",
        "part8": [
            "1 SAMUEL 14",
            "ROMANS 14"
        ]
    },
    "25 AUGUST": {
        "part1": "2 Samuel 17:14",
        "part2": "Hushai's proposal accepted",
        "part3": "VERSE 14",
        "part4": "And Absalom and all the men of Israel said, The counsel of Hushai the Archite is better than the counsel of Ahithophel. For the LORD had appointed to defeat the good counsel of Ahithophel, to the intent that the LORD might bring evil upon Absalom.",
        "part5": "Why did Absalom choose the proposal of Hushai over that of Ahithophel even though the latter's plan was tactically superior? Some commentators believe it was partly due to Hushai's cunning in appealing to Absalom's ego throughout his lengthy presentation. Maybe, but that does not explain why even Absalom's generals changed their minds after they had earlier expressed satisfaction with Ahithophel's plan. The real reason is found in the second part of verse 14; it was the intent of the Lord to bring evil upon Absalom. It was God's unseen hand \"worketh all things after the counsel of His own will\" [Ephesians 1:11].\n\nIt is the privilege of Bible-believing Christians to be able to see God's unseen hand in the glove of history. Here we see it in the case of Absalom; first in his decision to seek a 'second opinion' from Hushai [v. 5], and then favouring his proposal. We see this also in numerous events recorded in the Bible, such as Daniel being brought \"into favour and tender love with the prince of the eunuchs\" [Daniel 1:9], and Esther obtaining \"grace and favour in (the sight of King Ahasuerus) more than all the virgins\" [Esther 2:17].\n\nAs Christians, we are to trust the Lord with all our heart and lean not unto our own understanding [Proverbs 3:5]. Let us stay confident and comforted that, regardless of the circumstances in our lives, our God will cause all things to \"work together for good to them that love God, to them who are the called according to His purpose\" [Romans 8:28].",
        "part6": "THOUGHT",
        "part7": "The king's heart is in the hand of the LORD, as the rivers of water: He turneth it whithersoever He will. - Proverbs 21:1",
        "part8": [
            "1 SAMUEL 15",
            "ROMANS 15"
        ]
    },
    "26 AUGUST": {
        "part1": "2 Samuel 17:15-17",
        "part2": "David's escape",
        "part3": "VERSE 16",
        "part4": "Now therefore send quickly, and tell David, saying, Lodge not this night in the plains of the wilderness, but speedily pass over; lest the king be swallowed up, and all the people that are with him.",
        "part5": "In David's psalms, he often thanked God for delivering him from his enemies. For example, in Psalm 18, he used the word \"deliver\" seven times to acknowledge God's deliverance. Today's passage is another such occasion where David managed to escape from Absalom's army. As in an earlier incident when David escaped Saul's assassins through the help of his wife Michal [1 Samuel 19], here he receives help from those God sent.\n\nAs soon as Hushai left the meeting with Absalom and his generals, he hastened to report to David via the priests Zadok and Abiathar as instructed by David earlier [2 Samuel 15:35]. The two priests then sent a maidservant to relay this information to their sons Jonathan and Ahimaaz who were waiting by the spring at Enrogel outside Jerusalem. There was no time to waste as it was likely Hushai did not know which proposal Absalom had adopted, his or Ahithophel's. Even if Absalom had accepted his, there was still the danger he could change his mind. David must immediately cross the Jordan before he and his troops are \"swallowed up\" by Absalom's army.\n\nAs followers of our Lord Jesus Christ, we too can call upon the Lord in our hour of distress and know that our cry will come before Him, even into His ears [Psalm 18:6]. Rest assured that the King of glory and Lord of hosts [Psalm 24:10] is able to deliver in the manner that is best for us and for the glory of His own name.",
        "part6": "THOUGHT",
        "part7": "Some trust in chariots, and some in horses: but we will remember the name of the LORD our God. - Psalm 20:7",
        "part8": [
            "1 SAMUEL 16",
            "ROMANS 16"
        ]
    },
    "27 AUGUST": {
        "part1": "2 Samuel 17:18-20",
        "part2": "Narrow escape",
        "part3": "VERSE 20",
        "part4": "And when Absalom's servants came to the woman to the house, they said, Where is Ahimaaz and Jonathan? And the woman said unto them, They be gone over the brook of water. And when they had sought and could not find them, they returned to Jerusalem.",
        "part5": "Ayoung man, possibly one of Absalom's spies, saw Jonathan and Ahimaaz talking to the maidservant and hurried back to report to Absalom. Realising they had been spotted, the two messengers fled and coming to a certain house in Bahurim, hid in the well in the courtyard. The brave woman of this house covered the well with a cloth, pretending to be drying the corn laid out on top of it. Her bravery and presence of mind saved their lives because Absalom would surely have killed them all if he found out the truth.\n\nThis nail-biting episode is yet another example of how the Lord used an ordinary woman to fulfil His plan for the redemption of mankind. We are reminded how Rahab saved the two spies in Jericho [Joshua 2] and ultimately became grafted into the line of David's ancestors. We also think of Esther, who apart from her physical beauty, was just an ordinary Jewish girl. But God used her to rescue the Jews from annihilation by Satan during the time of the Medo-Persian Empire. Thus preserved the children of Israel to welcome their Messiah, who would be born to the family of Joseph some four and a half centuries later.\n\nThe lesson of these stories for ordinary people like us is that we must be ready to serve the Lord when the opportunity arises; \"and who knoweth whether thou art come to the kingdom for such a time as this?\" [Esther 4:14].",
        "part6": "THOUGHT",
        "part7": "When God calls you, He enables you and He sees you through. - Warren W. Wiersbe in On Being a Servant of God",
        "part8": [
            "1 SAMUEL 17",
            "1 CORINTHIANS 1"
        ]
    },
    "28 AUGUST": {
        "part1": "2 Samuel 17:21-22",
        "part2": "A happy ending",
        "part3": "VERSE 22",
        "part4": "Then David arose, and all the people that were with him, and they passed over Jordan: by the morning light there lacked not one of them that was not gone over Jordan.",
        "part5": "The reader may heave a sigh of relief when he reads in verse 22 the happy ending in yet another dramatic episode in the life of David. The villain's plan is thwarted, and our hero escapes. Exciting though the narrative has been, still we all know there will be a happy ending because of the spoiler in verse 14, \"that the LORD might bring evil upon Absalom\".\n\nThis is the case throughout the Bible, whether it was the fate of Joseph in the Egyptian prison, Daniel in the lions' den or Mordecai in the Persian court. We know how the story will end because its Author says, \"I am God, and there is none like Me, declaring the end from the beginning, and from ancient times the things that are not yet done, saying, My counsel shall stand, and I will do all my pleasure\" [Isaiah 46:9b-10]. No wonder, Elwood McQuaid, author of the book It is No Dream, said that the history of Israel is pre-written history. God has already recorded it for us in Scripture.\n\nThis knowledge should give us the confidence to face the trials of life because we know who holds tomorrow. Warren Wiersbe said in his book, On Being a Servant of God, \"If God has called you to minister, no matter what that ministry may be, He hasn't made a mistake. He knows what He's doing, and the best thing you can do is gratefully submit to His will and trust Him to work.\"",
        "part6": "THOUGHT",
        "part7": "Many things about tomorrow, I don't seem to understand. But I know who holds tomorrow, and I know who holds my hand. - Ira Stanphill",
        "part8": [
            "1 SAMUEL 18",
            "1 CORINTHIANS 2"
        ]
    },
    "29 AUGUST": {
        "part1": "2 Samuel 17:23",
        "part2": "A tragic end",
        "part3": "VERSE 23",
        "part4": "And when Ahithophel saw that his counsel was not followed, he saddled his ass, and arose, and gat him home to his house, to his city, and put his household in order, and hanged himself, and died, and was buried in the sepulchre of his father.",
        "part5": "Seeing that Absalom had rejected his counsel and chosen instead to listen to David's friend, Ahithophel decided to end his own life. His treacherous scheme to eliminate the former king had failed. His dreams had crumbled, and his carefully laid plans had come to nought. Hence, while David travelled to Mahanaim, Ahithophel returned to his home, set his affairs in order, and hanged himself. What caused him to do such a tragic thing?\n\nFirstly, he could not bear the shame of being slighted. His ambition of being the power behind the new king appeared to be on the way to fulfilment until this unexpected turn of events. Secondly, his hope of leading the attack and basking in its victory had evaporated, leaving him without the power he sought. Thirdly, he assessed that inexperienced Absalom would be defeated. Given the needed time to recoup, David's battle-hardened and deeply loyal fighters would decimate Absalom's forces, after which he would be executed as a traitor. Basically, like Judas Iscariot, he must have sensed that he had been used by Satan and realised it was futile to \"kick against the pricks\" [Acts 9:5].\n\nAhithophel's fate teaches a precious lesson for all who live for the world, seeking wealth and success. Soon we will discover that all is vanity; and when things do not go our way, then there is nothing left worth living for. Let us seek first the kingdom of God and His righteousness; let us wait on the Lord, and He will grant us the desires of our heart.",
        "part6": "THOUGHT",
        "part7": "For what shall it profit a man, if he shall gain the whole world, and lose his own soul? - Mark 8:36",
        "part8": [
            "1 SAMUEL 19",
            "1 CORINTHIANS 3"
        ]
    },
    "30 AUGUST": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 24 Jacob declared upon seeing the host of God's",
        "part4": "Then David came to Mahanaim. And Absalom passed over Jordan, he and all the men of Israel with him.",
        "part5": "David took the advice of Ahimaaz and Jonathan [v. 22], and fled to Mahanaim, a city on the other side of Jordan. Mahanaim was a fortified city with walls and gates, a suitable place to take refuge in [2 Samuel 18:24]. Importantly, Mahanaim was where David would be able to gather reinforcements. Mahanaim was also where the angels of God had met with Jacob, and where Jacob declared upon seeing the host of God's angels, that \"this is God's host\" [Genesis 32:1-2].\n\nAs David passed over to Mahanaim, Absalom too crossed the Jordan with his forces and pitched in the land of Gilead. Having accepted Hushai's advice, Absalom was now ready with all the men of Israel to engage David. Absalom replaced Joab with Amasa as the commander of Israel's army, appointing another of David's nephews to take charge of taking David's life.\n\nAbsalom's rebellion is staggering. He was not content with having ravaged his father's concubines openly [2 Samuel 16:22] and chasing his father out of Jerusalem to the other side of Jordan. At this point it was likely that Absalom had been already anointed as king [2 Samuel 19:10]. Yet Absalom's hunger to secure the crown and kingdom would not be satiated until he had utterly eliminated his father.\n\nAbsalom's open revolt turned a nation against itself, pitting family member against family. He forsook his namesake (Absalom means \"father of peace\") and pursued rebellion instead. Are we pursuers of God and peace, or do we find ourselves like Absalom, pursuing rebellion and our own desires?",
        "part6": "",
        "part7": "We need not fret ourselves because of evil men. Ultimately the evil will have no reward, and they will come to an end. Read Proverbs 24:19-20.",
        "part8": []
    },
    "31 AUGUST": {
        "part1": "2 Samuel 17:27-29",
        "part2": "Timely provision  VERSES 28-29 Brought beds, and basons, and earthen vessels, and wheat, and barley, and flour, and parched corn, and beans, and lentiles, and parched pulse, and honey,  and butter, and sheep, and cheese of kine, for David, and for the people that were with him, to eat: for they said, The people is hungry, and weary, and thirsty, in the wilderness.  To CompLtete THE BiBLeE",
        "part3": "",
        "part4": "Brought beds, and basons, and earthen vessels, and wheat, and barley, and flour, and parched corn, and beans, and lentiles, and parched pulse, and honey, and butter, and sheep, and cheese of kine, for David, and for the people that were with him, to eat: for they said, The people is hungry, and weary, and thirsty, in the wilderness.",
        "part5": "At Mahanaim, David was received by distinguished hosts of great wealth and royalty: Shobi from Rabbah of the Ammonites was almost certainly from the royal family of Ammon, once an avowed enemy of Israel; Machir from Lo-debar, was a farmer who had taken care of Jonathan's son Mephibosheth and had been faithful to the house of Saul; and Barzillai the Gileadite was a wealthy man. These men met David in his need with great sympathy and substantial gifts.\n\nSo not only did David find refuge in Mahanaim, he also found hope in unlikely allies. This was the first sign that not everyone in Israel had fallen away from him. David and his men were comforted and relieved of hunger and weariness by these people's kindness. These men remain honoured today by their legacy of loving God and succouring God's people in their difficult times.\n\nDavid was bereft of position, home, family and nation, but found comfort in the all-providing God. All manner of provision was made to David in a timely way. In the wilderness they had suffered want and scarcity. Here, they received plenty from their hosts and were strengthened for the battle ahead. Our God is a refuge and strength, a very present help in trouble. Even though everything around us may seem to be falling apart, we need not fear if God is with us, for He knows our every need.",
        "part6": "THOUGHT",
        "part7": "Day by day, and with each passing moment, Strength I find to meet my trials here; Trusting in my Father's wise bestowment, I've no cause for worry or for fear. - Carolina V. Sandell-Berg",
        "part8": [
            "1 SAMUEL 21-22",
            "1 CORINTHIANS 5"
        ]
    },
    "1 SEPTEMBER": {
        "part1": "2 Samuel 18:1-2",
        "part2": "Overview of David's faith  VERSES 1-2 And David numbered the people that were with him, and set captains of thousands and captains of hundreds over them. And David sent forth a third part of the people under the hand of Joab, and a third part under the hand of Abishat the son of ZLerutah, Joab' brother, and a third part under the hand of Ittai the Gittite. And the king said unto the people, I will surely go forth with you myself also.  To CompPLeTE THE BIBLE",
        "part3": "",
        "part4": "And David numbered the people that were with him, and set captains of thousands and captains of hundreds over them. And David sent forth a third part of the people under the hand of Joab, and a third part under the hand of Abishai the son of Zeruiah, Joab's brother, and a third part under the hand of Ittai the Gittite. And the king said unto the people, I will surely go forth with you myself also.",
        "part5": "The eighteenth chapter opens with the inevitability of battle between David and Absalom. As the time for battle approached, David was in full command of his troops. He numbered his troops. He divided and placed them under his three generals, Joab, Abishai, and Ittai.\n\nBy all measures, the father-son confrontation was a tragic event. It would be interesting to go into David's mind and know his thoughts as he prepared to face his son in battle. It must have been a great conflict for him having to struggle between his being a king who has to put down an insurrection and his role as a father who loves his son. Victory is a must for David. However, victory for David would mean that his son would have to face the consequences for his sedition and treason. This would be a story without a happy ending.\n\nWe can go further back in time to see the causes that led to this sad state of affairs in the royal household. There were several factors, but it began with his sin of adultery with Bathsheba, which was compounded by the sin of deceit and the murder of Uriah when David tried to hide the first sin. The cover up gave Joab a hold over David.\n\nA second factor was David's failure as a father. He did not discipline his sons when they committed egregious sins. David did nothing when Amnon violated Tamar, and he also did nothing when Absalom killed Amnon to avenge Tamar's honour [2 Samuel 13]. David's failures to discipline his sons led to an erosion of the people's support for him, leading to the crisis at hand.",
        "part6": "THOUGHT",
        "part7": "\"Watch ye and pray, lest ye enter into temptation\" [Mark 14:38a]. Keep close to the LORD to keep your faith active and vibrant.",
        "part8": [
            "1 SAMUEL 23",
            "1 CORINTHIANS 6"
        ]
    },
    "2 SEPTEMBER": {
        "part1": "2 Samuel 18:1-4",
        "part2": "David's counter offensive",
        "part3": "VERSE 1",
        "part4": "And David numbered the people that were with him, and set captains of thousands and captains of hundreds over them.",
        "part5": "David had recovered from his initial flight from Jerusalem and found refuge in the fortified city of Mahanaim [2 Samuel 17:24]. To prepare for the counter offensive, he numbered and reviewed his troops. He then appointed captains of thousands and captains of hundreds, and arranged them in three companies headed respectively by Joab, Abishai his brother, and Ittai the Gittite, knowing well the worth of able leadership, order and discipline. The three-pronged attack was a common military manoeuvre of this period [Judges 7:16; 1 Samuel 13:17].\n\nAbsalom led his large army of inexperienced men under the command of Amasa, across the Jordan and encamped in the land of Gilead [2 Samuel 17:24-26] to battle his father. David boldly assumed leadership to go with his men who were risking their lives for his cause, but was persuaded to remain at Mahanaim with the reserves both for his protection and to defend the city. The men said, \"Thou art worth ten thousand of us\" [v. 3], even if half of them died, the rest would carry on. But if David was killed, the cause was lost. So David acquiesced to their request. \"What seemeth you best I will do\" [v. 4].\n\n\"Whether the people's prudence had an eye to it or no, God's providence wisely ordered it, that David should not be in the field of battle; for then his tenderness would certainly have interposed to save the life of Absalom, whom God had determined to destroy.\" (Matthew Henry)",
        "part6": "THOUGHT",
        "part7": "Onward Christian soldiers, Marching as to war. With the cross of Jesus, Going on before! Christ, the royal Master, Leads against the foe, Forward into battle, See His banner go. - Sabine Baring-Gould",
        "part8": [
            "1 SAMUEL 24",
            "1 CORINTHIANS 7"
        ]
    },
    "3 SEPTEMBER": {
        "part1": "2 Samuel 18:5",
        "part2": "Natural affection over kingdom responsibility",
        "part3": "VERSE 5",
        "part4": "And the king commanded Joab and Abishai and Ittai, saying, Deal gently for my sake with the young man, even with Absalom. And all the people heard when the king gave all the captains charge concerning Absalom.",
        "part5": "As the army marched before him for the final battle, the king specially commanded his three generals, \"Deal gently for my sake with the young man, even with Absalom\" and the people heard his instructions. However, David's order of leniency to spare Absalom's life would be brashly ignored by Joab and his men. Though Absalom premeditated Amnon's murder in revenge for his sister, abused David's concubines, conspired against God's anointed king, and set out to kill his father and appoint himself king, David still loved this wayward son very much. The love that David had for his son blinded him to the many defects and malicious designs of Absalom, a rebel against God's kingdom who deserved judgement and the death penalty.\n\nNatural affection is a good thing [Romans 1:31] but not the only thing to consider; there are other priorities. What did our Lord Jesus teach about the relationship between natural affection and kingdom priorities? Read Matthew 10:34-39. Natural affection must be regulated to the honour of God.\n\nOnly God deserves our supreme devotion. There is no divided allegiance where He is concerned. \"No man can serve two masters\". No human love must be allowed to keep us from doing what He wants done. King David failed in this regard, behaving as a natural father would, rather than God's anointed. Whenever natural affection and partiality affect the judgement of God's leaders, it will lead to disagreement, discord and discouragement among His people. But notice that God's purpose and will are still accomplished - Absalom would be killed in God's providence, through Joab's wilful unrighteous act. Godly leaders must boldly pursue kingdom priorities in faith.",
        "part6": "THOUGHT",
        "part7": "Love and duty are inseparable. Is my love strengthened by the exercise of spiritual discipline?",
        "part8": [
            "1 SAMUEL 25",
            "1 CORINTHIANS 8"
        ]
    },
    "4 SEPTEMBER": {
        "part1": "2 Samuel 18:6-8",
        "part2": "Civil war",
        "part3": "VERSE 8",
        "part4": "For the battle was there scattered over the face of all the country: and the wood devoured more people that day than the sword devoured.",
        "part5": "The battle (civil war) was fought in the forest of Ephraim. The bitter civil war was instigated by David's worthless and treacherous son Absalom. Civil war is always a terrible calamity but when the rebellion is raised by a son against his father, we have the most painful form of strife.\n\nThe battle was scattered, meaning it was a series of separate encounters covering the entire battle zone in which David's three divisions attacked and routed Absalom's men. Casualties among his troops numbered over 20,000 soldiers. Better-disciplined and better-led than the hastily mustered forces of Absalom, the soldiers of David broke the ranks of their enemies and sent them to seek shelter in the dense forest. The battleground was well suited to David's experienced and brave soldiers rather than the many inexperienced men of Absalom. \"The wicked flee when no man pursueth: but the righteous are bold as a lion\" [Proverbs 28:1].\n\nThe woods devoured more people than the sword. The verb \"devoured\" literally means \"to eat or consume\". Even the woods are dangerous when you are out of the will of God by being disobedient to His cause! God intervened on David's behalf. David's troops were able to use the rugged terrain and dense growth of the forest to their advantage. Perhaps wild beasts that infested the forest killed many distracted and displaced Israelites. Because of the rugged terrain, the pursuit through the thick forest resulted in more deaths than did the actual combat. David's men, though fewer in number, won the civil war. The God of Israel would not suffer His anointed to perish, nor the impious usurper to triumph over him.",
        "part6": "THOUGHT",
        "part7": "Perhaps Amnon's murder, Absalom's rebellion and the civil war within David's kingdom could have been avoided if David had chosen to confront sin rather than dismiss it.",
        "part8": [
            "1 SAMUEL 26",
            "1 CORINTHIANS 9"
        ]
    },
    "5 SEPTEMBER": {
        "part1": "2 Samuel 18:9",
        "part2": "Defeat of Absalom",
        "part3": "VERSE 9",
        "part4": "And Absalom met the servants of David. And Absalom rode upon a mule, and the mule went under the thick boughs of a great oak, and his head caught hold of the oak, and he was taken up between the heaven and the earth; and the mule that was under him went away.",
        "part5": "Despite Absalom's popularity and larger army, he still lost the battle against David. Having all worldly advantage was of no avail. Absalom could not overcome David with God on David's side. In today's reading we see that Absalom encountered David's servants in the aftermath of that disastrous battle and attempted to flee. However, as he was riding away on his mule, his head was caught on an oak branch and he was left hanging in mid-air. He was in a great predicament, rendered completely defenceless and hanging helplessly where he could be mocked by any passers-by. This would have been especially humiliating for Absalom who was greatly concerned with people's opinion of him.\n\nWorse than that, we see that material advantages could not give Absalom victory over David. Although Absalom had plotted this rebellion deviously and won the hearts of the Israelites, in God's eyes Absalom was just another rebel. The Israelites might believe that Absalom was the rightful king, but the Bible is clear that the Lord hates a rebellious son [Proverbs 15:5,20; 30:17]. In acting to usurp David's throne and win the kingdom, Absalom was guilty of rebellion against his father.\n\nOften, we come up with justifications and excuses for what we perceive to be our minor sins. However, let us remember that we are children of God and sin is rebellion. So let us not rebel against our heavenly Father.",
        "part6": "THOUGHT",
        "part7": "Do I often make excuses for sins which I perceive to be minor?",
        "part8": [
            "1 SAMUEL 27",
            "1 CORINTHIANS 10"
        ]
    },
    "6 SEPTEMBER": {
        "part1": "2 Samuel 18:10-13",
        "part2": "The foot soldier's wisdom",
        "part3": "VERSE 13",
        "part4": "Otherwise I should have wrought falsehood against mine own life: for there is no matter hid from the king, and thou thyself wouldest have set thyself against me.",
        "part5": "Joab was a powerful figure by David's side. He was also a dangerous man who would not hesitate to kill for his own gain [2 Samuel 3:27]. Today, we read that a man had witnessed Absalom's predicament and informed Joab, only to be rebuked for not slaying him. We will consider this nameless man's wisdom in choosing not to obey Joab's command to kill Absalom.\n\nFirst, we see that he knew the will of David, the one with true authority. He reminded Joab that David had given orders for Absalom not to be harmed. He would not disobey the king's order, not even for a great reward. Second, we see that this man was wise in knowing that his actions would not be hidden forever. One's sin will find one out. Finally, we see that this man was astute in regarding Joab's character. He knew even though Joab promised him a reward for killing Absalom, Joab would also not actively come to his defence if he was found out.\n\nWhen we are tempted by others to sin, let us too be reminded of these three things. First, remember that no matter what the authority of the person tempting us to sin is, we are subject to God who is the highest authority above all. Second, remember nothing can be hidden from God. Even if we hide our deeds from the world, there is no hiding from the omniscient God. Third, remember that no human being can protect us from the consequences of our sins.",
        "part6": "THOUGHT",
        "part7": "Dabbling in sin is akin to gambling with your own life.",
        "part8": [
            "1 SAMUEL 28",
            "1 CORINTHIANS 11"
        ]
    },
    "7 SEPTEMBER": {
        "part1": "2 Samuel 18:14-15",
        "part2": "The general's mercilessness",
        "part3": "VERSE 14",
        "part4": "Then said Joab, I may not tarry thus with thee. And he took three darts in his hand, and thrust them through the heart of Absalom, while he was yet alive in the midst of the oak.",
        "part5": "From a human perspective, we can perhaps understand why Joab took matters into his own hands. We know that David was in two minds about this battle. On the one hand, his men were fighting for him to be reinstated to the throne. On the other, his son's life was at stake. As such, David, subject to human weakness and fatherly love, had given the command for his soldiers to be merciful to his son, which would have adversely impacted his soldiers' morale.\n\nDespite his many faults, Joab was loyal to David. Here, we see his obedience was a subjective one. He was prepared to disobey David for what he believed to be for David's own good. It is possible Joab had good reason for killing Absalom. By doing so, Joab eliminated the possibility of future threats against David. But Joab put Absalom to death in a cruel and merciless manner. He stabbed him through the heart and then left his men to finish him off.\n\nLet us be reminded that unlike Joab who was subordinate to a king who had his many moments of human weakness, we have a God who is never weak or wrong. He is perfect even in mercy and judgement. As such, we must not be selective in submitting to His commands. Often, it is easy to obey God when it is convenient to do so. However, it is more important for us to remain submissive during the times we do not fully understand God's will.",
        "part6": "THOUGHT",
        "part7": "Consecrate me now to Thy service, Lord, By the pow'r of grace divine; Let my soul look up with a steadfast hope, And my will be lost in Thine. - Fanny J Crosby",
        "part8": [
            "1 SAMUEL 29-30",
            "1 CORINTHIANS 12"
        ]
    },
    "8 SEPTEMBER": {
        "part1": "2 Samuel 18:16-17",
        "part2": "The death of Absalom",
        "part3": "VERSE 17",
        "part4": "And they took Absalom, and cast him into a great pit in the wood, and laid a very great heap of stones upon him: and all Israel fled every one to his tent.",
        "part5": "Now that the battle was done, they threw Absalom's corpse into a deep pit and covered it with stones in an act of scorn and contempt. Absalom's hanging and death, and his body's crude disposal give us a picture of God's hatred against rebellion. We may see that hanging on the tree parallels past hangings of Israel's accursed enemies [Joshua 8:29; 10:27]. We may also see that the disposal under stones is suggestive of the punishment God had ordained for rebellious children [Deuteronomy 21:21].\n\nAs we read this account of Absalom's death, we may feel a sense of justice served. We may believe that Absalom received his just deserts. A rebellious child is universally disliked in any society today. Let us consider the Old Testament punishment and death reserved for rebellious children. The truth is that, like Absalom, we are also guilty of the sin of rebellion against our heavenly Father. Just as we may have felt that justice was upheld in Absalom's death, we should not forget this is the same way justice will be upheld if we were subject to the Law.\n\nThen let us consider how our Lord Jesus Christ's death on the cross and subsequent burial has put an end to that Law's requirement and satisfied its penalty. Our Lord Jesus died a painful, merciless death on our behalf. The wrath God poured out upon our Lord that day at Calvary was fury that we have incurred through our rebellion. Let us therefore be ever grateful to the Lord Jesus Christ our Saviour.",
        "part6": "THOUGHT",
        "part7": "His robes for mine: God's justice is appeased. Jesus is crushed, and thus the Father's pleased. - Chris Anderson",
        "part8": [
            "1 SAMUEL 31",
            "1 CORINTHIANS 13"
        ]
    },
    "9 SEPTEMBER": {
        "part1": "2 Samuel 18:18",
        "part2": "The price of pride",
        "part3": "VERSE 18",
        "part4": "Now Absalom in his lifetime had taken and reared up for himself a pillar, which is in the king's dale: for he said, I have no son to keep my name in remembrance: and he called the pillar after his own name: and it is called unto this day, Absalom's place.",
        "part5": "Verse 18 is a postscript of Absalom's life. It was his eulogy after his death at the hand of Joab, but it was not a very flattering one. Absalom was known for his looks. The Bible says that \"from the sole of his foot even to the crown of his head there was no blemish in him\" [2 Samuel 14:25]. He wanted to be known for his greatness. He also had grandiose ideas about himself.\n\nPresumably, Absalom contrived a scheme to perpetuate his memory after he was allowed to return to Jerusalem. As he rose in popularity, we read that \"in his lifetime had taken and reared up for himself a pillar ... and he called the pillar after his own name: and it is called unto this day, Absalom's place\". The word \"place\" literally means \"hand\", speaking of his \"accomplishments\". But what great deeds had Absalom accomplished up to the day of his death? Consider what Absalom would be known for? His dastardly act of fratricide [2 Samuel 13:28-29] and an attempted regicide [2 Samuel 15:14].\n\nSee the vanity of Absalom in raising a pillar to his own name! Note also its futility. He had intended the monument to be a record of his greatness after his death because he had no son, but it became a memory of his shame. Absalom might have wanted the pillar to be his cenotaph, but he was ignominiously buried in an unmarked grave under a heap of stones.\n\nLearn the lesson of Absalom's life and death - beware of the instruments of vainglory; beware of the allure of ill-gotten gains; beware of pride and self-glory.",
        "part6": "THOUGHT",
        "part7": "\"And seekest thou great things for thyself? seek them not\" [Jeremiah 45:5a]. Seek, instead, the glory of God.",
        "part8": [
            "2 SAMUEL 1",
            "1 CORINTHIANS 14"
        ]
    },
    "10 SEPTEMBER": {
        "part1": "2 Samuel 18:19-20",
        "part2": "Ahimaaz's enthusiasm",
        "part3": "VERSE 20",
        "part4": "And Joab said unto him, Thou shalt not bear tidings this day, but thou shalt bear tidings another day: but this day thou shalt bear no tidings, because the king's son is dead.",
        "part5": "From the battlefield where we witnessed the tragic end of the wicked and proud Absalom, we now turn to three men, Joab, Ahimaaz and Cushi as the outcome of the battle is conveyed to David. Inevitably, the news of Absalom's death must be told to his father. Ahimaaz the son of Zadok offered to bring the news to David [v. 19].\n\nAhimaaz's loyalty to David was without question. At a time when the hearts of men were stolen by Absalom [2 Samuel 15:6], Ahimaaz remained loyal to the old king even when he was fleeing for his life [2 Samuel 15:27, 36].\n\nAhimaaz's enthusiasm, however, was curbed by Joab's astuteness. It could be that Joab was wise to know that the king would react unfavourably to the news of his son's death. Joab was keenly aware of David's love for Absalom. And the report of Absalom's defeat, far from being the news of victory, would bring much distress for David because winning the battle would mean his losing his son. It could also be possible that the bearer of bad news would bear the brunt of David's sorrow and fury.\n\nOn a more cynical note, Ahimaaz was prevented from carrying the news to David because Joab was afraid that he would be exposed for defying the king's explicit orders to spare his son [v. 5]. Perhaps, that is why Joab sent Cushi instead, who being a foreigner would have known nothing of David's original order.\n\nAhimaaz was enthusiastic about bearing the news of the death of a son because of his devotion to David. We too have similar tidings - the sacrificial death of the Son. Let us be just as prompt in our devotion to our Lord Jesus Christ and in the dissemination of His Gospel.",
        "part6": "THOUGHT",
        "part7": "How beautiful are the feet of them that preach the Gospel of peace, and bring glad tidings of good things! - Romans 10:15b",
        "part8": [
            "2 SAMUEL 2",
            "1 CORINTHIANS 15"
        ]
    },
    "11 SEPTEMBER": {
        "part1": "2 Samuel 18:21-23",
        "part2": "Ahimaaz's persistence",
        "part3": "VERSE 23",
        "part4": "But howsoever, said he, let me run. And he said unto him, Run. Then Ahimaaz ran by the way of the plain, and overran Cushi.",
        "part5": "In place of Ahimaaz, Joab dispatched Cushi, which is not a proper name; rather he was an Ethiopian in Joab's service. Despite the fact that Joab had already given the mission to Cushi, and his dumping cold water on Ahimaaz's enthusiasm - \"Wherefore wilt thou run, my son, seeing that thou hast no tidings ready?\" [v. 22b] - Ahimaaz was insistent.\n\n\"But howsoever, let me ... \" [v. 22a]. Ahimaaz's persistence paid off in the end. \"Run\" was Joab's response as he acquiesced.\n\nThe battle was fought in \"the wood of Ephraim\" [v. 6b], which was a thick forested area east of the Jordan River. The Cushite took the road over the hills in a straight southerly direction toward Mahanaim. It was a shorter but a more difficult route.\n\nAhimaaz, on the other hand, \"ran by the way of the plain\", which was the name of the Jordan valley near Jericho. This route would mean that Ahimaaz first must head west across the Jordan River before heading south. The two routes would eventually converge a short distance from Mahanaim. The \"way of the plain\" was longer, but it was an easier route. So, Ahimaaz \"overran Cushi\".\n\nOn Ahimaaz's enthusiasm and persistence, Charles Spurgeon comments, \"In reading this passage, it strikes me that if men vie with each other in common matters, and one outruns the other, I ought to be in solemn earnestness so to run that I may obtain. Lord, help me to gird up the loins of my mind, and may I press forward towards the mark for the prize of my high calling of God in Christ Jesus.\"",
        "part6": "PRAYER",
        "part7": "Father in heaven, help me to bear patiently under trials or rejections, to run with zeal the race set before me even amidst challenges and difficulties. In Jesus' name, Amen.",
        "part8": [
            "2 SAMUEL 3",
            "1 CORINTHIANS 16"
        ]
    },
    "12 SEPTEMBER": {
        "part1": "2 Samuel 18:24-27",
        "part2": "The messengers",
        "part3": "VERSE 27",
        "part4": "And the watchman said, Me thinketh the running of the foremost is like the running of Ahimaaz the son of Zadok. And the king said, He is a good man, and cometh with good tidings.",
        "part5": "This passage portrays a graphic description of the runners Cushi and Ahimaaz and their arrival at Mahanaim. King David had taken his place at the city gate while a watchman was stationed on the walls to look out for anyone coming with reports of the battle [v. 24].\n\nThe watchman saw the first man running alone. As he drew nearer, a second runner was sighted. David perceived both runners were bringing news [v. 26]. The watchman then made out the first runner to be the son of Zadok. Hearing his name, David concluded that Ahimaaz being sent must indeed mean good news. \"He is a good man, and cometh with good tidings.\" Underlying David's words is his assumption a good man must bring good news.\n\nWhat would be good news for David? It would be what he desired to hear; that the life of Absalom was spared. That, however, was not to be. David would soon learn that his rebellious son was dead.\n\nWhat would be good news for a sinner? The Gospel, of course; that God loves us and sent His only begotten Son, our Lord Jesus Christ, into the world to save us from our sins and provide the way to everlasting life. But the Good News would also mean the \"bad news\" of the death of the rebellious heart. The Good News that gives hope also reveals that all men are sinners and unless they repent and place their faith in the Lord Jesus Christ as their Saviour, there awaits every sinner God's fearsome wrath and eternal judgement. May we be the faithful messengers running earnestly to deliver the truth that \"he that believeth on the Son hath everlasting life: and he that believeth not the Son shall not see life; but the wrath of God abideth on him\" [John 3:36].",
        "part6": "PRAYER",
        "part7": "Father in heaven, help me to be a faithful and courageous messenger of your Gospel which convicts sinners and saves them to the uttermost. In Jesus' name, Amen.",
        "part8": [
            "2 SAMUEL 4-5",
            "2 CORINTHIANS 1"
        ]
    },
    "13 SEPTEMBER": {
        "part1": "2 Samuel 18:28",
        "part2": "\"All is well\"",
        "part3": "VERSE 28",
        "part4": "And Ahimaaz called, and said unto the king, All is well. And he fell down to the earth upon his face before the king, and said, Blessed be the LORD thy God, which hath delivered up the men that lifted up their hand against my lord the king.",
        "part5": "Ahimaaz yearned so much to bring David good news after the battle that he persuaded Joab to allow him to carry the news back [v. 22-23]. Was he out to \"curry favour\" with his king? \"All is well\" in Hebrew is \"shalom\" or \"peace\"; but we know that while the battle was won and David's kingship secured, David's heart was not going to be well.\n\nDo we have friends like Ahimaaz in our life? Friends who tell us \"all is well\" and inadvertently give us the false assurance of worldly peace. We may have stable jobs, nice houses, good health and all seems well. But as we peer into the depths of our souls, are we as certain all is well. We know temptations assail us and sin besets us, unless we resort to our Lord Jesus Christ and cling to His cross.\n\nOur Lord Jesus tells us there is a difference between worldly peace and Godly peace: \"Peace I leave with you, My peace I give unto you: not as the world giveth, give I unto you\" [John 14:27a]. The circumstances of our lives may be well, others may tell us we are well, but it is only after reflection and examination of ourselves that we can ascertain whether we are truly well.\n\nBeloved, are we satisfied with being \"well\" according to the world's standards? Or do we desire to be \"well\" before our Lord and by His standards? Constant self-reflection and examination is the key.",
        "part6": "THOUGHT",
        "part7": "Do we examine our actions and reflect on our thoughts regularly? Is there self-awareness of our sins?",
        "part8": [
            "2 SAMUEL 6",
            "2 CORINTHIANS 2"
        ]
    },
    "14 SEPTEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 29 awkwardness, we choose the path of Ahimaaz. We",
        "part4": "And the king said, Is the young man Absalom safe? And Ahimaaz answered, When Joab sent the king's servant, and me thy servant, I saw a great tumult, but I knew not what it was.",
        "part5": "Ahimaaz was so eager to bring good news that he lied about Absalom's fate. He told David some truth but not the whole truth.\n\nHave we been placed in similar situations where it would be too awkward, embarrassing or socially impolite to tell our loved ones the 'whole truth'? So we rationalise and prevaricate: \"It's not my position to tell him, someone closer will tell him about his sin\". In order to look good and avoid awkwardness, we choose the path of Ahimaaz. We omit the whole truth and tell a \"white lie\".\n\nIf we cherish our loved ones, the right thing would be to speak honestly but lovingly about the person's shortcomings, weaknesses or sin. A Christian brother was getting married to a non- believer and his friends did nothing to stop him. Years down the road after their divorce, he came to his friends and said: \"You knew I was doing the wrong thing but you did nothing about it, how can I call you guys my friends?\"\n\n\"A friend loveth at all times, and a brother is born for adversity\" [Proverbs 17:17]. A real friend is one who experiences both joy and adversity with you. If we only want to experience the joy and leave the adversity to others, then we are not true friends. If we truly love the people we say we love, we will not spare their feelings to mention hard truths they need to hear.",
        "part6": "",
        "part7": "Faithful are the wounds of a friend; but the kisses of an enemy are deceitful. - Proverbs 27:6",
        "part8": [
            "2 SAMUEL 7",
            "2 CORINTHIANS 3",
            "THOUGHT Faithful are the wounds of a friend; but the kisses",
            "of an enemy are deceitful. - Proverbs 27:6"
        ]
    },
    "15 SEPTEMBER": {
        "part1": "2 Samuel 18:30-32",
        "part2": "David's preoccupation",
        "part3": "VERSE 32a",
        "part4": "And the king said unto Cushi, Is the young man Absalom safe?",
        "part5": "Have you ever experienced moments in your life when your mind was too preoccupied with someone, something or some situation that you find yourself constantly distracted by it? Your heart tells you that you will not be at ease until you obtain or achieve it. This could be the case for those who are anxiously awaiting the results of a job interview/promotion, desiring a 'soul mate' or even an addiction to some worldly entertainment or thing the world has to offer.\n\nDavid's preoccupation was with his beloved son Absalom, now dead. God's higher will was momentarily lost from David's sight. He expressed no thanks to the Lord for His great deliverance. He showed no concern for Joab and his men who had fought and were spent for him. David's mind was solely focused on his son to the exclusion of all else. Absalom had become David's idol. The Lord told Israel not to bring any idols into their homes for they will soon become as degraded as their idols [Deuteronomy 7:26]. We are enslaved by whatever we worship, and if our idols of wealth, worldly desires and entertainment occupy first place in our heart, we will be enslaved by them and soon find ourselves constantly wanting more and more.\n\nWe indulge in our idols and sinful pleasures to find contentment and satisfaction for the void in our hearts, but there is no fulfillment in these. The objects of the world are vanity. It is the Lord alone who can give us true contentment in our hearts.\n\nRecognise the idols that control you and pray for strength to place God and His Word first.",
        "part6": "THOUGHT",
        "part7": "What are the idols in your heart? Do they have a grip on your life? Surrender them to the Lord.",
        "part8": [
            "2 SAMUEL 8-9",
            "2 CORINTHIANS 4"
        ]
    },
    "16 SEPTEMBER": {
        "part1": "2 Samuel 18:33",
        "part2": "David's grief",
        "part3": "VERSE 33",
        "part4": "And the king was much moved, and went up to the chamber over the gate, and wept: and as he went, thus he said, O my son Absalom, my son, my son Absalom! would God I had died for thee, O Absalom, my son, my son!",
        "part5": "The author could simply have written \"David mourned for his son\". Instead he gave us a detailed description of David's grief. Considering this and Nathan's words in 2 Samuel 12:10a that \"Now therefore the sword shall never depart from thine house\", we can see that David's grief was compounded with guilt.\n\nDavid's sin of adultery with Bathsheba and murder resulted in the consequence of Absalom's death which is why David lamented \"would God I had died for thee\". David knew he deserved death for his sins, yet he was alive, and his son lay dead. God's chastisement and discipline was more painful than death for him. However, despite the anguish and sorrow David felt through God's discipline, there was also much grace in store for him. As we will see in the days ahead, God loved David and chose his son (from Bathsheba), Solomon, to be the next king. Solomon would be the richest and wisest king in Israel's history.\n\nIn times of sorrow and grief, the person we need most to be with is our Lord. To Him we can pour out our anguish, and cast all our cares and troubles because He cares for us. While the hand of God may seem heavy for a season, remember that the yoke of our Lord Jesus Christ is light and we can lean on Him for strength.\n\nNo matter how dark the night may seem, joy comes in the morning when the dawn breaks. There is always grace to be found if we will just draw closer to the Giver of grace.",
        "part6": "THOUGHT",
        "part7": "For His anger endureth but a moment; in His favour is life: weeping may endure for a night, but joy cometh in the morning. - Psalm 30:5",
        "part8": [
            "2 SAMUEL 10",
            "2 CORINTHIANS 5"
        ]
    },
    "17 SEPTEMBER": {
        "part1": "2 Samuel 19:1-3",
        "part2": "Effects of David's grief",
        "part3": "VERSE 2",
        "part4": "And the victory that day was turned into mourning unto all the people: for the people heard say that day how the king was grieved for his son.",
        "part5": "The passing of a loved one is never easy to bear, especially if the person is one's child. Absalom was David's son, and it is clear from today's passage (and 2 Samuel 18:5) David was a passionate man who loved his children, even one who had caused him so much harm as Absalom. David could not bring himself to say \"I shall go to him\" [2 Samuel 12:23] because he knew that in the final reckoning and in the resurrection to come, Absalom will not be found together with him and therefore he lamented, \"O my son Absalom, O Absalom, my son, my son!\" [v. 4]. However, David failed to realise the effect his reaction would have on the morale of his soldiers and servants who had fought bravely and obtained victory for him against Absalom.\n\nAs a result of David's grief, the army's victory celebration soured, turning it into a day of mourning. The men tip-toed around stealthily like men who had lost the battle and were in shame. What an adverse effect David's anguish had on the mood of his army! David was stuck in an emotional rut and this cast a pall over an otherwise celebratory occasion. He had allowed his personal feelings to become a stumbling block and humiliation to those who had served him sacrificially.\n\nDear readers, in whatever circumstance we find ourselves, let us realise that God has allowed the events to come to pass and we can trust His sovereign will.",
        "part6": "THOUGHT",
        "part7": "Do all things without murmurings and disputings: That ye may be blameless and harmless, the sons of God, without rebuke, in the midst of a crooked and perverse nation, among whom ye shine as lights in the world. - Philippians 2:14-15",
        "part8": [
            "2 SAMUEL 11",
            "2 CORINTHIANS 6"
        ]
    },
    "18 SEPTEMBER": {
        "part1": "2 Samuel 19:4",
        "part2": "David's self-pity",
        "part3": "VERSE 4",
        "part4": "But the king covered his face, and the king cried with a loud voice, O my son Absalom, O Absalom, my son, my son!",
        "part5": "While the army had won the battle against their foes and slained Absalom the architect of the rebellion, we see David, instead of rejoicing in the victory, lamenting grievously the death of his son. The root of the problem lies in self-pity. We see this when a child loses in a game, and he sulks and refuses to continue playing with his friends. We see this in adults when a worker misses out on a promotion, and rather than working harder for the next round, he mopes and bad-mouths his bosses and colleagues, and finally resigns from the job.\n\nSelf-pity is a destructive sin that leads a Christian to lose his effectiveness in his service to man and to God. He becomes negative and self-centred caring only for himself. He puts himself above others, even God. At its root, self-pity causes a Christian to assess his situation and himself outside the grace of God, even to the extent of blaming God for not giving him the outcome he desires.\n\nSo, how do we avoid self-pity and not let its root grow in our psyche? Firstly, we should not think of ourselves more highly than we ought to think [Romans 12:3]. Secondly, place God in the centre of our lives, by submitting to His sovereign will, being thankful and accepting that whatever God gives us is from a loving and gracious Father.",
        "part6": "THOUGHT",
        "part7": "In every thing give thanks: for this is the will of God in Christ Jesus concerning you. - 1 Thessalonians 5:18",
        "part8": [
            "2 SAMUEL 12",
            "2 CORINTHIANS 7"
        ]
    },
    "19 SEPTEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 5 enemies, and hatest thy friends ... for this day I",
        "part4": "And Joab came into the house to the king, and said, Thou hast shamed this day the faces of all thy servants, which this day have saved thy life, and the lives of thy sons and of thy daughters, and the lives of thy wives, and the lives of thy concubines;",
        "part5": "David was caught in a dilemma. As a father, he loved his son. As a king, he must exercise justice. Here, David made a wrong judgement. His indulgent love for his son blinded him to Absalom's abominable treachery. So, we find David wallowing in self-pity [v. 4], spiralling downwards in a vicious cycle of negativity until Joab confronted David. Joab said, \"Thou hast shamed this day the faces of all thy servants ... in that thou lovest thine enemies, and hatest thy friends ... for this day I perceive, that if Absalom had lived, and all we had died this day, then it had pleased thee well\" [v. 5-6].\n\nThese words must have stabbed into David's heart, but Joab's words were true. If Absalom were successful in his insurrection, David would have lost his life, and there would have been a massacre of his sons and daughters, and the rest of the family who fled with him [v. 5]. The soldiers who stood with David in the rebellion would also be certainly put to the sword. It was this horrible prospect that moved Joab to give David a stern rebuke, bidding David to suppress his mere personal feelings.\n\nDavid's depression was not the result of what he knew - Absalom's death and his own role in it. David's problem was in what he forgot - that God was still in control, that a great victory was won, that the insurrection was put down, that he had many loyal supporters, and that God was gracious and merciful to David in spite of his sin. So, instead of lamenting, \"O Absalom, my son, my son!\" [v. 4], David should have called, \"O my God, my Lord.\"\n\nThe remedy to depression is not to focus on what we have lost, but to remember what we have gained in our Lord Jesus Christ.",
        "part6": "",
        "part7": "Let us lay aside every weight, and the sin which doth so easily beset us, and let us run with patience the race that is set before us, looking unto Jesus the author and finisher of our faith. - Hebrews 12:1b-2a",
        "part8": []
    },
    "20 SEPTEMBER": {
        "part1": "2 Samuel 19:5-6",
        "part2": "David's insensitivity",
        "part3": "VERSE 6",
        "part4": "In that thou lovest thine enemies, and hatest thy friends. For thou hast declared this day, that thou regardest neither princes nor servants: for this day I perceive, that if Absalom had lived, and all we had died this day, then it had pleased thee well.",
        "part5": "Joab further rebuked David for his insensitivity. When David mourned for Absalom in such a manner, he showed that he loved his enemies and hated his friends. In his reality check, Joab chided David, it was as if he was declaring that had Absalom lived and everyone else died, he would have been pleased.\n\nLet us learn from this incident that we should be sensitive to those around us. Most of all, Christians must be sensitive to God's prompting. God has given each of us at least a talent and ministry; it may be as a church leader or other roles in church ministry, or it could be a ministry elsewhere, such as taking care of our children's spiritual growth at home, or being a testimony at work or school. We are to magnify our Lord in these roles by our thoughts, words and deed. Being sensitive to others does not only mean attending to their physical needs. Even machines can do that nowadays. Sensitivity and concern should stem from empathy towards others, and by esteeming them higher than ourselves [Philippians 2:3-4]. Heed these words from the apostle Paul, and live it in our lives, so these qualities will manifest not just in our actions, but also our words and attitudes toward others.\n\nThank God for faithful friends, even one like Joab, whom God used to turn the mourning and sorrowing of King David, and raise him up again from the pit of self-pity.",
        "part6": "THOUGHT",
        "part7": "Brethren, if any of you do err from the truth, and one convert him; Let him know, that he which converteth the sinner from the error of his way shall save a soul from death, and shall hide a multitude of sins. - James 5:19-20",
        "part8": [
            "2 SAMUEL 14",
            "2 CORINTHIANS 9"
        ]
    },
    "21 SEPTEMBER": {
        "part1": "2 Samuel 19:7-8",
        "part2": "David's wake-up call",
        "part3": "VERSE 7",
        "part4": "Now therefore arise, go forth, and speak comfortably unto thy servants: for I swear by the LORD, if thou go not forth, there will not tarry one with thee this night: and that will be worse unto thee than all the evil that befell thee from thy youth until now.",
        "part5": "No parent desires to outlive their children. Certainly, David was filled with grief and sorrow. However, there is a time when sorrow goes too far, and we over-indulge our grief. In these circumstances, we need a wake-up call. Joab gave such a call and warning to David to provoke him to speak in a friendly manner to the people who had risked their lives for him. If not, the consequences would be far worse than anything he had experienced before.\n\nRemember, this is David who had faced great dangers in his life: As a shepherd boy, he had fought off predators; he had slain a giant. David had to flee for his life from a vengeful king; and suffered the betrayal of his own son. Yet if David did not heed Joab's warning and persisted in his dismal state, his people would abandon him. He would be deserted and defenseless, and his kingdom would be vulnerable to defeat by their enemies.\n\nThese words went straight to David's heart. Likewise, the Lord Jesus' words to the woman at the well [John 4:18] was like a dagger to her heart. Although proven to be effective in these narratives, we have to carefully determine if they are necessary. And when stern rebuke is necessary, remember to \"[speak] the truth in love\" [Ephesians 4:15]. We are directed to pray for wisdom and guidance in our speech so that it is not used to cut down but to edify the body of believers.",
        "part6": "THOUGHT",
        "part7": "There is \"a time to weep\" [Ecclesiastes 3:4a], but we should not be oblivious to the circumstances around us.",
        "part8": [
            "2 SAMUEL 15",
            "2 CORINTHIANS 10"
        ]
    },
    "22 SEPTEMBER": {
        "part1": "2 Samuel 19:9-10",
        "part2": "David's restoration",
        "part3": "VERSE 10",
        "part4": "And Absalom, whom we anointed over us, is dead in battle. Now therefore why speak ye not a word of bringing the king back?",
        "part5": "Areversal of public opinion now takes place among the people, and they call on their leaders to reinstate the king. They reflect upon all the good things David had done for the country and also saw the futility of following a dead king. Their obligation is no longer to Absalom and his rebellion but to David.\n\nNotice also David's path to restoration as the king begins with his humble compliance to Joab's instructions. Had David not spoken kindly to his servants and sat as the king in the place of authority (sitting at the gate), the people would have departed in discouragement and left David defenseless and susceptible to defeat. Humility precedes restoration. The Lord Jesus humbled Himself by taking on flesh and dwelling among man and is now exalted at the right hand of God. Joseph, the beloved child of Jacob, was humbled through many painful experiences before being elevated to be the exalted administrator over all Egypt.\n\nIn like manner, unbelievers have broken their fellowship with God. Only when we humble ourselves seeking God for repentance and acknowledge that we cannot save ourselves, will our fellowship be restored. And as sinners saved by grace, we are promoted to a higher position, to not only judge the world but to also judge the angels [1 Corinthians 6:2-3].\n\nAs Christians in the process of sanctification, may we put on \"humbleness of mind\" [Colossians 3:12]. No matter our age, position or length of service in the church, may we put on humility and lend our ears to wisdom.",
        "part6": "THOUGHT",
        "part7": "He hath put down the mighty from their seats, and exalted them of low degree. - Luke 1:52",
        "part8": [
            "2 SAMUEL 16",
            "2 CORINTHIANS 11"
        ]
    },
    "23 SEPTEMBER": {
        "part1": "2 Samuel 19:11-13",
        "part2": "David's appeal",
        "part3": "VERSE 11",
        "part4": "And king David sent to Zadok and to Abiathar the priests, saying, Speak unto the elders of Judah, saying, Why are ye the last to bring the king back to his house? seeing the speech of all Israel is come to the king, even to his house.",
        "part5": "During Absalom's usurpation, Zadok and Abiathar worked undercover in Jerusalem, gathering intelligence for David [2 Samuel 15:27- 28]. David now instructs Zadok and Abiathar to question the elders of Judah: \"Why are ye the last to bring the king back to his house?\" The operative word here is \"last\", as it subtly informs Judah that everyone else is already back with David. The repetition of the pronoun \"ye\" underscores David's relationship with these leaders: \"Ye are my brethren, ye are my bones and my flesh: wherefore then are ye the last to bring back the king?\" [v. 12]\n\nThough it can be read as a veiled threat, it seems more likely David's message was intended to build alliances rather than intimidate. David seeks to re- establish his rule in Jerusalem without resorting to armed force. So he opts for reconciliation with his rivals including Absalom's commander, Amasa, who is to replace Joab. By swearing an oath before God that Amasa will replace Joab as David's army commander, David establishes a truce with Amasa, and Amasa brings the people of Judah who had sided with Absalom, back to David.\n\nAlthough there were political reasons for Amasa's appointment, David sought reconciliation instead of violence to regain the throne. As Paul instructed in Romans 12:18b, we are to \"live peaceably with all men\". Reconciliation does not bear grudges, but rather forgives the past. Remember we were once sinners estranged from God, yet God offered peace to all who believe and repent. And because of God's grace and mercy, not one sin is held against us. Is there someone that you need to reconcile with today?",
        "part6": "THOUGHT",
        "part7": "Blessed are the peacemakers: for they shall be called the children of God. - Matthew 5:9",
        "part8": [
            "2 SAMUEL 17",
            "2 CORINTHIANS 12"
        ]
    },
    "24 SEPTEMBER": {
        "part1": "2 Samuel 19:14-15",
        "part2": "David's popularity restored",
        "part3": "VERSE 14",
        "part4": "And he bowed the heart of all the men of Judah, even as the heart of one man; so that they sent this word unto the king, Return thou, and all thy servants.",
        "part5": "What a turn of events! David had fled Jerusalem a desperate fugitive, rejected by the nation and hunted by his son. Now he is escorted back by thousands of supporters [v. 15]. David's appeal was heard and thus Amasa persuaded the people of Judah to a wholehearted support of God's anointed, sending word to invite him back to the city. David didn't sway just a few, but all the men of Judah unanimously. Their desire for David's return could not be coerced, their hearts had to be swayed.\n\nMany parallels can be made between David's restoration to the throne of Israel and God's restoration to the throne of our hearts. Like David, God will not force His reign on us. We must welcome Him into our hearts. Just as the people of Judah were swayed by David's appeal of reconciliation and forgiveness, we are swayed by the grace and the mercy of God. And just as David's relationship with the people was restored, so is God's fellowship with us restored upon repentance.\n\nDavid's reign and restoration required the continual support and submission of the people. Likewise, for God to continue to reign in our hearts, we must submit our lives to Him without reserve. To make His Son Jesus the Lord of our hearts, we must obey His Word, and exercise diligence to separate and remove the doubt and sins that remain in our lives [2 Peter 1:10]. Only then can we say that God truly reigns as the King of our hearts.",
        "part6": "THOUGHT",
        "part7": "Dear God, may You reign over me, lead me, guide me, so that I may live a life that is pleasing to You.",
        "part8": [
            "2 SAMUEL 18",
            "2 CORINTHIANS 13"
        ]
    },
    "25 SEPTEMBER": {
        "part1": "2 Samuel 19:16-17",
        "part2": "Shimei's fear",
        "part3": "VERSE 16",
        "part4": "And Shimei the son of Gera, a Benjamite, which was of Bahurim, hasted and came down with the men of Judah to meet king David.",
        "part5": "We read about the former acts of Shimei in 2 Samuel 16:5-14. At the lowest point of David's life, Shimei had rubbed salt into his wounds. He hurled curses and threw stones at David and his men as they came to Bahurim, blaming the demise of Saul and his house on David, and exulting that his dismal situation was his deserved punishment. The distraught and weary David then, had received Shimei's accusation with humility. He did not retaliate but turned to the LORD.\n\nIn today's verses, the situation has changed dramatically. David was returning to Jerusalem in jubilation after Absalom's rebellion was quelled. And Shimei was among the first to welcome him - he together with a thousand men of Benjamin, even crossed the Jordan before David so that they could be rightly seen as receiving him home.\n\nWhat caused this change of attitude in Shimei? We can only see one reason - fear. His earlier speculation was wrong. Absalom's revolt did not end David's reign. King David's return would mean Shimei was in big trouble. Thus fearing for his life, Shimei was trying to reverse his past folly. There is no evidence of genuine repentance in Shimei. But it is evident he is trying to save his own skin.\n\nThis reversal of allegiance will prove to be a matter of convenience and his respite temporary. Years later in David's final instructions to Solomon, it becomes clear that David had seen through Shimei's hypocrisy. David said to his son, \"Now therefore hold him (Shimei) not guiltless: for thou art a wise man, and knowest what thou oughtest to do unto him; but his hoar head bring thou down to the grave with blood\" [1 Kings 2:9].",
        "part6": "THOUGHT",
        "part7": "Be careful with your words. \"A fool uttereth all his mind: but a wise man keepeth it in till afterwards.\" - Proverbs 29:11",
        "part8": [
            "2 SAMUEL 19",
            "GALATIANS 1"
        ]
    },
    "26 SEPTEMBER": {
        "part1": "2 Samuel 19:18-20",
        "part2": "Shimei's desperate plea  VERSES 19-20 And said unto the king, Let not my lord impute iniquity unto me, neither do thou remember that which thy servant did perversely the day that my lord the Ring went out of Jerusalem, that the king should take tt to his heart. For thy servant doth know that I have sinned: therefore, behold, I am come the first this day of all the house of Joseph to go down to meet my lord the Ring.  To CompLtete THE BiBLeE",
        "part3": "",
        "part4": "And said unto the king, Let not my lord impute iniquity unto me, neither do thou remember that which thy servant did perversely the day that my lord the king went out of Jerusalem, that the king should take it to his heart. For thy servant doth know that I have sinned: therefore, behold, I am come the first this day of all the house of Joseph to go down to meet my lord the king.",
        "part5": "There was no way Shimei could take back what he had said to David. The only thing he could do was to confess that he had indeed done perversely against his lord and plead for David to forgive and forget this offence against him. He had sinned against God's anointed king, and to claim his sincerity in repentance, he was quick to point out he was the first to meet the king that day.\n\n\"Seest thou a man that is hasty in his words? there is more hope of a fool than of him\" [Proverbs 29:20]. Shimei is a good example of one who does not watch his tongue. To be fair, it was natural for Shimei to think negatively of David's reign, given that he was also from the house of Benjamin. In the annals of history, this is something new kings have always to deal with - the sentiment and allegiance of those who served and prospered under the previous, and especially if the new king was from a different house.\n\nHad Shimei kept his thoughts to himself then, he would not be caught in the situation we read today. He had humiliated and mocked the king publicly - the allegations were so serious and his attitude so disrespectful that the king's men had wanted to kill him there and then [2 Samuel 16:9]. Now that the king is back, it is almost impossible not to deal with this public transgression that had been committed. King David could do one of two things - punish Shimei to assert his authority, or spare Shimei to show his graciousness; and to the latter Shimei was appealing.",
        "part6": "THOUGHT",
        "part7": "He that hath knowledge spareth his words: and a man of understanding is of an excellent spirit. Even a fool, when he holdeth his peace, is counted wise: and he that shutteth his lips is esteemed a man of understanding. - Proverbs 17:27-28",
        "part8": [
            "2 SAMUEL 20",
            "GALATIANS 2"
        ]
    },
    "27 SEPTEMBER": {
        "part1": "2 Samuel 19:21-23",
        "part2": "David's restraints",
        "part3": "VERSE 22",
        "part4": "And David said, What have I to do with you, ye sons of Zeruiah, that ye should this day be adversaries unto me? shall there any man be put to death this day in Israel? for do not I know that I am this day king over Israel?",
        "part5": "Abishai had wanted to kill Shimei since their first encounter [2 Samuel 16:9]. David had stopped him that time for two reasons: first, he saw Shimei's cursing as chastisement from God [2 Samuel 16:10- 11]; and second, in not retaliating, David had hoped for God's mercy. In his own words, \"It may be that the LORD will look on mine affliction, and that the LORD will requite me good for his cursing this day\" [2 Samuel 16:12]. Now that everything has been set right for David, Abishai again asked for Shimei's head, \"because he cursed the LORD's anointed\" [v. 21]. But again, David had two thoughts in sparing Shimei's life now: first, he said, \"What have I to do with you, ye sons of Zeruiah, that ye should this day be adversaries unto me?\" Shimei had brought along one thousand men from Benjamin in homage [2 Samuel 19:17]. If David were to kill Shimei, it might strain the relationship between him and the house of Benjamin. Then, more importantly, David also said, \"Shall there any man be put to death this day in Israel? for do not I know that I am this day king over Israel?\" Being able to return to Jerusalem, David was grateful. God had chastised him and then shown mercy. He should therefore be gracious and grant forgiveness to another who now came before him expressing repentance. \"Blessed are the merciful: for they shall obtain mercy\" [Matthew 5:7]. As difficult as it is, we must control our natural impulse and instead show mercy. A spirit of forgiveness must fill and control our hearts.",
        "part6": "THOUGHT",
        "part7": "And be ye kind one to another, tenderhearted, forgiving one another, even as God for Christ's sake hath forgiven you. - Ephesians 4:32",
        "part8": [
            "2 SAMUEL 21",
            "GALATIANS 3"
        ]
    },
    "28 SEPTEMBER": {
        "part1": "2 Samuel 19:24-25",
        "part2": "Mephibosheth's loyalty questioned",
        "part3": "VERSE 25",
        "part4": "And it came to pass, when he was come to Jerusalem to meet the king, that the king said unto him, Wherefore wentest not thou with me, Mephibosheth?",
        "part5": "Our attention now shifts to Mephibosheth. In 2 Samuel 16:1-4, we read that his servant Ziba had come to David with a gift of supplies and stinging slander against his master. Ziba said then, \"Behold, he abideth at Jerusalem: for he said, To day shall the house of Israel restore me the kingdom of my father\" [2 Samuel 16:3b]. By Ziba's account, Mephibosheth was rejoicing over David's departure and chose to stay in Jerusalem waiting to be restored to the throne. David had reacted hastily then and transferred everything in Saul's house to Ziba's ownership [2 Samuel 16:4].\n\nNow, Mephibosheth came with a different story. But first we note his appearance. He \"had neither dressed his feet, nor trimmed his beard, nor washed his clothes, from the day the king departed until the day he came again in peace\". Mephibosheth was apparently mourning for David when he was away, which begs the question David asked, \"Wherefore wentest not thou with me, Mephibosheth?\"\n\nDavid had made an impulsive and hasty decision when he gave all of Saul's property to Ziba. Treacherous Ziba had caught David in a state of weariness and confusion from all his troubles. David should have composed himself, prayed for guidance and listened to both sides of the story.\n\nOur vision is often obscured by our circumstances. We cannot see beyond our predicament. In times like these, take a step back, pray and ask for God's wisdom to see things in the right light. Be not hasty in our decisions especially in times of crises; commit everything to the LORD and wait upon Him.",
        "part6": "THOUGHT",
        "part7": "If any of you lack wisdom, let him ask of God, that giveth to all men liberally, and upbraideth not; and it shall be given him. - James 1:5",
        "part8": [
            "2 SAMUEL 22",
            "GALATIANS 4"
        ]
    },
    "29 SEPTEMBER": {
        "part1": "2 Samuel 19:26-28",
        "part2": "Mephibosheth's defence",
        "part3": "VERSE 27",
        "part4": "And he hath slandered thy servant unto my lord the king; but my lord the king is as an angel of God: do therefore what is good in thine eyes.",
        "part5": "Mephibosheth presented his side of the story. Ziba had lied to him, saying he would prepare a donkey so lame Mephibosheth could follow David in leaving Jerusalem. The donkey did not come, and he had to stay behind [v. 26]. Ziba furthermore slandered him before David saying Mephibosheth had stayed back with the intention of hoping to be the next king.\n\nHearing this account, which is entirely different from Ziba's, we can imagine David's confusion. He probably regretted his hasty decision to punish Mephibosheth by giving all to Ziba. But Mephibosheth had not come seeking redress for his grievances. Neither did he blame David for believing Ziba and making his uninformed (and unwise) judgement. Instead, Mephibosheth called David \"an angel of God\" who is entitled to \"do therefore what is good in thine eyes\".\n\nHis rationale was this: \"For all of my father's house were but dead men before my lord the king: yet didst thou set thy servant among them that did eat at thine own table. What right therefore have I yet to cry any more unto the king?\" [v. 28]. Mephibosheth realised that if not for the hesed love and mercy of David before, he would not have survived till this day. How could he then demand anything from David?\n\nThis is the condition of mankind as well. If not for God's covenantal love, we would be nothing but condemned sinners. There are no grounds for us to demand \"fairness\", for if fairness was God's yardstick, then we should all perish. Yet God loves us and gives us His best even though we do not deserve anything at all.",
        "part6": "THOUGHT",
        "part7": "But by the grace of God I am what I am: and His grace which was bestowed upon me was not in vain; but I laboured more abundantly than they all: yet not I, but the grace of God which was with me. - 1 Corinthians 15:10",
        "part8": [
            "2 SAMUEL 23",
            "GALATIANS 5"
        ]
    },
    "30 SEPTEMBER": {
        "part1": "2 Samuel 19:29-30",
        "part2": "David's judgement",
        "part3": "VERSE 29",
        "part4": "And the king said unto him, Why speakest thou any more of thy matters? I have said, Thou and Ziba divide the land.",
        "part5": "David had a decision to make. On the one hand, there was Ziba, who had pledged his allegiance and supplied provisions to David when he fled Jerusalem [2 Samuel 16:1-4]. On the other, there was Mephibosheth, whom David had promised Jonathan to take care of [1 Samuel 20:14- 15]. One of them had told a lie, and David could have asked for a trial to find out the truth. But David did not do so, instead he decided to let Ziba and Mephibosheth divide Saul's land.\n\nMost commentators would say it was Ziba who lied; it is quite difficult to see how Absalom's revolt would lead to lame Mephibosheth being restored. But correct or not, David's decision to divide the land seemed to have brought the case to a close. We are not told of Ziba's response to having half of his property returned to his former master, but we read here that Mephibosheth was grateful. He said to David, \"Yea, let him take all, forasmuch as my lord the king is come again in peace unto his own house\" [v. 30]. He would let Ziba have everything as long as David returned. That was his only concern.\n\nPerhaps some of us are not satisfied with how this matter was resolved. Surely the liar must be punished, and the rightful owner restored all he had lost. Yet who can hold on to any riches on earth for eternity? The things in this world are nothing compared to treasures in heaven. It is in this spirit that we can echo Mephibosheth by saying, \"Yea, let the world take all, forasmuch as we can eat continually at the King's table.\"",
        "part6": "THOUGHT",
        "part7": "I'd rather have Jesus than silver or gold; I'd rather be His than have riches untold; I'd rather have Jesus than houses or lands; I'd rather be led by His nail-pierced hand Than to be the king of a vast domain, or be held in sin's dread sway; I'd rather have Jesus than anything this world affords today. - Oscar C. A. Bernadotte",
        "part8": [
            "2 SAMUEL 24",
            "GALATIANS 6"
        ]
    }
}