{
    "1 JANUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 1 Paul puts it this way: God the Father chose us in",
        "part4": "",
        "part5": "S LESSON",
        "part6": "",
        "part7": "There is therefore now no condemnation to them which are in Christ Jesus, who walk not after the flesh, but after the Spirit.  THOUGHT  alvation is the work of God, not ours. There is no condemnation because of what the triune God has done. In theology, this is known as the covenant of redemption, referring to the harmony and unity of purpose in the Trinity before the foundation of the world on the matter of salvation. God the Father, God the Son and God the Holy Spirit are in complete agreement for all eternity in terms of bringing forth the work of redemption. Paul puts it this way: God the Father chose us in Christ Jesus (God the Son) and we are sealed with the \"Holy Spirit of promise\" (read Ephesians 1:2- 14). What is the role of God the Father in the work of redemption? He sent the Son in the likeness of sinful man to be the sin offering; and in so doing, God not only condemned sin in the flesh, but His demands for perfect righteousness are also fully satisfied in those who are united to Christ [2 Corinthians 5:21]. What is the role of God the Son? Christ did the work of redemption. He came to \"give His life a ransom for many\" [Mark 10:45]. Christ was \"the Lamb of God, which taketh away the sin of the world\" [John 1:29]. He was \"the propitiation for our sins\" [1 John 2:2], appeasing the righteous wrath of a holy God. What is the role of the Holy Spirit? He joins us to Christ. We are in Christ by the Holy Spirit. Paul tells us that Christians are \"sealed with that holy Spirit of promise, which is the earnest of our inheritance until the redemption of the purchased possession\" [Ephesians 1:13-14]. Being thus joined, we can be certain there is \"therefore now no condemnation to them which are in Christ Jesus\". All praise to the triune God whose work of redemption gives us abundant life forever.",
        "part8": []
    },
    "2 JANUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 1 When Paul says there is now no condemnation",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "There is therefore now no condemnation to them which are in Christ Jesus, who walk not after the flesh, but after the Spirit.  THOUGHT  he apostle Paul has been telling us that before God, we are all guilty and liable for His wrath and punishment. The Jews thought they could escape this because they had the law. They prided themselves in knowing God's commandments, but Paul pointed out the law just made them less excusable because \"by the deeds of the law there shall no flesh be justified in (God's) sight\" [Romans 3:20]. When Paul says there is now no condemnation for those who are in Christ, it is not due to the suspension or annulment of the law; rather it is a vicarious provision being made on our behalf. One writer calls it the objective provision of the Gospel of Christ. It is objective because our condemnation has been absolved not because God closed His eyes to sin but because our sins have been paid in full by Christ's work on our behalf. The Son of God endured the wrath of God in our place on the accursed tree. The word \"condemnation\" in Romans 8:1 has a prefix intensifying its meaning of total and final condemnation. But because of the totality and finality of the atoning sacrifice by our Lord Jesus Christ, the dreadful condemnation has been totally and completely removed. What is amazing is that this is a fact at this present moment. There is \"now no condemnation to them which are in Christ Jesus\". This is not just a future hope, but it is also a present reality. We know the day will come when we have to give an account before God. That day, we will stand confident in Christ because even now, there is already no condemnation. \"He that believeth on the Son hath everlasting life: and he that believeth not the Son shall not see life; but the wrath of God abideth on him\" [John 3:36]. Are you in Christ?",
        "part8": []
    },
    "3 JANUARY": {
        "part1": "Romans 8:1",
        "part2": "Walk not after the Flesh (Part 1)",
        "part3": "VERSE 1",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "There is therefore now no condemnation to them which are in Christ Jesus, who walk not after the flesh, but after the Spirit.  THOUGHT  he Christian's walk is our manner of living. It is what our life is all about. Our \"walk\" is our way of life. Our walk is identified by what we live for and what motivates us. It is identified by the things with which and people with whom we associate. It is identified by where the affections of our hearts lie. It is identified by what comes out of our hearts by way of our mouths. It is identified by the place and authority we give to Christ in our lives. Walking after the flesh is having our lives completely directed by and carried away with our carnal desires and carnal minds. It has been said that some people eat to live, while others live to eat. When food becomes the dominating and controlling factor in one's life, one is walking after the flesh. When your purpose in life is only to satisfy carnal desires (food, pleasure, entertainment, etc.), you are walking after the flesh. God has given us \"richly all things to enjoy\" [1 Timothy 6:17], but when we start to live for those things so that they crowd out the more important things in life, we are walking after the flesh. Our walk is either after the flesh or after the Spirit. It cannot be both because they are diametrically opposed. \"The flesh lusteth against the Spirit, and the Spirit against the flesh: and these are contrary the one to the other\" [Galatians 5:17]. We cannot do both at the same time. The inward transformation of our nature must be matched by the outward change of our lives.  Chosen by God the Father, redeemed by God the Son, sealed by God the Spirit, our lives must be marked by the constraining love of God to walk after the Spirit.",
        "part8": [
            "GENESIS 3",
            "MATTHEW 3"
        ]
    },
    "4 JANUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 1 In his epistle to the Galatians, Paul gives two",
        "part4": "",
        "part5": "B LESSON",
        "part6": "",
        "part7": "There is therefore now no condemnation to them which are in Christ Jesus, who walk not after the flesh, but after the Spirit.  THOUGHT  ecause of the lust (or desire) of the flesh, an unregenerate person cannot do good, even though he knows he should and may even have an inner desire to do so. Like a person suffering from substance abuse who knows the dreadful consequences of addiction, he may even have the desire not to take the next puff, or the next drink or the next throw of the dice, but he cannot overcome his addiction because he is driven and controlled by his desire. In his epistle to the Galatians, Paul gives two contrasting lists: the works of the flesh and the fruit of the Spirit [Galatians 5:19-23]. It is interesting to note that Paul presents the works of the flesh as a list of multiple transgressions while the fruit of the Spirit is singular. The fruit of the Spirit comes in one package. The works of the flesh are carried out individually. That means an unsaved person may manifest one or more of the works of the flesh and even some of the attributes of the fruit of the Spirit. This makes it easier for unbelievers to be deceived about their standing before God. The Bible has multiple warnings for \"so-called\" brethren [1 Corinthians 5:11]; those who think they are saved when they are really lost. Our Lord Jesus warns: \"I never knew you: depart from me, ye that work iniquity\" [Matthew 7:23]. Paul also says: \"Know ye not that the unrighteous shall not inherit the kingdom of God? Be not deceived ...\" [1 Corinthians 6:9]. \"Be not deceived; God is not mocked: for whatsoever a man soweth, that shall he also reap\" [Galatians 6:7]. Even so, we shall be known by our fruits. Ye shall know them by their fruits ... Every good tree bringeth forth good fruit; but a corrupt tree bringeth forth evil fruit. A good tree cannot bring forth evil fruit, neither can a corrupt tree bring forth good fruit. - Matthew 7:16-19",
        "part8": []
    },
    "5 JANUARY": {
        "part1": "Romans 8:1",
        "part2": "Walk after  the Spirit [Part 1]",
        "part3": "VERSE 1",
        "part4": "",
        "part5": "J LESSON",
        "part6": "THOUGHT",
        "part7": "There is therefore now no condemnation to them which are in Christ Jesus, who walk not after the flesh, but after the Spirit.  THOUGHT  ust as the works of the flesh are evident in a person who is walking after the flesh - \"now the works of the flesh are manifest ...\" [Galatians 5:19-21] - so likewise must the fruit of the Spirit be evident in God's people. \"The fruit of the Spirit is love, joy, peace, longsuffering, gentleness, goodness, faith, meekness, temperance: against such there is no law\" [Galatians 5:22-23]. Doing things per se do not save the sinner; neither do they define a spiritual person. This is not a fleshly work; it is not a matter of raising a hand at a Gospel meeting, saying a prayer, or being kind and loving. These spiritual graces are the natural outflow of one who is conscientiously walking after the Spirit of God. To be sure, the fruit will not be developed to the fullest measure in every believer - nor can it be this side of eternity. The reason is that although all born-again Christians have the Holy Spirit indwelling them - they are \"in Christ\" - they are not always controlled by the Spirit of Christ. However, every believer must evidence all the attributes of the fruit of the Spirit, and it must be a growing fruit. By the Spirit's power, we are being continually restrained from doing the evil that is presented to us, and we are more and more being constrained by the love of God so that those evil things we would otherwise do, we no longer do. The extent to which we bear the Spirit's fruit depends on our walking after the Spirit, meaning obedience to God's Word and being controlled by the Spirit.  A Christian is a whole-hearted and one-minded person who is walking after the Spirit.",
        "part8": [
            "GENESIS 5",
            "MATTHEW 5"
        ]
    },
    "6 JANUARY": {
        "part1": "Romans 8:1",
        "part2": "Walk after  the Spirit (Part 2)",
        "part3": "VERSE 1",
        "part4": "",
        "part5": "I LESSON",
        "part6": "THOUGHT",
        "part7": "There is therefore now no condemnation to them which are in Christ Jesus, who walk not after the flesh, but after the Spirit.  THOUGHT  n Romans 8, we can imagine Paul having a dialogue with his readers. Paul first makes the statement: \"There is therefore now no condemnation to them which are in Christ Jesus\". That leads to the people asking Paul: \"Who are those who are in Christ?\" Paul's answer: \"These would be those 'who walk not after the flesh, but after the Spirit.'\" Who are those \"who walk not after the flesh\"? There are some who believe that these are people who no longer have a sin nature; people who do not at all respond to the desires of the flesh. But that is not what Paul means. When Paul refers to those \"who walk not after the flesh\", he is speaking of those who have no confidence in the flesh. Their hope is not in their works. Their salvation is not in their will. Their sanctification is not of their own doing. No man, honest with himself, is going to lean on the arm of the flesh to be saved and to be sanctified. That is why Paul adds that not to walk after the flesh is to walk after the Spirit. That means the Spirit convicts, regenerates, seals, and leads the sinner. On our part, we repent when the Spirit convicts. We imbibe what the Spirit teaches. We receive what the Spirit reveals. And we follow where the Spirit leads. \"Where does the Spirit lead?\" He is the Spirit of truth [John 14:17; 15:26; 16:13] so He will never lead us to error. He is the Holy Spirit so He will never lead us in the path of unrighteousness. He came from the Father [John 15:26] so He will lead us back to the Father and life everlasting, and free us \"from the law of sin and death\" [v. 2].  The Spirit will never lead us away from truth into error. He will never lead us away from righteousness into sin.",
        "part8": [
            "GENESIS 6",
            "MATTHEW 6"
        ]
    },
    "7 JANUARY": {
        "part1": "Romans 8:2",
        "part2": "The Law of the Spirit of Life",
        "part3": "VERSE 2",
        "part4": "",
        "part5": "I LESSON",
        "part6": "THOUGHT",
        "part7": "For the law of the Spirit of life in Christ Jesus hath made me free from the law of sin and death.  THOUGHT  n Romans 8:1, Paul contrasts the walk after the flesh with the walk after the Spirit. In verse 2, Paul makes a second contrast - the law of the Spirit of life in Christ Jesus against the law of sin and death. This contrast between the flesh and the Spirit is prevalent in the New Testament. Paul writes that \"the flesh lusteth against the Spirit, and the Spirit against the flesh: and these are contrary the one to the other\" [Galatians 5:17]. The two laws stand in absolute contradistinction. What is the law of the Spirit of life in Christ Jesus? First, the law of the Spirit of life in Christ is the glorious law of the Gospel of Christ that frees us from enslavement to sin as opposed to the old law that enslaves us in sin and death. Second, the law of the Spirit of life in Christ works in us, transforming our hearts and minds beyond just behavioural conformity to some external law. All men are born with a natural tendency to do the works of the flesh, which leads to death. The law of the Spirit of life in Christ works in us to lead us away from the way of sin to a new life in our Saviour. The Psalmist writes: \"Thy word have I hid in mine heart, that I might not sin against thee\" [Psalm 119:11]. Third, the law of the Spirit of life in Christ frees us from the burden to follow and keep God's Law for salvation. Christ fulfilled the law on our behalf so that we do not have to obey to the jot and tittle the law in order to be accepted by God.  The demands of the law send us to Christ to be saved, and Christ sends us back to the law to be sanctified.",
        "part8": [
            "GENESIS 7",
            "MATTHEW 7"
        ]
    },
    "8 JANUARY": {
        "part1": "Romans 8:2",
        "part2": "Freedom from the Law of Sin  and death",
        "part3": "VERSE 2",
        "part4": "",
        "part5": "I LESSON",
        "part6": "THOUGHT",
        "part7": "For the law of the Spirit of life in Christ Jesus hath made me free from the law of sin and death.  THOUGHT  n the Garden of Eden, God warned Adam, \"Of every tree of the garden thou mayest freely eat: But of the tree of the knowledge of good and evil, thou shalt not eat of it: for in the day that thou eatest thereof thou shalt surely die\" [Genesis 2:1617]. When Adam defied God's word and ate the forbidden fruit, the curse - the law of sin and death - went into effect. And it remains in effect even today. \"Wherefore, as by one man sin entered into the world, and death by sin; and so death passed upon all men, for that all have sinned\" [Romans 5:12]. However, by the mercies of God, there is a law that trumps the law of sin and death, which is the law of the Spirit of life in Christ Jesus. We see this law operating in the life of the apostle Paul, who was \"breathing out threatenings and slaughter against the disciples of the Lord\" [Acts 9:1], but when Christ stopped him on the Damascus road, Paul was completely changed. And he later testified, \"I am crucified with Christ: nevertheless I live; yet not I, but Christ liveth in me: and the life which I now live in the flesh I live by the faith of the Son of God, who loved me, and gave himself for me\" [Galatians 2:20]. In the Christian, there remains a residual hold of the law of sin, accounting for the continual spiritual struggle in us [Romans 7:15-24]. But as we walk with God, we will find ourselves more and more opposed to the strong hold of the law of sin. May that be our heart's desire indeed.  \"It is the spirit that quickeneth (gives life); the flesh profiteth nothing: the words that I speak unto you, they are spirit, and they are life\" (John 6:63). The law of sin brings death. The Holy Spirit brings life.",
        "part8": [
            "GENESIS 8",
            "MATTHEW 8"
        ]
    },
    "9 JANUARY": {
        "part1": "Romans 8:3",
        "part2": "The Impotence of the Law",
        "part3": "VERSE 3",
        "part4": "",
        "part5": "I LESSON",
        "part6": "THOUGHT",
        "part7": "For what the law could not do, in that it was weak through the flesh, God sending his own Son in the likeness of sinful flesh, and for sin, condemned sin in the flesh:  THOUGHT  n Romans 8:2, we read that it takes the law of the Spirit of life in Christ Jesus to free us from the law of sin and death. The basis for this new law in the believer is the death of Jesus Christ. The law cannot bring us life. \"Therefore by the deeds of the law there shall no flesh be justified in his sight: for by the law is the knowledge of sin\" [Romans 3:20]. Sinners are \"justified by faith without the deeds of the law\" [Romans 3:28]. The law is not set up to save. The intent of the law is to expose and condemn sin. The law is given to define what sin is and what righteousness is, but it is weak through our flesh. The law can only command us to do what is right and not do what is wrong, and while it demands perfect obedience, it does not have the means to enable us to be obedient. That is why we cannot be free from the law's condemnation. For this reason, the law can only condemn us; it cannot save us. Living in Singapore - a country known for its strict law and order - Christians have to remember that we cannot produce godliness in our society by making laws. That is a fool's venture. It does not work. It has never worked, and it will never work. The only way we can produce godliness in a nation is to win more sinners to the kingdom of God and let them be the salt of the earth and light for Christ.  Righteousness (of God) exalteth a nation: but sin is a reproach to any people. - Proverbs 14:34",
        "part8": [
            "GENESIS 9",
            "MATTHEW 9"
        ]
    },
    "10 JANUARY": {
        "part1": "Romans 8:3",
        "part2": "The Omnipotence of God",
        "part3": "VERSE 3",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "For what the law could not do, in that it was weak through the flesh, God sending his own Son in the likeness of sinful flesh, and for sin, condemned sin in the flesh:  THOUGHT  he law cannot do anything to make us righteous because it cannot do anything to take away our sins. In a court of law, if a person is found guilty, the law can only exact judgement on the person. But what the laws could not do, the judge can. The judge has the authority to reduce the punishment, and even let the person off. Similarly, in the court of heaven, the law of God has no means of letting sinners get away with sin. \"The soul that sinneth, it shall die\" [Ezekiel 18:4, 20]. However, what the law could not do through the weakness of our flesh, God did by sending His own Son in the likeness of sinful flesh on account of sin: And He condemned sin in the flesh. A perfect illustration of the impotence of the law and the omnipotence of God is seen in the story of the woman caught in adultery [John 8:311]. The scribes and Pharisees brought her before Jesus and asked, \"Master ... Moses in the law commanded us, that such should be stoned: but what sayest thou?\" [John 8:4-5]. According to the law, she deserved death. The law could not save her. When the scribes and Pharisees pressed Jesus for His answer, He said to them: \"He that is without sin among you, let him first cast a stone at her\" [John 8:7]. And all the accusers slinked away. Christ then said to the woman, \"Neither do I condemn thee: go, and sin no more\" [John 8:11]. The law condemned the adulteress (all her accusers and us too), but the Lord Jesus Christ set her free. God did the same for us through Christ who suffered the penalty of our sins on the cross. Christ \"Who His own self bare our sins in His own body on the tree, that we, being dead to sins, should live unto righteousness: by whose stripes ye were healed.\" [1 Peter 2:24]",
        "part8": [
            "GENESIS 10",
            "MATTHEW 10"
        ]
    },
    "11 JANUARY": {
        "part1": "Romans 8:3",
        "part2": "Christ came in the Flesh  (Part 1)",
        "part3": "VERSE 3",
        "part4": "",
        "part5": "W LESSON",
        "part6": "THOUGHT",
        "part7": "For what the law could not do, in that it was weak through the flesh, God sending his own Son in the likeness of sinful flesh, and for sin, condemned sin in the flesh:  THOUGHT  e might have just celebrated Christmas three weeks ago, but there is never a time when it is out of place to speak of the incarnation of Christ. Martin Luther - the 16th century Reformer - preached countless sermons on the first advent of Christ and the power of His incarnation, helping the people understand the true meaning of Christmas. He writes: \"Read and meditate upon the nativity. If the meditation does not reach the heart, we shall sense no sweetness. The heart will not laugh or be merry. There is such richness and goodness in this nativity that if we should see and deeply understand, we should be caught up in perpetual joy.\" In his most famous carol - one of several he composed - Luther wrote: \"From heaven high I come to you. I bring you tidings good and new. Glad tidings of great joy I bring, whereof I now will say and sing. To you this night is born a child, Of Mary, chosen, virgin, mild. This little child of lowly birth, Shall be the joy of all the earth.\" Luther would go on to express his joy in Christ for another 15 stanzas. If there is one thing Luther loved more than Christmas, it is the doctrine of justification by faith alone in Christ without works. Luther says, \"We cannot grasp or exhaust Christ the eternal righteousness with one sermon. We are to learn to appreciate him as an everlasting lesson which we shall not be able to finish either in this life or in the life to come.\" Luther believed justification by faith alone in Christ is the chief article of Christian doctrine and the prince of theology. And while he preached many sermons on the incarnation, he preached many more about the doctrine of justification. The doctrine of justification by faith alone in Christ is the heart of the Christian faith and our life itself.",
        "part8": [
            "GENESIS 11",
            "MATTHEW 11"
        ]
    },
    "12 JANUARY": {
        "part1": "Romans 8:3",
        "part2": "Christ came in the Flesh  (Part 2)",
        "part3": "VERSE 3",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "For what the law could not do, in that it was weak through the flesh, God sending his own Son in the likeness of sinful flesh, and for sin, condemned sin in the flesh:  THOUGHT  he Bible asserts that Jesus is the God-Man. God incarnate - \"the Word was made flesh, and dwelt among us\" [John 1:14]. Christ \"took not on Him the nature of angels; but He took on him the seed of Abraham\" [Hebrews 2:16]. He \"took upon Him the form of a servant, and was made in the likeness of men\" [Philippians 2:7]. The Westminster Confession of Faith also teaches: \"The Son of God, the second person of the Trinity, being very and eternal God, of one substance and equal with the Father, did, when the fullness of time was come, take upon Him man's nature, with all the essential properties and common infirmities thereof, yet without sin...\" [WCF, Chapter 8.2]. So essential is this doctrine to Christianity that the apostle John describes those who deny the incarnation of Christ as \"a deceiver and an antichrist\" [2 John 7; 1 John 4:3]. Confessing that Jesus Christ is God come in human flesh is necessary to the Christian faith because this doctrine is so intricately connected to other doctrines - the deity of Christ, His impeccability, the efficacy of His redemptive work. No one who denies this doctrine can be said to be born-again. Christ is the God-Man, meaning that when Christ took on human flesh, He was neither a demigod (less than God in divine attributes) nor a superman (more than man in human faculties). In His condescension, Christ was fully man, but He remained fully God. The Confession puts it this way - \"Which person is very God and very man, yet one Christ, the only Mediator between God and man.\" [WCF, Chapter 8.2] Christ is God from the essence of the Father, begotten before time; and he is human from the essence of his mother, born in time; completely God, completely human, with a rational soul and human flesh; equal to the Father as regards divinity, less than the Father as regards humanity. [Athanasian Creed]",
        "part8": [
            "GENESIS 12",
            "MATTHEW 12"
        ]
    },
    "13 JANUARY": {
        "part1": "Romans 8:3",
        "part2": "Same or Similar",
        "part3": "VERSE 3",
        "part4": "",
        "part5": "I LESSON",
        "part6": "THOUGHT",
        "part7": "For what the law could not do, in that it was weak through the flesh, God sending his own Son in the likeness of sinful flesh, and for sin, condemned sin in the flesh:  THOUGHT  n the fourth century (AD 300s), a doctrinal controversy broke out between two theologians - Arius and Athanasius. The point of contention was the nature and the essence of Christ. Was Christ the same as God or was Christ similar to God? The debate was really over one letter. Arius argued for homoiousios - a compound word comprising \"homoi\" (similar) and \"ousia\" (substance) - teaching that God the Son is similar to God the Father, but not identical. Athanasius, on the other hand, argued for homoousios - \"homo\" (same) - that God the Son is the same as God the Father, having the same essence and nature. Whatever God the Father is, God the Son is too. To resolve this controversy, Emperor Constantine convened the Council of Nicaea in 325 AD which put an end to it, although the influence of Arianism persisted in the church for centuries. The happy outcome of that Council was the Nicene Creed which affirms the doctrine of homoousios, that God the Son is the same as God the Father. When Christ \"was made flesh\", Paul says that Christ was \"made in the likeness of men\" [Philippians 2:7]; that He was sent \"in the likeness of sinful flesh\". \"Likeness\" - in Greek homoiomati - carries the concept of similarity and not sameness. For Paul to say that Jesus came in sinful flesh would have contradicted the clear New Testament teaching of the sinless nature of Jesus. By coming in a state similar to human nature, our Lord Jesus is able to identify with our miseries, frailties and pain without Himself becoming defiled by sin. \"For we have not an high priest which cannot be touched with the feeling of our infirmities; but was in all points tempted like as we are, yet without sin\" [Hebrews 4:15]. The assurance of our salvation is based on the fact that we have a sinless Saviour.",
        "part8": [
            "GENESIS 13",
            "MATTHEW 13"
        ]
    },
    "14 JANUARY": {
        "part1": "Romans 8:3",
        "part2": "Sin Condemned in the Flesh",
        "part3": "VERSE 3",
        "part4": "",
        "part5": "A LESSON",
        "part6": "THOUGHT",
        "part7": "For what the law could not do, in that it was weak through the flesh, God sending his own Son in the likeness of sinful flesh, and for sin, condemned sin in the flesh:  THOUGHT  s we have noted (9 January reading), the law's intent is to condemn sin, but it is unable to destroy its power. The condemnation of sin can only come by God sending \"His Son in the likeness of sinful flesh, and for sin, condemned sin in the flesh\". God sent His Son \"for sin\". That is the purpose of Christ coming into the world. The incarnation of Christ has no relevance apart from the fact of sin. He is \"the Lamb of God, which taketh away the sin of the world.\" [John 1:29] God sent His Son to condemn sin. The word \"condemn\" as used by Paul (also in Romans 8:1) comprises both pronouncement and execution. In other words, God not only declares sin to be what it is but also executes judgment upon it. God most certainly and definitively destroyed the power of sin. God sent His Son to condemn sin in the flesh. In other words, God condemned sin in Christ's flesh - in His human nature. We must never forget that it is in our place Christ bore the wrath of God against sin [Romans 5:6-9]. We must take note it is not just sin in the flesh that was condemned, but that sin was condemned through the flesh. Christ was made sin for us [2 Corinthians 5:21]. He bore \"our sins in His own body on the tree\" [1 Peter 2:24]. \"He was wounded for our transgressions; He was bruised for our iniquities\" [Isaiah 53:5]. The empty cross and empty tomb are our assurance that God has decisively condemned sin in the flesh. They are also our confidence that through Christ, we have victory over sin and death. Sin was judicially dealt with in the flesh. Sin has thus no more rights in us now. Praise the LORD that in Christ, there is not the slightest possibility of condemnation.",
        "part8": [
            "GENESIS 14",
            "MATTHEW 14"
        ]
    },
    "15 JANUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 4 us \"it is not possible that the blood of bulls and of",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "That the righteousness of the law might be fulfilled in us, who walk not after the flesh, but after the Spirit.  THOUGHT  he very purpose of God sending His Son is so that sin may be condemned in the flesh and that \"the righteousness of the law might be fulfilled in us\". Romans 8:4 speaks both of our justification [v. 4a] as well as our sanctification [v. 4b]. Our Lord Jesus Christ, by His sacrificial death on the cross, condemned sin in the flesh and fulfilled the demands of the law, as our substitute. Christ fulfilled the ceremonial law. Hebrews tells us \"it is not possible that the blood of bulls and of goats should take away sins\" [Hebrews 10:4], but Christ, \"by His own blood he entered in once into the holy place, having obtained eternal redemption for us\" [Hebrews 9:12]. The righteousness of the law demands our complete and active obedience to it so that we may be justified. The law must be perfectly and intensely obeyed to the jot and tittle in every aspect of our lives. We must be sinless in thought, word and deed. We must be innocent as Adam originally was in the Garden, and the angels in heaven. Because of the sinfulness of our flesh, this is humanly impossible. We can never fulfil the law in our own persons and by our own wills. Christ fulfilled the moral law perfectly and intensely. And by His obedience to it, we are made righteous. Christ, the sinless One was made sin for us so \"that we might be made the righteousness of God in Him\" [2 Corinthians 5:21]. In His grace, Christ steps into our lives, but that is not where it ends. The Gospel is not antinomian. We who have been justified are also sanctified. Holiness is the fruit and evidence of reconciliation with God.  Christ, God's beloved, condemned as though His foe. He, as though I, accursed and left alone; I, as though He, embraced and welcomed home! - His Robes for Mine",
        "part8": []
    },
    "16 JANUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 4 Ephesians that \"we are His workmanship, created",
        "part4": "",
        "part5": "\" LESSON",
        "part6": "",
        "part7": "That the righteousness of the law might be fulfilled in us, who walk not after the flesh, but after the Spirit.  THOUGHT  God sending his own Son in the likeness of sinful flesh\" - that is Christ's incarnation. \"For (our) sin, condemned sin in the flesh\" [v. 3] - that is the reason for His sacrificial death. But it must be pointed out that Christ died to save us not merely in our sins, but also from our sins. God condemned sin through His Son so that holiness might appear in us. That is what Paul meant when he says to the Ephesians that \"we are His workmanship, created in Christ Jesus unto good works, which God hath before ordained that we should walk in them\" [Ephesians 2:10]. God has ordained the double ends - the good works and the workers of those works (that is, you, I, and all believers). God has also ordained the means so that we would be enabled to accomplish the good works that He has specifically appointed for us. Thus, it is important for us to know the good works for which God has saved us to do, and to actually do them. There is a reason God has set you at this point of your life in the place where you are. Esther was hesitant to do the good works God had ordained for her until Mordecai posed her this question - \"Who knoweth whether thou art come to the kingdom for such a time as this?\" [Esther 4:14]. As God's people, we too must know the purpose for which we are on earth. And there is no greater confidence for and no greater joy in our lives than to know we are walking in the way that God has set for us.  God has made us alive in Christ so that we might live for Him. God saved us by His grace so that we may extend grace to the people who cross our paths.",
        "part8": []
    },
    "17 JANUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 4 to the spices that they used [Matthew 23:23]. The",
        "part4": "",
        "part5": "\" LESSON",
        "part6": "",
        "part7": "That the righteousness of the law might be fulfilled in us, who walk not after the flesh, but after the Spirit.  THOUGHT  Except your righteousness shall exceed the righteousness of the scribes and Pharisees, ye shall in no case enter into the kingdom of heaven\" [Matthew 5:20]. By a cursory reading of these words, it seems the Lord Jesus has set an impossible standard for our entrance into God's kingdom. To the average Jew, who could be more righteous than the scribes and the Pharisees? They were known for their strict keeping of the law. The law called for tithing, and so they did, down to the spices that they used [Matthew 23:23]. The law called for keeping the Sabbath holy, so they would not even lift a finger to do works of mercy. Even Paul, before his conversion, boasted that as \"touching the righteousness which is in the law, (he was) blameless\" [Philippians 3:6]. But the Pharisees were not righteous - not by God's standards. They were self-righteous, and self-righteousness is defective righteousness. What is defective righteousness? These are \"good works\" that come neither from a sincere heart nor done according to the principles of grace. The Pharisees carried out these acts not for God's glory but for man's applause. The Pharisees did \"good works\" so they could be seen by men, and Jesus said \"they have their reward\" [Matthew 6:2], but reward only on earth with adulation from man, and not reward in heaven with approval from God. These are also works that \"have omitted the weightier matters of the law\" [Matthew 23:23]. The Pharisees satisfied themselves with occasional external works that impress others, rather than good works from a transformed heart that truly please God. Do good works of righteousness, but \"let not thy left hand know what thy right hand doeth ... and thy Father which seeth in secret Himself shall reward thee openly\" [Matthew 6:3-4].",
        "part8": []
    },
    "18 JANUARY": {
        "part1": "Romans 8:4",
        "part2": "True Righteousness of the Law (Part 2)",
        "part3": "VERSE 4",
        "part4": "",
        "part5": "W LESSON",
        "part6": "PRAYER",
        "part7": "That the righteousness of the law might be fulfilled in us, who walk not after the flesh, but after the Spirit.  PRAYER  hen our Lord Jesus says that unless our \"righteousness shall exceed the righteousness of the scribes and Pharisees, (we) shall in no case enter into the kingdom of heaven\" [Matthew 5:20], He is emphasizing the need for righteousness as a condition for admission into God's kingdom. It was the loss of righteousness that caused Adam and Eve to be expelled from the Garden of Eden in the first place. If God were to admit us into heaven without righteousness, it would go against the very nature of His justice. Unlike the self-righteousness of the Pharisees in our Lord's time, the present age is dominated by an antinomian spirit. The view that says, \"As long as I feel good and right and do not hurt anyone, the law is irrelevant.\" There are Christian preachers who say that the Ten Commandments are passe, claiming that our sins - past, present, and future - have been forgiven. We are in the age of grace and therefore the commandments in God's Word have no part in the Christian's life. It is an egregious doctrinal error dispelled by our Lord Jesus Christ who says, \"If ye love me, keep my commandments\" [John 14:15]. And in Romans 13:9, Paul applies the second table of the law to Christians, adding that \"love (for God) is the fulfilling of the law\" [Romans 13:9-10]. A \"pharisaical\" righteousness will not bring a sinner into God's kingdom, but neither should a person count on \"lawless\" grace to save him. The grace of God does not nullify His moral law. Law and grace are not contradictory. They complement each other. We are saved by the grace of God and empowered by the Holy Spirit to walk in holiness. Not my righteousness, O Lord but Thine for Thou are Jehovah Tsidkenu - \"In his days Judah shall be saved, and Israel shall dwell safely: and this is his name whereby he shall be called, THE LORD OUR RIGHTEOUSNESS.\" [Jeremiah 23:6; 33:16]",
        "part8": [
            "GENESIS 18",
            "MATTHEW 18"
        ]
    },
    "19 JANUARY": {
        "part1": "Romans 8:4",
        "part2": "Holiness and the Work of  the Holy Spirit",
        "part3": "VERSE 4",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "That the righteousness of the law might be fulfilled in us, who walk not after the flesh, but after the Spirit.  THOUGHT  he Pharisee counts on his own righteousness. At the other end of the spectrum, the antinomian believes that grace exempts him from obeying the law. The Christian lives with confidence in the saving grace of Christ but also in the reality that he is still susceptible to the temptations of the devil and the world, and the weakness of his own flesh. Christians can sin - and still do. The law serves as a guide as we tread this treacherous world. In Romans 7, Paul said that before his conversion, as much as he loved the law of God, he could not keep the law. But after his conversion, he discovered that he could not keep the law by himself. The things that he should do, he did not, but the things that he should not do, he did. And he discovered that by his own flesh, he could not walk after the Spirit. Only by the presence and power of the Holy Spirit could he walk after the Spirit. This reality leads to two conclusions: First, the Holy Spirit is vital to holy living. The Holy Spirit who indwells us will teach us all things, bring all things to our remembrance, and guide us in all truth [John 14:17, 26; 16:13] so that we may know the Word of God and walk in the path of truth and righteousness. Second, we must work at this relationship by our obeying God's Word and submitting to the Spirit's guidance. Paul exhorts us to \"yield (ourselves) unto God, as those that are alive from the dead, and (our) members as instruments of righteousness unto God\" [Romans 6:13].  As God's redeemed, we must seek the Spirit's guidance and rely on His power for our holiness.",
        "part8": [
            "GENESIS 19",
            "MATTHEW 19"
        ]
    },
    "20 JANUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 4 the unholy state of Christians and their churches?",
        "part4": "",
        "part5": "A LESSON",
        "part6": "",
        "part7": "That the righteousness of the law might be fulfilled in us, who walk not after the flesh, but after the Spirit.  PRAYER  person must follow Christ to be a Christian. There is no other way. The person who claims to be a Christian must also reflect the nature of Christ. \"As He which hath called you is holy, so be ye holy in all manner of conversation; Because it is written, Be ye holy; for I am holy\" [1 Peter 1:15-16; Leviticus 20:7]. That begs the question - if holiness is the nature of Christ and Christians, how do we account for the unholy state of Christians and their churches? Sadly, there is an observable divide between the claim and the character, between the talk and the walk. While it is easy to point the finger at others, the revival of religion lands squarely on the shoulders of individuals - you and I. To the extent we are personally revived, the church will be revived. A study of the history of revivals shows it happens in three phases. First is the realisation we are not what we ought to be. This is an awakening to the truth so that counterfeit believers and lukewarm Christians are brought to see their true spiritual condition. The second phase is revival, in which genuine believers are brought to spiritual life again. With this comes a growing spiritual vitality, and a thirst and hunger for God's truth and righteousness. The third phase - impact on society - follows naturally. Just as salt will flavour food, and light will dispel darkness, the spiritually-revived Christian will make an impact in his home, community and workplace. How we need a true evangelical revival in our day. Spiritual revival is like a ripple; it begins with you, your family, your church and then society at large. Lord, send a revival and let it begin with me.",
        "part8": []
    },
    "21 JANUARY": {
        "part1": "Romans 8:5",
        "part2": "Fleshly-Minded (Part 1)",
        "part3": "VERSE 5",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "For they that are after the flesh do mind the things of the flesh; but they that are after the Spirit the things of the Spirit.  THOUGHT  here are those who hold the view that we can classify the spiritual state of people in three ways - unbelievers, believers, and those who are believers but live like unbelievers, commonly known as carnal (fleshly-minded) Christians. Romans 8:5 tells us that there are really only two classes - believers and unbelievers. The third class of people is a misnomer. These are the ones who have imbibed the false teaching of preachers who assure them of \"peace, peace; when there is no peace\" [Jeremiah 6:14; 8:11]. Such spiritual delusion is destructive. \"For they that are after the flesh do mind the things of the flesh\". The word \"flesh\" (Greek: sarx), in its literal sense, refers to the fleshly part of man; it portrays man in his physical and earthly state [John 1:14; 1 John 4:2]. However, in the New Testament, \"flesh\" is commonly used as a metaphor denoting man's sinful nature - the unregenerate dimension of humanity. In this regard, the contrast is often made between the flesh and the spirit - either it is earthly in contrast to the heavenly, or it is the sinful in contrast to the life in Christ. So the natural man is under the control of his \"sinful flesh\", but the regenerate man is guided by the Spirit. The former is ruled by sin; the latter by God. Paul reminds us that to be fleshly-minded is to war against the Spirit of God [Galatians 5:17]. He adds that the \"carnal (sarx) mind is enmity against God\" [v. 7], which manifests itself in overt sinful behaviour [Galatians 5:19-21]. Just as it is unnatural and impossible for a sinner to live holily, so it is equally unnatural and egregious for a saint to continue to live in the flesh. That which is born of the flesh is flesh; and that which is born of the Spirit is spirit. - John 3:6",
        "part8": [
            "GENESIS 21",
            "MATTHEW 21"
        ]
    },
    "22 JANUARY": {
        "part1": "Romans 8:5",
        "part2": "Fleshly-Minded (Part 2)",
        "part3": "VERSE 5",
        "part4": "",
        "part5": "W LESSON",
        "part6": "THOUGHT",
        "part7": "For they that are after the flesh do mind the things of the flesh; but they that are after the Spirit the things of the Spirit.  THOUGHT  hen we think of those who \"mind the things of the flesh\", the tendency is to see a person who is engaged in fleshly sins - drunkenness, sexual promiscuity, lovers of pleasure, pride, etc. [Galatians 5:19-21; 2 Timothy 3:4]. In other words, we tend to think of sinful acts performed by unbelievers. However, to \"mind the things of the flesh\" has a larger scope in meaning. The word \"mind\" describes an attitude - a disposition of the mind; the allegiance of one's heart. It would include many things we may not usually describe as fleshly. In Romans 8:5, Paul is not just concerned about the sinful deeds; he is just as concerned about the sinful affections. Take Paul for example. Before his conversion, he said that as far as the law was concerned, he was \"a Pharisee; concerning zeal, persecuting the church; touching the righteousness which is in the law, (he was) blameless\" [Philippians 3:5-6]. In his lost state, Paul did not indulge in debauchery; quite the contrary, he was a strict moralist and a religious zealot. As a Pharisee, Paul would have followed the stringent moral rules, controlling every aspect of his life. Was Paul doing \"the things of the flesh\"? Assuredly not! But was he minding the things of the flesh? Most certainly! Such is the characteristic of the moral unbeliever, whose desire is to prove that by his own efforts, he is worthy of God's saving favour. Nothing so characterizes the thinking of the unbeliever than this delusion.  Christian, mind heavenly things. \"Seek those things which are above ... Set your affection on things above, not on things on the earth\" [Colossians 3:12].",
        "part8": [
            "GENESIS 22",
            "MATTHEW 22"
        ]
    },
    "23 JANUARY": {
        "part1": "Romans 8:5",
        "part2": "What is a Christian? (Part 1)",
        "part3": "VERSE 5",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "For they that are after the flesh do mind the things of the flesh; but they that are after the Spirit the things of the Spirit.  THOUGHT  he unbeliever sets his mind on what his own flesh desires. The believer, on the other hand, sets his mind on what the Spirit desires. This is the difference between one who is merely religious and one who is mindful of the things of the Spirit. The Pharisees were exceedingly religious; they kept the law meticulously, but they desired to kill the Lord Jesus. Saul of Tarsus was extremely religious even as he was creating havoc in the church and having Christians arrested and thrown into jail [Acts 9:2]. In making the contrast between the fleshlyminded and the spiritually-minded, Paul exposes the folly of those who are merely religious; those who merely ascribe to a set of orthodox theological beliefs; these who mistakenly think that as long as they believe, their sins will be forgiven, and God is obliged to save them. It is important to embrace biblical truth and believe in the right doctrines because without faith, it is impossible to please God. That said however, the Word of God reminds us that \"the devils also believe, and tremble\" [James 2:19]. There were many who saw the miracles of our Lord Jesus and believed in His name, but He \"did not commit himself unto them, because he knew all men\" [John 2:23-24]. To be a Christian is more than just giving verbal assent to a set of biblical doctrines; it is to be born again of the Spirit [John 3:5-6], and it is to be expected that one who is born of the Spirit will mind the things of the Spirit.  Our Christian conduct must be evident in our Christian confession.",
        "part8": [
            "GENESIS 23",
            "MATTHEW 23"
        ]
    },
    "24 JANUARY": {
        "part1": "Romans 8:5",
        "part2": "What is a Christian? (Part 2)",
        "part3": "VERSE 5",
        "part4": "",
        "part5": "W LESSON",
        "part6": "THOUGHT",
        "part7": "For they that are after the flesh do mind the things of the flesh; but they that are after the Spirit the things of the Spirit.  THOUGHT  hat is a Christian? What does being a Christian mean? You are a Christian when you are convicted of your sins, quickened by the power of the Holy Spirit to put your faith in the atoning work of Christ. And being regenerated, there is an inner transformation that causes you to set your heart and mind on the things of the Spirit so that your life is directed by the desires of the Spirit. It does not mean we are sinlessly perfect. It also does not mean we will always be walking in the Spirit, but it does mean that we want to. Our Lord Jesus says that a Christian is one who enters the strait gate and walks the narrow way. The narrow path is not the destination. The destination is eternal life in the presence of God. Walking the narrow path simply means we are moving along in the path of righteousness, following our Lord Jesus. In this life, we are not a finished product. We are in the process of being. And as we mind the things of the Spirit, we are daily being sanctified, like a rough stone being polished, like silver being refined. Now we are not like our Saviour, but one day, we will be. John puts it this way, \"Beloved, now are we the sons of God, and it doth not yet appear what we shall be: but we know that, when he shall appear, we shall be like him; for we shall see him as he is\" [1 John 3:2].  I am not what I ought to be; I am not what I want to be, I am not what I hope to be in another world; but still I am not what I once used to be, and by the grace of God I am what I am. - John Newton",
        "part8": [
            "GENESIS 24",
            "MATTHEW 24"
        ]
    },
    "25 JANUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 6 5]. There is a link between what we think and how",
        "part4": "",
        "part5": "P LESSON",
        "part6": "",
        "part7": "For to be carnally minded is death; but to be spiritually minded is life and peace.  THOUGHT  aul makes the contrast between a believer and an unbeliever. As the Gospel is preached, there will be two kinds of responses. Those who submit to God in repentance of sin with faith in Christ, and those who reject it. Both will then show in their lives the effects of believing or not. The believer will walk after the Spirit, but the unbeliever will walk after the flesh. \"For they that are after the flesh do mind the things of the flesh; but they that are after the Spirit the things of the Spirit\" [v. 5]. There is a link between what we think and how we live. Verse 6a reads \"for to be carnally minded is death\". Carnal-mindedness or flesh-mindedness means to think and live according to the desires of the flesh under the control of our sin nature, which leads to death. That is how we were before we were saved. After being born again in Christ, though we may still have a tendency to give in to carnal thinking, behaving like the ungodly and pursuing the lusts of the flesh - a life that displeases God; however, in Christ we have been delivered from helpless the bondage to sin, from the devil, and from the eternal death judgment. So, we must turn away from the sinful lifestyle of the flesh. We must heed God's Word and be resolved to shun evil for \"the works of the flesh are manifest, which are these; Adultery, fornication, uncleanness, lasciviousness, idolatry, witchcraft, hatred, variance, emulations, wrath, strife, seditions, heresies, envyings, murders, drunkenness, revellings, and such like: of the which I tell you before, as I have also told you in time past, that they which do such things shall not inherit the kingdom of God\" [Galatians 5:19-21]. And they that are Christ's have crucified the flesh with the affections and lusts. - Galatians 5:24",
        "part8": []
    },
    "26 JANUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 6 5:17].",
        "part4": "",
        "part5": "W LESSON",
        "part6": "",
        "part7": "For to be carnally minded is death; but to be spiritually minded is life and peace.  THOUGHT  hen God saved us by His grace through the finished work of His Son Jesus Christ, the Holy Spirit indwelled us, enabling us to live the new life in Christ. This does not mean we have attained moral perfection in our body of flesh. We still face manifold temptations. Why? \"For the flesh lusteth against the Spirit, and the Spirit against the flesh: and these are contrary the one to the other: so that ye cannot do the things that ye would\" [Galatians 5:17]. The good news is that God has given us the power to live victoriously for Him. \"For God hath not given us the spirit of fear; but of power, and of love, and of a sound mind\" [2 Timothy 1:7]. This sound mind speaks of the God-given ability to think on the things of God, on spiritual things. How we think will result in how we act. If we train our minds to think spiritually in accordance with God's teaching, it will be life and peace. \"Thou wilt keep him in perfect peace, whose mind is stayed on Thee: because he trusteth in Thee\" [Isaiah 26:3]. But if we allow our minds to think things that pander to the lusts of the flesh, our bodies will take control of our lives and we will live and behave as if we were not saved. How do we train ourselves to think spiritually? Answer: \"If we live in the Spirit, let us also walk in the Spirit\" [Galatians 5:25]. Indeed, \"this I say then, Walk in the Spirit, and ye shall not fulfil the lust of the flesh\" [Galatians 5:16].  A spiritually-minded believer manifests the fruit of the Holy Spirit which \"is love, joy, peace, longsuffering, gentleness, goodness, faith, meekness, temperance: against such there is no law\" [Galatians 5:22-23].",
        "part8": [
            "GENESIS 26",
            "MATTHEW 26",
            "THOUGHT A. spiritually-minded believer manifests the fruit",
            "of the Holy Spirit which \"is love, joy, peace,",
            "longsuffering, gentleness, goodness, faith,",
            "meekness, temperance: against such there is no",
            "law\" [Galatians 5:22-23]."
        ]
    },
    "27 JANUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 7 we rebelled against His authority and law over us.",
        "part4": "",
        "part5": "V LESSON",
        "part6": "",
        "part7": "Because the carnal mind is enmity against God: for it is not subject to the law of God, neither indeed can be.  THOUGHT  erse 6 states the contrast in outcomes between the carnally minded - death, and the spiritually minded - life and peace. Verse 7 gives the reason for these outcomes: because the carnal mind is enmity against God. The word \"enmity\" is hostility. The carnal mind of fallen man is hostile to God. Before we were saved by grace in Christ, Romans 5:10 tells us we were enemies of God. We were defiant, and we rebelled against His authority and law over us. But thank God who \"commendeth His love toward us, in that, while we were yet sinners, Christ died for us ... when we were enemies, we were reconciled to God by the death of his Son\" [Romans 5:8, 10]. By the mercies and grace of God, we turned to Christ and were born again spiritually with a new inner nature able to live for God. We still struggle with the outer corrupt body of flesh that tries to lure us back into the old sinful ways. The battleground is in what and how we think - whether spiritually or carnally. If we give in to the temptation of carnal thinking, we are again behaving like an enemy of God. Perhaps you think you are not an enemy of God like a hard-core criminal. But God's enemy is anyone with an attitude of indifference toward Him - a heart that is neither hot nor cold toward Him. May the Lord help us to be true unto Him according to His word in John 15:14 \"Ye are My friends, if ye do whatsoever I command you.\"  Search me, O God, and know my heart: try me, and know my thoughts. - Psalm 139:23",
        "part8": [
            "GENESIS 27",
            "MATTHEW 27",
            "THOUGHT Search me, O God, and know my heart: try me, and",
            "know my thoughts. -- Psalm 139:23"
        ]
    },
    "28 JANUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 8 carnally minded are enemies of God in defiance",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "So then they that are in the flesh cannot please God.  THOUGHT  he phrase \"in the flesh\" taken by itself speaks of the unsaved who by nature live for themselves to satisfy their lustful appetites inherited from Adam's sin nature. Under the controlling power of sin, the flesh cannot do the things which please God. Such are already spiritually dead in their sin and trespasses. That is why no amount of good works done can save them from God's wrath. Following the reasoning in Romans 8:7 that the carnally minded are enemies of God in defiance of His law, Paul emphasizes that in the flesh they cannot please God. Here Paul warns believers they should not live their lives as before, in the way of the flesh. This is important because even though the souls of believers are saved by grace, they are still in the body of unredeemed flesh waiting to put on the incorruptible glorified body at the return of our Lord Jesus Christ. Meanwhile, believers experience conflicts within like what Paul experienced. \"For I know that in me (that is, in my flesh,) dwelleth no good thing: for to will is present with me; but how to perform that which is good I find not. For the good that I would I do not: but the evil which I would not, that I do\" [Romans 7:18-19]. The point is this - the reason we struggle is that our unredeemed flesh with its sinful tendencies has no ability to please God. Therefore, the only way to subdue the flesh is to maintain our walk in the power of the Holy Spirit and bear spiritual fruit within [Galatians 5:16, 22-23]. Our help is from the Lord.  Not by works of righteousness which we have done, but according to His mercy He saved us, by the washing of regeneration, and renewing of the Holy Ghost. - Titus 3:5",
        "part8": []
    },
    "29 JANUARY": {
        "part1": "Romans 8:9",
        "part2": "The Christian's Past",
        "part3": "VERSE 9",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "But ye are not in the flesh, but in the Spirit, if so be that the Spirit of God dwell in you. Now if any man have not the Spirit of Christ, he is none of his.  THOUGHT  he person delivered from sin's bondage and condemnation by Jesus Christ will be a different person. The inspired Bible writers describe them in various ways. He was blind walking in darkness before but now he has sight and abides in the light. He is a new creation versus the old. a citizen of heaven versus a citizen of the world, a slave to righteousness versus a slave to sin. Now born again, he is a child of God, no more a child of the devil. The new man is spiritual, while the old man was carnal. Here the apostle describes him as being in the Spirit, no more in the flesh. There must be a difference between who he is now and what he was before, or something is terribly amiss. The Christian's past was marked by a love of sin and indulgence in it. He now seeks after righteousness and strives for it because that pleases his new Master and glorifies God. Before, he sought only worldly things - \"the lust of the flesh, the lust of the eye and the pride of life,\" now he seeks to lay up treasures where moth and rust do not corrupt or thieves break in to steal. Before, his roots were sunk deep in this world, now he looks for a city with eternal foundations, whose builder and maker is God. He is wise and hears his Master's voice; he does His bidding thus building his house upon a rock, not sand. Dear friend, is your new life in the Spirit consistent with what has been described above and evidenced by fruit to God's glory or is it a fruitless fruit tree that will be hewn down and cast aside in the final reckoning because it is useless to anyone? [Matthew 7:16-20]  Can the fig tree, my brethren, bear olive berries? either a vine, figs? so can no fountain both yield salt water and fresh. - James 3:12",
        "part8": [
            "GENESIS 29",
            "MARK 1"
        ]
    },
    "30 JANUARY": {
        "part1": "Romans 8:9",
        "part2": "Indwelling of the Spirit",
        "part3": "VERSE 9",
        "part4": "",
        "part5": "W LESSON",
        "part6": "THOUGHT",
        "part7": "But ye are not in the flesh, but in the Spirit, if so be that the Spirit of God dwell in you. Now if any man have not the Spirit of Christ, he is none of his.  THOUGHT  hat is the difference between the person born \"in the flesh\" and the person born again \"in the Spirit\"? Is he different in appearance? Maybe. Sound different? Probably. Does he think and live life differently? Certainly. What accounts for the difference in one who has repented of his sin, received forgiveness and now trusts and follows Christ as his Saviour and Lord? It is that the Holy Spirit now dwells in him. Before he was a child of the fallen Adam, a slave to the prince of this world, the devil. Now he belongs to Christ, the sinless second Adam, freed from sin's penalty, born the second time not in the flesh but in the Spirit and indwelt by Him. What does it mean for us who are indwelt by the Spirit? It means the Holy Spirit is present with us perpetually. When we need God's guidance, the Holy Spirit is there as our Counsellor. When in need of comfort, He is our Comforter. When weak, He gives us strength. When we lack wisdom, we ask and He supplies. When life overwhelms, and we do not know what to pray, He teaches us and intercedes for us at the throne of grace. \"Emmanuel, God with us\" [Isaiah 7:14, Matthew 1:23] is not merely the prophecy and promise of God the Son Incarnate, but it is also an unequivocal statement of God the Spirit's perpetual presence with, habitation in and possession of the regenerate soul in Christ so that no more does sin have any claim on him. The Spirit's indwelling is the seal that a person is loved by and belongs to God forever. His is God's power and presence available only to His own. In the words of the modern gospel song, \"My chains are gone, I've been set free, Unending love, Amazing grace\". God's sublime promise that \"I will never leave thee, nor forsake thee\" [Hebrews 13:5] is confirmed by the Holy Spirit indwelling us.",
        "part8": [
            "GENESIS 30",
            "MARK 2"
        ]
    },
    "31 JANUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 9 as God's possession, saved by grace through faith",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "But ye are not in the flesh, but in the Spirit, if so be that the Spirit of God dwell in you. Now if any man have not the Spirit of Christ, he is none of his.  THOUGHT  he Holy Spirit is the third person of the Triune Godhead (the Trinity). As Jesus prepared his disciples for His imminent departure, He gave them the promise of the Holy Spirit whom God the Father would send to be their Comforter (or Helper) in His place, the Spirit of truth which the world cannot receive because they do not know Him [John 14:16-17]. He will enter and dwell in the believers' hearts as a seal of their special standing as God's possession, saved by grace through faith in Jesus Christ. Paul told the Corinthians, \"For He hath made him to be sin for us, who knew no sin; that we might be made the righteousness of God in Him\" [2 Corinthians 5:21]. Now they belong to Christ and the proof was the Holy Spirit within them. He asked them, \"What? know ye not that your body is the temple of the Holy Ghost which is in you, which ye have of God, and ye are not your own? For ye are bought with a price: therefore glorify God in your body, and in your spirit, which are God's\" [1 Corinthians 6:19-20]. The indwelling of the Spirit is the sole prerogative, special privilege and personal possession of the redeemed, who will henceforth be empowered to glorify God. If we deny the Spirit, we deny Christ. If we quench the Spirit, we deprive ourselves of His saving power. If we resist the Spirit, we despise God Almighty Himself and silence His divine voice of guidance and good conscience. God in His Spirit dwells with us. If we do not have the Spirit, then we do not have Christ and are still in our sins and condemned. Jesus Christ is the chief foundation stone and we are built together to be His holy temple, a habitation of God through the Spirit. Read Ephesians 2:2022.",
        "part8": [
            "conscience.",
            "GENESIS 31 God in His Spirit dwells with us. If we do not",
            "MARK 3 have the Spirit, then we do not have Christ and are",
            "still in our sins and condemned.",
            "THOUGHT Jesus Christ is the chief foundation stone and we",
            "are built together to be His holy temple, a habitation",
            "of God through the Spirit. Read Ephesians 2:20-",
            "22."
        ]
    },
    "1 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 10 penalty of his sins past, present and future has",
        "part4": "",
        "part5": "H LESSON",
        "part6": "",
        "part7": "And if Christ be in you, the body is dead because of sin; but the Spirit is life because of righteousness.  THOUGHT  ow is Christ in the Christian? By the Holy Spirit dwelling in him. The Christian as a child of Adam has inherited the sin gene. Tainted by his first father's fall, his soul was lost but God in His sovereign grace provided a Redeemer born not of man's seed but woman's. This Saviour was Jesus Christ, the second person of the Trinity. The Christian, born again by the blood now has the Spirit of Christ abiding in him [v. 9]. The penalty of his sins past, present and future has been paid once and for all on the Cross [Hebrews 10:12]. But his former sin nature remains to trouble him while he occupies this temporal body of flesh. Thus arises a tussle between his old nature and his new. The Christian in whose heart the Spirit dwells and to whom he gives full reign is like the branch connected to the vine [John 15:4-5]. The branch is fruitful only because it draws its nourishment and strength from the stem. He may be troubled by the presence of residual sin and sinful tendencies arising from his old nature, yet he is able to resist and overcome because the power of God's Holy Spirit is his ever-present help. Apostle John testified to this in writing, \"Ye are of God, little children, and have overcome them: because greater is he that is in you, than he that is in the world\" [1 John 4:4]. The Spirit of God is greater than the spirit of the antichrist. The Holy Spirit within us is the proof and seal of our redemption and eternal ownership by God. This is our present state and standing. It is a great privilege and high calling to be children of God, heirs and joint-heirs with Christ, empowered by the Spirit, awaiting the great day of our glorification [v. 8:16-17]. And grieve not the holy Spirit of God, whereby ye are sealed unto the day of redemption. - Ephesians 4:30",
        "part8": []
    },
    "2 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 10 [Philippians 2:13]. Christ 1s our new master, and",
        "part4": "",
        "part5": "I LESSON",
        "part6": "",
        "part7": "And if Christ be in you, the body is dead because of sin; but the Spirit is life because of righteousness.  THOUGHT  f Christ be in us, then His Spirit of righteousness is in us [Romans 1:4]. What blessed thought that we are no more subject to the dictates of the evil one or the whims of the flesh as we once were. The Christian in Christ is dead to sin but alive to God because the Spirit is living and active in him [Romans 6:11]. God works in us \"to will and do of His good pleasure\" through the working of the Spirit [Philippians 2:13]. Christ is our new master, and we are freed from sin's enslavement, with liberty and ability not to do whatever we want but to do what we ought as Paul told the Corinthians, \"Now the Lord is that Spirit: and where the Spirit of the Lord is, there is liberty.\" [2 Corinthians 3:17]. The Christian aspires to righteousness because Christ's Spirit of holiness lives in him [Romans 1:4]. The Christian regardless of his external circumstances is filled with inner joy and peace because he has the blessed hope of eternal life and the blessed assurance of divine companionship and ultimate victory through the Holy Spirit's power [Romans 15:13]. The Christian is able to bear fruit for God's glory because the Spirit of Christ is a river of life-giving waters within him. The Christian illuminated by the Spirit is able to discern and understand God's truth and believe His Word because he has the Spirit of truth [John 16:13] and the divine teacher [1 John 2:27]. Thus, the Christian can have faith in God whom he cannot see and believes His revelation of things yet to happen [Ephesians 1:17]. The Christian's life is one under control because the Holy Spirit is in control of it. The Spirit abides in us but we must abide in the Spirit. Therefore \"Walk in the Spirit, and ye shall not fulfil the lust of the flesh\" [Galatians 5:16].",
        "part8": []
    },
    "3 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 11 Christ. The Holy Spirit then dwells in the hearts",
        "part4": "",
        "part5": "A LESSON",
        "part6": "",
        "part7": "But if the Spirit of him that raised up Jesus from the dead dwell in you, he that raised up Christ from the dead shall also quicken your mortal bodies by his Spirit that dwelleth in you.  THOUGHT  t first glance, this verse may seem abstract. Actually, it is very clearly expressed. Here the apostle Paul wrote that the same Spirit that resurrected Jesus dwells in us (all who confess Jesus as their Saviour). God the Father, the Son (Jesus) and the Holy Spirit are all one. We were once at enmity with God and dead in our sins. But by God's grace, we were quickened (made alive) through the Lord Jesus Christ. The Holy Spirit then dwells in the hearts of every believer. Yes, the same Spirit Paul speaks about who raised Jesus dwells in us. Thus, we are now God's children. God, like any loving parent, cares for us, and He is listening when we pray. Just as the Lord Jesus was resurrected to die no more, we too will be resurrected and live forever. We will be in heaven after taking our last breath on earth. What is your response to such a privilege? We ought to have an obligation to the Spirit who lives in us. He walks with us, talks with us and guides us our entire life. \"And even to your old age I am he; and even to hoar hairs will I carry you: I have made, and I will bear; even I will carry, and will deliver you\" [Isaiah 46:4]. Therefore, we ought not to walk in the flesh again. We follow Christ, and as the Holy Spirit empowers us, we live as new creatures. But if we, who are saved by grace through faith in Jesus, do not change our life then something is amiss and we must check our hearts.  What? know ye not that your body is the temple of the Holy Ghost which is in you, which ye have of God, and ye are not your own? - 1 Corinthians 6:19",
        "part8": [
            "GENESIS 34",
            "MARK 6",
            "THOUGHT What? know ye not that your body is the temple",
            "of the Holy Ghost which ts in you, which ye have",
            "of God, and ye are not your own? -- 1 Corinthians",
            "6:19"
        ]
    },
    "4 FEBRUARY": {
        "part1": "Romans 8:11",
        "part2": "The Christian's Future",
        "part3": "VERSE 11",
        "part4": "",
        "part5": "N LESSON",
        "part6": "THOUGHT",
        "part7": "But if the Spirit of him that raised up Jesus from the dead dwell in you, he that raised up Christ from the dead shall also quicken your mortal bodies by his Spirit that dwelleth in you.  THOUGHT  o one knows what lies in the future, but we are assured because we know God holds our future. The future is not merely the physical life we live while on earth. As part of the old creation in Adam, our physical bodies will deteriorate with age and eventually die. The human future is bleak indeed. We may live for 60 to 80 years or a few more but with many problems. So there is no future on this corrupt earth. Thank God through Jesus the second Adam, we are now a new creature, and all things have become new. We have hope in Christ. This is the glorious truth. His death becomes our death, and His resurrection becomes our resurrection. And finally, we will be united with Him in eternity. This means we will live forever with Him in heaven. Our future is assured the moment we trust the Lord Jesus as our Saviour. We are justified and saved by grace through faith in Him. This earth is not our permanent dwelling place. While we are here, God will lead us day by day to sanctify us. With the help of the Holy Spirit living in us, we can live a godly life day by day conforming to the image and likeness of Christ. We rejoice in fellowship with Him. If we are already dead when Christ comes again, our bodies will be resurrected. But if we are still alive then, we will be raptured, and our bodies taken up to meet the Lord Jesus in the sky. What a bright and exciting future is awaiting us!  For I know the thoughts that I think toward you, saith the LORD, thoughts of peace, and not of evil, to give you an expected end. - Jeremiah 29:11",
        "part8": [
            "GENESIS 35-36",
            "MARK 7"
        ]
    },
    "5 FEBRUARY": {
        "part1": "Romans 8:12",
        "part2": "We are in Debt (Part 1)",
        "part3": "VERSE 12",
        "part4": "",
        "part5": "V LESSON",
        "part6": "THOUGHT",
        "part7": "Therefore, brethren, we are debtors, not to the flesh, to live after the flesh.  THOUGHT  erses 12 and 13 are clearly addressed to bornagain Christians. We are familiar with the account of the woman caught in adultery in John 8. The Lord's parting words to her were: \"Neither do I condemn thee: go, and sin no more\" [John 8:11]. When the Lord Jesus forgave the woman, He did not excuse her sin or treat it lightly. He expected her to repent of her sin and begin a new life. On the woman's part, she must have been grateful and felt an obligation to lead a holy life thereafter. Applying Romans 8 to ourselves, we can see that our situation is not any different from that of the adultress woman in John 8. In verse 1, Paul assures us that \"There is therefore now no condemnation to them which are in Christ Jesus\". Like the woman, we too are not condemned but forgiven, and now indebted to our new Master; we are under obligation to lead holy lives that bring glory to His name. Our Lord warned that in the last days, there will be many false teachers. Among the many falsehoods they teach will be that, since Jesus Christ has fully paid the penalty for our sins - past, present and future - there is no need to feel remorse for our sins, and no need to repeatedly seek forgiveness because each time you ask for forgiveness, you are crucifying the Lord all over again. Clearly, this is not what Paul is teaching in this epistle to the Romans.  But as he which hath called you is holy, so be ye holy in all manner of conversation; Because it is written, Be ye holy; for I am holy. - 1 Peter 1:15-16",
        "part8": [
            "GENESIS 37",
            "MARK 8"
        ]
    },
    "6 FEBRUARY": {
        "part1": "Romans 8:12",
        "part2": "We are in Debt (Part 2)",
        "part3": "VERSE 12",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "Therefore, brethren, we are debtors, not to the flesh, to live after the flesh.  THOUGHT  he first time Paul (then Saul) spoke to Jesus Christ who confronted him on the road to Damascus, he addressed Him as Lord. \"Who art thou, Lord? ... What wilt thou have me to do?\" [Acts 9:5-6]. In his testimony to King Agrippa, he recounted the mission his Master gave him; \"But rise, and stand upon thy feet: for I have appeared unto thee for this purpose, to make thee a minister (servant) and a witness both of these things which thou hast seen, and of those things in the which I will appear unto thee;\" [Acts 26:16]. Thus, in his greeting to the Roman Christians, as well as in many of his other epistles, Paul introduced himself as \"a servant of Jesus Christ, called to be an apostle, separated unto the gospel of God\" [Romans 1:1]. In Romans 1:14, he specifically labelled himself a \"debtor\". And so it is for everyone who calls himself a Christian. Like Paul, we are indebted to our Saviour who redeemed us at a great price. It is only reasonable that we present our bodies as a living sacrifice for the His use [Romans 12:1]. We have been \"saved to serve\", and we should serve with humility and much joy. This is what our Master expects of us. \"So likewise ye, when ye shall have done all those things which are commanded you, say, We are unprofitable servants: we have done that which was our duty to do\" [Luke 17:10].  What our Lord said to the seven churches in the Book of Revelation, He says to us today; \"I know thy works\".",
        "part8": [
            "GENESIS 38",
            "MARK 9"
        ]
    },
    "7 FEBRUARY": {
        "part1": "Romans 8:13",
        "part2": "Live after the Flesh -- Death",
        "part3": "VERSE 13",
        "part4": "",
        "part5": "P LESSON",
        "part6": "THOUGHT",
        "part7": "For if ye live after the flesh, ye shall die: but if ye through the Spirit do mortify the deeds of the body, ye shall live.  THOUGHT  aul puts it simply and bluntly; if you are living after the flesh, you will die. This is another one of his many reminders. The flesh is doomed; it dies, and there are no exceptions. Therefore, if a man chooses to live after the flesh, he will experience what the flesh finally experiences - death. Everyone has to choose. To live after the flesh is to live as if this life is all there is. It is what the much-revered singer John Lennon expresses in his song \"Imagine\", many of the people of the world sadly follow. \"Imagine there's no heaven ... No hell below us. Above us only sky. Imagine all the people living for today.\" If you choose this path, you are like the rich fool the Lord warns about in His parable in Luke 12:16-21. Tragically, this is exactly the life many people today follow. We live in a culture saturated with enticements to satisfy our fleshly desires and constantly encouraging us to \"take thine ease, eat, drink and be merry.\" Our Lord warned that this is the kind of world that will greet Him when He returns; \"For as in the days that were before the flood they were eating and drinking, marrying and giving in marriage, until the day that Noe entered into the ark, And knew not until the flood came, and took them all away; so shall also the coming of the Son of man be.\" [Matthew 24:38-39]. Let us heed the Apostle's warning and choose life, not death.  There is a way that seemeth right unto a man, but the end thereof are the ways of death. - Proverbs 16:25",
        "part8": [
            "GENESIS 39",
            "MARK 10"
        ]
    },
    "8 FEBRUARY": {
        "part1": "Romans 8:13",
        "part2": "Die to the Flesh -- Live",
        "part3": "VERSE 13",
        "part4": "",
        "part5": "A LESSON",
        "part6": "THOUGHT",
        "part7": "For if ye live after the flesh, ye shall die: but if ye through the Spirit do mortify the deeds of the body, ye shall live.  THOUGHT  ll who hear the Gospel have to make a choice. If you choose to live after the flesh, you will die. The question then arises. Can a believer who has received the grace of God live after the flesh? The answer is no. While the sinful nature is still in the believer and may exert its influence, it will not have dominion. The true believer will not finally fall from his state of grace. But there will be a constant struggle with sin, a struggle that even the Apostle had to put up; and sometimes the flesh does get the upper hand and the believer stumbles and falls into sin. Paul says that believers have to mortify or put to death the deeds of the body. Deeds of the body refer to wicked deeds, evil lusts and passions, the desires and urges that lead to sin. The power to mortify the evil deeds of the body comes \"through the Spirit\". That means we need to have the Holy Spirit dwelling in us in the first place. We can find two excellent examples of godly men who were able to fend off the strongest temptations despite living in thoroughly pagan and godless societies. Joseph in Egypt was described as \"a man in whom the Spirit of God is\" [Genesis 41:38], and Daniel in Babylon was said to have \"an excellent spirit\" in him [Daniel 6:3]. If we are true followers of the Lord Jesus Christ, this same Holy Spirit indwells us, and He will help us in our struggle with sin.  Serving God in the spirit of adoption is true happiness. - James Smith, Daily Remembrancer",
        "part8": [
            "GENESIS 40",
            "MARK 11"
        ]
    },
    "9 FEBRUARY": {
        "part1": "Romans 8:13",
        "part2": "The Means of Mortification",
        "part3": "VERSE 13",
        "part4": "",
        "part5": "O LESSON",
        "part6": "THOUGHT",
        "part7": "For if ye live after the flesh, ye shall die: but if ye through the Spirit do mortify the deeds of the body, ye shall live.  THOUGHT  ur Lord says in Luke 9:23: \"If any man will come after me, let him deny himself, and take up his cross daily, and follow me.\" Denying oneself daily is not easy. Often the (human) spirit is willing, but the flesh is weak. Paul says that we must put to death the deeds of the flesh. This has the idea of denying, subduing, deadening, destroying the strength of the flesh. The apostle Peter puts it this way in 1 Peter 4:2, \"That he no longer should live the rest of his time in the flesh to the lusts of men, but to the will of God.\" However, even if we are willing to do it, we do not have the strength. We need the power of the Holy Spirit. Mortification of the flesh is a collaborative effort between us and the Holy Spirit within us. We must first have the will to deny the sinful desires and inclinations, and then the Spirit gives the strength to deaden and subdue their strength. He cannot destroy the strength of sin unless we exercise our will and work to destroy it ourselves, and we cannot will and work at it apart from Him. In this fight we need weapons. In Ephesians 6:17, Pauls says we need \"the sword of the Spirit, which is the word of God\". If you are one of those Christians who only open your Bible on Sunday mornings when the preacher asks you to do so, you can be sure that the flesh will have the upper hand and your defeat is certain.  The Bible will keep you from sin, or sin will keep you from the Bible. - Dwight L. Moody",
        "part8": [
            "GENESIS 41",
            "MARK 12"
        ]
    },
    "10 FEBRUARY": {
        "part1": "Romans 8:13",
        "part2": "John Owen -- What Mortification of Sin is not?",
        "part3": "VERSE 13",
        "part4": "",
        "part5": "J LESSON",
        "part6": "THOUGHT",
        "part7": "For if ye live after the flesh, ye shall die: but if ye through the Spirit do mortify the deeds of the body, ye shall live.  THOUGHT  ohn Owen (1616-1683) was a Puritan and a non-Conformist theologian. He was also one of the most prolific writers in the seventeenth century, writing over eight million words on topics that covered theology and spirituality, politics and economics, including the largest commentary ever published on the Epistle to the Hebrews. One of his many volumes was Mortification of Sin based on Romans 8:13. What is the mortification of sin? Owen writes: \"To mortify a sin is not utterly to kill, root it out, and destroy it, so that it has no more hold at all nor residence in our hearts. It is true this is that which is aimed at, but this is not in this life to be accomplished. There is no man that truly sets himself to mortify any sin, but he aims at, intends, and desires its utter destruction so that it leaves neither root nor fruit in the heart or life. He would so kill it that it should never move nor stir any more, cry or call, seduce or tempt, to eternity.\" Owen also warns us of the diversion of sin, like Simon Magus who left his sorceries but diverted to covetousness and remained in the \"gall of bitterness\" (Acts 8:23). \"A man may be sensible of a lust, set himself against the eruptions of it, take care that it shall not break forth as it has done, but in the meantime suffer the same corrupted habit to vent itself some other way ... The same is the case of trading lusts: a man's leaving off from serving one so that he may serve another. He that changes pride for worldliness ... let him not think that he has mortified the sin that he seems to have left. He has changed his master but is a servant still.\" Whose servant are you? \"Know ye not, that to whom ye yield yourselves servants to obey, his servants ye are to whom ye obey; whether of sin unto death, or of obedience unto righteousness?\" [Romans 6:16]",
        "part8": [
            "GENESIS 42",
            "MARK 13"
        ]
    },
    "11 FEBRUARY": {
        "part1": "Romans 8:13",
        "part2": "John Owen -- What Mortification of Sin is?",
        "part3": "VERSE 13",
        "part4": "",
        "part5": "O LESSON",
        "part6": "THOUGHT",
        "part7": "For if ye live after the flesh, ye shall die: but if ye through the Spirit do mortify the deeds of the body, ye shall live.  THOUGHT  wen writes that mortification of sin consists of three things: \"The weakening of this habit of sin or lust ... a constant fighting and contending against sin ... (and) a frequent success against any lust.\" To be in constant battle against sin requires us to know the tempter. \"To labour to be acquainted with the ways, wiles, methods, advantages, and occasions of sin's success is the beginning of this warfare. This is the way men deal with enemies. They inquire about their counsels and designs, ponder their goals, [and] consider how and by what means they have formerly prevailed, so that they may be prevented ... Indeed, men who mortify lust deal with it in this way. Not only when lust is actually vexing, enticing, and seducing, but in their quiet moments they consider, 'This is our enemy; this is his way and progress, these are his advantages, thus has he prevailed, and thus he will do, if not prevented.' So it was with David: 'My sin is ever before me' (Psalm 51:3). Indeed, one of the choicest and most eminent parts of spiritual wisdom, practically applied, consists in finding out the subtleties ... of any indwelling sin. A good part of our warfare is to consider and know - wherein its greatest strength lies; what advantage it takes of occasions, opportunities, and temptations; what are its pleas, pretenses, and reasonings; and what are its strategies, colors, and excuses. A good part of our warfare is - to set the wisdom of the Spirit against the craft of the old man; to trace this serpent in all its turnings and windings; to be able to say, at its most secret and imperceptible actings: 'This is your old way and course; I know what you aim at;' and so to be always in readiness.\" Be killing sin or it will be killing you.",
        "part8": [
            "GENESIS 43",
            "MARK 14"
        ]
    },
    "12 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 14 of both physical and spiritual death, man had no",
        "part4": "",
        "part5": "A LESSON",
        "part6": "",
        "part7": "For as many as are led by the Spirit of God, they are the sons of God.  THOUGHT  dam was the representative of mankind - head of the human race. By his sin, we are all sinners. \"Wherefore, as by one man sin entered into the world, and death by sin; and so death passed upon all men, for that all have sinned\" [Romans 5:12]. Even as Adam fell into the trap of the Devil, mankind fell under the dominion of the Devil, becoming his slaves and sons. Under the penalty of both physical and spiritual death, man had no hope of being reconciled to God his creator, nor entering heaven. When Nicodemus sought Jesus by night [John 3], Jesus read his mind and answered his question. \"Except a man be born again, he cannot see the kingdom of God\" [John 3:3b]. Unregenerate man is a spiritual son of the Devil [John 8:44]. Man in his physical form is born of his biological father - flesh begets flesh [John 3:6a]. Paul gives this warning, \"Flesh and blood cannot inherit the kingdom of God ... \" [1 Corinthians 15:50] because man's nature is thoroughly fallen. The carnal mind is enmity against God [v. 7]. Man came into the world without love for or fear towards God, without inclination to seek, serve or obey Him. Left to himself, the child of Adam is a son of Satan and will never turn to God. He needs a \"new birth\" to be the son of God and see His kingdom. The Holy Spirit regenerates the natural man by convicting him of his sins unto repentance, cleansing his heart, purifying his soul and turning him to God who justifies him. Given a \"new birth\", he is now adopted to be a child of God.  \"For all have sinned, and come short of the glory of God\" [Roman 3:23]; \"For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord\" [Romans 6:23].",
        "part8": []
    },
    "13 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 14 and keeps himself from the wicked one. Anyone",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "For as many as are led by the Spirit of God, they are the sons of God.  THOUGHT  he man born of God is a \"new creation\". He experiences a radical and profound change in his life. There will always be evidence of these fruits in every one that is born of the Spirit. In the first epistle of John, we learn that the man born of God \"believeth that Jesus is the Christ\", \"doth not commit sin\", \"doeth righteousness\" and \"overcometh the world\"; he loves the brethren and keeps himself from the wicked one. Anyone who is missing these marks is not a son of God but is still dead in his sin and trespasses. The heart and soul of the child of God is submissive and receptive to divine influences. He will have total confidence trusting in the Lord [Proverbs 3:5-6], resting in the peace, comfort and providence of the Good Shephard [Psalm 23]. He will draw nigh to God daily, communing with Him in prayer and supplication [Philippians 4:6-8] and the study of His Word [2 Timothy 2:15]. He will see things through God's eyes, seeking those things which are above, setting his affections on things above and not on things on the earth [Colossians 3:1-2]. The child of God has been led by the Spirit out of the kingdom of darkness, chaos and evil into the kingdom of light, truth and order; out of hunger, wretchedness, of guilty wanderings into the fullness and happiness of the Father's house, just as the prodigal son was led. And even as we journey on earth, we rejoice with the knowledge that God the Holy Spirit is leading us to His glorious heavenly city [Revelation 21:9-22:5].  He leadeth me: O blessed thought! O words with heavenly comfort fraught Whate'er I do, where'er I be, Still 'tis God's hand that leadeth me. - Joseph H. Gilmore",
        "part8": []
    },
    "14 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 14 all thy soul, and with all thy might' [Deuteronomy",
        "part4": "",
        "part5": "I LESSON",
        "part6": "",
        "part7": "For as many as are led by the Spirit of God, they are the sons of God.  THOUGHT  n paternity suits, paternity can be determined by means of DNA tests. Our spiritual sonship with God our Heavenly Father is assured when we recognise that the Spirit of God is working in our lives. The Spirit of God moves in our hearts to obey God's command which He had given to His chosen people, the Israelites - \"And thou shalt love the LORD thy God with all thine heart, and with all thy soul, and with all thy might\" [Deuteronomy 6:5]. As His chosen people now, we will love God our Father for who He is and what He has done in calling us to be His sons and daughters. The Holy Spirit moves our hearts to call out affectionately \"Abba, Father\" - \"And because ye are sons, God hath sent forth the Spirit of his Son into your hearts, crying, Abba, Father.\" [Galatians 4:6] and leads us to live holy lives because God our Father is holy [1 Peter 1:15-16]. The Spirit of God takes control of our intellect to renew our minds, moving us to offer our bodies \"a living sacrifice, holy, acceptable unto God\". We will not be conformed to this world but transformed by the continual renewal of our minds, and by our dedication begin to discern, know and do God's will [Romans 12:1-2]. He directs and strengthens us \"to will and to do of His good pleasure\" [Philippians 2:12-13]. By the diligent study of God's Word illumined by the Holy Spirit, our minds are renewed and we are transformed as we obey His Word, to honour Him.  As obedient children, not fashioning yourselves according to the former lusts in your ignorance: But as he which hath called you is holy, so be ye holy in all manner of conversation. - 1 Peter 1:1415",
        "part8": []
    },
    "15 FEBRUARY": {
        "part1": "Romans 8:14",
        "part2": "Sons of God",
        "part3": "VERSE 14",
        "part4": "",
        "part5": "M LESSON",
        "part6": "THOUGHT",
        "part7": "For as many as are led by the Spirit of God, they are the sons of God.  THOUGHT  embers of the same family may share some physical resemblances and hence be identified as belonging to that family. Drawn from across the ages, geography, history, ethnicity, culture, varying in outward form, social circumstances, with diverse gifts, faculties and endowments, the sons of God have hardly any external resemblance. Yet they have one resemblance inwardly - being led by the Spirit of God. The Bible gives us such godly examples - Joseph, the prime minister of the Egyptian empire; Mordecai the Jew, sitting despised at the king's gate; Solomon arrayed in all his glory; Lazarus clothed in rags and starving to death; Paul with his mighty intellect and Moses who was slow in speech. The local church is a microcosm of God's larger family. The minds and hearts of the sons of God, both young and old, from all walks of life, yield to the direction of God's Spirit to love and obey Him and seeking to please Him. They delight themselves in the Lord [Psalm 37:4], uniting in heart and spirit, in love and corporate worship. \"And let us consider one another to provoke unto love and to good works: Not forsaking the assembling of ourselves together, as the manner of some is; but exhorting one another: and so much the more, as ye see the day approaching\" [Hebrews 10:24-25]. Mindful of the Lord's commandment to His disciples in John 13:33-35, the sons of God will love each other even as they serve together in humility, esteeming others better than themselves so as to fulfil the great commission [Matthew 28:19-20] and looking eagerly forward to His return [Revelation 22:20]. But as many as received Him, to them gave He power to become the sons of God, even to them that believe on His name. - John 1:12",
        "part8": [
            "GENESIS 47",
            "LUKE 1:39-80"
        ]
    },
    "16 FEBRUARY": {
        "part1": "Romans 8:15",
        "part2": "The Spirit of Bondage Leads to Fear",
        "part3": "VERSE 15",
        "part4": "",
        "part5": "B LESSON",
        "part6": "THOUGHT",
        "part7": "For ye have not received the spirit of bondage again to fear; but ye have received the Spirit of adoption, whereby we cry, Abba, Father.  THOUGHT  efore we were saved by the Lord Jesus, each of us was a slave of sin, controlled by its power and unable to break free. No matter how we denied it or claimed indifference, we were continually subject to fear because we were living under God's judgement. We were also under the bondage of the law, attempting to please God through good works or fulfilling the prescriptions of the law. Alas, we could never obey it perfectly, ever falling short of God's holy standards. We sought peace, comfort and joy in worldly pursuits and pleasures but found nothing lasting. Our lusts and desires were never satiated. The worship of other gods did not give us assurance of acceptance, freedom from sin's guilt or confidence that we will be worthy to enter heaven. Such was the hopeless state we were in, plagued by the fear of future punishment at the hands of a just, holy and righteous God, with nowhere to hide. We thank God that He is gracious and merciful to us. He looked down on us in love and delivered us from our sinful, wretched state. God saved us by the gift of salvation through His only begotten Son, our Lord Jesus, who died in our place. The blood of Christ shed on Calvary's cross washed away our sins so that we are justified and reconciled to God. Now, all fear of hellfire judgement is removed, and we have the blessed assurance of eternal life in heaven.  But God be thanked, that ye were the servants of sin, but ye have obeyed from the heart that form of doctrine which was delivered you. Being then made free from sin, ye became the servants of righteousness. - Romans 6:17-18",
        "part8": [
            "GENESIS 48",
            "LUKE 2"
        ]
    },
    "17 FEBRUARY": {
        "part1": "Romans 8:15",
        "part2": "The Spirit of Adoption Leads to Faith",
        "part3": "VERSE 15",
        "part4": "",
        "part5": "I LESSON",
        "part6": "THOUGHT",
        "part7": "For ye have not received the spirit of bondage again to fear; but ye have received the Spirit of adoption, whereby we cry, Abba, Father.  THOUGHT  n the past, we were slaves to sin in rebellion against God. By nature, we were children of wrath and children of Satan [Ephesians 2:3, John 8:44]. When we were saved from our sins, we were adopted by into God's family, meaning our Heavenly Father admits us to the rights and privileges of His sons and daughters. We receive a new status and enter into a new relationship with Him. In the Old Testament, Jews regarded the name of Jehovah as too sacred to write or say. This led to a detached and impersonal relationship of reverence and fear of God. But in the earthly ministry of our Lord Jesus, He revealed a relationship with the Father that was intimate, close and personal. Jesus taught the disciples to pray, addressing God as \"Father\" [Matthew 6:9]. In the Garden of Gethsemane, Jesus prayed, \"Abba, Father\" [Mark 14:36]. Abba is the Aramaic term of endearment that small children used to address their fathers, indicating love and affection in the Son's relationship with God the Father. It reflects a joy and desire to commune with Him because of the inseparable spiritual bond that exists between the Father and His only begotten Son. Our Lord Jesus showed us we too can have a very personal and close relationship with God as His children. This relationship is characterised by God's love for us and the confidence that we can go to God freely and He will not turn us away. The assurance that He will hear all our petitions builds our faith in God that He who saved us at the first will save us to the uttermost.  To redeem them that were under the law, that we might receive the adoption of sons. And because ye are sons, God hath sent forth the Spirit of His Son into your hearts, crying, Abba, Father. - Galatians 4:5-6",
        "part8": [
            "GENESIS 49",
            "LUKE 3"
        ]
    },
    "18 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 16 take notice and we give God the praise and glory.",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "The Spirit itself beareth witness with our spirit, that we are the children of God.  THOUGHT  he Holy Spirit works in many ways in us who are adopted sons and daughters of God. Firstly, the Holy Spirit convicts us of our sins and sanctifies us. We are transformed and made more Christ-like in holiness. We develop a hatred for sin and distaste for the ways of the world. We bear the fruit of the Spirit while the works of the flesh become increasingly less evident in our lives. This marked difference in behaviour causes others to take notice and we give God the praise and glory. Secondly, the Spirit fosters in us the desire to commune with God in prayer and read His Word. We long to know God's will and His commands to us, seeking to obey His will. The inspired Word of God written by men directed by the Holy Spirit testifies of the work of salvation that God has done in us. Thirdly, the Spirit illumines our minds and gives us spiritual understanding so we are not blind to the message contained in God's Word. We understand truths that cannot be understood without the Spirit's enlightenment. Peter's confession of Christ as God the Son was only possible because spiritual insight from God the Holy Spirit enabled him to recognise who Jesus really was [Matthew 16:1617]. Others who observed the same things of Jesus and heard His teaching could not make the same confession because of spiritual blindness. We thank God for giving us the Holy Spirit. It is the witness of His Spirit in our lives that gives us the great assurance that we are truly saved by God.  Hereby know we that we dwell in Him, and He in us, because He hath given us of His Spirit. - 1 John 4:13",
        "part8": []
    },
    "19 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 16 of God. We enter into an exclusive, special and",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "The Spirit itself beareth witness with our spirit, that we are the children of God.  THOUGHT  he Greek word translated \"children\" in verse 16 does not simply refer to biological offspring. It refers to the close relationship that exists between a child and his/her father within the family. There is a bond of love that binds family members tightly together. The same word is used in John 1:12 where God's Word tells us God made all those who believed and trusted in the Lord Jesus Christ become the sons of God. We enter into an exclusive, special and intimate relationship of love with God the Father. God only allows those whom He has elected share this relationship with Him. The word is repeated in Jesus' teaching about prayer in Matthew 7:11. If we give good gifts to our children, \"how much more shall your Father which is in heaven give good things to them that ask him?\" Such is the compassion our heavenly Father has for us that He will only give what is good for us. We thank God for the blessed assurance of the forgiveness of sins, reconciliation with Him and adoption as His children. God gave us the Comforter to teach us all things [John 14:26] and guide us into all truth [John 16:13]. Even what we perceive as unpleasant is actually for our edification. God sends us trials to strengthen our faith, chastisement to correct us and grace to go through each day. Truly, the blessings of salvation in our Lord Jesus are more than we deserve.  Behold, what manner of love the Father hath bestowed upon us, that we should be called the sons of God: therefore the world knoweth us not, because it knew Him not. - 1 John 3:1",
        "part8": [
            "EXODUS 1",
            "LUKE 5",
            "THOUGHT Behold, what manner of love the Father hath",
            "bestowed upon us, that we should be called the",
            "sons of God: therefore the world knoweth us not,",
            "because it knew Him not. -- 1 John 3:1"
        ]
    },
    "20 FEBRUARY": {
        "part1": "Romans 8:17",
        "part2": "Heirs of God and Joint-heirs with Christ",
        "part3": "VERSE 17",
        "part4": "",
        "part5": "I LESSON",
        "part6": "THOUGHT",
        "part7": "And if children, then heirs; heirs of God, and joint-heirs with Christ; if so be that we suffer with him, that we may be also glorified together.  THOUGHT  n the preceding verses, we learnt what it means to be God's children. Adopted into God's family, we do not live in worldly fear anymore. We can cry out to God the Father for help in time of need, and we have the assurance of God the Holy Spirit telling us He will not leave us or forsake us, on account of our trust in the reconciliatory work of God the Son, the Lord Jesus Christ. Yet we will have missed God's greatest blessings if our minds are occupied only with earthly benefits. It is indeed comforting to know we have a God who hears our prayers and helps us through present trials, yet it would be a mistake to think the whole purpose of life is simply to live well here. In fact, a misrepresentation of the Gospel has caused many to go to churches solely for wellness and wealth in this life. Instead of God as the centre of their worship, their faith is centred on man's needs as the chief concern. The apostle Paul points us to the future in verse 17. Children are natural heirs of their parents' possessions, and therefore as God's children, we are heirs of God's abundant spiritual inheritance. Unlike worldly gains, God's gift for us is a treasure no one can take away - eternal life in heaven. It is \"an inheritance incorruptible, and undefiled, and that fadeth not away, reserved in heaven for you\" [1 Peter 1:4]. We are heirs of God, and since our Lord Jesus is God's only begotten Son and the firstfruit of the resurrection, we are also co-heirs with Christ for we share in His sufferings in this fallen world and in His resurrection to the next, and in God's grace, we will be like Him, enjoying glory in the future to come. And he said to them all, If any man will come after me, let him deny himself, and take up his cross daily, and follow me. - Luke 9:23",
        "part8": [
            "EXODUS 2",
            "LUKE 6"
        ]
    },
    "21 FEBRUARY": {
        "part1": "Romans 8:17",
        "part2": "Now Suffering, then Glory",
        "part3": "VERSE 17",
        "part4": "",
        "part5": "I LESSON",
        "part6": "THOUGHT",
        "part7": "And if children, then heirs; heirs of God, and joint-heirs with Christ; if so be that we suffer with him, that we may be also glorified together.  THOUGHT  t is interesting how Paul maps out the Christian path to glory - through the sufferings we must need go through in this world. In fact, we could even say Paul sees sufferings as an essential part of Christian life, a distinctive mark of God's children. Paul is not an armchair philosopher who thinks he has worked out the solutions to all the big questions of life. He is a realist - just like all Christians should be. The truth is many things that happen in this world are not within our control or understanding. Neither do we have answers to all things God allows to come our way. Committing ourselves wholly to God does not mean we need not face pain and suffering in the here and now. However, unlike people of the world, we do not become frustrated or even angry with man and God. Neither do we live a life of denial and disengagement from the world, becoming disillusioned and discouraged. Instead, we find grace and strength to live each and every day for Christ, waiting upon God's perfect will and timing. \"The LORD is good unto them that wait for Him, to the soul that seeketh Him. It is good that a man should both hope and quietly wait for the salvation of the LORD\" [Lamentations 3:2526]. As we are sanctified day by day, we become increasingly aware of the world's \"fallen-ness\", the very reason for the sufferings we see. In turn, this awareness should awaken in us a burden for lost souls, spur us to redeem the time in spreading the Gospel, looking unto our glorious Lord as our only reward.  But the God of all grace, who hath called us unto his eternal glory by Christ Jesus, after that ye have suffered a while, make you perfect, stablish, strengthen, settle you. - 1 Peter 5:10",
        "part8": [
            "EXODUS 3",
            "LUKE 7"
        ]
    },
    "22 FEBRUARY": {
        "part1": "Romans 8:17",
        "part2": "The Problem of Suffering",
        "part3": "VERSE 17",
        "part4": "",
        "part5": "S LESSON",
        "part6": "THOUGHT",
        "part7": "And if children, then heirs; heirs of God, and joint-heirs with Christ; if so be that we suffer with him, that we may be also glorified together.  THOUGHT  uffering is the \"problem\" that troubles mankind from the very day he started to think. \"Why do bad things happen (to good people)?\" \"Why don't things work out as planned?\" \"Is there any way I can prevent bad things from happening again?\" From the man in the street to the greatest thinker in his rumination, all will at some point in life ask these questions and find no solution to this problem. The answers lie literally in our hands - the Bible. God tells us we are living in a fallen world, and even if we have trusted in the Lord Jesus, we will go through the pains and sufferings of a sin-cursed world, until the day of glory when we see our Lord and Saviour. We have been called out of darkness into God's marvellous light, and God's will is for us to shine for Him in the darkness as long as our lives last. Not all suffering is bad. Some sufferings are chastisements from God. Hebrews 12:10-11 tells us His discipline is \"for our profit, that we might be partakers of his holiness\", and while \"no chastening for the present seemeth to be joyous, but grievous: nevertheless afterward it yieldeth the peaceable fruit of righteousness unto them which are exercised thereby.\" Even in times when we suffer for no obvious fault on our part, we can grow in grace and faith in God's Sovereign will, learning to trust Him for strength and grace. And blessed even more are those who suffer for righteousness' sake, for \"great is your reward in heaven: for so persecuted they the prophets which were before you\" [Matthew 5:12].  Blessed is the man that endureth temptation: for when he is tried, he shall receive the crown of life, which the Lord hath promised to them that love Him. - James 1:12",
        "part8": [
            "EXODUS 4",
            "LUKE 8"
        ]
    },
    "23 FEBRUARY": {
        "part1": "Romans 8:17",
        "part2": "The Power  of Witness of the Sufferer",
        "part3": "VERSE 17",
        "part4": "",
        "part5": "W LESSON",
        "part6": "THOUGHT",
        "part7": "And if children, then heirs; heirs of God, and joint-heirs with Christ; if so be that we suffer with him, that we may be also glorified together.  THOUGHT  hen we are struggling with troubles in life, it is perhaps natural for us to see everything in terms of the cost we pay and the benefit we gain. \"How much have I suffered?\" \"What have I gained from this?\" Yet God sometimes allows us to go through pain for a reason we fail to realize: the impact we can make on others through the way we handle life's crises - the power of a Christian testimony in sufferings. We may profess our faith before others; we may proclaim the Truth to everyone we meet, but the greatest testimony of a Christian is how he lives his faith, especially in difficult times - and this is often the yardstick by which the world judges him. How many lives were stumbled when church leaders were seen not practising what they preach; how many souls were lost because Christians around them behaved like or even worse than unbelievers! The good testimony of a child of God makes a whole world of difference. Facing the same troubles, a Christian shows faith and peace; battling the same illness, a believer shows trust and hope. And his steadfastness is not based on empty optimism but established on Jesus Christ, the solid Rock. So it is for the church. History has shown that the greatest enemy of Christianity is not persecution, but rather complacency. More often than not, the more the Truth is suppressed and the more severe the persecution, the stronger the faithful become. Often, the easiest way for a church to die is the apparent absence of crises, in times of prosperity and ease. When worship becomes an unchallenging and lifeless routine, the pews will become empty soon. Confirming the souls of the disciples, and exhorting them to continue in the faith, and that we must through much tribulation enter into the kingdom of God. - Acts 14:22",
        "part8": [
            "EXODUS 5",
            "LUKE 9"
        ]
    },
    "24 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 17 on the earth\" [Hebrews 11:13]. The reason for the",
        "part4": "",
        "part5": "S LESSON",
        "part6": "",
        "part7": "And if children, then heirs; heirs of God, and joint-heirs with Christ; if so be that we suffer with him, that we may be also glorified together.  THOUGHT  uffering is inevitable in the Christian path to glory; Hebrews 11 contains its best illustration. The Bible's \"hall of faith\" records a list of biblical figures who through much faith endured sufferings in this world, and by God's grace persevered to the end. \"These all died in faith, not having received the promises, but having seen them afar off, and were persuaded of them, and embraced them, and confessed that they were strangers and pilgrims on the earth\" [Hebrews 11:13]. The reason for the faithfulness of these heirs of God is they believed in God's promises. \"But now they desire a better country, that is, an heavenly: wherefore God is not ashamed to be called their God: for he hath prepared for them a city\" [Hebrews 11:16]. Yet Scripture also tells us these were not perfect people. Faithful Abraham told half-truths [Genesis 12:11-13; 20:1-2]; humble Moses had his wilful moments [Numbers 20:8-11]; God's chosen king David sinned grievously [2 Samuel 11]; fearless Elijah fled from Jezebel [1 Kings 19:1-4]. Their weaknesses are not excuses for sin, but rather, show us a gracious God who still forgives and restores despite human weaknesses. If there is anyone in the Bible we should emulate in this path to glory, it must be our Lord Jesus Christ. \"Wherefore seeing we also are compassed about with so great a cloud of witnesses, let us lay aside every weight, and the sin which doth so easily beset us, and let us run with patience the race that is set before us, Looking unto Jesus the author and finisher of our faith; who for the joy that was set before him endured the cross, despising the shame, and is set down at the right hand of the throne of God\" [Hebrews 12:1-2]. For we have not an high priest which cannot be touched with the feeling of our infirmities; but was in all points tempted like as we are, yet without sin. - Hebrews 4:15",
        "part8": []
    },
    "25 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 17 house ate many mansions: if it were not so, I would",
        "part4": "",
        "part5": "W LESSON",
        "part6": "",
        "part7": "And if children, then heirs; heirs of God, and joint-heirs with Christ; if so be that we suffer with him, that we may be also glorified together.  THOUGHT  e have been considering how, as heirs of God, we should persevere in our walk with Him through the pains of this world, towards that wonderful day of glory. For the next few days, we shall look at what is awaiting us at the end of our journey - the abundance of God's riches. We shall cease from all our labours and return to the heavenly home we truly belong to. Our Lord Jesus told us, \"Let not your heart be troubled: ye believe in God, believe also in Me. In My Father's house are many mansions: if it were not so, I would have told you. I go to prepare a place for you. And if I go and prepare a place for you, I will come again, and receive you unto Myself; that where I am, there ye may be also\" [John 14:1-3]. There will be a great celebration then. The Bible often uses the analogy of the banquet to illustrate such joyous consummation [Matthew 22:1-14, 25:1-13; Luke 14:15-24, 15:11-32; Revelation 19:69]. It will be a wonderful day as faithful servants of the Lord enter into His joy [Matthew 25:21] - a joy that lasts forever, a joy that nothing in this world can take away. As God's children, we rest in His precious promises knowing that though the pathway may be dreary, and at times we are weary, He is our refuge and our guide. We are walking purposefully toward that day of eventual rest, when our tears shall turn to laughter, and our nights become day.  I'm living on the mountain, underneath a cloudless sky; I'm drinking at the fountain that never shall run dry; O yes! I'm feasting on the manna from a bountiful supply, For I am dwelling in Beulah Land. - C.A. Miles",
        "part8": [
            "EXODUS 7",
            "LUKE 11",
            "THOUGHT I'm living on the mountain,",
            "underneath a cloudless sky;",
            "I'm drinking at the fountain",
            "that never shall run dry;",
            "O yes! ''m feasting on the manna",
            "from a bountiful supply,",
            "For I am dwelling in Beulah Land.",
            "-- C.A. Miles"
        ]
    },
    "26 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 17 taken up and also transformed. Before the judgment",
        "part4": "",
        "part5": "I LESSON",
        "part6": "",
        "part7": "And if children, then heirs; heirs of God, and joint-heirs with Christ; if so be that we suffer with him, that we may be also glorified together.  THOUGHT  n Matthew 25:21, we see how the master rewarded his faithful servant - \"thou hast been faithful over a few things, I will make thee ruler over many things\". In 2 Timothy 2:12, Paul wrote, \"If we suffer, we shall also reign with him (our Lord Jesus)\". This points to the millennial kingdom which our Lord will establish in this world. When Christ returns, the dead in Christ will be resurrected, rejoin their souls, and be transformed to have glorified bodies; those still alive then will be taken up and also transformed. Before the judgment seat of Christ, we will be judged according to our works [1 Corinthians 3:10-15]. At the end of the great tribulation, glorified saints shall rule the earth for a thousand years together with our Lord [1 Thessalonians 4:14-17]. From now till then, we are day by day being sanctified, being transformed more and more into the image of our Lord. Every day involves the renewing of our minds, the recalibration of our hearts, the realignment of our will, and reconsecration of our conduct - putting off the old man and putting on the new. We will not attain perfection this side of eternity, but there is definitely a clear upward trajectory and purpose in our spiritual growth. What a joyous day it will be when we see our Lord and Saviour face to face! \"Beloved, now are we the sons of God, and it doth not yet appear what we shall be: but we know that, when He shall appear, we shall be like Him; for we shall see Him as He is\" [1 John 3:2].  It will be worth it all, when we see Jesus! Life's trials will seem so small, when we see Christ. One glimpse of his dear face, all sorrow will erase. So, bravely run the race, till we see Christ. - Esther Kerr Rusthoi",
        "part8": []
    },
    "27 FEBRUARY": {
        "part1": "Romans 8:17",
        "part2": "The best inheritance of all",
        "part3": "VERSE 17",
        "part4": "",
        "part5": "I LESSON",
        "part6": "THOUGHT",
        "part7": "And if children, then heirs; heirs of God, and joint-heirs with Christ; if so be that we suffer with him, that we may be also glorified together.  THOUGHT  n Philippians 3:8-10, Paul talks about the greatest prize any Christian should desire - our Lord Jesus Christ: \"Yea doubtless, and I count all things but loss for the excellency of the knowledge of Christ Jesus my Lord: for Whom I have suffered the loss of all things, and do count them but dung, that I may win Christ ... That I may know Him, and the power of His resurrection, and the fellowship of His sufferings, being made conformable unto His death.\" Our Lord is the greatest treasure we should seek, and the best inheritance we shall have: \"Whom have I in heaven but Thee? and there is none upon earth that I desire beside Thee. My flesh and my heart faileth: but God is the strength of my heart, and my portion for ever\" [Psalm 73:25-26]. \"Joint-heirs with Christ\" deserves further explanation. Our Lord's inheritance is actually the glory of God the Father [John 17:4-5]. In having fellowship with our Lord's sufferings, we are moving towards that day when we will enjoy the glory and praise of God, just as our Lord was exalted after His work on earth was done. The chief end of man is to glorify God and to enjoy Him forever. Ephesians 1:13-14 tells us that believers are sealed with the Holy Spirit of promise, \"which is the earnest of our inheritance until the redemption of the purchased possession, unto the praise of His glory.\" \"Earnest\" means a deposit paid for what would in due time be paid in full. The Holy Spirit who indwells us is the assurance of the inheritance we will gain - God Himself - when we pass into eternity and be with Him forever. The LORD is my portion, saith my soul; therefore will I hope in Him. The LORD is good unto them that wait for Him, to the soul that seeketh Him. - Lamentations 3:24-25",
        "part8": [
            "EXODUS 9",
            "LUKE 13"
        ]
    },
    "28 FEBRUARY": {
        "part1": "Romans 8:18",
        "part2": "Glory Lost -- Ichabod",
        "part3": "VERSE 18",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "For I reckon that the sufferings of this present time are not worthy to be compared with the glory which shall be revealed in us.  THOUGHT  he suffering of all mankind and creation started in Genesis chapter 3 after the fall of Adam resulted in sin entering the creation, bringing in physical and spiritual death and decay. Man alone had been described as being created in God's image. None of the other creatures were so: \"And God said, Let us make man in our image, after our likeness: and let them have dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth. So God created man in his own image, in the image of God created he him; male and female created he them\" [Genesis 1:26-27]. As the pinnacle of God's creation, Adam and Eve were unblemished physically and more importantly spiritually. Sin resulted in the curse and the loss of that innocence. And that was what was restored in Christ as we read: \"And have put on the new man, which is renewed in knowledge after the image of him that created him\" [Colossians 3:10]. \"And that ye put on the new man, which after God is created in righteousness and true holiness\" [Ephesians 4:24]. Before the Fall, Adam and Eve possessed a spiritual knowledge of God with righteousness and holiness. In disobeying God and falling into sin, Adam did not just lose the physical beauty of the Garden. He lost all and God's glory departed from him. Ichabod [1 Samuel 4:21] indeed!  Hath a nation changed their gods, which are yet no gods? but my people have changed their glory for that which doth not profit. - Jeremiah 2:11",
        "part8": [
            "EXODUS 10",
            "LUKE 14"
        ]
    },
    "1 MARCH": {
        "part1": "Romans 8:18",
        "part2": "Glory Recovered",
        "part3": "VERSE 18",
        "part4": "",
        "part5": "W LESSON",
        "part6": "THOUGHT",
        "part7": "For I reckon that the sufferings of this present time are not worthy to be compared with the glory which shall be revealed in us.  THOUGHT  ith Adam's fall, mankind lost the spiritual knowledge of God and fell, becoming an unrighteous and unholy creature because God's glory departed from him. \"There is none that understandeth, there is none that seeketh after God. They are all gone out of the way, they are together become unprofitable; there is none that doeth good, no, not one\" [Romans 3:11-12]. When our Lord Jesus saves us from our sins, He is also saving us from God's wrath and we are adopted to be His children. It is all of God's grace. God's children are renewed with a knowledge of Him, in righteousness and true holiness [Colossians 3:10; Ephesians 4:24]. The Holy Spirit inspired Paul to write of a future when there will be an even greater glory than what the child of God experiences this side of Heaven. We will be translated to full glory to be with God - be it in physical death when our soul departs this world or at the Second Coming of our Lord and Saviour. When we are brought to Heaven, we will be more than Adam ever was in Eden. We will show Christ-likeness fully as God intended. We will enjoy God's glory in heaven more than Adam did in Eden. Adam was created sinless and innocent but with free will and the ability to sin. We will be free from and unable to sin [Revelation 21:2427]. No death nor sorrow, no pain nor suffering in Heaven [Revelation 21:4]. We will put on fine robes of righteousness and dine with our Lord at the Marriage Feast of the Lamb [Revelation 19:7-8]. We will behold the face of our Saviour [Revelation 22:4], the Lord Jesus Christ, and be dwelling in God's presence, praising and serving Him in the heavenly throne room [Revelation 19:5; 22:3]! Beloved, now are we the sons of God, and it doth not yet appear what we shall be: but we know that, when He shall appear, we shall be like Him; for we shall see Him as He is. - 1 John 3:2",
        "part8": [
            "EXODUS 11",
            "LUKE 15"
        ]
    },
    "2 MARCH": {
        "part1": "Romans 8:18",
        "part2": "The Weight of Glory",
        "part3": "VERSE 18",
        "part4": "",
        "part5": "A LESSON",
        "part6": "THOUGHT",
        "part7": "For I reckon that the sufferings of this present time are not worthy to be compared with the glory which shall be revealed in us.  THOUGHT  s God's children at the present, we will endure physical sufferings and spiritual afflictions. This verse assures us there is a far greater glory than we can imagine which God will reveal in us in due time. \"But we all, with open face beholding as in a glass the glory of the Lord, are changed into the same image from glory to glory, even as by the Spirit of the Lord\" [2 Corinthians 3:18]. \"For our light affliction, which is but for a moment, worketh for us a far more exceeding and eternal weight of glory\" [2 Corinthians 4:17]. Not only are the present circumstances incomparable to the glory God is going to reveal in us, but these present sufferings are God's means of accomplishing in us His purpose of showing Christ's glory in us. Compared to the weightiness of Christ's glory in us being manifest fully, our current afflictions are light. Our afflictions are temporary but what God will achieve in us is eternal. Our sufferings are physical and though great, they are light compared to the spiritual work and blessing God will accomplish in us. The intensity of earthly troubles are weightless compared to the weighty grandeur of God's glory, His purposes and our heavenly home. Why is this glory weighty? Because glory belongs to God alone. It is His attribute. The one living and true God, is self-existent in and of Himself. All else is created by and dependent on Him for existence. Without God, nothing would exist. Any glory revealed in His creatures is of His doing and points only to His glory, not the creature's. Ultimately all glory comes from and must go to God alone. Behold, I have refined thee, but not with silver; I have chosen thee in the furnace of affliction. For Mine own sake, even for Mine own sake, will I do it: for how should My name be polluted? and I will not give My glory unto another. - Isaiah 48:10-11",
        "part8": [
            "EXODUS 12:1-20",
            "LUKE 16"
        ]
    },
    "3 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 19 which shall openly exhibit the glory of the children",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "For the earnest expectation of the creature waiteth for the manifestation of the sons of God.  THOUGHT  he whole creation fell from glory into a sorry state of misery since the fall of man who dragged everything along with him. Yet it eagerly awaits, in patient hope, the restoration of man, the sons of God, to his former estate. Not that the whole creation has personal feelings that correspond to redeemed men but just a personification of it. John Calvin commented that all creatures were seized with great anxiety and held in suspense with great desire, waiting for that day which shall openly exhibit the glory of the children of God. The whole creation includes not only man, who was tempted and fell into sin but also the animal kingdom, represented by the serpent, as well as inanimate nature, by the tree of knowledge of good and evil. The full redemption of man will bring about a full redemption of the whole creation, returning it to its original charm, beauty, durability, harmony and perfection. It is God who will bring about a new transformation, for it is unthinkable for fully redeemed men to live in a corruptible and perishable world. Believers who are sons of God, presently in this corruptible and perishable body, do not appear as what should be but when Christ shall appear again the second time, they shall be like Him in His glory [1 John 3:2-3]. They await the day when corruption shall put on incorruption, mortality put on immortality, and every man that has this hope in Him, purifies himself even as Christ Himself is pure, changing from glory to glory [2 Corinthians 3:18]. For our conversation (citizenship) is in heaven; from whence also we look for the Saviour, the Lord Jesus Christ: Who shall change our vile body, that it may be fashioned like unto His glorious body, according to the working whereby He is able even to subdue all things unto Himself. - Philippians 3:20-21",
        "part8": []
    },
    "4 MARCH": {
        "part1": "Romans 8:19-20",
        "part2": "Paradise Lost  VERSES 19-20 For the earnest expectation of the creature watteth for the manifestation of the sons of God.  For the creature was made subject to vanity, not willingly, but by reason of him who hath  subjected the same in hope.  To COMPLETE THE BIBLE",
        "part3": "",
        "part4": "",
        "part5": "W LESSON",
        "part6": "PRAYER",
        "part7": "For the earnest expectation of the creature waiteth for the manifestation of the sons of God. For the creature was made subject to vanity, not willingly, but by reason of him who hath subjected the same in hope.  PRAYER  hile sitting on a pleasant landscape, the beauty and serenity of nature captivate the eyes, the harmonious music of songbirds charms the ears, the calm and wonders of the glittering night skies cheer the soul, the rising freshness of sunrise and the lowering restfulness of sunset these enthralling sights and sounds gladden the spirit and present itself to the human heart a wonderful vision. Breathing a scene of wonder, \"this is Paradise!\" Ah, the fearsome thunder sounds and lightning strikes, the angry volcano erupts and the earthquakes, the threatening storm, the rising floods, the withering flowers, the forest inferno, the death of songbirds. The miseries and sorrows of the human race, the lurking fatal diseases ready to strike, the killings on the battlefield, the murders of the innocent and deaths of the guilty, the crimes on the streets, city or home, corruption and oppression prevails, etc. \"Nature, with its teeming charms, betray its beauty with unspeakable alarms.\" When Man sinned in the Garden, God's judgment fell upon him and the curse of sin followed. Man's perfect union and spiritual intimacy with God were broken; he was driven out of paradise. Pride reigns, sin prevails in the human heart and \"i\" stands in the center of both. The world turned upside down. What an infinite loss, it is Paradise lost! Yet in Eden's primal hour, when man sinned and divine justice was meted out, the just and merciful God also made a promise, a Saviour would come and restore mankind and creation [Genesis 3:15] and He says, \"Behold, I make all things new\" [Revelation 21:5]. Celestial glory awaits those who put their faith in Christ and look forward to His return. Lord, remember me when Thou comest into Thy kingdom. - Luke 23:42",
        "part8": [
            "EXODUS 13",
            "LUKE 18"
        ]
    },
    "5 MARCH": {
        "part1": "Romans 8:19-20",
        "part2": "Paradise Regained  VERSES 19-20 For the earnest expectation of the creature watteth for the manifestation of the sons of God.  For the creature was made subject to vanity, not willingly, but by reason of him who hath  subjected the same in hope.  To CompeLeTE THE BIBLE In 2 YEARS, READ EXODUS 14 LUKE 19",
        "part3": "",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "For the earnest expectation of the creature waiteth for the manifestation of the sons of God. For the creature was made subject to vanity, not willingly, but by reason of him who hath subjected the same in hope.  THOUGHT  he tragic fall of man brought about the downfall of all creation, so the redemption of man will bring about the restoration of the whole creation. It begins with man and it will end with man. For God in His wisdom and providence has so ordered things that the good of His own children shall be the good of everything else. Man was tempted in the Garden and fell into sin, bringing its curse down on the whole human race. He disobeyed God and died spiritually. Christ was tempted in the wilderness but triumphed over the wicked one. Christ obeyed, conquered death and sin by His resurrection and lives eternally. \"For as in Adam, all die, even so in Christ shall all be made alive\" [1 Corinthians 15:22]. Paradise was lost in the Garden of Eden and man was driven out of it. Paradise was regained on the cross of Calvary and Christ now sits on the right hand of the throne of God in heaven. What Adam had lost through his disobedience; Christ had recovered through His perfect obedience. New heavens and a new earth wherein dwelleth righteousness will be the lot of all who put their faith in Christ when He returns. Nature, man and animal will be at peace with each other [Isaiah 2:4; 11:6-9]. Glorious liberty from bondage of sin and corruption! \"Wherefore, beloved, seeing that ye look for such things, be diligent that ye may be found of him in peace, without spot, and blameless\" [2 Peter 3:14] and be counted worthy of the kingdom of God for which we look forward to.  Those who do not partake of a gracious liberty in this world, they shall never be partakers of a glorious liberty in the world to come. - Thomas Horton",
        "part8": []
    },
    "6 MARCH": {
        "part1": "Romans 8:21",
        "part2": "Corrupting bondage to glorious liberty",
        "part3": "VERSE 21",
        "part4": "",
        "part5": "A LESSON",
        "part6": "THOUGHT",
        "part7": "Because the creature itself also shall be delivered from the bondage of corruption into the glorious liberty of the children of God.  THOUGHT  t the time of Adam's Fall in the Garden, all of creation was corrupted along with Adam and Eve, and it continues to be subject to the same futility we face as human beings. The world is one where beauty fades and loveliness decays; it is a dying world. But that is not the end of the story. The Bible does not teach the annihilation of this planet, but rather its renovation and redemption. The Scriptures promise a new heaven and a new earth: a cosmic transformation whereby the work of redemption effected by Christ will not only bring renewal, sanctification and glorification to man, but also renewal, sanctification and glorification to our natural world, to our natural environment. In this verse, Paul specifies the content of the hope that he mentioned at the end of verse 20: the hope that creation would be set free from decay into the freedom of the glory of the children of God. God intends that his \"new creation\" work includes all of creation, reminding us of the value God places on the non-human world and consequently, the need for us as His children to value that world too. When we look around at nature and marvel at its beauty and splendour, realize there will be a day when all of creation will shine even brighter in its brilliance, that truly glorious day of total eradication of the presence and consequence of sin in our lives.  Praise God for He is the great Restorer!",
        "part8": [
            "EXODUS 15",
            "LUKE 20"
        ]
    },
    "7 MARCH": {
        "part1": "Romans 8:22",
        "part2": "The creation groans",
        "part3": "VERSE 22",
        "part4": "",
        "part5": "J LESSON",
        "part6": "THOUGHT",
        "part7": "For we know that the whole creation groaneth and travaileth in pain together until now.  THOUGHT  ust as we groan because of displeasure with regard to particular circumstances, creation groans because of her discontent with her present state. The language Paul uses is a graphic description of the suffering that is inflicted upon the earth. The earth is a place where there is much sorrow, and the sorrow that afflicts our lives is described here as a sorrow that impacts the whole creation and elicits groans from it. This image of groaning is linked with the idea of travail or birthing pains. Birthing pain depicts for us the intensity of groanings that so burden creation. But creation does not pine away without a prospect of remedy. Note that the groaning and pain which Paul speaks are like the pains of childbirth, a specific kind of intense pain. When the apostle speaks of creation groaning, it is like the painful pangs of an expectant mother during childbirth. Even though the created world is going through pain, it is not an agony that ends in termination or annihilation but an agony that culminates in the unspeakable joy of birth and new life, of renovation and redemption. Jesus makes this very application in John 16:20-22 whereupon the deliverance of a newborn child, the mother \"remembereth no more the anguish\". \"Sing unto the LORD, O ye saints of his, and give thanks at the remembrance of his holiness. For his anger endureth but a moment; in his favour is life: weeping may endure for a night, but joy cometh in the morning.\" [Psalm 30:4-5]  Dear Lord, may I have the same anguish that all creation has in this present world, and not be so comfortable and attached to this place which is not my eternal home.",
        "part8": [
            "EXODUS 16",
            "LUKE 21"
        ]
    },
    "8 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 23 the presence of sin until that day when we receive",
        "part4": "",
        "part5": "C LESSON",
        "part6": "",
        "part7": "And not only they, but ourselves also, which have the firstfruits of the Spirit, even we ourselves groan within ourselves, waiting for the adoption, to wit, the redemption of our body.  THOUGHT  reation is not alone in waiting to be redeemed from the consequences of sin. Paul transitions from creation's longing to our own, a longing for the day when the battle with our sinful flesh will finally end. Although we are a \"new creature\" [2 Corinthians 5:17] when we come to Christ, we still have an ongoing struggle against sin. Even as believers are presently saved from the punishment of sin and the power of sin, we still have in us the presence of sin until that day when we receive our glorified bodies. No longer will there be the war between our flesh pursuing sin and our inner person pursuing God. Not only do we struggle with sin on this earth, but we also suffer from disease, illness, and death; the ground is still cursed with sin as to make us sweat in the labour of cultivating the land [Genesis 3:17-19], and childbirth is still cursed with pain [Genesis 3:16]. We look forward with anticipation to when all of sin's consequences will be removed and eradicated. For the believer, life on earth now is his closest experience of hell and thus the source of his discomfort and groaning. For the unbeliever the opposite is true, life on earth will be his closest experience of heaven. The question is, do we live with such an attitude of comfort and attachment to this fleeting world? Or do we groan in anticipation of the final consummation of our salvation in Christ?  In hope of eternal life, which God, that cannot lie, promised before the world began. - Titus 1:2.",
        "part8": [
            "EXODUS 17",
            "LUKE 22",
            "THOUGHT In hope of eternal life, which God, that cannot lie,",
            "promised before the world began. -- Titus 1:2."
        ]
    },
    "9 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 23 through the Holy Spirit. But it 1s a taste which is",
        "part4": "",
        "part5": "R LESSON",
        "part6": "",
        "part7": "And not only they, but ourselves also, which have the firstfruits of the Spirit, even we ourselves groan within ourselves, waiting for the adoption, to wit, the redemption of our body.  THOUGHT  edemption in biblical terms is not something that takes place all at once, but rather in stages. That final element of our salvation, the future consummation of the fullness of glory, is something we still have not experienced. Yet we have what Paul calls \"the firstfruits of the Spirit\". We do not simply have a promise of the future with no present participation in that future; but rather, we have a foretaste of the glory to come, by the newness of life we already experience in Christ through the Holy Spirit. But it is a taste which is co-mingled with an ongoing struggle against sin, mixed with a coat of suffering that still causes us, in spite of the joy of our salvation, to weep, to suffer, to hurt. The firstfruits of the Spirit is like a down payment, with the Divine promise that the full measure of the blessing will most certainly come. We still suffer from the effects and consequences of the Fall upon our mortal bodies. We know what it means to grow old; what it means to experience degeneration and decay; what it means to suffer the ravages of disease. But we anticipate a salvation that redeems both soul and body. The glory given to Christ was manifested in a glorified, resurrected human body, and His glory is the firstfruits of what we will experience. We too will inherit bodies that are incorruptible and immortal, not subject to pain, disease, suffering and death. We know these things will come to pass because God has promised them. In the meantime, having experienced the taste of the firstfruits of the Spirit, like the rest of the created order we groan in the expectancy of childbirth, waiting for the full measure of the manifestation of the sons of God. Being confident of this very thing, that he which hath begun a good work in you will perform it until the day of Jesus Christ. - Philippians 1:6",
        "part8": []
    },
    "10 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 24 understanding poverty -- to be poor is not to be",
        "part4": "",
        "part5": "E LESSON",
        "part6": "",
        "part7": "For we are saved by hope: but hope that is seen is not hope: for what a man seeth, why doth he yet hope for?  THOUGHT  very now and then, we hear of young people who would travel to developing countries \"to experience poverty\". They will spend a month there and come back claiming they know what it means to be \"poor\". Yet this is not understanding the poor. To do so, one must travel to a poor country, throw away one's passport and give up any possibility of returning to the comfort of one's home. It is then they may perhaps come near to understanding poverty - to be poor is not to be materially deprived; rather it is the loss of hope that things will change. Hope is the strength and motivation of every Christian, yet our hope is not crossing our fingers and wishfully hoping for a better tomorrow. It is based on what we believe, which has withstood the test of time and proven true. Our hope centres on Christ and what He has done for us. Our hope lies in the faithful promises of God. Hebrews 11, the great chapter on faith, tells us the relationship between hope and faith - the basis and certainty of hope is our faith: \"Now faith is the substance of things hoped for, the evidence of things not seen\" [Hebrews 11:1] - faith in the just and loving God who gave us His Word. With the knowledge of God's love for us, we can then find strength to love others, and do it with much peace and joy. The pivotal role of hope in our salvation is thus clear: because of our faith, we have hope, and with that hope, we will find strength to live and love, waiting for that day when Christ will return - when all that we hope in and for becomes reality.  Now the God of hope fill you with all joy and peace in believing, that ye may abound in hope, through the power of the Holy Ghost. - Romans 15:13",
        "part8": []
    },
    "11 MARCH": {
        "part1": "Romans 8:25",
        "part2": "Patience and endurance",
        "part3": "VERSE 25",
        "part4": "",
        "part5": "F LESSON",
        "part6": "THOUGHT",
        "part7": "But if we hope for that we see not, then do we with patience wait for it.  THOUGHT  aith, hope and waiting go hand in hand. We believe in what we hope for, and thus are willing to wait patiently for it to come to pass. Yet the Christian hope is not one of passive enduring, but proactive looking forward, waiting and serving Christ with good spirits in whatever vocation God has placed us. In the Lord's prayer, we pray for God's kingdom to come [Matthew 6:10] - when this present kingdom of grace will be replaced by His kingdom of glory. But from now till then, as we wait for the day of Christ, we should put on our best to shine for Him, in both the good times and the bad. Is life smooth sailing now? Thank and praise God for His blessings, for \"every good gift and every perfect gift is from above, and cometh down from the Father of lights, with whom is no variableness, neither shadow of turning\" [James 1:17]. Look for ways you can be a channel of blessing to others, testifying to them concerning the source of your material and spiritual abundance, a foretaste of a greater inheritance to come. Are you negotiating a bad patch in life now? Also thank and praise God for this opportunity to shine for Him in your trials. \"But sanctify the Lord God in your hearts: and be ready always to give an answer to every man that asketh you a reason of the hope that is in you with meekness and fear: Having a good conscience; that, whereas they speak evil of you, as of evildoers, they may be ashamed that falsely accuse your good conversation in Christ\" [1 Peter 3:15-16].  The LORD is good unto them that wait for Him, to the soul that seeketh Him. It is good that a man should both hope and quietly wait for the salvation of the LORD. - Lamentations 3:25-26.",
        "part8": [
            "EXODUS 20",
            "JOHN 1"
        ]
    },
    "12 MARCH": {
        "part1": "Romans 8:26",
        "part2": "The Spirit's Help in Prayer",
        "part3": "VERSE 26",
        "part4": "",
        "part5": "\" LESSON",
        "part6": "PRAYER",
        "part7": "Likewise the Spirit also helpeth our infirmities: for we know not what we should pray for as we ought: but the Spirit itself maketh intercession for us with groanings which cannot be uttered.  PRAYER  Likewise (after the same manner) the Spirit also helpeth our infirmities\". Paul either links \"likewise\" to other references to the Holy Spirit in chapter 8 or he is linking it with the encouragement and hope of Romans 8:18-25. The word \"infirmities\" refers to the weakness to which we are subject and to problems and trials in this life. Our Lord is ever mindful of our need of Him, for He knows how weak and infirmed we are. The word \"weakness\" in the New Testament can be weakness owing to our limited human nature [Romans 6:19] or weakness owing to sickness [Luke 5:15] or weakness owing to adversity [2 Corinthians 12:9-10]. We are also bound by weakness within [Matthew 26:41; 2 Corinthians 12:5-10] and powerful enemies without [Ephesians 6:11-13]. The particular weakness apostle Paul cites that affects all aspects of our life is that we do not know what to pray in unusual circumstances and crises. For all these, our Lord Jesus does not give up on us but sends us the Holy Spirit to help us. He excites us to pray and assists us in prayer. The Greek word Paul uses for the Spirit's role in prayer is syn-anti-lambanetai, which means \"always helping together\". The word refers to someone coming alongside another to take part of a heavy load and helping to bear it. The word \"helpeth\" is only used twice in the New Testament. The other instance is in Luke 10:40, where Martha begs the assistance of Mary to help her in the work she is doing to share with her in serving. Let us always seek the Spirit to help with our infirmities. Father, I openly confess my weakness to You: I don't really know how to pray. Give me the right words at the right moment. Help me with the words that flow from my lips, until they truly become part of me.",
        "part8": [
            "EXODUS 21",
            "JOHN 2"
        ]
    },
    "13 MARCH": {
        "part1": "Romans 8:26",
        "part2": "Our Problem with Prayer",
        "part3": "VERSE 26",
        "part4": "",
        "part5": "\" LESSON",
        "part6": "THOUGHT",
        "part7": "Likewise the Spirit also helpeth our infirmities: for we know not what we should pray for as we ought: but the Spirit itself maketh intercession for us with groanings which cannot be uttered.  THOUGHT  We know not what we should pray for as we ought\". This clause comprehends both the matter and the manner of our prayers; both what we should ask and how we should ask it. When James and John came to our Lord Jesus during His earthly ministry, they desired that they should sit the one on His right hand and the other on His left in His kingdom, but He said to them, \"Ye know not what ye ask\" [Matthew 20:22; Mark 10:38a]. They had not the right idea either of the nature of His kingdom, or the principles on which the honours of that kingdom are bestowed. \"Ye ask and receive not,\" says James, \"because ye ask amiss\" [James 4:3]. Paul himself knew not what to pray for as he ought when he \"besought the Lord thrice\" that his great physical trouble (\"the thorn in the flesh\") be removed from him and was refused [2 Corinthians 12:8-9]. The Son of man Himself prayed, \"saying, Father, if Thou be willing, remove this cup from Me: nevertheless not My will, but Thine, be done\" [Luke 22:42], and learnt in experience that it was not possible. We often do not know how to pray as we should, but thankfully God does not leave us to ourselves. He has graciously given us the Holy Spirit to help us in our prayers. He is a partner in our prayers. Let us be thankful that we pray to a God who can discern the prayer within our prayers. The prayer that our Lord taught His disciples, known as the Lord's prayer, is a model to guide His followers concerning proper principles and goals of prayer [Matthew 6:9-13]. Ye have not chosen Me, but I have chosen you, and ordained you, that ye should go and bring forth fruit, and that your fruit should remain: that whatsoever ye shall ask of the Father in My name, He may give it you. - John 15:16",
        "part8": [
            "EXODUS 22",
            "JOHN 3"
        ]
    },
    "14 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 26 word for groaning, stenagmos, refers to intense yet",
        "part4": "",
        "part5": "R LESSON",
        "part6": "",
        "part7": "Likewise the Spirit also helpeth our infirmities: for we know not what we should pray for as we ought: but the Spirit itself maketh intercession for us with groanings which cannot be uttered.  THOUGHT  omans 8:34 says that our Lord Jesus \"is even at the right hand of God, who also maketh intercession for us\". In 1 John 2:1, we read that He is our \"advocate with the Father\", and from Hebrews 7:25, we learn that He \"ever liveth to make intercession\". Paul here in Romans 8:26 speaks of a similar intercessory prayer by the Holy Spirit: \"the Spirit itself maketh intercession for us with groanings which cannot be uttered.\" The Greek word for groaning, stenagmos, refers to intense yet inaudible sighing. Sometimes the struggles and sufferings of life become so heavy we just cannot bear them. At other times, temptations and troubles grip our hearts to such an extent that words are impossible. Emotions become too much for words. Every genuine believer knows what it is to be speechless before God and left groaning in the Spirit, like how Moses [Exodus 14:15] and Hannah [1 Samuel 1:13] prayed. Though the groanings \"cannot be uttered\", they are heard by God. They are understood and will be answered for the Spirit that is in us is the Spirit who \"searcheth all things, yea, the deep things of God\" [1 Corinthians 2:10], and He, therefore \"maketh intercession for the saints according to the will of God\" [v. 27b]. The Spirit interceding in us groans on our behalf, takes up our needs at the deepest emotional level and conveys our hurts and cares to the Father's throne, all in line with the will of God. This should encourage us to pour out our hearts before Him [Psalm 62:8].  Praying always with all prayer and supplication in the Spirit, and watching thereunto with all perseverance and supplication for all saints. - Ephesians 6:18",
        "part8": []
    },
    "15 MARCH": {
        "part1": "Romans 8:27",
        "part2": "The Spirit Searches the Heart",
        "part3": "VERSE 27",
        "part4": "",
        "part5": "R LESSON",
        "part6": "THOUGHT",
        "part7": "And he that searcheth the hearts knoweth what is the mind of the Spirit, because he maketh intercession for the saints according to the will of God.  THOUGHT  omans 8:27 gives us great assurance that we are not left to ourselves to cope with our sorrows, challenges, anxiety and pain. The Holy Spirit searches our hearts and minds. Even when we do not know the right words to pray, the Holy Spirit prays with and for us. And we can be assured that the Holy Spirit's prayers are according to God's will. As believers of Christ, we have the Holy Spirit who superintends and guards us in our prayers. We can take comfort He is always there with us and interceding for us before God. No matter the situation, the Holy Spirit knows what is ultimately best for us. This is evident from verse 28, which says, \"And we know that all things work together for good to them that love God ... \" We can trust that God will always do what is best and turn every circumstance for our own good, according to His purpose. We are also reminded in 1 Chronicles 28:9 to keep an intimate relationship with God, and to serve Him wholeheartedly with willing minds, for \"the LORD searcheth all hearts, and understandeth all the imaginations of the thoughts\". God knows our heart and our motivations for serving Him; the Spirit resides with those who have humble and contrite hearts rather than those who choose self-interests over God's. To truly love the Lord, we must know Him better by meditating on His law and precepts, and developing a personal relationship with Him. Blessed is the man who trusts in the Lord, who yields himself entirely to the guidance of the Holy Spirit. I the LORD search the heart, I try the reins, even to give every man according to his ways, and according to the fruit of his doings. - Jeremiah 17:10",
        "part8": [
            "EXODUS 24",
            "JOHN 5"
        ]
    },
    "16 MARCH": {
        "part1": "Romans 8:27",
        "part2": "According to the Will of God",
        "part3": "VERSE 27",
        "part4": "",
        "part5": "H LESSON",
        "part6": "THOUGHT",
        "part7": "And he that searcheth the hearts knoweth what is the mind of the Spirit, because he maketh intercession for the saints according to the will of God.  THOUGHT  ow do I know what is the will of God? How can I find God's will in me? How do I know I am praying in accordance with God's will? Fret not, for we are assured God has a perfect will for each of us, and the Holy Spirit is praying for us in accordance with His will. Ephesians 5:17 states that \"wherefore be ye not unwise, but understanding what the will of the Lord is.\" We are urged by apostle Paul to seek God's will, to be more Christ-like and do good. As God's children, we grow into spiritual maturity through prayer, studying the Scriptures and obeying God's teachings. It is foolish to go against God's will by sinning and grieving the Holy Spirit that has been granted by the Lord to stay within us. Rather, we should pray for the guidance of the Holy Spirit to keep us from falling, restore our faith in the Lord and help us stay faithful, walking the narrow path with the Lord. Only with renewed minds, focusing on Christ rather than self, when we submit to and obey Him will God show us His will for our lives. When one is depressed, disappointed or sad, it may be difficult to pray and give thanks. Take heart - for in all things God works for our good if we love Him and are called according to His purpose. Thank God for His enabling power and strength, giving us confidence and joy to live day by day. We can rest assured that God's perfect love will see us through and make us stronger in Him.  O Lord my God, thank you for guiding and teaching me. Thank you for Your promise to walk daily with me. I pray that you open my heart to let Your word and truth turn my heart from sin and renew my mind in goodness and truthfulness. Amen.",
        "part8": [
            "EXODUS 25",
            "JOHN 6"
        ]
    },
    "17 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 27 in terms of whether it 1s His hidden or His revealed",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "And he that searcheth the hearts knoweth what is the mind of the Spirit, because he maketh intercession for the saints according to the will of God.  THOUGHT  oday's verse tells us the importance of God's will to the child of God. Our Lord Jesus teaches us to pray for God's will to be done, and 1 John 5:14 assures us that if we pray and ask of God according to His will, He will hear our prayers. So, let us spend some time considering the will of God in today's meditation. Firstly, we need to understand the nature of God's will. Theologians often speak of God's will in terms of whether it is His hidden or His revealed will. It is easier to explain what His revealed will is: it is that which is revealed in the Scriptures. God, in His wisdom and providence, revealed all that He wants us to know in the Scriptures, meaning the Bible. Indeed, everything man can know about God: His person, His attributes, His redemption plan, and His revealed will, can be found in the Scriptures and we believe only in the Scriptures. That leaves the definition of the hidden will of God as that which God does not deem necessary for us to know, and not necessary for our salvation. Dear child of God, seeing that the will of God is to be found in the Scriptures alone, let us draw close to His will by studying His Word, because only then can we say that we are walking close to Him. God's Word is profitable for us, and in reading it we are grounded in the right doctrines, reproved and corrected when we sin, and instructed in righteous living.  All scripture is given by inspiration of God, and is profitable for doctrine, for reproof, for correction, for instruction in righteousness: That the man of God may be perfect, thoroughly furnished unto all good works. - 2 Timothy 3:16-17",
        "part8": [
            "EXODUS 26",
            "JOHN 7",
            "THOUGHT All scripture is given by inspiration of God, and is",
            "profitable for doctrine, for reproof, for correction,",
            "for instruction in righteousness: That the man of",
            "God may be perfect, thoroughly furnished unto all",
            "good works. -- 2 Timothy 3:16-17"
        ]
    },
    "18 MARCH": {
        "part1": "Romans 8:27",
        "part2": "The Will of God (Part 2)",
        "part3": "VERSE 27",
        "part4": "",
        "part5": "Y LESSON",
        "part6": "THOUGHT",
        "part7": "And he that searcheth the hearts knoweth what is the mind of the Spirit, because he maketh intercession for the saints according to the will of God.  THOUGHT  esterday, we looked at how the Scriptures are the only reliable source of God's revealed will. Why does God reveal to us His will in the Scriptures? Again 2 Timothy 3:16-17 tells us that in reading and obeying the Scriptures, a godly man may be perfect and thoroughly equipped for all good works, namely for the work that God has called him to. Theologians often refer to God's revealed will as His moral will, because in obeying God's will, a man can live a morally upright and righteous life. Thus, the godly man becomes a witness for the Gospel and a light in a world of darkness. Our God is the Almighty God, and a loving God who cares for us, whom He created. He loved Adam and Eve, even though they disobeyed Him and were banished from Eden. God in His infinite love made it possible for fallen man to be reconciled to Him. He demonstrated His love when He called Abraham out of his comfortable life to journey to the Promised Land. And through Abraham's offspring, came the Jewish people whom God had specially chosen to be keepers of His Word. Finally, He showed His love through Jesus, a descendent of Abraham, who lived a perfect life and died a sacrificial death for the sins of all who believe in Him. Dear child of God, ultimately God's will is for all to come to repentance and believe in Him. And we who have believed, have the sacred duty to share this Gospel of good news to all who are lost in sin and darkness. Are you ready to do God's will here and now? The Lord is not slack concerning his promise, as some men count slackness; but is longsuffering to us-ward, not willing that any should perish, but that all should come to repentance. - 2 Peter 3:9",
        "part8": [
            "EXODUS 27",
            "JOHN 8"
        ]
    },
    "19 MARCH": {
        "part1": "Romans 8:28",
        "part2": "God's Certain Sovereignty",
        "part3": "VERSE 28",
        "part4": "",
        "part5": "W LESSON",
        "part6": "THOUGHT",
        "part7": "And we know that all things work together for good to them that love God, to them who are the called according to his purpose.  THOUGHT  e come now to perhaps the most comforting verse in the Bible for Christians. When we go through trials in life, grieve for the loss of loved ones, or undergo inexplicable suffering, this verse ministers to our souls and strengthens our hope in our sovereign and mighty God. Paul begins this verse with the words \"and we know\". He does not simply tell us that all things work together for our good; he says categorically \"we know\" it. In what sense do we know? Do we come to know from our experiences, or is it a fact that we can be certain of ? While the underlying Greek word supports both nuances of its meaning, Paul's emphasis is on the latter. This is something that we, all Christians, should know as a fact, regardless of our experiences because it is grounded in God's certain sovereignty which Paul elaborates in verses 29 and 30. All things work together for good to those who are called according to His purpose - that they should be conformed to the image of His Son and share in His glory. Because this is God's purpose for us who are called, we can be certain that He will work all things for our good and realize His purpose for us. We can rest in the security that God is in control. All things will come to pass as He has purposed it. And because God's sovereignty is certain, our hope is sure.  ...I have spoken it, I will also bring it to pass; I have purposed it, I will also do it. - Isaiah 46:11b",
        "part8": [
            "EXODUS 28",
            "JOHN 9"
        ]
    },
    "20 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 28 He is the Lord over all creation. He created all",
        "part4": "",
        "part5": "N LESSON",
        "part6": "",
        "part7": "And we know that all things work together for good to them that love God, to them who are the called according to his purpose.  THOUGHT  ext, Paul tells us that all things work together for our good. The term \"all things\" is general. Paul does not specify what they include, but he would have in mind the sufferings of this present time [v. 18], tribulation, distress, persecution, famine, nakedness, peril, sword, and even death [v. 35-36]. But its scope is not limited to these. All that is in this life, even our sins, can be used by God for our good. God can work all things for our good because He is the Lord over all creation. He created all things, sustains all things, and rules over all things [Colossians 1:16-17; Hebrews 1:3]. As King of kings and Lord of lords, He has supreme power and authority over everything. There is nothing He does not know [Romans 11:33] and nothing He cannot control [Psalm 103:19]. His sovereignty is all-encompassing. But this does not mean He is the direct cause of everything that occurs. He is not the author of sin. Yet nothing can happen unless He allows it to happen. And everything that happens inevitably serves only to accomplish His purpose. As Christians, we have great comfort knowing that nothing escapes God's sovereign control. So, no matter what situations we find ourselves in, we can be sure they are happening in accordance with His plan and intention. Nothing is left to chance, and everything will work out exactly as He has purposed, for our good and not for evil, so that God may be glorified in all.  For of Him, and through Him, and to Him, are all things: to Whom be glory for ever. Amen. - Romans 11:36",
        "part8": []
    },
    "21 MARCH": {
        "part1": "Romans 8:28",
        "part2": "God's All-Seeing Sovereignty",
        "part3": "VERSE 28",
        "part4": "",
        "part5": "W LESSON",
        "part6": "THOUGHT",
        "part7": "And we know that all things work together for good to them that love God, to them who are the called according to his purpose.  THOUGHT  hy does God allow evil to exist in the world? Why does God allow bad things to happen? Why does God allow the innocent to suffer? In trying to answer all these questions, some may conclude that there is no God, or that there is a God, but He is inactive in the affairs of the world. But verse 28 tells us that neither is true. God exists. And not only has God created all things, but He is also actively at work, caring for His creation and directing all things for the supreme good of His people. The work of God's sovereign guidance and care for His creation is known as His providence. We do not always understand what God is doing, let alone welcome it. But we know that everything that God does is directed towards accomplishing His purpose for His people. Nothing can frustrate God's providence - not our sins or failures, not the jealousy or opposition of others, not circumstances or our own indifference. Where God permit sins and evil, they will invariably serve to accomplish His purpose. This is most gloriously displayed on the cross where, by God's set purpose and foreknowledge, the wickedness of men ultimately resulted in the completion of Christ's work of atonement and salvation for His people [Acts 2:23]. God is tirelessly working for the good of His people. He never sleeps. So, as God's beloved, we can rest in His all-seeing sovereignty and trust in the goodness of His providence.  My help cometh from the LORD, which made heaven and earth. He will not suffer thy foot to be moved: he that keepeth thee will not slumber. - Psalm 121:2-3",
        "part8": [
            "EXODUS 30",
            "JOHN 11"
        ]
    },
    "22 MARCH": {
        "part1": "Romans 8:28",
        "part2": "God's All-Loving Sovereignty",
        "part3": "VERSE 28",
        "part4": "",
        "part5": "R LESSON",
        "part6": "THOUGHT",
        "part7": "And we know that all things work together for good to them that love God, to them who are the called according to his purpose.  THOUGHT  omans 8:28 can be misunderstood because of how we define \"good\". We often pray for things we believe are good for us - a steady job, good health, success, happiness, etc. No one asks for sickness, suffering, persecution, or death. There is nothing good about them so how can such things be for our good? To understand this verse properly, we must be careful to define \"good\" on God's terms and not ours. Things that are \"good\" for us are not things that bring material wealth or health, or anything that the world seeks after. \"Good\" must be understood in relation to God's purpose for His people, which is \"to be conformed to the image of His Son\" and ultimately share in His glory [Romans 8:29-30]. In other words, things that are for our \"good\" are those that sanctify us and help us grow in Christlikeness, till we reach the final stage of our salvation in glorification. When seen in this light, we can indeed rejoice in sufferings and trials for they contribute to our \"good\" by refining our faith and strengthening our hope [Romans 1:3-5; James 1:2-4]. Admittedly, in times of pain and grief, it is hard for us to accept or see the need to suffer for our spiritual good. During such times, we must look beyond our circumstances and fix our eyes on our Almighty God, trusting in His goodness and allloving sovereignty, patiently waiting for Him in hope, knowing that ultimately everything will work out exactly as He has purposed, for our good and for His glory.  Being confident of this very thing, that he which hath begun a good work in you will perform it until the day of Jesus Christ. - Philippians 1:6",
        "part8": [
            "EXODUS 31",
            "JOHN 12"
        ]
    },
    "23 MARCH": {
        "part1": "Romans 8:28",
        "part2": "God's Purposeful Sovereignty",
        "part3": "VERSE 28",
        "part4": "",
        "part5": "R LESSON",
        "part6": "THOUGHT",
        "part7": "And we know that all things work together for good to them that love God, to them who are the called according to his purpose.  THOUGHT  omans 8:28 is a wonderful promise of God, but the promise is not for everyone. It is only for those who \"love God\" or more specifically, those who are \"called according to his purpose.\" Both phrases refer to the same people - born-again Christians. Those who \"love God\" is simply an expression to describe God's people, people whose hearts have been regenerated and are inclined towards God. Those who are called are those who have been effectually summoned by God to enter into a relationship with Him. This calling is not an invitation to respond to the Gospel. It is a particular call by which the Holy Spirit regenerates and works saving grace in a sinner's heart. The foundation of God's calling is God's purpose. The underlying Greek word for \"purpose\", prothesis, refers to something which has been set forth in advance. This means that God has chosen or elected in advance who should receive His call and come into His saving grace. God elects \"according to His purpose\" before a person is born [Romans 9:11]. He does it freely, after the counsel of His own will [Ephesians 1:11]. His purpose is eternal, which means God has set forth from eternity whom He would call [Ephesians 3:11]. When understood correctly, God's purposeful sovereignty in salvation brings us much assurance. Our salvation is based on and upheld by God's eternal purpose, not by our will or ability to sustain in the faith. This should drive us to humble gratitude and greater love for our sovereign Creator who has shown us mercy.  So then it is not of him that willeth, nor of him that runneth, but of God that sheweth mercy. - Romans 9:16",
        "part8": [
            "EXODUS 32",
            "JOHN 13"
        ]
    },
    "24 MARCH": {
        "part1": "Romans 8:29",
        "part2": "God's Foreknowledge",
        "part3": "VERSE 29",
        "part4": "",
        "part5": "I LESSON",
        "part6": "THOUGHT",
        "part7": "For whom he did foreknow, he also did predestinate to be conformed to the image of his Son, that he might be the firstborn among many brethren.  THOUGHT  n Romans 8:29-30, we read what is sometimes called \"the golden chain of salvation\". There are essentially five interconnected rings in this chain and the first two are found in today's verse: God's foreknowledge and God's predestination, both of which happened long before time, or we can also say, outside time, in accordance with God's eternal counsel. To understand this, we need to realise that though God has chosen to work in time, He is not constrained by it. God's omniscience is such that He sees every event in time together as a whole, unlike finite beings like us who see events in chronological order. This will help us appreciate God's foreknowledge. Foreknowledge does not mean God knows ahead of time who will believe in Him and given that knowledge calls that person to salvation. Instead, it means God loves and chooses (elects) a person before he even knows God, and then in God's good time, He ordains and calls that person to accept Jesus Christ as his personal Saviour and Lord. This understanding is important because it tells us the biblical doctrine of God's sovereignty. We are created according to God's own good purpose - to believe in Him and become more and more like Christ His Son, our Lord. Note the pronoun in verse 29 is \"whom\" and not \"what\". God's foreknowledge is of the person rather than the things he will do, or the faith he will have. We are the objects of God's marvellous love. God knew us individually, by name. He knows everything we are going through, just as a good shepherd knows every one of his sheep and their condition. Before I formed thee in the belly I knew thee; and before thou camest forth out of the womb I sanctified thee, and I ordained thee a prophet unto the nations. - Jeremiah 1:5",
        "part8": [
            "EXODUS 33",
            "JOHN 14"
        ]
    },
    "25 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 29 fatalism. We are not helpless creatures who cannot",
        "part4": "",
        "part5": "G LESSON",
        "part6": "",
        "part7": "For whom he did foreknow, he also did predestinate to be conformed to the image of his Son, that he might be the firstborn among many brethren.  THOUGHT  od's predestination goes hand in hand with His foreknowledge. God knows and loves us before we know Him (foreknowledge), and He chooses us to be His children (predestination). These two components in the \"golden chain of salvation\" are the basis for the next three: His calling us according to His time, our justification, and eventually, our glorification. Contrary to popular belief, predestination is not fatalism. We are not helpless creatures who cannot escape our destiny. We have a freewill. In God's good time, He changes our worldview and mindset so that we come to see things from His perspective, as Ezekiel 36:26 tells us, \"A new heart also will I give you, and a new spirit will I put within you: and I will take away the stony heart out of your flesh, and I will give you an heart of flesh.\" With this receptive heart we will see and comprehend God's truth, and having seen, we cannot resist His grace because we perceive how life as God's child is much better than one who is dead in sin. This will cause us to freely choose Him. Why did God save some and not all? We dare not speculate on God's perfect will and define fairness according to our limited wisdom. What we must know, however, is that ultimately the reason for our salvation is God's glory and that even God's judgment of sin serves that same purpose. We instead thank God He has chosen to save a remnant (of which we are part) who believe and pray we will be God's means to spread the Gospel to the people around us.  According as he hath chosen us in him before the foundation of the world, that we should be holy and without blame before him in love: Having predestinated us unto the adoption of children by Jesus Christ to himself, according to the good pleasure of his will. - Ephesians 1:4-5",
        "part8": []
    },
    "26 MARCH": {
        "part1": "Romans 8:29",
        "part2": "Conformity to the Image of Christ",
        "part3": "VERSE 29",
        "part4": "",
        "part5": "C LESSON",
        "part6": "THOUGHT",
        "part7": "For whom he did foreknow, he also did predestinate to be conformed to the image of his Son, that he might be the firstborn among many brethren.  THOUGHT  hildren of God are to conform to our Lord's image in our sufferings. Our Lord came to this world to suffer for the sake of the Gospel. The Son of God \"made Himself of no reputation, and took upon Him the form of a servant, and was made in the likeness of men: And being found in fashion as a man, He humbled Himself, and became obedient unto death, even the death of the cross\" [Philippians 2:7-8]. This is indeed the mind of our Lord Jesus [Philippians 2:5], and we should be like Him, serving others with humility and sacrificial love. We are made to conform to His image in our holiness. As we deal with challenges in life each day, we remember God's grace in our sanctification: \"That ye put off concerning the former conversation the old man, which is corrupt according to the deceitful lusts; And be renewed in the spirit of your mind; And that ye put on the new man, which after God is created in righteousness and true holiness\" [Ephesians 4:22-24], dying to sin and living for our Lord. We will be conformed to the image of Jesus in our eventual glory. Time is moving toward that coming day when we will see our Lord face to face, and that day of consummation will mark the transitional point in our path to glory when we will be transformed and put on a glorified body and spirit: \"But we all, with open face beholding as in a glass the glory of the Lord, are changed into the same image from glory to glory, even as by the Spirit of the Lord\" [2 Corinthians 3:18].  For which cause we faint not; but though our outward man perish, yet the inward man is renewed day by day. - 2 Corinthians 4:16",
        "part8": [
            "EXODUS 35",
            "JOHN 16"
        ]
    },
    "27 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 29 which cannot be touched with the feeling of our",
        "part4": "",
        "part5": "O LESSON",
        "part6": "",
        "part7": "For whom he did foreknow, he also did predestinate to be conformed to the image of his Son, that he might be the firstborn among many brethren.  THOUGHT  ur Lord Jesus is the firstborn in the way He walks before us. Living a life on this earth, He endured what we are going through each day, yet He sinned not, but fulfilled all righteousness required in God's standards. \"Seeing then that we have a great high priest, that is passed into the heavens, Jesus the Son of God, let us hold fast our profession. For we have not an high priest which cannot be touched with the feeling of our infirmities; but was in all points tempted like as we are, yet without sin\" [Hebrews 4:14-15]. He leads us in our quest for holiness. Our Lord is the firstborn and thus should enjoy pre-eminence in all things. We need to remember that our Lord Jesus \"is before all things, and by Him all things consist. And He is the head of the body, the church: who is the beginning, the firstborn from the dead; that in all things He might have the preeminence\" [Colossians 1:17-18]. Our Lord Jesus should be the centre of our lives and we should acknowledge Him in all our ways, putting Him first in the choices we make. Our Lord is the firstborn in that like Him who died and resurrected again to eternal glory, our corruptible bodies will likewise rise again and put on incorruption in our resurrection glory. \"But now is Christ risen from the dead, and become the firstfruits of them that slept. For since by man came death, by man came also the resurrection of the dead. For as in Adam all die, even so in Christ shall all be made alive. But every man in his own order: Christ the firstfruits; afterward they that are Christ's at his coming\" [1 Corinthians 15:20-23]. Looking unto Jesus the author and finisher of our faith; who for the joy that was set before Him endured the cross, despising the shame, and is set down at the right hand of the throne of God. - Hebrews 12:2",
        "part8": []
    },
    "28 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 30 Christ by the Holy Spirit. The entire process is the",
        "part4": "",
        "part5": "O LESSON",
        "part6": "",
        "part7": "Moreover whom he did predestinate, them he also called: and whom he called, them he also justified: and whom he justified, them he also glorified.  THOUGHT  rdo salutis is Latin for \"order of salvation\". It focuses on the acts of God and the response of the individual in salvation. The ordo salutis spells out in verses 29-30 is foreknowledge, predestination, followed by calling, justification and glorification. It speaks of a way of organizing all the events of redemption in their consecutive order as they show up in an individual's life, by which he is joined to Christ by the Holy Spirit. The entire process is the work of God in Christ and by grace alone. It is a unifying work of God to bring us into union with Christ. It enables us to see clearly that it is God who saves, freeing us from the sinful tendency to take some credit for our salvation. As you continue to battle sin in your life, your ongoing sin is not proof that your salvation never happened. But it is a reminder you must continue looking to Christ, eagerly awaiting the day when your salvation will inevitably reach its completion. Do you see Jesus as more to be desired than anything else, and sufficient to save you from your sin? Let us pray for one another, that in every way Christ will be exalted through our conformity to Him, and we might enjoy the assurance that because of our election and predestination, everything will work together for our good. \"But as many as received Him, to them gave He power to become the sons of God, even to them that believe on His name\" [John 1:12]. Receive Him!  God sovereignly ordains each part of the ordo salutis in a person's salvation.",
        "part8": [
            "EXODUS 37",
            "JOHN 18",
            "THOUGHT God sovereignly ordains each part of the odo salutis",
            "in a person's salvation."
        ]
    },
    "29 MARCH": {
        "part1": "Romans 8:30",
        "part2": "Effectual Calling",
        "part3": "VERSE 30",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "Moreover whom he did predestinate, them he also called: and whom he called, them he also justified: and whom he justified, them he also glorified.  THOUGHT  he effectual call is understood as God's sovereign drawing of a sinner to salvation. What is it that God does when He intervenes in a person's life to bring him to faith? Is it God alone who changes the heart of the sinner, or does this change of heart rest also on the willingness of the sinner? The Lord Jesus said, \"No man can come to Me, except the Father which hath sent Me draw him\" [John 6:44]. While God calls all men externally, He only calls His own internally. Those who respond to the external call are those who have been called internally by God and given new birth. Then they respond in faith to the external call. The inward call is irresistible, not in the sense that you do not have the power to resist it, but your resistance cannot overcome it. God's effectual call effects what He intends it to do; namely, to bring us to saving faith. It reminds us that what God begins, in terms of the order of salvation, He always completes. For those who are externally called but reject the Gospel, all things will not be working together for their good. Every believer has also a call to service. Many have been gifted to serve in the church. They must sense an internal call, and this call must be confirmed by an external call from the church. God's call is a call to serve Him. May God's calling to you influence how you live and work at your calling.  Distinguish between the external call of the Gospel and the internal call of the Holy Spirit.",
        "part8": [
            "EXODUS 38",
            "JOHN 19"
        ]
    },
    "30 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 30 Paul tells us God's plan from eternity past",
        "part4": "",
        "part5": "W LESSON",
        "part6": "",
        "part7": "Moreover whom he did predestinate, them he also called: and whom he called, them he also justified: and whom he justified, them he also glorified.  THOUGHT  e, who can hardly predict what will happen in a year, a week, a day or even an hour, cannot imagine how far ahead God has been planning. God's plan began in eternity past and will come to fruition in eternity future. Unlike our plans, God's plan is certain, detailed and wisely drafted, and nothing can arise to upset it. For God, no alternative plan is necessary. Paul tells us God's plan from eternity past is for those He has predestinated and called to be justified. Being justified means to be declared righteous in God's sight. God purposed that we would be declared righteous not by our own efforts but through the sacrifice of Christ at the cross for us [Romans 3:24-25]. God purposed that in His time, those He called would be justified by Christ paying the penalty for their sins, and those who were sinners and lawbreakers would no longer have any penalty to pay. With God declaring us righteous, we no longer have to suffer the penalty for sin which is death. Not only are we acquitted, but we are also restored to favour with God. And not only restored but also declared to be co-heirs with Christ and friends of God [Romans 8:17; James 2:23]. God did not simply overlook our sins and write them off which would be at odds with His attributes of holiness and justice. Someone else took the penalty of our sin so we can stand before God, and call Him our Father and Friend. In God's plan, His sinless Son died for our sins, the just for the unjust, that He might bring us to God [1 Peter 3:18]. How are we living our lives knowing that God Himself died for us to free us from the death penalty of sin?",
        "part8": []
    },
    "31 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 30 through a blurry mirror. Only in the future will we",
        "part4": "",
        "part5": "\" LESSON",
        "part6": "",
        "part7": "Moreover whom he did predestinate, them he also called: and whom he called, them he also justified: and whom he justified, them he also glorified.  THOUGHT  O wretched man that I am! who shall deliver me from the body of this death?\" [Romans 7:24]. As a messenger of God's perfect plan, Paul himself was only too aware how sin continues to plague every believer. Justification is God's acceptance of sinners but does not mean that we become perfect and sinless, living happily ever after. Instead, we presently see God dimly and imperfectly as if through a blurry mirror. Only in the future will we see Him face to face [1 Corinthians 13:12]. Glorification awaits us. It is God's final removal of sin from the life of the saved [v. 18]. When our Lord Jesus comes again, the saved will be transformed in an instant into perfect beings - we shall be changed in the twinkling of an eye [1 Corinthians 15:51]. One day, we will be glorified and be like Jesus. One day, sin will no longer trouble us, and we will enjoy the complete fulness and eternal favour of God's presence. Until then, we watch and wait for our Lord's return. Until then, we do not sit and snooze, for if we do we will be found unprepared when the bridegroom arrives [Matthew 25:1-13]. Until then, we diligently put to death the sins in us [v. 13] through meditation on God's Word, persevering obedience, faithful service, fervent prayer and fellowship with believers, and we behold His glory, being transformed into His image from glory to glory [2 Corinthians 3:18].  So till He come, I'll watch and pray rejoicing; Till He come, each day I'll labour on. Then soon one day, my eyes shall see my Saviour Descend the clouds, O glorious day!",
        "part8": [
            "EXODUS 40",
            "JOHN 21",
            "THOUGHT So till He come, Pll watch and pray rejoicing;",
            "Till He come, each day Pll labour on.",
            "Then soon one day, my eyes shall see my Saviour",
            "Descend the clouds, O glorious day!"
        ]
    }
}