{
    "1 NOVEMBER": {
        "part1": "2 Samuel 21:12-14",
        "part2": "Proper burial",
        "part3": "VERSE 14",
        "part4": "And the bones of Saul and Jonathan his son buried they in the country of Benjamin in Zelah, in the sepulchre of Kish his father: and they performed all that the king commanded. And after that God was intreated for the land.",
        "part5": "David moved the bones of Saul and Jonathan from Jabesh [1 Samuel 31:13] to Zelah, back to the country of Benjamin, to which Saul belonged. This could be seen as a compassionate act by David (despite Saul's enmity toward him) who had all along wanted to return good for evil. It could also be seen as David's remembrance of the friendship he had with Jonathan. Yet this act also carried a significance in addition to all that it seemed to be. It was a wise move to bring about unity in Israel.\n\nThe logic is simple. For the breaking of covenant, seven sons in Saul's house had to die. As king, it was hard for David to give such an order. And it was especially difficult for him, for this might be seen in man's eye as David's vengeful act for what Saul had done to him, or worse, as David's attempt to be rid of all possible future threats to the house of Judah. Perhaps, the least David could do was to show his goodwill by bringing the bones of Saul and Jonathan home. A failure to do so might cause resentment that could later escalate even to civil war.\n\nRather than regarding this act as David strengthening his position as king, we may see it more as his desire to keep Israel united. We see here, David making a wise kingly move. He could have dismissed the sentiments of the people and self-righteously claim he was only doing the right thing under God's instructions to hand over Saul's seven sons to the Gibeonites, but he did not. This is God-given wisdom, and this is one of the reasons why David was able to unite and eventually establish Israel on the map of Canaan.",
        "part6": "THOUGHT",
        "part7": "Who is a wise man and endued with knowledge among you? Let him shew out of a good conversation his works with meekness of wisdom. - James 3:13",
        "part8": [
            "2 KINGS 12",
            "2 TIMOTHY 4"
        ]
    },
    "2 NOVEMBER": {
        "part1": "2 Samuel 21:14",
        "part2": "Final rites",
        "part3": "VERSE 14",
        "part4": "And the bones of Saul and Jonathan his son buried they in the country of Benjamin in Zelah, in the sepulchre of Kish his father: and they performed all that the king commanded. And after that God was intreated for the land.",
        "part5": "Saul's end was both tragic and gruesome. He committed suicide. The Philistines then beheaded him and hanged his body on the wall of Bethshan. The men of Jabesh-gilead retrieved the bodies of Saul and his sons, cremated them, took their bones and buried them [1 Samuel 31]. Moved by the maternal love of Rizpah for her two sons and five nephews, David exhumed the remains of Saul and Jonathan and reinterred them with that of the seven sons in the sepulchre of Kish in Zelah, the hometown of Saul.\n\nThis account highlights three ways the dead were treated. The Philistines hanged and exposed the corpses of the dead as a warning and a humiliation. The men of Jabesh-gilead took the bodies, burned them and then buried the bones. David took one step further; he honoured the dead by burying the bones in the family sepulchre.\n\nThere is a somewhat disturbing trend today in treating the dead as a thing to be disposed of in the most convenient way; that usually means - cremation. There are scriptural references for the burning of the human body - human sacrifice [Leviticus 18:21; Deuteronomy 12:31], judgement from God [Leviticus 10:1-2; 20:14; 21:9; Joshua 7:15, 25; 1 Kings 13:1-2], desecration [Amos 2:1], disposal [1 Samuel 31]. In the case of Saul and Jonathan, their decapitated bodies were first burned and the bones buried because their bodies had decomposed. While there is no explicit biblical command - with chapter and verse - that says \"Thou shalt only bury the dead\" or \"Thou shalt not cremate\", there is scriptural preponderance in favour of burial because it acknowledges the sanctity of the body [Genesis 1:26-27; Romans 14:8], and it better symbolizes the hope of the resurrection [1 Corinthians 15:42-44].",
        "part6": "THOUGHT",
        "part7": "In deciding end-of-life matters, how can I best reflect biblical values, teaching and the believer's hope for the resurrection.",
        "part8": [
            "2 KINGS 13",
            "TITUS 1"
        ]
    },
    "3 NOVEMBER": {
        "part1": "2 Samuel 21:14b",
        "part2": "Famine averted",
        "part3": "VERSE 14b",
        "part4": "... And after that God was intreated for the land.",
        "part5": "The famine which began this chapter now comes to an end. With restitution made, God showed mercy to the Israelites, and the land was healed.\n\nGod's justice will always prevail. When Saul slayed the Gibeonites \"in his zeal to the children of Israel and Judah\" [v. 2], he might have dismissed the consequences of breaking a covenant and thought he could get away with it, especially given his self- righteousness, and the fact that the covenant was made hundreds of years ago in the early days of Joshua's leadership. But God saw everything, and in His time, punishment was meted out.\n\nYet this episode also tells us of God's faithfulness. God had revealed to David and the Israelites the reason for the famine, and He allowed His children to be at the mercy of the Gibeonites who stated their terms of restitution. Now with all requirements fulfilled, God lifted His hand of chastisement and \"was intreated for the land\".\n\nTo be sure, not all disasters are the consequences of man's sins, and no one can claim that the sufferings of any particular nation now are because of her people's transgressions. Yet crises are often good opportunities for us to consider our finitude, and to examine our ways before the sovereign God. It is true nothing happens by chance, and if God allows a country to go through a certain trial, we can trust that He has His good purpose. One good reason is for sinners to turn to their only Lord and Saviour, and for saints to shine for Him in a time of darkness.",
        "part6": "THOUGHT",
        "part7": "If My people, which are called by My name, shall humble themselves, and pray, and seek My face, and turn from their wicked ways; then will I hear from heaven, and will forgive their sin, and will heal their land. - 2 Chronicles 7:14",
        "part8": [
            "2 KINGS 14",
            "TITUS 2"
        ]
    },
    "4 NOVEMBER": {
        "part1": "2 Samuel 21:1-14",
        "part2": "Wherewith shall I make the atonement?",
        "part3": "VERSE 14b",
        "part4": "They performed all that the king commanded. And after that God was intreated for the land.",
        "part5": "The children of Israel under the leadership of Joshua had made a covenant with the Gibeonites. The covenant laid down the commitments from both parties to maintain the relationship as well as consequences if the terms were not kept. When Saul massacred the Gibeonites, the covenant was broken, and Israel suffered famine for three years. After David learnt the reason for the famine, he went to the Gibeonites and asked, \"Wherewith shall I make the atonement, that ye may bless the inheritance of the LORD?\" [v. 3].\n\nGod takes the breaking of a covenant seriously. Covenant breaking has serious consequences. The famine [2 Samuel 21:1] is designed to get David's attention to the violation of the covenant and the need to mend the breach. The phrase \"to make the atonement\" means \"to cover\", and it has the idea of reconciliation. It has been pointed out that the word \"atone\" is made up of \"at\" and \"one\", and \"atonement\" literally means \"at-one-ment\".\n\nSin destroys our relationship with God. Sin separates us from our Creator. Sin cuts off His blessings. And the accompanying misery and guilt of sin is to awaken our conscience and show us our need for reconciliation. Atonement is the necessary step before our relationship with God can be restored. Thus, we must ask as David did, \"Wherewith shall I make the atonement?\" realising however, that our atonement can neither be purchased by gold and silver nor earned by good works, and the terms of atonement are not set by the sinner. Atonement involves the shedding of blood and death [Hebrews 9:22], and not of animals, but by the once-and-for-all offering of our Lord Jesus Christ to truly take away the guilt of sinners and give life to the repentant.",
        "part6": "THOUGHT",
        "part7": "We are \"not redeemed with corruptible things, as silver and gold ... but with the precious blood of Christ, as of a lamb without blemish and without spot\" [1 Peter 1:18-19].",
        "part8": [
            "2 KINGS 15",
            "TITUS 3"
        ]
    },
    "5 NOVEMBER": {
        "part1": "2 Samuel 21:15-17a",
        "part2": "Death of the giants - Ishbibenob killed by Abishai",
        "part3": "VERSE 17a a child of God 1s clear: if we are blinded by the",
        "part4": "But Abishai the son of Zeruiah succoured him, and smote the Philistine, and killed him.",
        "part5": "The narrative now moves on to a new section - an account of the slaying of four Philistine giants by David's mighty warriors.\n\nWe should be familiar with the historical accounts of giants in the Bible. From the giants of Anak which caused the Israelites to turn back and wander in the wilderness for forty years [Numbers 13:31-33] to David's slaying of Goliath [1 Samuel 17], their great stature reflects their seemingly impregnable strength. The spiritual lesson for a child of God is clear: if we are blinded by the physical appearance of our enemies, we will lead defeated lives - even before the battle has started. Conversely, if we trust in God and meet these challenges in His strength and for His name, God will certainly help us overcome them.\n\nThe first giant in this account is Ishbibenob. Verse 16 tells us of his weighty armour and new sword. David was an experienced fighter, yet we read that he \"waxed faint\". We do not know why David faltered but thank God Abishai, his nephew, was there to help him and this faithful companion slew the giant.\n\nNo matter how strong we are, there will definitely be times of weakness. Sometimes the challenge may be so daunting, but God has promised us always a way of escape [1 Corinthians 10:13]. For David here, help came in the form of one of his faithful companions. Do you have godly companions who can help you in times of temptations and distress? More importantly, are you an Abishai, a keeper to your brother or sister in Christ?",
        "part6": "",
        "part7": "A friend loveth at all times, and a brother is born for adversity. - Proverbs 17:17",
        "part8": []
    },
    "6 NOVEMBER": {
        "part1": "2 Samuel 21:17b",
        "part2": "The Light of Israel",
        "part3": "VERSE 17b",
        "part4": "Thou shalt go no more out with us to battle, that thou quench not the light of Israel.",
        "part5": "The Philistines \"had yet war again with Israel\" [v. 15]. They were a constant thorn in the sides of the people of God. David, in his heyday, was a warrior king, but age had caught up with him. This time as he led his army against the Philistines, he was faint. Seeing their king was no longer physically able to lead in battle, the mighty men of God led by Abishai bound themselves by an oath that David would never fight in person again, lest he be slain in battle and the whole nation suffer defeat with his death.\n\nThe light is proof of life and vitality, and the extinguishing of that light signifies decline and destruction [Job 18:5-6]. Here, Abishai and the others recognised David as the glory of Israel. The nation's existence and prosperity were bound to David's life. While no man is ever indispensable, history tells us that a man can carry the weight of a whole nation. So, it is to the credit of David's character and leadership that Abishai recognised him as the light and glory of Israel.\n\nThere is One greater than David who is not only the light of Israel, but the light of the world. He, of course, is our Lord Jesus Christ who reminds us that those who follow Him, \"shall not walk in darkness, but shall have the light of life\" [John 8:12], and that we are \"the light of the world\", and we are to \"let [our] light so shine before men, that they may see [our] good works, and glorify [our] Father which is in heaven\" [Matthew 5:14-16].\n\nAnd just as David's life was the light that God had lit for Israel's benefit, so our lives must be lit for the good of the world.",
        "part6": "THOUGHT",
        "part7": "Be a light for God. Shine by word and deed.",
        "part8": [
            "2 KINGS 17",
            "HEBREWS 1"
        ]
    },
    "7 NOVEMBER": {
        "part1": "2 Samuel 21:18",
        "part2": "Death of the giants - Saph killed by Sibbechai",
        "part3": "VERSE 18",
        "part4": "And it came to pass after this, that there was again a battle with the Philistines at Gob: then Sibbechai the Hushathite slew Saph, which was of the sons of the giant.",
        "part5": "Not long after Abishai killed Ishbibenob, the Philistines came again. This time round they had with them another giant. His name was Saph. Not much is known about him save that he was of the same descent as Ishbibenob and he was defeated by another Israelite warrior - Sibbechai the Hushathite. The Israelites may have been thinking - when will this end? Why are we having to face constant harassment from the Philistines? When will peace come?\n\nThis is quite akin to our spiritual struggles. When it comes to matters of the heart and spirit, the battle may be even tougher. \"For we wrestle not against flesh and blood, but ... against spiritual wickedness in high places\" [Ephesians 6:12]. Just when we think we have finally overcome one temptation and we can have a break, another testing comes up. In fact, the Bible warns against spiritual complacency, lest our initial victory causes us to be presumptuous, and our last state be worse than the first [Matthew 12:45].\n\nLet us therefore put on the whole armour of God, so we can stand against the wiles of the devil [Ephesians 6:11]. The enemy may attack in different ways and challenges come wave after wave, but take courage, there is only one way for us to respond. \"Submit yourselves therefore to God. Resist the devil, and he will flee from you\" [James 4:7]. Trust the LORD and commit ourselves to Him, who will fight the battle for us [Exodus 14:14], and together with us [Joshua 1:9]. He always will.",
        "part6": "THOUGHT",
        "part7": "Finally, my brethren, be strong in the LORD, and in the power of His might. - Ephesians 6:10",
        "part8": [
            "2 KINGS 18",
            "HEBREWS 2"
        ]
    },
    "8 NOVEMBER": {
        "part1": "2 Samuel 21:19",
        "part2": "Death of the giants - brother of Goliath killed by Elhanan",
        "part3": "VERSE 19",
        "part4": "And there was again a battle in Gob with the Philistines, where Elhanan the son of Jaareoregim, a Bethlehemite, slew the brother of Goliath the Gittite, the staff of whose spear was like a weaver's beam.",
        "part5": "The third giant killed in this account was the brother of Goliath the Gittite. 'The brother of ' is italicized meaning they were not in the original Hebrew text. This has led some to say Goliath was killed not by David, but by Elhanan here. This interpretation is clearly unacceptable as it is contrary to Scripture [1 Samuel 17:51]. Neither is the suggestion that this is a different Goliath. A simple cross-comparison with 1 Chronicles 20:5 provides the answer: \"And there was war again with the Philistines; and Elhanan the son of Jair slew Lahmi the brother of Goliath the Gittite, whose spear staff was like a weaver's beam\". The name of this giant is Lahmi and he is the brother of Goliath.\n\nMany a times, difficulties and controversies in interpretation can be resolved simply by seeking internal evidence within the Bible. A conscientious student of God's Word should seek the whole counsel of God by reading the Bible in its entirety, and learning to read every verse not only in its immediate context, but also with their parallel biblical narratives.\n\nTaking a step back, we can also see how the whole account of David's giant-slayers [2 Samuel 21:15-22] correlates to the account of his mighty men [2 Samuel 23:8-39]. There is also a similar parallel between 2 Samuel 21:1-4 and 2 Samuel 24, which focus on the theme of atonement. This draws our attention to what is central in the last four chapters of 2 Samuel - David's song of praise and his last words in 2 Samuel 22:1-23:7. This structure of casting light upon the focus of a narrative serves to provide insight on recognizing the emphases in some of God's narratives.",
        "part6": "THOUGHT",
        "part7": "The Bible is a treasure trove of discoveries. We could dive in and see the beauty of each gem, the same way we could take a step back and see how each section fits into the beauty of God's tapestry.",
        "part8": [
            "2 KINGS 19",
            "HEBREWS 3"
        ]
    },
    "9 NOVEMBER": {
        "part1": "2 Samuel 21:20-22",
        "part2": "Six-fingered man",
        "part3": "VERSE 20",
        "part4": "And there was yet a battle in Gath, where was a man of great stature, that had on every hand six fingers, and on every foot six toes, four and twenty in number; and he also was born to the giant.",
        "part5": "The last giant in this account is an unnamed one. He has a strange physique - \"on every hand six fingers, and on every foot six toes\". We need not read too much into the symbolic significance of 'six' here. It is just a description of this particular opponent of Israel at this time.\n\nMore importantly, he defied Israel. In his strength and might, he mocked the people of God - a reminder of what Goliath did in 1 Samuel 17. Soon he was slain by Jonathan, the son of Shimeah.\n\nVerse 22 brings us back to the focus of this section. The emphasis of this account in 2 Samuel 21:16-22 is not on the giants - they were all killed, no matter how big and strong they were. Like Goliath, they had sought to bring reproach to Israel and defied the armies of the living God [1 Samuel 17:26]. Like David, the Israelites were there defending God's name and kingdom. God's servants were the ones He would remember here - Abishai the son of Zeruiah, Sibbechai the Hushathite, Elhanan the son of Jaareoregim, and Jonathan the son of Shimeah. They had defended their Lord's honour.\n\nIn our spiritual struggles, giants will come our way that we must take on. But in our Lord Jesus Christ, we are already more than conquerors, for Satan is already a vanquished foe. What we must do is focus on Christ and commit our ways to Him. God will be with us in every challenge, no matter how daunting they seem.",
        "part6": "THOUGHT",
        "part7": "And all this assembly shall know that the LORD saveth not with sword and spear: for the battle is the LORD's, and He will give you into our hands. - 1 Samuel 17:47",
        "part8": [
            "2 KINGS 20",
            "HEBREWS 4"
        ]
    },
    "10 NOVEMBER": {
        "part1": "2 Samuel 22:1",
        "part2": "Song of deliverance",
        "part3": "VERSE 1",
        "part4": "And David spake unto the LORD the words of this song in the day that the LORD had delivered him out of the hand of all his enemies, and out of the hand of Saul.",
        "part5": "The two books of Samuel are bookended by two songs - the Song of Hannah [1 Samuel 2:1-10] and the Song of David [2 Samuel 22; Psalm 18]. In both, God is extolled for lifting up His people who know they have no ability to lift themselves up. God is full of mercy and lovingkindness. This is the theme that runs through the books of Samuel.\n\nAs David's reign draws to a close, he looks back at his life and marvels at God's providence and deliverance. His heart is flooded with praise and thanksgiving, and his response is to praise the Almighty God. In 2 Samuel 22, David's song is prefaced by a verse that tells us he wrote this song when the LORD delivered him from the hand of his enemies, especially from Saul. This is a personal song of thanks, and it is adapted in Psalm 18 so that it could be used in public worship.\n\nWhat do you see when you recount your life? Do you see your accomplishments like Nebuchadnezzar did when he said, \"Is not this great Babylon, that I have built for the house of the kingdom by the might of my power, and for the honour of my majesty?\" [Daniel 4:30] - SELF, SELF, SELF. Or do you see life as David did - the story of wonderful things God did and His hand of goodness at every turn. Matthew Henry writes, \"Every new mercy in our hand should put a new song into our mouth, even praises to our God. Where there is a grateful heart, out of the abundance of that the mouth will speak.\"",
        "part6": "THOUGHT",
        "part7": "\"Our sufficiency is of God\" [2 Corinthians 3:5b]. Praise the LORD for His day-to-day providence.",
        "part8": [
            "2 KINGS 21",
            "HEBREWS 5"
        ]
    },
    "11 NOVEMBER": {
        "part1": "2 Samuel 22:1",
        "part2": "Timing of deliverance",
        "part3": "VERSE 1",
        "part4": "And David spake unto the LORD the words of this song in the day that the LORD had delivered him out of the hand of all his enemies, and out of the hand of Saul.",
        "part5": "David lived a life fraught with danger. In his younger days, he had been fiercely persecuted by Saul despite the fact that the prophet Samuel had anointed him to be Israel's next king. In his older years, he faced rebellion from his own son who tried to dethrone him. At the end of the day however, David was able to look back at all those difficult circumstances and testify that it was by God's grace he had been delivered. This song is also recorded in Psalm 18, and it is notable that it is inserted here in 2 Samuel at the end of David's life. Perhaps as David looked back at his life, he was able to see clearly and testify that God in His perfect timing and providence had delivered him through all those hard times.\n\nLike David, we may be going through various trials and persecutions today. Perhaps you are being discriminated against in your workplace because of your Christian beliefs. Perhaps you are being bullied in school because of your faith. Regardless of our circumstances, have faith that God is with you and that in His perfect timing He will see you through. And when we have been delivered, let us also remember to do like David, who counted his blessings and thanked God for them. At the end of our lives when we look back upon our days with the benefit of perfect hindsight, we will be able to see that God has been faithful all the way.",
        "part6": "THOUGHT",
        "part7": "This I recall to my mind, therefore have I hope. It is of the LORD'S mercies that we are not consumed, because His compassions fail not. They are new every morning: great is Thy faithfulness. - Lamentations 3:21-23",
        "part8": [
            "2 KINGS 22",
            "HEBREWS 6"
        ]
    },
    "12 NOVEMBER": {
        "part1": "2 Samuel 22:2-3",
        "part2": "My Rock and Fortress",
        "part3": "VERSE 2",
        "part4": "And he said, The LORD is my rock, and my fortress, and my deliverer;",
        "part5": "David was a man of war [1 Chronicles 28:3]. He had been in many battles and knew the tactics of war. Here he described God as his Rock and his Fortress. Just as a fortress is a stout defensive structure built to withstand enemy sieges, David acknowledged that it is God who had enabled him to withstand the persecution and assaults of his enemies. More than that, God was also David's firm foundation, his Rock. Even though David experienced kindness from various sources in difficult times, he was clear in understanding it was God who ultimately provided the support he needed.\n\nUnlike the physical fortress which affords protection in one place only, David recognized that God was with him wherever he was and that His defence would be equally strong regardless of terrain. This allowed David to safely trust in God even during the most difficult of circumstances. By placing faith in the Lord, David could see that no physical location, person, or object could be better responsible for his safety.\n\nToday, many of us create safety nets for ourselves. In planning events, we have a main plan and a wet weather plan. With health and finances, we take up insurance policies protecting us from unforeseen contingencies. More important than all these means of security and preparedness, let us remember that we have a God who is our Fortress and our Rock. He is our firm foundation.",
        "part6": "THOUGHT",
        "part7": "Will I feel safe without my worldly sources of support?",
        "part8": [
            "2 KINGS 23",
            "HEBREWS 7"
        ]
    },
    "13 NOVEMBER": {
        "part1": "2 Samuel 22:2-3",
        "part2": "My Shield, Horn of Salvation,  High Tower",
        "part3": "VERSE 3",
        "part4": "The God of my rock; in Him will I trust: He is my shield, and the horn of my salvation, my high tower, and my refuge, my Saviour; Thou savest me from violence.",
        "part5": "\"Thanksgiving to God is the sweetest vocal music\" (Matthew Henry's Commentary). How true. 2 Samuel 22 finds its parallel in Psalm 18. What effusive, exuberant and passionate expression of a very thankful heart. It shows a person's true gratitude.\n\nThroughout this song of 50 verses, the emphasis is clear - David gives glory to God alone. King David acknowledges his deliverance by the one and only Deliverer, the King of kings and Lord of lords. Instead of living the luxurious life of a king, David had to hide in the cave of Adullam with his men [2 Samuel 23:13]. Just imagine his state of affairs then.\n\nIn this verse, we find David so thankful to God for saving him from harm and danger. Though a king, he had to flee from his enemies. Worst of all, he had to run from his own son Absalom. And there was the constant threat of king Saul who wanted his life.\n\nWhat a plight for anyone to be in, even a king. But do not be surprised. We face Satan's attacks when we pledge allegiance to the Lord. Let us learn to be thankful for what He has done for us, even the smallest of things. Pause right now from what you are busy with and thank God for His love.",
        "part6": "THOUGHT",
        "part7": "In everything give thanks; for this is the will of God in Christ Jesus concerning you. - 1 Thessalonians 5:18",
        "part8": [
            "2 KINGS 24",
            "HEBREWS 8"
        ]
    },
    "14 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 3 Saul. In sheer desperation, he was willing to be a",
        "part4": "The God of my rock; in Him will I trust: He is my shield, and the horn of my salvation, my high tower, and my refuge, my Saviour; Thou savest me from violence.",
        "part5": "2Samuel 22 is almost identical to Psalm 18. Both are equal in length and emphasize the same theme - God as Refuge and Saviour. Indeed, David had every reason to repeat his joyful praise and thanksgiving to God his Saviour. His experiences throughout life as a shepherd, soldier and sovereign was reason for his deep gratitude.\n\nHere are two instances of what David went through. The first - fleeing and hiding from king Saul. In sheer desperation, he was willing to be a fugitive serving king Achish of the Philistines in order to escape Saul.\n\nThe second is even more pitiful - conflict with his favourite son, Absalom. But throughout these trials, David remembered God's merciful care for him. Our loving God will never leave us in despair. When we encounter trouble, ask God immediately for help. He will never forsake us.\n\nRemember all the help David received from the Lord. All the descriptions he used describe the power of the Almighty - Refuge, Fortress, Deliverer, Rock, Horn of Salvation, Shield, High Tower, Refuge, Saviour. What a mighty God we have!\n\nThe important question is, \"Can you claim Him to be yours too?\" If not, do not delay. Do not reject His love for you. Here and now, pray, ask God to forgive you, accept and trust Him as your Lord and Saviour. One who has been forgiven much loves much [Luke 7:47], so will one who has been delivered from much praise much, like David.",
        "part6": "",
        "part7": "Is the Lord Jesus Christ your Lord and Saviour?",
        "part8": []
    },
    "15 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 4 His grace and mercy. We should constantly recall",
        "part4": "I will call on the LORD, who is worthy to be praised: so shall I be saved from mine enemies.",
        "part5": "David praised the Lord for answering his prayers and being a very present help in his troubles with Saul. Similarly, when we are anxious or dismayed, we can trust in God. He is the living God and with Him all things are possible. Regardless of how complex the challenges are, He will deliver us.\n\nDavid also reminds us to give glory to God for His grace and mercy. We should constantly recall and recount our blessings from God and how He has preserved us. Praise God for His help through the trials in our life and always give thanks for His ultimate act of mercy in saving us. As Psalm 107:1 says, \"O give thanks unto the Lord, for He is good: for His mercy endureth forever\", so is our thanksgiving an integral part of praising God. We manifest thanks to God through our unceasing prayer and songs of praise.\n\nOftentimes, we forget to render to God the praise due to Him. Psalm 96:4 says, \"For the LORD is great, and greatly to be praised: He is to be feared above all gods.\" Let us practise calling on Him in faith and giving thanks to Him in our daily routine. David constantly prayed to God throughout his life and he did not forget His goodness when all was going well. We must strive for greater intimacy with God so that He is at the forefront of our minds at all times, and instinctively we will seek Him out first in any situation.",
        "part6": "",
        "part7": "But verily God hath heard me; He hath attended to the voice of my prayer. Blessed be God, which hath not turned away my prayer, nor His mercy from me. - Psalm 66:19-20",
        "part8": [
            "1 CHRONICLES 1-2",
            "HEBREWS 10",
            "THOUGHT But verily God hath heard me; He hath attended",
            "to the voice of my prayer. Blessed be God, which",
            "hath not turned away my prayer, nor His mercy",
            "from me. - Psalm 66:19-20"
        ]
    },
    "16 NOVEMBER": {
        "part1": "2 Samuel 22:5-6",
        "part2": "Waves of death",
        "part3": "VERSE 5",
        "part4": "When the waves of death compassed me, the floods of ungodly men made me afraid.",
        "part5": "David cried out to the Lord in his distress. He was often surrounded by enemies, on the brink of ruin, both physically and emotionally. Oftentimes we are in such despairing situations and no one seems to understand our pain. We feel helpless and hopeless. It seems impossible for us to climb out of the deep and dark pit of trouble. In such hopeless times, we can still praise God for the one hope left: the Lord Himself.\n\nWhen we are confronted by insurmountable odds, even the crisis of death itself, there is always this one hope: prayer - crying out to the Lord for deliverance. Thus we have a deeper appreciation for David's thanksgiving in verse 4, when he praises God for being always present to hear his cry.\n\nThere will be times when we are discouraged, when we are confronted with the most troubling issues, maybe the prospect of death. Do we give up? No, we have our Lord God. We can cling to Him and cry out for His face and mercy to shine on us. Do not fear but remember. He is the Lord of all comfort and help even in the direst of circumstances.\n\nNever feel that you are forgotten and abandoned. Our Lord God remembers us and He will bless. Read Psalm 115 and be encouraged knowing that God always keeps us in His thoughts.",
        "part6": "PRAYER",
        "part7": "O Lord my God, I cried unto Thee, and Thou hast healed me. Read Psalm 30.",
        "part8": [
            "1 CHRONICLES 3-4",
            "HEBREWS 11"
        ]
    },
    "17 NOVEMBER": {
        "part1": "2 Samuel 22:7",
        "part2": "God hears ...",
        "part3": "VERSE 7",
        "part4": "In my distress I called upon the LORD, and cried to my God: and He did hear my voice out of His temple, and my cry did enter into His ears.",
        "part5": "David recounted God listening to his prayers. He remembered how he cried to God in his distress, and God heard. When circumstances go against us and we are hit by one problem after another, we tend to ask God, \"Why me?\" and \"Where are You?\" David reminded us to do the opposite. When everything seems to be against us, do not blame God but seek Him. David knew God would hear his pleas. Our Lord, the all-powerful Creator God, cares for us and we can take refuge in Him. We can be confident God understands how we feel, and He listens to our prayers.\n\nWe develop a deeper relationship with God by earnestly reading His Word and praying. James 4:8a says, \"Draw nigh to God, and He will draw nigh to you ...\" As we grow closer to Him, we will cultivate a stronger faith that knows He will see us through our trials because He is able to do exceeding abundantly above all that we ask or think, according to the power that worketh in us [Ephesians 3:20].\n\nAs David experienced first-hand, God will listen to our cries for help. We can trust that He will be our refuge and strength in the storms of life. Recall and reflect on the occasions that you experienced God's hand working in a personal time of distress and thank Him for His deliverance.",
        "part6": "PRAYER",
        "part7": "Thank you Lord for Your mercy and grace. We know we can call upon You and You will hear and deliver us. Teach us to focus and think on whatsoever things are true, honest, just, pure, lovely, of good report, virtue and praise... Amen.",
        "part8": [
            "1 CHRONICLES 5-6",
            "HEBREWS 12"
        ]
    },
    "18 NOVEMBER": {
        "part1": "2 Samuel 22:8-9",
        "part2": "God's wrath  VERSES 8-9 Then the earth shook and trembled, the foundations of heaven moved and shook, because He was wroth. There went up a smoke out of Hes nostrils, and fire out of Hts mouth devoured: coals were kindled by tt.  To CompLtete THE BiBLe",
        "part3": "",
        "part4": "Then the earth shook and trembled; the foundations of heaven moved and shook, because He was wroth. There went up a smoke out of His nostrils, and fire out of His mouth devoured: coals were kindled by it.",
        "part5": "God shook the earth to meet the needs of David. David wrote of God's majesty and anger as he described the earth shaking, the heavens quaking, dark waters and thick clouds in the skies, thunder from heaven and divine lightning bolts vanquishing God's enemies, in response to His servant's cry. It is an amazing picture of God's power. The God who thunders, is the God who speaks powerfully against His enemies in order to deliver His people.\n\nThe wrath of God is one of God's attributes. It is needed for motivation to Christian living, for proper worship, and as a tool to confront objections to Christianity. God makes no attempt to conceal the fact of His wrath. Sin and God's holiness just do not mix; they cannot keep company. There is really no good way to soften the wrath of God to mean anything other than an angry response on God's part to human disobedience. God's wrath is not angry retribution against those who have offended Him. It is His righteous judgement against those who do evil.\n\nGod's wrath is never motivated primarily by a desire to punish but to bring people to repentance so that they may be saved. Even in His wrath, God remembers mercy. God demonstrates His mercy in wrath by never pouring out His wrath without much warning. We come under God's grace by placing our faith in the Lord Jesus and His sacrifice for our lives. Those who have rejected God's free gift of grace in His Son Jesus are under God's wrath, and they have no one to blame but themselves.",
        "part6": "THOUGHT",
        "part7": "Are you under grace or under wrath?",
        "part8": [
            "1 CHRONICLES 7-8",
            "HEBREWS 13"
        ]
    },
    "19 NOVEMBER": {
        "part1": "2 Samuel 22:10-11",
        "part2": "God's response  VERSES 10-11 He bowed the heavens also, and came down, and darkness was under Has feet. And He rode upon a cherub, and did fly: and He was seen upon the wings of the wind.  To CompLtete THE BiBLe",
        "part3": "",
        "part4": "He bowed the heavens also, and came down; and darkness was under His feet. And He rode upon a cherub, and did fly: and He was seen upon the wings of the wind.",
        "part5": "With troubles all around, David looked to the Lord for help. David did not look within for help - he was unable to help himself. He did not look without for help - his enemies were too powerful for anyone to overcome. He looked up and his cry reached the Lord and was heard. God thundered down from heaven in cloudy darkness, signifying a severe storm, to answer his plea for deliverance. The point of this is to show that God acts quickly, decisively and powerfully for His people, when they are threatened by enemies.\n\nDavid went into great detail as he testified how God moved in power to defend and sustain him. David pictured the Lord coming with glory and speed. He came so fast it seemed God travelled upon the wings of the wind.\n\nDavid told us God worked with miraculous power time and again just to deliver him from those who sought to destroy him. This is the kind of blessing all who know the Lord enjoy. His ears are ever open to our cries. He invites us to flee to Him in the hour of trouble. When we do, we will find Him to be all David declared Him to be. God truly is all we need. All those who know the Lord enjoy this same relationship. God will move heaven and earth to meet the needs of His children. What you are to God is what He will be to you. If you are pure in heart and see everything in its proper light, you will discover that God is this way to you.",
        "part6": "THOUGHT",
        "part7": "Is your view of God's power limited to only miracles like signs and wonders?",
        "part8": [
            "1 CHRONICLES 9-10",
            "JAMES 1"
        ]
    },
    "20 NOVEMBER": {
        "part1": "2 Samuel 22:12-13",
        "part2": "God's brightness  VERSES 12-13 And he made darkness pavilions round about Him, dark waters, and thick clouds of the skies. Through the brightness before Him were coals of fire kindled.  To CompLtete THE BiBLe",
        "part3": "",
        "part4": "And he made darkness pavilions round about Him, dark waters, and thick clouds of the skies. Through the brightness before Him were coals of fire kindled.",
        "part5": "David called out to God for deliverance and God responded in a way that signalled His sovereignty over all creation. God is angered by those who endanger His people and He can use His creation to reflect His anger. This is not just a description of God being eager to save David, but the Lord who is intent upon destroying the enemies who threaten His own.\n\nThe glory of God is depicted as brightness, shining in glorious radiance when His presence is made known. Light and darkness are common themes used throughout Scripture. Light shines in the darkness and the darkness does not comprehend it. When light shines, darkness is no more. The concept of light is the concept of being visible. God's glory is in a sense making Himself visible and known. When we look at the sun, we are overwhelmed by its light. We cannot stare at it. It is too bright, too majestic and powerful. Likewise, God dwells in His glory and brightness that is unapproachable. That is the immensity of the infinite God who gave light to the world.\n\nIn our Lord Jesus Christ, God's greater glory has come. We see in Him an even brighter light, an even more amazing revelation of God. And we are changed from glory to glory as we reflect the light of our Lord Jesus Christ in our lives by the working of the Holy Spirit within. Our light shines brighter the more we become like our Lord Jesus.",
        "part6": "THOUGHT",
        "part7": "All the luminosity of light and the brilliance of its brightest rays emanate from Him.",
        "part8": [
            "1 CHRONICLES 11-12",
            "JAMES 2"
        ]
    },
    "21 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 14 and this anger in heaven is the forerunner to His",
        "part4": "The LORD thundered from heaven, and the most High uttered His voice.",
        "part5": "The Most High uttered His voice. God spoke on David's behalf, commanding His creation to respond to His desire to deliver His child. All this is a reflection of David's confidence in the love of God. David sees a God who will not tolerate the distress of His beloved. When we read the Scriptures about God thundering from heaven, claps of thunder are indicators that God is angry and this anger in heaven is the forerunner to His wrath being poured out on earth. Thus, thunder was often considered to be God's voice. The common belief in times past was that God was the direct cause of thunder and lightning.\n\nIt is not how God's voice sounds, but rather what the voice says that lets you know who is speaking. What is the difference between hearing and listening? To \"listen\" means we are paying attention to the sound. To \"hear\" means to perceive something with our ears, like seeing with our ears. There are thousands of noises that compete for our attention. It is not that you are not hearing those noises, but you are not listening to them. When hearing and listening work together, we have an understanding of the purpose of the sound.\n\nHow much are you missing what God has for you? Is He talking to you but you are not paying attention? What are you hearing and listening each day? When the Word of God truly becomes His voice in your life, then your hearing and listening will open up a new world of understanding for you. Your life will change. \"Give ye ear, and hear My voice; hearken, and hear My speech.\" [Isaiah 28:23]",
        "part6": "",
        "part7": "Listen to what you hear.",
        "part8": []
    },
    "22 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 15 David in Psalm 97 spoke of the flashes of",
        "part4": "And He sent out arrows, and scattered them; lightning, and discomfited them.",
        "part5": "David, as in previous verses, employed synonymous parallelism (the same thought repeated in different words) to describe the Lord's deeds. David's deliverance from his enemies here is attributed to the Lord's use of the forces of nature - arrows of lightning. These are at His disposal to be dispatched swiftly whenever He utters His word of command.\n\nDavid in Psalm 97 spoke of the flashes of lightnings, \"His lightnings enlightened the world: the earth saw, and trembled\" [Psalm 97:4]. At Mt Sinai, the glorious manifestation of God's presence was attended by thunderings and lightnings ... etc, so much so the Israelites trembled exceedingly. Such fearful forces of nature can still terrify us today as in the days of old.\n\nA lightning strike is an electric discharge between the atmosphere and the ground. It is only about one inch in diameter, but because of its extreme brilliance, it looks much larger to the human eye. Lightning discharges are typically miles long and sometimes occurring together in multiple strikes. The entire flash lasts only a fraction of a second at approximately 27,000 degrees Celsius and is enough to cause total damage and complete devastation. It is quite unthinkable how this can be inflicted on David's enemies.\n\nReminiscing the past deeds of the Lord, David prayed in Psalm 144:6 against his enemies, \"Cast forth lightning, and scatter them: shoot out Thine arrows, and destroy them\" [Psalm 144:6]. What blessedness for this God to be our God! Not only is He our mighty fortress in defense but also a great warrior and conqueror in offense. Therefore, if God be for us, who can be against us?",
        "part6": "",
        "part7": "The LORD shall go forth as a mighty man, He shall stir up jealousy like a man of war: He shall cry, yea, roar; He shall prevail against His enemies. - Isaiah 42:13",
        "part8": []
    },
    "23 NOVEMBER": {
        "part1": "2 Samuel 22:16",
        "part2": "God's blast of breath",
        "part3": "VERSE 16",
        "part4": "And the channels of the sea appeared, the foundations of the world were discovered, at the rebuking of the LORD, at the blast of the breath of His nostrils.",
        "part5": "The Lord in His anger against the enemies, who go against His faithful ones seeking to destroy them, manifests His mighty power making bare the depths of the sea, uncovering the earth's foundation, striking fear in their hearts and melting away their bravery. There David stood still and saw the salvation of the Lord.\n\nAt the blast of His nostrils, the Red Sea parted, the roaring waves standing upright on either side, made a pathway at the bottom and the Israelites walked on dry ground, fleeing the powerful Egyptians [Exodus 15:8]. This blast of God's breath the Canaanites heard and their hearts melted, the terror of the Israelites fell upon them and the land fainted because the Lord God fought for Israel even before they entered their lands to conquer [Joshua 2:9-11].\n\nYou, who have trusted in the Lord, fear not man neither be afraid. \"For he that toucheth you, toucheth the apple of His eye\" [Zechariah 2:8]. The Lord God condescends to defend His beloved ones when their adversaries rise to seek their hurt. For what is man, \"that dwell in houses of clay, whose foundation is in the dust, which are crushed before the moth?\" [Job 4:19]; \"By the blast of God they perish, and by the breath of His nostrils are they consumed\" [Job 4:9]. It is a fearful thing to fall into the hands of an angry God but a joyful thought to lean on the everlasting arms of the Lord.",
        "part6": "PRAYER",
        "part7": "O blast of God, destroy the proud and wicked; come breath of God, revive the broken and contrite hearted.",
        "part8": [
            "1 CHRONICLES 16",
            "JAMES 5"
        ]
    },
    "24 NOVEMBER": {
        "part1": "2 Samuel 22:17-18",
        "part2": "God's deliverance",
        "part3": "VERSE 18",
        "part4": "He delivered me from my strong enemy, and from them that hated me: for they were too strong for me.",
        "part5": "David was often compassed about by enemies who sought to destroy him, whether it was Saul the king, Absalom the son or the Philistines, Israel's foe. His uprightness and success in the kingdom became a threat and envy to many, earning him enemies round about. These were often too strong for him. Yet he did not fret but always sought the counsel of God and enquired of Him. His unwavering faith in the Lord was testified by His deliverance from his enemies. In the distress of the roaring waves, the Lord stretched out His arm to lift him from the sea of troubles.\n\nWho can destroy the last enemy, death? Who can overcome the enemy of our soul, Satan, whose power and craft are great? Who can deal with our sins within and without? Seen and unseen enemies, who is sufficient against all these? Thanks be to God who causes us to triumph over them in the Lord Jesus Christ, who conquered death, the devil and sin [1 Corinthian 15:55-57; 1 John 3:8]. That in which we were helpless, He delivered us.\n\nDoes our cross seem sometimes too heavy to bear? Do our trials seem insurmountable? Do we feel overstretched, pressed beyond measure, and tested above what we are capable of handling? Sometimes the Lord puts us in such circumstances to the end that we may learn to lean on Him. Often that which we can accomplish by our capability and strength, seems not to require our faith. But that which seems impossible and beyond our strength to handle drives us to seek the Lord. He saved David. He will also do so for all His beloved ones.",
        "part6": "THOUGHT",
        "part7": "Sometimes the end God has in mind is to exercise our faith, so He brings us into straitened circumstances so that we might look up to Him and see His deliverance. - Jerry Bridges",
        "part8": [
            "1 CHRONICLES 17",
            "1 PETER 1"
        ]
    },
    "25 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 19 helpless state, the power of the Lord alone was",
        "part4": "They prevented me in the day of my calamity: but the LORD was my stay.",
        "part5": "The word \"prevented\" here does not mean \"to obstruct, avert or fend off \" but rather \"to assail or confront\". David was keenly aware of the powerful enemies' nearness, swiftly advancing to assail him, and nothing could save him from this perilous situation except the Lord, who was his stronghold and support.\n\nThe enemies thought to devour him, and in his helpless state, the power of the Lord alone was his sure defense and renewing strength. He was treading on dangerous ground but steadfast faith in God would keep him safe. The Lord upheld and provided succour when David faced calamity and disaster. He saw the fearful enemies advancing, but he also saw the mighty hand of God upholding him. The enemies cast a shadow of fear on him but the Lord was his light and salvation, dispelling anxiety and doubt, filling his mind with the knowledge of His presence. \"The LORD is my light and my salvation; whom shall I fear? the LORD is the strength of my life; of whom shall I be afraid?\" [Psalm 27:1].\n\nO child of God, was this not our experience when we faced those fearful and overwhelming threats? In those most extreme of circumstances, we were ready to fold, and the arm of flesh failed us miserably but then the hand of the Lord was our stay. We would have fallen but the Lord was our strength and support. If we can trust Him in the past, undoubtedly, we can continue to trust Him for the present and in the future.",
        "part6": "",
        "part7": "Fear thou not; for I am with thee: be not dismayed; for I am thy God: I will strengthen thee; yea, I will help thee; yea, I will uphold thee with the right hand of My righteousness. - Isaiah 41:10",
        "part8": []
    },
    "26 NOVEMBER": {
        "part1": "2 Samuel 22:20",
        "part2": "God's delight",
        "part3": "VERSE 20",
        "part4": "He brought me forth also into a large place: He delivered me, because He delighted in me.",
        "part5": "God had never failed to deliver David to the place of safety. Why was that? Because God delighted in him. What is it about David that God delighted in? How could David speak so confidently of God's delight in him?\n\nGod described David as \"a man after My own heart\". David had great faith in God. He sought after and delighted in Him. For the most part, David lived a life of obedience which is well- pleasing to God. Nevertheless, David's life was far from blameless. He committed adultery and murder. But he recognized his sins readily when confronted and was humble and sincere in seeking forgiveness. Although he repented of his sin, the question remains: How can a holy God delight in sinful man?\n\nThe answer lies in a paradox. Isaiah 53:10 tells us that God is pleased (the same Hebrew word for \"delight\") to bruise His Son, so that we wretched sinners may be justified. On the cross, our sins were imputed to the Lord Jesus Christ, who bore the wrath of God against sin on our behalf; His perfect righteousness was imputed to us, so that God can delight in us and count us perfect in our Lord Jesus.\n\nDavid knew the salvation of the Lord. Even as he sought to live a righteous life, he knew God's delight in him is possible only through the imputed righteousness of his Lord. Have you trusted in Jesus Christ as your Lord and Saviour? If so, you too can say with David, \"God delights in me.\"",
        "part6": "THOUGHT",
        "part7": "He shall see of the travail of His soul, and shall be satisfied: by His knowledge shall My righteous servant justify many; for He shall bear their iniquities. - Isaiah 53:11",
        "part8": [
            "1 CHRONICLES 19-20",
            "1 PETER 3"
        ]
    },
    "27 NOVEMBER": {
        "part1": "2 Samuel 22:21, 25",
        "part2": "God's reward",
        "part3": "VERSE 21",
        "part4": "The LORD rewarded me according to my righteousness: according to the cleanness of my hands hath He recompensed me.",
        "part5": "At first glance, David seems to be claiming a works righteousness, one that comes from his obedience to God's law. He is not. Our salvation does not depend on our own righteousness, which are like filthy rags, but on the imputed righteousness of the Lord Jesus Christ. God freely gives us the gift of salvation by grace; it is not something we can ever earn. David understood this. So, what does he mean when he says the LORD rewarded him according to his righteousness?\n\nGod is perfectly just. He can never close an eye to sin, no matter how tiny; neither will He overlook an act of obedience, no matter how seemingly insignificant. Everyone will receive their due punishment or reward when we appear before the judgement seat on the last day, except that the punishment for believers has been fully paid for by the Lord Jesus Christ [2 Corinthians 5:10, 21].\n\nBesides riches in heaven, we also receive rewards here and now for our obedience, but not in terms of health and wealth or a smooth and easy life. On the contrary, we will have tribulations, but as we walk in fellowship with God and obey His Word, we enjoy peace and communion with Him. We are sanctified day by day and furnished with power to resist Satan's attacks. As we follow the way of wisdom, we will also keep our lives free of besetting sins and avoid the natural consequences sin brings. How is your walk with God? Are you enjoying the fullness of God's spiritual blessings in our Lord Jesus Christ?",
        "part6": "THOUGHT",
        "part7": "Blessed be the God and Father of our Lord Jesus Christ, who hath blessed us with all spiritual blessings in heavenly places in Christ. - Ephesians 1:3",
        "part8": [
            "1 CHRONICLES 21",
            "1 PETER 4"
        ]
    },
    "28 NOVEMBER": {
        "part1": "2 Samuel 22:22-24",
        "part2": "David's testimony (1)",
        "part3": "VERSE 22",
        "part4": "For I have kept the ways of the LORD, and have not wickedly departed from my God.",
        "part5": "David gives a testimony of his obedience to God's law. He is not claiming to be sinless. Although he has committed grievous sins, he has accounted for them. David's life is largely characterized by a constant striving towards obedience of God's law in response to His saving grace. His testimony here should be read in the context of his actions concerning Saul as verse 1 tells us David wrote this song to thank God for delivering him from his enemies and from Saul.\n\nDavid had to live a fugitive's life for many years because of Saul's relentless desire to kill him. Although David could easily have avenged himself on two occasions, he chose not to. He held reverence for the Lord's anointed and great faith in the covenant-keeping God, leaving it entirely to Him to vindicate. God rewarded David for his obedience by delivering him from Saul. His deliverance was a vindication of His righteousness in His dealings with Saul.\n\nHow do you respond when others persecute you, are unjust or unkind to you? Do you respond in kind and harbour hatred, or do you persevere in obeying God's Word? Obedience is a choice, a conscious act of keeping oneself in the way of the Lord even as Satan, the world, and your sinful nature buffets you. Obedience is also an act of faith, trusting in the perfect will of the Sovereign God even when deliverance and vindication are not yet in sight.",
        "part6": "THOUGHT",
        "part7": "Blessed is the man that walketh not in the counsel of the ungodly, nor standeth in the way of sinners, nor sitteth in the seat of the scornful. - Psalm 1:1",
        "part8": [
            "1 CHRONICLES 22",
            "1 PETER 5"
        ]
    },
    "29 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 23 judgment before him. The word \"judgement\"",
        "part4": "For all His judgments were before me: and as for His statutes, I did not depart from them.",
        "part5": "David continued with his testimony in the next two verses. He had set God's judgement before him and did not depart from them. He had also kept himself from iniquity so that he might be upright before God.\n\nDavid's testimony teaches us another two aspects of obedience. First, obedience requires knowledge of God's way. David was able to keep the ways of the LORD because he set God's judgment before him. The word \"judgement\" in the original Hebrew language has a broader meaning than what the English word suggests. It does not only refer to judicial matters but to the entire government. God is not only the judge. He has divine authority over the lives of His creatures. He alone can set the laws and exercise true ultimate rulership over His creation. In other words, God is sovereign over all. By setting God's judgements before him and not departing from them, David implicitly acknowledged God's sovereignty over his life and submitted to Him.\n\nNext, obedience requires knowledge of self. David recognised he had come short of God's glory and holiness. He admitted his iniquities and made effort to keep himself from them [v. 24]. He was aware of God's abiding presence and strived to be upright before Him.\n\nTo keep ourselves in the path of righteousness, we need to know God and know ourselves. Do you recognise God's sovereignty and holiness, and your own unrighteousness? May the Lord help us to set His judgement before us always and to keep ourselves far from iniquity.",
        "part6": "",
        "part7": "Nearly all wisdom we possess, that is to say, true and sound wisdom, consists of two parts: the knowledge of God and of ourselves. - John Calvin",
        "part8": []
    },
    "30 NOVEMBER": {
        "part1": "2 Samuel 22:26-27a",
        "part2": "God's justice (1)",
        "part3": "VERSE 26",
        "part4": "With the merciful Thou wilt shew thyself merciful, and with the upright man Thou wilt shew thyself upright.",
        "part5": "David continues to develop the theme of God's justice and rewards. He describes how God deals with six individuals according to their character. The first three have virtues that please God.\n\nThe first is the merciful man. Mercy consists of showing compassion to others, forgiving others, and helping those in need. To this man, God will also show mercy. The second is the upright man. To be upright is to be complete and blameless. Such a man is wholehearted in his commitment to God. To the upright, God will show Himself upright. The third is the pure man, one who keeps himself clean by separating himself from anything sinful or anything which may cause him to sin. The pure man is singular in his desire to please God. To such a man, God will show Himself pure.\n\nGod's justice is perfect. Both the righteous and the wicked will get what they deserve for their deeds. Whatever a person sows, he will reap [Galatians 6:7]. Whatever a person measures, the same will be measured to him [Matthew 7:2].\n\nKnowing that God will not overlook good deeds, believers should be motivated to do good. However, we must be careful we do not do good in order to be rewarded. Instead, we should recognise that ultimately rewards stem from God's grace, and it is our duty as creatures to obey our Lord. So even as we give our best, let us always remember that we are but unprofitable servants.",
        "part6": "THOUGHT",
        "part7": "So likewise ye, when ye shall have done all those things which are commanded you, say, We are unprofitable servants: we have done that which was our duty to do. - Luke 17:10",
        "part8": [
            "1 CHRONICLES 24-25",
            "2 PETER 2"
        ]
    },
    "1 DECEMBER": {
        "part1": "2 Samuel 22:27b-28",
        "part2": "God's justice (2)",
        "part3": "VERSE 28",
        "part4": "And the afflicted people Thou wilt save: but Thine eyes are upon the haughty, that Thou mayest bring them down.",
        "part5": "Verse 28 is a clear warning for the haughty. He is watching them, and He will bring them down. There are numerous verses in the Bible which carry the same warning. Isaiah 13:11b is one of them. God says, \"I will cause the arrogancy of the proud to cease, and will lay low the haughtiness of the terrible.\"\n\nIf proud and wicked men try to devise evil schemes against the innocent, God will outwit them and thwart their plans [v. 27b]. There are numerous examples in the Bible. The Book of Esther provides a classic example of how God judged proud and evil Haman. Haman had become one of King Xerxes' chief advisers, but power went to his head. When everyone began to kneel and pay him homage, he noticed that Mordecai, Esther's adoptive father, did not. Mordecai, being a Jew, knew God's command about bowing to anyone but the Lord. This infuriated arrogant Haman [Esther 3:5]. He went to the king devising an evil plan that would destroy Mordecai and the entire Jewish race. But through a series of 'coincidences' God rescued the Jews and Haman was hung on the gallows that he had prepared for Mordecai.\n\nWe live in an evil and perverse generation where pride is taught as a virtue and unscrupulous methods often lauded as cleverness. May those who name the name of the Lord Jesus Christ never fall prey to such insidious philosophies. If we seek to be happy, to be led by the Spirit, to avoid destruction, we need to cultivate meekness and humility.",
        "part6": "THOUGHT",
        "part7": "Pride is the ground in which all the other sins grow, and the parent from which all the other sins come. - William Barclay",
        "part8": [
            "1 CHRONICLES 26-27",
            "2 PETER 3"
        ]
    },
    "2 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 29 I fear? the LORD is the strength of my life; of",
        "part4": "For Thou art my lamp, O LORD: and the LORD will lighten my darkness.",
        "part5": "David testified that the Lord was his lamp. He gave light to enlighten David's understanding so that he knew what to do and which way to turn in order to be victorious in life. The Lord also gave David the light of brilliant strategy when he faced enemies who confronted him throughout his life. In Psalm 27:1, David similarly testified: \"The LORD is my light and my salvation; whom shall I fear? the LORD is the strength of my life; of whom shall I be afraid?\" God had lifted him out of a condition of depression and contempt into one of glory and honour.\n\nAs Christians, we are privileged to have for our Master, the Lord Jesus Christ who is the light of the world. We possess the Holy Spirit who illuminates our understanding. God has called us out of darkness into His marvellous light that we may show forth His praises [1 Peter 2:9]. Paul cautions us to \"walk as children of light\" [Ephesians 5:8]. In other words, we are to eschew evil and glorify God in our lives [Matthew 5:16].\n\nWe live in dark and perilous times. There is danger everywhere around us. Every day, we hear of people including Christians, who fall into diverse temptations and \"pierced themselves through with many sorrows\" [1 Timothy 6:10]. But thanks be to God, who has given us His precious Word. This Word is a lamp unto our feet - directing our footsteps, and light unto our path - showing us the way to tread [Psalm 119:105]. But we need to study it, know it and wield it effectively in our fight against sin.",
        "part6": "",
        "part7": "It may be a day of darkness with us, but the Lord is our everlasting light. - James Smith, Daily Remembrancer",
        "part8": []
    },
    "3 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 30 God's own heart - a follower in whom the Spirit",
        "part4": "For by Thee I have run through a troop: by my God have I leaped over a wall.",
        "part5": "The Lord gave David power to conquer and prevail against enemies who confronted him. The Lord also gave him the power to scale the walls of opposition and adversity - the problems, difficulties, and barriers thrown up against him. While Saul is portrayed as a man of the flesh who tries in his own right to please God but fails miserably, David is the picture of the man after God's own heart - a follower in whom the Spirit of God dwells, sensitive to the instruction of the Spirit, who is taught to walk in the Holy Spirit.\n\nAs we see David being brought by God to the place of ruling his kingdom, we will see how the Holy Spirit is working to bring us to the place of ruling our lives by the Lord Jesus Christ. As His followers, we need His strength to fight the battles of life. The Apostle Paul encouraged us to be strong in the Lord and in the power of His might [Ephesians 6:10]. God has a resource of power (His might) that He makes available to us by faith. We are unable to be strong in our own strength, but we are strong only in His.\n\nThe Lord Jesus Christ is the vine, and we are the branches. As the branch cannot bear fruit of itself, except it abide in the vine, we cannot achieve anything of spiritual value except we abide in Him and let His Word and His spirit abide in us [John 15:4-7].",
        "part6": "",
        "part7": "Whatever God calls us to do, we can do with His help; otherwise, He would never have called us. - Warren W. Wiersbe, On Being a Servant of God",
        "part8": [
            "1 CHRONICLES 29",
            "1 JOHN 2",
            "THOUGHT Whatever God calls us to do, we can do with His",
            "help; otherwise, He would never have called us.",
            "- Warren W. Wiersbe, On Being a Servant of God"
        ]
    },
    "4 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 31 did that which was right in his own eyes\" [Judges",
        "part4": "As for God, His way is perfect; the word of the LORD is tried: He is a buckler to all them that trust in Him.",
        "part5": "\"I did it my way\" is a line from a popular song. Proud man always want to do things his own way, but that often leads to disaster. It is true of our world today. Just look at the state we are in - fighting, unrest, pollution, poverty and corruption everywhere. It was also true for Israel. One of the lowest periods in Israel's history was the era of the Judges; and the cause is well-known - \"every man did that which was right in his own eyes\" [Judges 21:25].\n\nThe golden age of Israel, a period when she enjoyed peace with the surrounding nations, her borders stretching from the Mediterranean to the Euphrates, was during the reign of King David about the time when he penned this psalm in 2 Samuel 22. What was David's secret? He faithfully followed God's way. Whenever he led his army against Israel's enemies, he would first \"enquired of the LORD\" [2 Samuel 5:19, 23] and the result was \"And David went on, and grew great, and the LORD God of hosts was with him\" [2 Samuel 5:10].\n\nGod's way is the perfect way. It was true for Israel then and it is true for our church and family now. It was true for David and it is true for you and me. The oft-quoted advice of Proverbs 3:5- 6 is worth remembering; \"Trust in the LORD with all thine heart; and lean not unto thine own understanding. In all thy ways acknowledge Him, and He shall direct thy paths\".",
        "part6": "",
        "part7": "Stumbling by sight has always been easier than walking by faith. - Michael Barrett, God's Unfailing Purpose",
        "part8": [
            "2 CHRONICLES 1-2",
            "1 JOHN 3",
            "THOUGHT Stumbling by sight has always been easier than",
            "walking by faith. - Michael Barrett, Gods Unfashng",
            "Purpose"
        ]
    },
    "5 DECEMBER": {
        "part1": "2 Samuel 22:32-33",
        "part2": "God's protection",
        "part3": "VERSE 32",
        "part4": "For who is God, save the LORD? and who is a rock, save our God?",
        "part5": "In verse 32, David reminds us of two important truths about the God we worship. Firstly, only Jehovah is the LORD, the only true living God. There is none beside Him, nor any like Him. There are many so-called \"gods\", but they are merely nominal deities, who are not by nature gods but fictitious ones, idols of pagans made of gold, silver, brass, wood and stone. Secondly, only our God is able to protect and save. Like other inspired writers of the Old Testament such as Moses and Isaiah, David refers to God as the Rock, a symbol of power, strength, protection and stability.\n\nDavid had experienced first-hand God's protection. From the lowest ebbs of life when he was fleeing from Saul to the jubilant times when he was victorious over Israel's enemies, \"the LORD preserved David whithersoever he went\" [2 Samuel 8:14b]. Likewise, God protected His servants like Joseph, Mordecai, Daniel and his three friends even as they were far from home and the temple, living under pagan kings and surrounded by idol worshippers.\n\nIn these perilous times we are living in, as the signs of our Lord's second coming increase and converge, God's people need more than ever the protection of this Rock. We need spiritual protection from false teachers and deceivers, and the moral decay around us. We need physical protection from pestilences, wars and natural disasters. In times like these, we too find comfort in David's declaration; \"Who is a rock, save our God?\"",
        "part6": "THOUGHT",
        "part7": "On Christ the solid rock I stand. All other ground is sinking sand; all other ground is sinking sand.",
        "part8": [
            "2 CHRONICLES 3-4",
            "1 JOHN 4"
        ]
    },
    "6 DECEMBER": {
        "part1": "2 Samuel 22:34",
        "part2": "God's provision (1)",
        "part3": "VERSE 34",
        "part4": "He maketh my feet like hinds' feet: and setteth me upon my high places.",
        "part5": "David declared his praise for his God who constantly answered his prayers. As one who frequently engaged in war and faced strife in his life, David was blessed by God with speed to flee from as well as pursue his foes.\n\nDavid praised God for giving him feet like the hinds' (deer) which are agile, swift and sure-footed even on rocky terrain. The deer skips from place to place with agility, seeming never to lose their footing. They bound unimpeded over the mountain tops. David acknowledged that God granted him the advantage by setting him on the high-ground in battle. These high places were the mountain strongholds, even Mount Zion, the occupation of which accorded him control of the land. The Lord endowed David with much power to conquer his foes.\n\nDavid recognised and rejoiced in his God who provides His children with security and keeps them from falling. The Lord enabled David to walk safely along the difficult and dangerous mountain peaks of trials and temptations. David's praise resembled the praise of Moses who sings that God \"made him ride on the high places of the earth\" [Deuteronomy 32:13] and the prophet Habakkuk who testified that the \"LORD God is my strength, and He will make my feet like hinds' feet\" [Habakkuk 3:19]. David recognised God's hand in all the advantages he had in life and praised God joyfully for them.",
        "part6": "PRAYER",
        "part7": "Dear Lord, let me never forget that everything I have comes from You. Help me to continually glorify You with everything You have blessed me with. In Jesus' name, Amen.",
        "part8": [
            "2 CHRONICLES 5",
            "1 JOHN 5"
        ]
    },
    "7 DECEMBER": {
        "part1": "2 Samuel 22:35",
        "part2": "God's provision (2)",
        "part3": "VERSE 35",
        "part4": "He teacheth my hands to war; so that a bow of steel is broken by mine arms.",
        "part5": "David beautifully praised God for delivering him from great danger and providing him with remarkable preservation.\n\nThe ability to bend a steel bow is proof of incredible strength. David praised God for the advantages of physical strength and energy. While David acknowledged God's gifts to him, he also acknowledged that it was God who taught him, saved him and gave him victory in battle.\n\nNotably, David did not blame God for the exacting wars, conflicts and strife in his life. Rather, David thanked God for preparing his hands for his battles. David acknowledged that wars would be a part of his life. But he was conscious of God's continual hand throughout his life and in the constant preparation he underwent for the trials before him. When the battle came, God's divine enablement allowed David to overcome strong foes.\n\nWe may face numerous difficulties in life and be earnestly wishing for an easier time. Instead of focussing on his troubles, David proclaimed that the Lord strengthened him. Like David, let us focus less on the seemingly insurmountable trials before us and remember we have a God who delights in preparing us to face the challenges He has set for us. We can do all things through our Lord Jesus Christ who strengthens us [Philippians 4:13].",
        "part6": "THOUGHT",
        "part7": "While there may be trials and sore temptations before us, God grants us the skill and strength we require for each battle. If God is for us, truly who can be against us?",
        "part8": [
            "2 CHRONICLES 6",
            "2 JOHN"
        ]
    },
    "8 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 36 provision of God. He ts a shield too for all His",
        "part4": "Thou hast also given me the shield of Thy salvation: and Thy gentleness hath made me great.",
        "part5": "David was able to look back on the years of blessings and divine provision which gave him victories over his enemies and established his throne. The LORD gave David His shield of salvation. The shield speaks of protection. God provided David eternal deliverance or salvation. He also bestowed strength, stability and skill which made David swift to pursue and subdue the bitter enemies of God. David praised the character and provision of God. He is a shield too for all His people as we see in Genesis 15:1 and Psalm 84:11.\n\nDavid remembered what he had been - an unknown shepherd boy. All the greatness of his present exalted position as Israel's king was owed to God's favour. He acknowledged it was divine goodness and gentleness that made him the great king, not because of any merit of his own.\n\nGod had preserved and protected David. When Saul viciously sought David's life, he became a fugitive hiding in the mountains. There were no easy roads there he could travel on. As David scaled the pathways up the mountain peaks of life (seeking to conquer the trials and evade his enemies), the Lord gave him a wide path and kept his feet from slipping. It was as if God was there right in front of David, making a clear escape route for him to follow easily. \"Thou hast enlarged my steps under me; so that my feet did not slip\" [v. 37]. So, God too enables His people to walk safely. He is with us always.",
        "part6": "",
        "part7": "God, when called upon for help, provides the believers with a broad space for free motion, removing obstructions and stumbling-blocks out of the way.",
        "part8": [
            "2 CHRONICLES 7",
            "3 JOHN",
            "THOUGHT God, when called upon for help, provides the",
            "believers with a broad space for free motion,",
            "removing obstructions and stumbling-blocks out",
            "of the way."
        ]
    },
    "9 DECEMBER": {
        "part1": "2 Samuel 22:38-39",
        "part2": "David's complete victory",
        "part3": "VERSE 38",
        "part4": "I have pursued mine enemies, and destroyed them; and turned not again until I had consumed them.",
        "part5": "In verses 38-39, David speaks in the first person about what 'I' have been able to accomplish: total destruction of his enemies. God defeats his enemies in different ways. Here He enabled David to chase and conquer: David pursued his enemies and did not give up till they were utterly consumed. David likely is recalling the events recorded in 1 Samuel 30.\n\nThere, during David's absence, an Amalekite raiding party had sacked and burned Ziklag,. They carried away David's family and all the inhabitants. David took counsel from God. In His providence, they found a sick Egyptian slave abandoned by his Amalekite master, who led the Israelites to the Amalekite's encampment. There David's men routed them and recovered all their families and properties. God provides believers with defensive protection and offensive power. We should expect victory in our Christian lives too, instead of living lives of defeat and frustration [Romans 8:31-39].\n\nShatter and subdue: \"And I have consumed them, and wounded them, that they could not arise: yea, they are fallen under my feet\" [v. 39]. This was true not only of the Amalekites, but of all whom David engaged in battle. They were either slain or subjugated like the Philistines, Moabites, Syrians and Edomites [2 Samuel 8]. David spoke of the complete destruction of his enemies in verses 38, 39 and 43. He praised the LORD for his strength and for the victories he had wrought.\n\nDavid's victories remind us of a greater victory still to come. At the end of the Tribulation, our Lord Jesus Christ will judge and destroy all who are His enemies. For we, who are His elect, victory is assured. Praise the LORD, we are bound for glory land.",
        "part6": "PRAYER",
        "part7": "Lord, You have given me the desire to serve You. Please give me Your strength to battle and be victorious over the deceptions of Satan.",
        "part8": [
            "2 CHRONICLES 8",
            "JUDE"
        ]
    },
    "10 DECEMBER": {
        "part1": "2 Samuel 22:40-41",
        "part2": "God's doing",
        "part3": "VERSE 40",
        "part4": "For Thou hast girded me with strength to battle: them that rose up against me hast Thou subdued under me.",
        "part5": "As David looked back at almost 70 years of life, he recognized how much God had done on his behalf. As a young shepherd, he faced a bear and a lion and slew them both. After he was anointed, he slew the Philistine Goliath to defend the Lord's honour [1 Samuel 17].\n\nLater, God delivered David from the constant attacks of Saul, and from Absalom's rebellion. His rise to power and prominence was in God's sovereign hand. David's lust led him to commit gross adultery and murder. His penitence spared him personal death. He praised God as his rescuer, refuge, his source of strength and victory. He knew it was God who preserved his life. He was restored to a vibrant relationship with the LORD. If a man like David can give God the glory, certainly we should as well.\n\nDavid was a man of war throughout his life [1 Chronicles 22:8]. With the LORD's strength, he had killed many of Israel's (that is God's) enemies. He defeated Israel's arch-enemy, the Philistines [2 Samuel 5:17-25]. Their defeat and the Mediterranean Sea secured their western front. With the Moabites subdued, the desert provided a safe border to the east. In the north, David defeated Hadadezar and the Aramaeans at Damascus, and in the south Edom and Hamath were subdued [2 Samuel 8:6, 14; 1 Chronicles 18]. In these regions, garrisons were established for defence.\n\nThis key statement is repeated twice: \"And the LORD preserved David whithersoever he went\" [2 Samuel 8:6, 14]. David ruled a mighty Israel with God's power and justice. God made David who he was. His victories were ultimately God's doing. So David rightly praised the LORD for every deliverance and every benefit he had experienced through his entire life.",
        "part6": "PRAYER",
        "part7": "Lord, let me look always to Thee, the mighty Fortress.",
        "part8": [
            "2 CHRONICLES 9",
            "REVELATION 1"
        ]
    },
    "11 DECEMBER": {
        "part1": "2 Samuel 22:42-43",
        "part2": "Enemy's total defeat",
        "part3": "VERSE 43",
        "part4": "Then did I beat them as small as the dust of the earth, I did stamp them as the mire of the street, and did spread them abroad.",
        "part5": "David was troubled by a myriad of enemies both external (the Philistines, the Moabites, the Edomites) and internal (King Saul). There were many times when his life was in jeopardy and only by God's grace, was he able to escape. Now, nearing the end of his life, David testified how God was faithful to him and helped him not only to escape death on many occasions, but also to have many victories over his foes. This was despite the fact that some of his adversaries were much stronger and more powerful like Goliath, the Philistines and even King Saul.\n\nAs such, when we read of David's victories over his enemies, we should realize this was a result of the continual and constant relationship he had with God. Complete triumph over God's enemies is something equally available to us in this day and age. These may not be physical enemies threatening our lives, but unseen spiritual foes tempting us to sin against God, and undermining our faith and confidence in Him. The Bible promises that just as David won a complete victory over his enemies, we too can have victory over the spiritual foes as we nurture our relationship with our Lord Jesus Christ [Romans 8:34; 2 Corinthians 10:4; Colossians 2:12- 15].\n\nLet us therefore not be discouraged when we recognise strongholds of sin in our life. Instead, turn to God in obedience and faith, and let the battle be His, and the victory and the glory as well.",
        "part6": "THOUGHT",
        "part7": "What shall we then say to these things? If God be for us, who can be against us? - Romans 8:31",
        "part8": [
            "2 CHRONICLES 10",
            "REVELATION 2"
        ]
    },
    "12 DECEMBER": {
        "part1": "2 Samuel 22:44-46",
        "part2": "Blessings of triumph",
        "part3": "VERSE 44",
        "part4": "Thou also hast delivered me from the strivings of my people, Thou hast kept me to be head of the heathen: a people which I knew not shall serve me.",
        "part5": "Today, we meditate on the fact that David's triumph over his enemies was not just in the battlefield. David enjoyed much political success. From being king in Hebron, David gained the love and respect of all Israel and became king over a unified kingdom. As he continued winning victories against the surrounding nations, he subdued them and built garrisons therein [2 Samuel 8]. He was admired and gained favour even with the Gentile nations thus making Israel to grow in prominence and enter its golden era.\n\nThere are at least two other instances in the Bible where God's people gain favour and respect even from the world. As both Samuel [1 Samuel 2:26] and the Lord Jesus Christ [Luke 2:52] grew in wisdom and stature, and in their relationship with God, we see that they were in favour with men. It is biblically attested that the world will hate Christians [1 John 3:13]. Yet despite the natural hatred which the world bears, God allows the faithful Christian to thrive in adverse circumstances so that the world cannot help but grudgingly acknowledge their successes and deeds. Like David, we may be surrounded by people or by events that constantly discourage and tempt us to sin but as we persevere in righteousness, we can have peace because our Lord has overcome the world [John 16:33].\n\nLet us therefore hold fast to our Lord Jesus Christ and live in a manner acceptable in His sight. Our uncompromising testimony in the face of adversity will give Him glory.",
        "part6": "THOUGHT",
        "part7": "These things I have spoken unto you, that in Me ye might have peace. In the world ye shall have tribulation: but be of good cheer; I have overcome the world. - John 16:33",
        "part8": [
            "2 CHRONICLES 11-12",
            "REVELATION 3"
        ]
    },
    "13 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 48 exists, and He is the One who helped bring about",
        "part4": "It is God that avengeth me, and that bringeth down the people under me.",
        "part5": "We often worry about our relationship with God when we are going through persecution or hard times. However, let us consider that perhaps it is during life's good times that our relationship with Him may be even more threatened. We may be tempted to think the smooth-sailing state of our circumstances came about through our own hard work. David prevents himself from taking such credit by bringing to mind the fact that God exists, and He is the One who helped bring about his present good circumstances.\n\nThis is a good example to emulate. Besides keeping us humble and God-focused, intentionally remembering God's goodness to us in the past also strengthens and prepares us for adverse circumstances in the future. We will benefit from taking time to list the many ways God has blessed us, and praise Him for each item with thanksgiving. First, David acknowledged the living God as his source of support and salvation. Next, David praised God for avenging the wrongs done to him. He lists specifically what God had done - bringing many people under David's subjection, delivering David from his enemies, keeping him safe and out of harm's reach, exalting him above those who rose up against him, and granting him paths of escape from violent men and situations.\n\nAim to be like David. Practise counting your blessings.",
        "part6": "",
        "part7": "Count your blessings, name them one by one ... And it will surprise you what the Lord hath done. - Johnson Oatman Jr.",
        "part8": [
            "2 CHRONICLES 13",
            "REVELATION 4",
            "THOUGHT Count your blessings, name them one by one ...",
            "And it will surprise you what the Lord hath done.",
            "- Johnson Oatman Jr."
        ]
    },
    "14 DECEMBER": {
        "part1": "2 Samuel 22:50-51",
        "part2": "Chorus of blessing (2)",
        "part3": "VERSE 50",
        "part4": "Therefore I will give thanks unto Thee, O LORD, among the heathen, and I will sing praises unto Thy name.",
        "part5": "Yesterday we saw David recalling the many ways God had blessed him. By counting his blessings, David reminded himself of his dependence on God, gave Him the glory, and cultivated his personal relationship with Him.\n\nToday, let us also consider how counting our blessings can help us to be a good testimony for God's glory. Now that David was the paramount public figure in the kingdom, respected by both Israelites and the surrounding nations, he boldly declared God's goodness in a public setting. Even \"among the heathen\", David asserted he would continue giving thanks to the Lord. Unlike many Christians today who keep quiet about their faith when they are in the public eye, David used those situations to continue giving God the glory, despite the possibility his testimony might portray him as a weak man, one who was solely dependent on God!\n\nPerhaps we may be uncomfortable displaying such a \"weak\" image through constantly thanking God for all the things He has done for us. We may feel that the world will laugh at our complete reliance on Him. Let us examine if it is a matter of our pride and self-love. Let us also remember not to deceive ourselves. We are in fact human and weak. Without God's grace, it would not have been possible to accomplish any work we do.\n\nSo let us direct all glory to Him and save none for ourselves.",
        "part6": "THOUGHT",
        "part7": "If we are truthful and humble, we will not hesitate to acknowledge God's work in our lives. \"I am the vine, ye are the branches: He that abideth in Me, and I in him, the same bringeth forth much fruit: for without Me ye can do nothing.\" [John 15:5]",
        "part8": [
            "2 CHRONICLES 14-15",
            "REVELATION 5"
        ]
    },
    "15 DECEMBER": {
        "part1": "2 Samuel 23:1",
        "part2": "Who was David?",
        "part3": "VERSE 1",
        "part4": "Now these be the last words of David. David the son of Jesse said, and the man who was raised up on high, the anointed of the God of Jacob, and the sweet psalmist of Israel, said...",
        "part5": "As he neared the end of his life, David made four statements about himself in the third person. If there is any question about who David was, the answer would be that he was the son of Jesse; he was raised up on high; he was the anointed of God; and he was the sweet psalmist of Israel.\n\nThe first statement points to his humble origin. David was the youngest of Jesse's seven sons from the nondescript town of Bethlehem. In other words, David was a nobody. Second, David was \"raised up on high\", meaning his accomplishments were not the result of his own abilities. From a shepherd David became king, but it was God who chose him and \"took him from the sheepfolds ... to feed Jacob his people, and Israel his inheritance\" [Psalm 78:70-71]. It was God who raised David up.\n\nThird, David was \"the anointed of the God of Jacob\". David was referring to the time when as a teenager he was anointed by Samuel to be king [1 Samuel 16:13]. The word \"messiah\" is a transliteration of the Hebrew word \"anointed\", meaning David was the man on whom God set His heart for His own purpose. David's greatness did not come from what he had done; rather, David was great because God had called and laid His purpose on him.\n\nFourth, David was \"the sweet psalmist of Israel\", meaning he was the composer of the psalms sung in Israel. And in his psalms, David points us beyond himself to his Greater Son, our Lord Jesus Christ.\n\nDavid's last words were not for self- aggrandizement. Rather, they are a testimony of what God had done in him, and what God can do in us when we \"yield (ourselves) unto God ... and (our) members as instruments of righteousness unto God\" [Romans 6:13b].",
        "part6": "THOUGHT",
        "part7": "What you would put on the epitaph of your gravestone is how you should live your life.",
        "part8": [
            "2 CHRONICLES 16-17",
            "REVELATION 6"
        ]
    },
    "16 DECEMBER": {
        "part1": "2 Samuel 23:1-2",
        "part2": "David as prophet",
        "part3": "VERSE 1",
        "part4": "Now these be the last words of David. David the son of Jesse said, and the man who was raised up on high, the anointed of the God of Jacob, and the sweet psalmist of Israel, said...",
        "part5": "These are the final words of David spoken under the inspiration of God's Spirit. By God's grace, he had been raised from low estate to become king. His description as being \"the sweet psalmist of Israel\" (literally \"pleasant in Israel's songs of praise\") is indeed deserved as he transcends the role of ruler to be used by God to teach His people through the Psalms he wrote.\n\n\"The Spirit of the Lord spake by me, and His word was in my tongue\" [v. 2]. As in the Psalms, the words recorded here are divinely inspired with David speaking as a prophet. In these verses it will be seen that David's final words point us in the same direction as the rest of David's reign - the eternal kingdom of the Lord Jesus Christ. As we consider and meditate on His eternal kingdom, it will help us develop a right expectation of things that count for eternity and hold greater importance in this life.\n\n\"While we look not at the things which are seen, but at the things which are not seen: for the things which are seen are temporal; but the things which are not seen are eternal\" [2 Corinthians 4:18]. This constant reminder will keep our hearts and minds oriented toward serving our Lord Jesus Christ in everything. Let us meditate on the eternal Kingdom of God this day, remembering that all will not be set right until our Lord returns again. Meanwhile, He strengthens us to press on.",
        "part6": "PRAYER",
        "part7": "Father in heaven, may our hearts be set on the things which count for eternity. Grant us faith and discernment for Your truth. In Jesus' name, Amen.",
        "part8": [
            "2 CHRONICLES 18",
            "REVELATION 7"
        ]
    },
    "17 DECEMBER": {
        "part1": "2 Samuel 23:2-3",
        "part2": "Process of communication",
        "part3": "VERSE 3",
        "part4": "The God of Israel said, the Rock of Israel spake to me, He that ruleth over men must be just, ruling in the fear of God.",
        "part5": "The inspired words of prophecy recorded by David was the Spirit of God speaking through him. He and other holy men of God spoke and wrote as they were moved by the Holy Ghost - \"Knowing this first, that no prophecy of the scripture is of any private interpretation. For the prophecy came not in old time by the will of man: but holy men of God spake as they were moved by the Holy Ghost\" [2 Peter 1:20-21].\n\nVerses 2 and 3 stamp the prophecy with a fourfold mark of divine inspiration:",
        "part6": "THOUGHT",
        "part7": "1. The Spirit of the Lord spake by me. 2. His word was in my tongue. 3. The God of Israel said. 4. The Rock of Israel spake to me.  This is a such a remarkable introduction as we look forward to what will be declared. We note that it is the 'Rock of Israel' who gives this declaration. He is the strength, defense and protector of His chosen people, Israel. He is our protector and defender too because in our Lord Jesus Christ, we are also God's chosen. Knowing the origin of these words must surely give us great assurance and comfort. They hold true, and stand fast in might and authority because its foundation is the Rock. There is perfect reliability on what God has declared.     The works of His hands are verity and judgment; all His commandments are sure. - Psalm 111:7",
        "part8": [
            "2 CHRONICLES 19-20",
            "REVELATION 8"
        ]
    },
    "18 DECEMBER": {
        "part1": "2 Samuel 23:3b-4",
        "part2": "David as ruler",
        "part3": "VERSE 4",
        "part4": "And he shall be as the light of the morning, when the sun riseth, even a morning without clouds; as the tender grass springing out of the earth by clear shining after rain.",
        "part5": "At the outset, we consider the subject of the prophecy - an earthly ruler over men. David describes the ideals of a king, \"He that ruleth over men must be just, ruling in the fear of God\" [v. 3]. A king should rule his subjects with justice. He is controlled and guided by the fear of God. Despite David's notable shortcomings, he was one who led Israel in accordance with God's justice. Likewise, we must thank God if we have earthly rulers who fear the Lord, who wield their authority in truth and righteousness.\n\nThe result of such benevolent leadership will be the blessings described picturesquely here as the life-giving sun's rays on a cloudless morning and the lush green fields springing up from the abundant sunshine and rain.\n\nBeyond this earthly monarch, we are assured of a greater Ruler who is not merely a ruler over a nation but a ruler over all men. This ruler's authority is not limited by earthly boundaries but prevails over all His creatures and creation. The distinct attribute of this Ruler is 'righteousness'. David's prophecy points to none other than the Messiah, our Lord Jesus Christ, the King of kings and Lord of lords. Through His righteousness, the just and holy King has redeemed us. Unlike the temporal blessings earthly rulers promise, our Lord Jesus Christ is the eternal light of the morning, and as His people we spring forth with great eternal joy. Question is: Do you belong to this Kingdom?",
        "part6": "PRAYER",
        "part7": "Father in heaven, we look forward to the return of our Messiah. While He tarries in His return, may we be found faithful. In Jesus' name, Amen.",
        "part8": [
            "2 CHRONICLES 21",
            "REVELATION 9"
        ]
    },
    "19 DECEMBER": {
        "part1": "2 Samuel 23:5",
        "part2": "The Davidic Covenant",
        "part3": "VERSE 5",
        "part4": "Although my house be not so with God; yet He hath made with me an everlasting covenant, ordered in all things, and sure: for this is all my salvation, and all my desire, although He make it not to grow.",
        "part5": "Looking back at his life, David had his regrets. There were times when he and his house had failed God's calling to be wise and godly. Yet David knew one important truth - had it not been for God's covenantal love, he and his descendants would be lost forever.\n\nDavid points us here to the covenant which God made with him in 2 Samuel 7:13-16, usually referred to as the Davidic covenant. God promised to establish the throne of his house forever. Indeed, there will be times when his descendants commit great iniquity, but God has promised that He will, after a period of right chastening, shower mercy upon them. God will preserve the Davidic line and this is the hope of the dying David - a steadfast hope in God Who orders the steps of a good man and upholds him with His hands [Psalm 37:23-24], Who is his salvation [Psalm 27:1] and his only desire [Psalm 27:4].\n\nYet David did not possess the full revelation of God's redemption plan. The reason the Davidic line was preserved was because the Messiah would be born to this house. That is why even when the kings of Judah after David were faithless, God remained faithful. He is faithful to His own covenant and will to establish the house of David.\n\nBelievers in the Lord Jesus Christ today inherit the blessings of the Davidic Covenant. Those who believe in the Lord Jesus are adopted into His kingdom to be co-heirs with Him, inheriting everlasting life and every spiritual blessing. Today, we have a better hope than David, so all the more we should echo David's praises of God's faithfulness.",
        "part6": "THOUGHT",
        "part7": "Thy mercy, O LORD, is in the heavens; and Thy faithfulness reacheth unto the clouds. - Psalm 36:5",
        "part8": [
            "2 CHRONICLES 22-23",
            "REVELATION 10"
        ]
    },
    "20 DECEMBER": {
        "part1": "2 Samuel 23:6-7",
        "part2": "Condemnation of the wicked  VERSES 6-7 But the sons of Belial shall be all of them as thorns thrust away, because they cannot be taken with hands: But the man that shall touch them must be fenced with iron and the staff of a spear; and they shall be utterly burned with  fire in the same place.  To CompLtete THE BiBLe",
        "part3": "",
        "part4": "But the sons of Belial shall be all of them as thorns thrust away, because they cannot be taken with hands: But the man that shall touch them must be fenced with iron and the staff of a spear; and they shall be utterly burned with fire in the same place.",
        "part5": "This section on David's last words concludes with a description of what will happen to the sons of Belial - worthless and wicked people who deny God. Like thorns which prick and injure those touching them, these unworthy people will be cast away. Yet they will put up a last struggle before they suffer their fate, that is to be burned with fire and destroyed in their place of mischief. Those who handle them must be well-protected.\n\nThis description reminds us of what will happen at the Great White Throne Judgement [Revelation 20:15]. The contrast in destinies between the saints and the sinners, found throughout the Bible, is again made clear. It serves both as a clear warning to the wicked, and an encouragement to the one who is wondering why the wicked seem to triumph, and the righteous suffer wrong. Indeed, the judgement of God, like His love for us, sings of His glory.\n\nThank God for His grace and mercy, for He has saved us out of darkness into His marvellous light. He has not abandoned us in our depravity but took away our stony heart and replaced it with a heart of flesh. Let us therefore eschew the wicked ways, for \"Blessed is the man that walketh not in the counsel of the ungodly, nor standeth in the way of sinners, nor sitteth in the seat of the scornful. But his delight is in the law of the LORD; and in his law doth he meditate day and night. And he shall be like a tree planted by the rivers of water, that bringeth forth his fruit in his season; his leaf also shall not wither; and whatsoever he doeth shall prosper\" [Psalm 1:1-3].",
        "part6": "THOUGHT",
        "part7": "Be ye not unequally yoked together with unbelievers: for what fellowship hath righteousness with unrighteousness? and what communion hath light with darkness? And what concord hath Christ with Belial? or what part hath he that believeth with an infidel? - 2 Corinthians 6:14-15",
        "part8": [
            "2 CHRONICLES 24",
            "REVELATION 11"
        ]
    },
    "21 DECEMBER": {
        "part1": "2 Samuel 23:8-12",
        "part2": "Three mighty men  VERSES 8a, 12b These be the names of the  mighty men whom David had:  ... and the LORD wrought a great victory.  To CompLtete THE BiBLe",
        "part3": "",
        "part4": "These be the names of the mighty men whom David had: ... and the LORD wrought a great victory.",
        "part5": "From verse 8, David listed the \"mighty men\" and their courageous deeds. These were the warriors who stood alongside David through good times and bad. Three names were mentioned - Adino the Eznite, Eleazar the son of Dodo the Ahohite, and Shammah the son of Agee the Hararite. These were men of great courage and ability. These were men who were committed not just to David but also to God's work. They did not abandon David when he was old; neither did they switch their loyalties when he was weak. These men stood together with David for the LORD.\n\nDavid had his mighty men. Paul had his co- labourers. In his epistles, Paul named his co- labourers - Aquila and Priscilla who for the work of the Gospel \"laid down their own necks\" [Romans 16:4]; Epaphroditus who ministered to Paul in prison [Philippians 2:25]. The work of the Gospel is too heavy for one person to carry. In his last letter, Paul lamented he was abandoned; no one stood with him; only Luke was with him, and he longed for the company of Mark [2 Timothy 4:11, 16]. Yes, the Lord Jesus stood with Paul and strengthened him [2 Timothy 4:16-17], but we should not discount the value of the fellowship of saints.\n\nSolomon wrote: \"Two are better than one ... if two lie together, then they have heat: but how can one be warm alone? And if one prevail against him, two shall withstand him; and a threefold cord is not quickly broken\" [Ecclesiastes 4:9-12]. This begs the question: Are you committed to the Lord Jesus Christ? Are you committed to your church? Are you a co-labourer in the Gospel ministry? Are you a companion or a complainer to your pastor? Pray for him. Co-labour with him. Be a mighty man/woman in the work of the Gospel.",
        "part6": "THOUGHT",
        "part7": "Stand fast in one spirit, with one mind striving together for the faith of the Gospel. - Philippians 1:27b",
        "part8": [
            "2 CHRONICLES 25",
            "REVELATION 12"
        ]
    },
    "22 DECEMBER": {
        "part1": "2 Samuel 23:13-17",
        "part2": "Other mighty men",
        "part3": "VERSE 17",
        "part4": "And he said, Be it far from me, O LORD, that I should do this: is not this the blood of the men that went in jeopardy of their lives? therefore he would not drink it. These things did these three mighty men.",
        "part5": "Our passage continues the honour roll to commend three unidentified mighty men of David. David was hiding in the cave of Adullam, and a Philistine garrison occupied his hometown Bethlehem. In this difficult moment, David made a remark out of homesickness and longing for his home only to be surprised as these three men heard it and risked their lives to collect some water from the well of Bethlehem for him.\n\nDavid responded to their act of dedication and courage by pouring out the water before Yahweh in an act of worship. In David's eyes, the water represented the blood of the men who risked their lives, and this offering belonged to God alone.\n\nThe author did not reveal the names of the three, but the king knew who they were. Likewise, our efforts in serving our King may not be penned on paper or engraved in stone. Loving acts performed in the name of the Lord Jesus Christ may even be forgotten over time by the people to whom love has been shown. But rest assured, God knows, and He does not forget.\n\nCrave not the attention and commendation of men, but only that of God. When we are unappreciated for all the hard work we have expended, look only to Him and wait expectantly for that promised day when He will say: \"Well done, good and faithful servant; you were faithful over a few things, I will make you ruler over many things. Enter into the joy of your lord.\"\n\nThe Master knows His servants and all they have done for Him.",
        "part6": "THOUGHT",
        "part7": "Do we care more about present human recognition or the recognition that God will give in Eternity?",
        "part8": [
            "2 CHRONICLES 26",
            "REVELATION 13"
        ]
    },
    "23 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 20a \"mighty man\".",
        "part4": "And Benaiah the son of Jehoiada, the son of a valiant man, of Kabzeel, who had done many acts ...",
        "part5": "The focus of today's devotion is on Benaiah, a mighty man of God. The author listed some of his valiant acts here. He slew two strong and fierce Moabites; he slew a lion in a pit in winter and he slew a fearsome Egyptian [1 Chronicles 11:23] with his own spear. There might be other exploits, but the author listed only three to show why Benaiah was considered worthy to be called a \"mighty man\".\n\nIf we delve a bit deeper, we will see that this man had a name which relates to \"Yahweh\". A direct translation of Benaiah's name is \"Yahweh hath built up\", meaning it was God Himself who gave strength for Benaiah's exploits. The author commended Benaiah for these valiant acts, but from the meaning of his name alone, all glory really can be directed to Whom it truly belongs - God Himself.\n\n(Thank God) we may not be called to take a weapon from our enemy's hands to kill him with it, but as we drive to work, attend classes in school, help a friend in need, take our children to the zoo, do our lives reflect \"Yahweh's presence\" in us? We really do not need a name which declares \"Yahweh hath built up\" to glorify Him. We can do it in our daily lives and actions. But in order to do so, we must first realize the strength that allows us to live and breathe everyday comes from Him. We need to look daily to Him in His Word and prayer to draw strength from above. Then only can we truly declare that our strength comes from God, and He is helping us to live for Him.",
        "part6": "",
        "part7": "Do we realise that God gives us strength everyday to get out of bed to live this life on earth for Him?",
        "part8": []
    },
    "24 DECEMBER": {
        "part1": "2 Samuel 23:24-39",
        "part2": "The thirty honourable men",
        "part3": "VERSE 39b",
        "part4": "... thirty and seven in all.",
        "part5": "\"The thirty\" was a collective way of describing the roster of David's mighty men and not its precise number. Each name listed here contributed valiantly to David's kingdom, and because David is Yahweh's chosen king, these men were in fact serving Yahweh. These were loyal men who fought well for God's kingdom.\n\nAs you read today's passage you may be thinking to yourself: \"Wait ... it's Christmas Eve, why am I reading a list of names which I know nothing of ? Should I not just take a cursory glance at this list?\"\n\nRealize that these gallant men's names were preserved in God's book for generations to read and remember. God does not forget the deeds that were done for His kingdom.\n\nLikewise, if we are faithful and persevering in serving our Lord, our names will also be written down, only in an even better book, the Lamb's book of Life. This passage reassures us that our God is a faithful God who remembers and commends His faithful servants. Even though these names are foreign to us, may they give us encouragement that one day, when that book is opened and the roll is called up yonder, our names will be there.\n\nWe may sometimes find life on earth tiring and meaningless. Wicked people appear to have the edge in the corporate world because they have access to the devil's armoury of tricks and devices. Those who profess the Lord Jesus Christ seem to 'lose out', but remember, this earth is not our home, and we are just passing through. Our vindication and the real living lie ahead of us because our names are written in the book of Life, and we will finally spend eternity with our Creator forever.",
        "part6": "THOUGHT",
        "part7": "How much do I desire for my name to be in the book of Life? Then confess the Lord Jesus Christ as your Lord and Saviour. Am I now living my life in such a way that says my name is written in that book?",
        "part8": [
            "2 CHRONICLES 29",
            "REVELATION 15"
        ]
    },
    "25 DECEMBER": {
        "part1": "2 Samuel 24:1-4",
        "part2": "David's pride and Joab's warning",
        "part3": "VERSE 1",
        "part4": "And again the anger of the LORD was kindled against Israel, and he moved David against them to say, Go, number Israel and Judah.",
        "part5": "It appears pride had crept into David's heart and the Lord permitted David to have his way in counting the number of Israel's fighting men. While we are unable to peer into David's heart to know his true intentions, the passage clearly informs that this was a sinful act permitted by God for purposes known to Him alone.\n\nJoab tried to dissuade David from carrying out this senseless census, but David was insistent. Joab and his captains then went throughout the land to number the people. How many times have we also cast aside the small voice in our conscience telling us to desist and flee from involvement in sin but we did it anyway?\n\nBeloved, beware of pride and wilfulness in our lives. Reflect often and keep careful watch over our dark hearts where sin may lurk. Engage in frequent repentance. If, like David we persist in our sin despite the warnings of the Holy Spirit, God may allow us to have our way only to suffer its consequences later.\n\nFor God's people however, His punishment is really 'loving discipline'. He would rather cause us momentary physical or emotional pain, than have us condemned for all eternity. Regardless of what God's purpose is for allowing sin and chastisement in your life, remember He is a merciful God. God displays His mercy by rescuing us from sin. When we are out of fellowship with Him, sometimes He brings about our deliverance through the sacrifice of temporal conveniences and even physical pain.",
        "part6": "THOUGHT",
        "part7": "Our God is always loving and merciful towards us whatever our circumstances may be. Always.",
        "part8": [
            "2 CHRONICLES 30",
            "REVELATION 16"
        ]
    },
    "26 DECEMBER": {
        "part1": "2 Samuel 24:5-9",
        "part2": "The cursed census",
        "part3": "VERSE 9",
        "part4": "And Joab gave up the sum of the number of the people unto the king: and there were in Israel eight hundred thousand valiant men that drew the sword; and the men of Judah were five hundred thousand men.",
        "part5": "We saw previously how God allowed David to be moved to conduct the census, even though David would regret doing it because it was sinful. Although not explicitly revealed why God was displeased, we know from 1 Chronicles 21:1 that the devil was complicit in the decision of the king. Even Joab had his reservations though he proceeded to carry out the census as David ordered. Could Joab have had done otherwise? It would be to the detriment of his personal safety and position as King David's right-hand man. Today's passage shows us how human government is fallible and imperfect. Nations and national leaders make decisions every day, and often because of man's sinful nature, the decisions are bad. As a result, we hear of troubles in many places. In history, the world suffered two world wars, and many other conflicts where innocent people are affected, even killed. Bad decisions are made by selfish and self-centred leaders without the conscience to realise their erroneous thinking; and by conceited rulers with misplaced notions of greatness and power because of the positions God has placed them in. We live in perilous times in an uncertain world. As God's children, let us be reminded we should not be part of the problem in this world, but rather to be witnesses and messengers for our Lord Jesus Christ, whose sole purpose for coming to this world was to save mankind from God's judgement upon a sin-cursed world.",
        "part6": "THOUGHT",
        "part7": "We ought to obey God rather than men. - Acts 5:29b",
        "part8": [
            "2 CHRONICLES 31",
            "REVELATION 17"
        ]
    },
    "27 DECEMBER": {
        "part1": "2 Samuel 24:10",
        "part2": "David's sensitivity to sin",
        "part3": "VERSE 10",
        "part4": "And David's heart smote him after that he had numbered the people. And David said unto the LORD, I have sinned greatly in that I have done: and now, I beseech Thee, O LORD, take away the iniquity of Thy servant; for I have done very foolishly.",
        "part5": "After Joab returned with the results, David's heart was pricked by the guilt of wrongdoing. David confessed to the Lord in contrition and sought His forgiveness for his foolish transgression. Though chosen and anointed by God, his human nature was still prone to sin, but David was quick to realize his iniquities, and quicker still to go to the Lord for forgiveness.\n\nToday's passage teaches us several precious lessons. The first, even though we are all saved when we confess our sins to the Lord, we, like David, are still weak and struggle with besetting sins in our lives. Let us realize we are all sinners and while still clothed in earthly flesh, we must contend daily with the temptations of sin in our lives. Like Paul (and David), we cry daily, \"O wretched man that I am! who shall deliver me from the body of this death?\" [Romans 7:24].\n\nThe second, as Christians having confessed and committed our sins to the Lord, we must still go each time to Him with humble and repentant hearts when we transgress. Our God is a loving and faithful God. If we truly repent, and forsake our sins, then He is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness [1 John 1:9]. What wonderful grace from our heavenly Father! Let us therefore, boldly go before the throne of grace, to obtain mercy, and to find grace when we are tempted [Hebrews 4:16].",
        "part6": "THOUGHT",
        "part7": "For we have not an high priest which cannot be touched with the feeling of our infirmities; but was in all points tempted like as we are, yet without sin. - Hebrews 4:15",
        "part8": [
            "2 CHRONICLES 32",
            "REVELATION 18"
        ]
    },
    "28 DECEMBER": {
        "part1": "2 Samuel 24:11-14",
        "part2": "No good options",
        "part3": "VERSE 13",
        "part4": "So Gad came to David, and told him, and said unto him, Shall seven years of famine come unto thee in thy land? or wilt thou flee three months before thine enemies, while they pursue thee? or that there be three days' pestilence in thy land? now advise, and see what answer I shall return to Him that sent me.",
        "part5": "In response to David's confession, the Lord's judgement was pronounced by the prophet Gad. David had three choices: endure seven years of famine in the land, be pursued for three months by his enemies, or suffer three days of pestilence. As Israel's king, all three were detrimental to the kingdom, but David had to choose one.\n\nAt times, we too have difficult decisions to make. It may not be as harmful or deadly as David's choices, but nonetheless, they are difficult ones. One thing we must ask ourselves and search our hearts is whether these choices were the consequence of our sinful actions, as in David's case. Did we obey the Lord fully in our daily lives and life choices? And even if we have not transgressed, realize God may allow difficult situations in our lives without giving us the reason until we meet Him in our heavenly home.\n\nWhat then? Shall we question God and be angry at Him? No, because we know and Scripture affirms that our God is compassionate and He always works things out for the good of those who love Him. We persevere and trust in His goodness and faithfulness to see us through whatever difficult situations we may be put in. Like David, our response to difficult choices should be: \"... let us fall now into the hand of the LORD; for His mercies are great: and let me not fall into the hand of man\" [v. 14]. So trust God and not rely on human wisdom, especially our own.",
        "part6": "THOUGHT",
        "part7": "Trust in the LORD with all thine heart; and lean not unto thine own understanding. In all thy ways acknowledge Him, and He shall direct thy paths. - Proverbs 3:5-6",
        "part8": [
            "2 CHRONICLES 33",
            "REVELATION 19"
        ]
    },
    "29 DECEMBER": {
        "part1": "2 Samuel 24:15-17",
        "part2": "No way out",
        "part3": "VERSE 15",
        "part4": "So the LORD sent a pestilence upon Israel from the morning even to the time appointed: and there died of the people from Dan even to Beersheba seventy thousand men.",
        "part5": "Although David chose the punishment with the shortest duration of suffering, no King desires to see his people suffer and die. David pleaded with God to lay the punishment upon himself and his family for it was David who originally ordered the numbering of the people [v. 17]. And though David's sin was the immediate cause, the great increase of national offenses at this time had kindled the anger of the Lord [2 Samuel 24:1]. The irony is that David's sinful action of numbering the people was punished by the mass deaths caused by the pestilence. And if it were not for the mercy of God, more would have died [v. 16]. We must remember that sin must be punished. There is no way out; no way for David to escape God's punishment by compensating with good works or past merits. Sin will be punished. Due to man's wickedness God sent a global flood to wipe out all but eight people. Adam and Eve were punished for eating the forbidden fruit. David was punished for committing adultery. Does God punish each and every sin we commit? Yes! Although there may not be an immediate punishment directly following our sins, ultimately they are punishable by our eternal damnation. Yet the God of grace deemed it such that His only begotten Son would take the penalty for us on the cross. God's wrath towards sin was not withdrawn but placed instead upon the Lord Jesus. It was on the cross that His wrath was appeased, and our sins forgiven.",
        "part6": "THOUGHT",
        "part7": "Hallelujah for \"God hath not appointed us to wrath, but to obtain salvation by our Lord Jesus Christ\" [1 Thessalonians 5:9].",
        "part8": [
            "2 CHRONICLES 34",
            "REVELATION 20"
        ]
    },
    "30 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 19 LORD commanded', not as David commanded",
        "part4": "And David, according to the saying of Gad, went up as the LORD commanded.",
        "part5": "Imagine that to honour mother on Mother's Day, you decided to treat her to a meal at a fancy restaurant. It would be selfish if the selection of cuisine was according to your preference and not hers. The same principle applies to our worshipping God. Worship is for God, not man. And God has not left us in the dark as to how we should worship Him, but He has showed us His desire.\n\nThe operative phrase in verse 19 is \"as the LORD commanded\", not as David commanded and not as Gad commanded. The incident of the golden calf exemplifies for us that worship cannot be according to our preferences. Worship that deviates from Scripture is termed as \"strange fire\" [Leviticus 10:1]. God's Word should dictate our worship.\n\nThe \"regulative\" principle of worship is worship that is founded upon the instructions of Scripture. We know from Scripture that worship contains the \"reading, (and) exhortation\" of God's Word [1 Timothy 4:13]; and the singing of \"psalms and hymns and spiritual songs\" [Ephesians 5:19]. Although Scripture is silent on the circumstances of worship (length of time, start time, order of worship etc ...) we should follow the principle given to the church at Corinth that \"all things be done decently and in order\" [1 Corinthians 14:40]. When we worship as God instructed, then our worship will rise as a sweet-smelling savour.",
        "part6": "",
        "part7": "If our whole life is to be lived according to the rule of Scripture, why should our worship be any different?",
        "part8": [
            "2 CHRONICLES 35",
            "REVELATION 21",
            "THOUGHT If our whole life is to be lived according to the",
            "rule of Scripture, why should our worship be any",
            "different?"
        ]
    },
    "31 DECEMBER": {
        "part1": "2 Samuel 24:20-25",
        "part2": "Worship that costs something",
        "part3": "VERSE 24",
        "part4": "And the king said unto Araunah, Nay; but I will surely buy it of thee at a price: neither will I offer burnt offerings unto the LORD my God of that which doth cost me nothing. So David bought the threshingfloor and the oxen for fifty shekels of silver.",
        "part5": "Picture yourself returning home from a restaurant meal with a full belly and leftovers in hand, and you meet a homeless man on the streets. There you sacrifice your leftovers and hand the extra food to him. What did it cost you? Did you suffer hunger because you gave away your leftovers? Did you have to pay extra for the leftovers? No. Your \"sacrifice\" came at no cost. They were mere leftovers.\n\nDavid, however, knew that all genuine sacrifice comes at a price. To offer the Lord burnt offerings that cost him nothing would have been to David a sign of the deepest ingratitude. Although the owner offered them to David for free, he paid for the threshing floor, oxen and wood so that he could build a worthy altar to God. The woman who broke the costly jar of perfume and anointed the Lord Jesus in Mark 14 did so in worshipping Him. The wise men that travelled from afar came bearing valuable gifts of gold, myrrh and frankincense.\n\nIndeed, genuine worship comes at a price. It may require our time and commitment in service. It may require our money for the furtherance of the Gospel work. It may require our gifts and talents in the ministry. Worship is costly and requires our personal sacrifice not because God needs our sacrifice and money but because God is worth it. David worships God because in Him there is forgiveness and mercy in the abatement of the pestilence. Likewise, we worship God because in Him there is eternal life and victory over sin for us at the cross.",
        "part6": "THOUGHT",
        "part7": "What have you \"sacrificed\" in worship?",
        "part8": [
            "2 CHRONICLES 36",
            "REVELATION 22"
        ]
    }
}