{
    "1 JULY": {
        "part1": "Romans 9:28",
        "part2": "He will finish the work",
        "part3": "VERSE 28",
        "part4": "For he will finish the work, and cut it short in righteousness: because a short work will the Lord make upon the earth.",
        "part5": "From the context of verses 22 to 29, Paul is talking about the work that God will finish. It has to do with unleashing His holy wrath on sins after holding it back from the unbelieving Jews. The quotations in verse 25 from Hosea and verse 27 from Isaiah, point to the fact that even though the children of Israel would be numerous as \"the sand of the sea\", only a remnant would be saved because most had rejected the Lord Jesus and saw their nationality as guaranteeing God's favour.\n\nTo be saved these Jews demanded that \"except ye be circumcised after the manner of Moses, ye cannot be saved\" [Acts 15:1b]. But the truth is that even a circumcised Jew could not keep the law of Moses for their salvation. The only way is to accept the Lord Jesus as their Saviour and the Promised Messiah by faith, which only a remnant did as recipients of God's election grace.\n\nAs for the unbelieving Jews, God \"will finish the work, and cut it short in righteousness ... upon the earth\", meaning He will speedily carry out His righteous judgment upon an unbelieving Jewish nation. This is a warning that no one can escape if they reject Christ. The only reason judgment is delayed is because \"the Lord is not slack concerning his promise, as some men count slackness; but is longsuffering to us-ward, not willing that any should perish, but that all should come to repentance\" [2 Peter 3:9]. God will finish His work in His time. He is the Righteous Judge of all the earth. Amen.",
        "part6": "THOUGHT",
        "part7": "For all the promises of God in him are yea, and in him Amen, unto the glory of God by us. - 2 Corinthians 1:20",
        "part8": [
            "JOSHUA 1",
            "PSALMS 126-128"
        ]
    }
}