{
    "1 JULY": {
        "part1": "Romans 4:8",
        "part2": "Blessed Positive",
        "part3": "VERSE 8",
        "part4": "Blessed is the man to whom the Lord will not impute sin.",
        "part5": "Who is a blessed man? The man who is blessed is truly happy. This is because the Lord will not impute his sin to him. The word \"impute\" means to attribute or \"put on his account\". \"Not to impute sin\" means his sins are not counted and no charges are laid against him even though he deserves it. But how is that possible? Did the Bible not say \"The soul that sinneth, it shall die\" [Ezekiel 18:20a] and \"The wages of sin is death\" [Romans 6:23a]? The remuneration for sin is death. Sin offers temporal pleasure but exacts a heavy price of guilt and misery. Sin drives us by the lust of the flesh, the lust of the eyes and the pride of life. It tempts, deceives and ensnares us to face God's wrath. Every sin committed actively in disobedience or passively in defiance will be punished. Ultimately sin requires of every sinner the highest price - death and eternal separation from God in hell. Hebrews 9:27 says, \"And as it is appointed unto men once to die, but after this the judgment\". This is the bad news.\n\nBut there is hope for the sinner if he realizes how heinous sin is and flees to one who can save. Jesus Christ the sinless God-Man came into the world to save sinners. On the cross He shed His precious blood and opened the only way for sinners to be reconciled to God. This is the Gospel, the good news of sins forgiven and life everlasting given to everyone who truly turns from the way of sin to Christ. Blessed is this man who has heard and responded to this for his sins are not imputed to him. Have you?",
        "part6": "THOUGHT",
        "part7": "For Christ also hath once suffered for sins, the just for the unjust, that he might bring us to God, being put to death in the flesh, but quickened by the Spirit. - 1 Peter 3:18.",
        "part8": [
            "JEREMIAH 22",
            "2 CORINTHIANS 1"
        ]
    },
    "2 JULY": {
        "part1": "Romans 4:8",
        "part2": "Doctrine of Imputation",
        "part3": "VERSE 8",
        "part4": "Blessed is the man to whom the Lord will not impute sin.",
        "part5": "The theological doctrine of imputation is the vicarious attribution of sin, guilt, or righteousness of a person to another. On one hand, through the sin of Adam, sin and death were imputed to all men - \"Wherefore, as by one man sin entered into the world, and death by sin; and so death passed upon all men, for that all have sinned\" [Romans 5:12]. On the other, through the atoning death of Christ on the cross, righteousness came upon many - \" ... much more the grace of God, and the gift by grace, which is by one man, Jesus Christ, hath abounded unto many\" [Romans 5:15b].\n\nBy imputation we see how a sinner is forgiven of his sins and receives salvation by grace through faith in the Lord Jesus Christ. This is how it works. The hearing of God's Word convicts of sin and produces faith in sinners to turn to Christ for forgiveness and saving grace. This is the essence of salvation wrought in Christ Jesus. When I trust Him to be my Saviour, He takes my sins upon Himself and clothes me with His righteousness. My sins are imputed to Christ and His righteousness imputed to me. The sinless Son of God took my sins and His righteousness became mine so I can now stand justified before God the Father. \"For Christ also hath once suffered for sins, the just for the unjust, that He might bring us to God\" [1 Peter 3:18a].\n\nThe doctrine of imputation is realized and effected in the substitutionary death of the Lord Jesus for our sins. This truth should fill our hearts with awe and gratitude to surrender our lives to God and wholeheartedly worship Him.",
        "part6": "THOUGHT",
        "part7": "For as by one man's disobedience many were made sinners, so by the obedience of one shall many be made righteous. - Romans 5:19",
        "part8": [
            "JEREMIAH 23",
            "2 CORINTHIANS 2"
        ]
    },
    "3 JULY": {
        "part1": "Romans 4:9",
        "part2": "Scope of Blessedness",
        "part3": "VERSE 9",
        "part4": "Cometh this blessedness then upon the circumcision only, or upon the uncircumcision also? for we say that faith was reckoned to Abraham for righteousness.",
        "part5": "The question is asked here whether the blessing of forgiveness of sin is available only to the circumcised (the mark of Israel as God's chosen people) or also to all peoples even uncircumcised Gentiles (non-Jews). The answer - it is available to all, both Jews and Gentiles. In Genesis 12:3 when God called Abram to leave Ur, God promised to bless him. \"And I will bless them that bless thee, and curse him that curseth thee: and in thee shall all families of the earth be blessed\". \"In thee shall all the families of the earth\" speaks of God's purpose that the blessings of salvation through the Gospel of Jesus Christ is for all the world. It is clear from God's Word to Ananias concerning Paul's calling to apostleship in Act 9:15b: \" ... he is a chosen vessel unto me, to bear my name before the Gentiles, and kings, and the children of Israel.\" Moreover, Paul himself said \"Whereunto I am ordained a preacher, and an apostle, ... a teacher of the Gentiles in faith and verity\" [1 Timothy 2:7].\n\nThe scope of our Gospel ministry is the people in the world. The challenge for us is to go into all the world and preach the Gospel in obedience to the Great Commission of our Lord in Matthew 28:18-20. When was the last time you witnessed to someone that Jesus Christ came to save them? Truly, the harvest is plenteous but the labourers are few. Will you pray for them and tell them the Gospel so they might be saved by grace and enjoy this eternal blessedness? May the love of God constrain us.",
        "part6": "THOUGHT",
        "part7": "For I am not ashamed of the Gospel of Christ: for it is the power of God unto salvation to every one that believeth; to the Jew first, and also to the Greek. - Romans 1:16",
        "part8": [
            "JEREMIAH 24",
            "2 CORINTHIANS 3"
        ]
    },
    "4 JULY": {
        "part1": "Romans 4:9",
        "part2": "When was Abraham's Faith Reckoned?",
        "part3": "VERSE 9",
        "part4": "Cometh this blessedness then upon the circumcision only, or upon the uncircumcision also? for we say that faith was reckoned to Abraham for righteousness.",
        "part5": "When was Abraham's faith in God counted to him for righteousness? At what point did Abraham believe and was saved? Was it when he was circumcised? Did circumcision save him? The answer is vital because the Jews in the New Testament believed that circumcision is equivalent to salvation. While it is true that circumcision was a unique mark that set the Jews apart from all others as God's people, it could not save them because physical circumcision could not bring about the change of heart that only faith in God could.\n\nThis is precisely how Abraham was saved by his faith in God. Before his circumcision, he was already declared righteous. This is validated by the chronology of events. Abraham was first given God's covenant promise when he was 75 years old [Genesis 12:1-4]. In Genesis 15:6, just before Ishmael was born, Abraham believed in the LORD and He counted it to him for righteousness. Genesis 16:16 informs that Abraham was 86 years old when Ishmael was born. And at 99, Abraham was circumcised ... fourteen years after he was declared righteous by God [Genesis 17:24].\n\nToday the same truth applies. Circumcision in the Old Testament points towards the sacrament of Baptism in the New Testament. Like circumcision, baptism cannot save. Faith alone in Jesus Christ saves. Why then be baptized if you have already put your faith in Christ as your Lord and Saviour? Well, true faith obeys God's Word by submitting to Christ and confessing Him publicly through Baptism that you belong to Him. This clarifies that a person is saved and the significance of Baptism. Having received Christ, are you baptized?",
        "part6": "THOUGHT",
        "part7": "Whosoever therefore shall be ashamed of me and of my words in this adulterous and sinful generation; of him also shall the Son of man be ashamed, when he cometh in the glory of his Father with the holy angels. - Mark 8:38",
        "part8": [
            "JEREMIAH 25",
            "2 CORINTHIANS 4"
        ]
    },
    "5 JULY": {
        "part1": "Romans 4:10",
        "part2": "How was Abraham's Faith Reckoned?",
        "part3": "VERSE 10",
        "part4": "How was it then reckoned? when he was in circumcision, or in uncircumcision? Not in circumcision, but in uncircumcision.",
        "part5": "Regarding when Abraham was saved, Genesis 15:6 tells us when Abraham believed in the LORD, it was counted to him for righteousness. That took place some fourteen years before Abraham's circumcision [Genesis 17:24] and many more years before God's Law was given at Mt Sinai. How then was Abraham saved? There were yet no Ten Commandments for him to keep. Therefore it cannot be said that Abraham was saved by keeping the Law.\n\nSalvation is not by means of trying to keep God's Law. The Law of God reflects the pure holiness of God and no one can keep it. The Law convicts sinners of their sin and their desperate need to flee to the Saviour because only Christ kept God's Law perfectly. Yet man in his spiritual blindness and pride boasts he can earn the merit of God's favour by doing good. Abraham was saved by faith in the promises of God before the Law (the Decalogue) and before circumcision. Abraham believed the covenant promises of God by grace in Genesis 12:1-4. \"He staggered not at the promise of God through unbelief; but was strong in faith, giving glory to God; and being fully persuaded that, what he had promised, he was able also to perform\" [Romans 4:20-21].\n\nAbraham was saved exactly in the way we read in Ephesians 2:8 - \"For by grace are ye saved through faith; and that not of yourselves: it is the gift of God: Not of works, lest any man should boast.\" How were you saved? By grace or by good works? Did your belief that the Lord Jesus died for your sins humble you to repentance and trust only in Him?",
        "part6": "THOUGHT",
        "part7": "That if thou shalt confess with thy mouth the Lord Jesus, and shalt believe in thine heart that God hath raised him from the dead, thou shalt be saved. - Romans 10:9",
        "part8": [
            "JEREMIAH 26",
            "2 CORINTHIANS 5"
        ]
    },
    "6 JULY": {
        "part1": "Romans 4:11",
        "part2": "A God-given Sign",
        "part3": "VERSE 11",
        "part4": "And he received the sign of circumcision, a seal of the righteousness of the faith which he had yet being uncircumcised: that he might be the father of all them that believe, though they be not circumcised; that righteousness might be imputed unto them also.",
        "part5": "The intent of Paul in Romans 4 is to prove the doctrine of salvation by faith from the Old Testament. To do that, Paul appealed to two prominent Old Testament personages in Jewish history - Abraham [v. 1-5] and David [v. 6-8]. If Paul could show that Abraham was counted righteous by God through faith [Romans 4:3], the Apostle would have proven the doctrine of salvation by grace. The doctrine, however, begs the question - why then did God give Abraham the sign of circumcision? What is the point of circumcision, or in our context, water baptism?\n\nVerse 11 contains two important words - \"sign\" and \"seal\". Circumcision is a God-given sign, as is the New Testament sacrament of water baptism. A sign has a two-fold purpose. First, a sign and the thing signified are closely related, but the thing signified is always greater than the sign itself. For example, on the way to the airport, you see a sign that reads \"Airport 10 kilometres\". The sign is not the airport, but it points to the thing signified - the airport. In other words, circumcision points to something greater and more significant, namely the covenant that God established with Abraham on account of what Christ's atoning work did.\n\nSecond, a sign can also indicate ownership. In Levitical law, when a Hebrew servant expressed his desire to serve his master for life, the master would pierce the ear of the servant with an aul [Exodus 21:6]. The servant's pierced ear is a sign of ownership by his master. In the same manner, New Testament baptism - like Old Testament circumcision - marks the believer's identity with and ownership by Christ. Baptism is a way for believers to testify to the world that they now belong to Christ.",
        "part6": "THOUGHT",
        "part7": "For ye are bought with a price: therefore glorify God in your body, and in your spirit, which are God's. - 1 Corinthians 6:20",
        "part8": [
            "JEREMIAH 27",
            "2 CORINTHIANS 6"
        ]
    },
    "7 JULY": {
        "part1": "Romans 4:11",
        "part2": "A Seal of Righteousness",
        "part3": "VERSE 11",
        "part4": "And he received the sign of circumcision, a seal of the righteousness of the faith which he had yet being uncircumcised: that he might be the father of all them that believe, though they be not circumcised; that righteousness might be imputed unto them also.",
        "part5": "Old Testament circumcision and New Testament baptism are covenantal signs; they are also the \"seal of the righteousness of the faith\". In the past, when kings and emperors issued decrees, they marked them with a royal seal, usually a signet ring. The seal served two purposes - to authorize and authenticate. First, when an emperor used a seal, it gave personal authority to the decree, like his signature. Today, seals are used in travel documents such as passports and visas, indicating that the issuing authority stands behind the person who carries that document. Second, a seal also serves the function of a notary public. When copies of a document have the seal \"certified true\", it validates the authenticity of the copies.\n\nSacraments work the same way. In Abraham's case, Paul makes the point that the sign of circumcision was \"a seal of the righteousness of the faith\", which God gave to Abraham after \"he believed in the LORD; and [God] counted it to him for righteousness\" [Genesis 15:6]. Note the nature and timing of the seal. Circumcision was a seal confirming not only the sincerity of Abraham's faith, but also the righteousness imputed to him. This is also seen in the timing of circumcision. Abraham was circumcised after he believed the LORD [Genesis 15:6; 17:10-11], proving he was not justified by his circumcision, but by the righteousness imputed to him before he was circumcised. The New Testament sacrament of baptism works the same way. It marks the baptised person's identity with Christ. Abraham became the proto-example of \"all them that believe\" - Jews and Gentiles. And Abraham became the \"father\" of all believers not because he was the author of our faith but because we have the same kind of faith as he did.",
        "part6": "THOUGHT",
        "part7": "Have you been baptised? Baptism does not save, but it marks your commitment to and identity with Christ.",
        "part8": [
            "JEREMIAH 28",
            "2 CORINTHIANS 7"
        ]
    },
    "8 JULY": {
        "part1": "Romans 4:11",
        "part2": "The Example of Faith",
        "part3": "VERSE 11",
        "part4": "And he received the sign of circumcision, a seal of the righteousness of the faith which he had yet being uncircumcised: that he might be the father of all them that believe, though they be not circumcised; that righteousness might be imputed unto them also.",
        "part5": "Abraham was one of the first two names to be mentioned in Matthew's genealogy of our Lord Jesus. \"The book of the generation of Jesus Christ, the son of David, the son of Abraham.\" [Matthew 1:1]. He was also given the most space in the Hall of Faith - twelve out of forty verses [Hebrews 11:8-19]. It is for good reason that Paul gave him the title - \"the father of all them that believe\". In James, he was called the \"Friend of God\" [James 2:23]. If there is one sentence to describe Abraham, it would be that \"he was a man of faith\".\n\nWhen Abraham left his home in Ur of the Chaldees to move to a land that he did not know and had never seen, he was not suffering from mid-life crisis [Genesis 12:1-9]. He \"obeyed; and went out, not knowing whither he went\" [Hebrews 11:8]. Abraham was already 75 years old when he began his journey of faith with the one true God.\n\nUr of the Chaldees was one of the earliest civilizations in the world. For Abraham to move out of Ur to another place would be like you moving from Singapore to a place you have never heard of. He was exchanging life in an urban city for a nomad's life, living in tents [Hebrews 11:9]. It also meant Abraham was leaving the religion he had been raised in - an idol-worshipping religion [Joshua 24:2] - to embrace a God of whom he had never heard. That is faith.\n\nIn Genesis 15, God promised Abraham the son \"that shall come forth out of thine own bowels shall be thine heir\" [Genesis 15:4-6]. For a man well past his prime, believing that is faith. Abraham's faith is a great reminder that it is never too late to submit to God's plan for your life!",
        "part6": "THOUGHT",
        "part7": "Faith is to take hold of God's promise and resting wholly in Him.",
        "part8": [
            "JEREMIAH 29",
            "2 CORINTHIANS 8"
        ]
    },
    "9 JULY": {
        "part1": "Romans 4:11",
        "part2": "Abraham - Father of the Faithful",
        "part3": "VERSE 11",
        "part4": "And he received the sign of circumcision, a seal of the righteousness of the faith which he had yet being uncircumcised: that he might be the father of all them that believe, though they be not circumcised; that righteousness might be imputed unto them also.",
        "part5": "When Abraham was 75 years old, God promised him that he would be a blessing to all the families of the earth [Genesis 12:3]. Some years later, God promised Abraham that his seed would be as numerous as the stars in the sky [Genesis 15:5]. When Abraham was 99 years old, God again promised that nations and kings would come from him, and God established an everlasting covenant with him [Genesis 17:6-8].\n\nIt was only 25 years after leaving Ur, when he was 100 years old, that Abraham saw the fulfilment of God's promises. That is faith - one that Paul says \"staggered not at the promise of God through unbelief; but was strong in faith, giving glory to God\" [Romans 4:20].\n\nWhen Paul said that Abraham was \"the father of all them that believe, though they were not circumcised\", he did not mean that no one before Abraham was saved. Paul meant by those words that through the faith of Abraham, the way of salvation was made explicitly clear for the first time - that salvation comes by faith in God. Abraham showed what it was to have faith, and he became the father of all who believe. Thus, every believer - Jew and Gentile - can trace our spiritual ancestry to God.\n\nWhat an ancestry that is. The writer of Hebrews reminds us that we \"are compassed about with so great a cloud of witnesses\" [Hebrews 12:1a]. What privileged company we will be in when we get to heaven - some circumcised, many are not, but all saved by the faith as that of Abraham. Having this promise therefore, \"let us lay aside every weight, and the sin which doth so easily beset us, and let us run with patience the race that is set before us\" [Hebrews 12:1b].",
        "part6": "THOUGHT",
        "part7": "Humble yourself before Christ, and you will find yourself in exalted company.",
        "part8": [
            "JEREMIAH 30",
            "2 CORINTHIANS 9"
        ]
    },
    "10 JULY": {
        "part1": "Romans 4:11",
        "part2": "Significance of the Covenantal Sign",
        "part3": "VERSE 11",
        "part4": "And he received the sign of circumcision, a seal of the righteousness of the faith which he had yet being uncircumcised: that he might be the father of all them that believe, though they be not circumcised; that righteousness might be imputed unto them also.",
        "part5": "Having made a covenant with Abraham, some years later, God sealed that covenant with the sign of circumcision. In ancient times, most covenants would have the following elements - preamble identifying the parties of the covenant [Genesis 17:1], promise and provision [Genesis 17:6-7], sanctions [Genesis 17:14], and period [Genesis 17:7-8]. For Abraham and the Israelites, the sign of circumcision reminded them of the indispensable response required of those who bore the sign. The covenantal sign has a vertical dimension. It marks the person as coming under the authority of God, being in subjection to His commandments. It also has a horizontal dimension, pointing to the communal aspect of the covenant. Receiving the sign made one a part of the Abrahamic family, the covenantal community of faith. The special blessings which accompany the covenant are only available to those who bear the covenantal sign; those without the sign are \"cut off \" [Genesis 17:14].\n\nIn the Old Testament, circumcision was never to be regarded as a mere physical act. Moses gave this solemn reminder to the children of Israel, \"Circumcise therefore the foreskin of your heart, and be no more stiffnecked\" (Deuteronomy 10:16; Jeremiah 4:4). The outward sign (Old Testament circumcision and New Testament baptism) is never to be considered apart from an inward reality (read Romans 2:28-29; 9:6-8). Above all, the covenantal sign is a mark of consecration. To be circumcised - an act of obedience in itself - marks one as being whole-heartedly dedicated to God [Deuteronomy 30:6]. Just as God called Israel to keep the covenant, so likewise we - as the people of God - are called to continue in commitment, loyalty, trust and obedience to Him.",
        "part6": "THOUGHT",
        "part7": "The key thing God is after is our commitment to Him. \"Thou shalt keep my covenant ... This is my covenant ...\" [Genesis 17:9-10].",
        "part8": [
            "JEREMIAH 31",
            "2 CORINTHIANS 10"
        ]
    },
    "11 JULY": {
        "part1": "Romans 4:11",
        "part2": "Baptism as a Sign",
        "part3": "VERSE 11",
        "part4": "And he received the sign of circumcision, a seal of the righteousness of the faith which he had yet being uncircumcised: that he might be the father of all them that believe, though they be not circumcised; that righteousness might be imputed unto them also.",
        "part5": "Circumcision, the covenantal sign in the Old Testament, is replaced by baptism in the New Testament. The Westminster Confession of Faith teaches that \"Sacraments are holy signs and seals of the covenant of grace, immediately instituted by God, to represent Christ and His benefits, and to confirm our interest in Him; as also to put a visible difference between those that belong unto the church and the rest of the world; and solemnly to engage them to the service of God in Christ, according to His Word\" (Chapter 27.1).\n\nThe sacrament of baptism is a sign not in the sense that it is a miracle of sorts (cf. John 2:11). There is nothing supernatural in the administration of the sacraments. Baptism is a sign in that it points to some thing beyond the act. In other words, baptism is not redemption in Christ, but it points to the reality of Christ's redemption.\n\nIn warning the Jews against placing their confidence in circumcision, Paul said that just because they were circumcised did not mean they were saved (Romans 2:28-29). Likewise, the outward sign of baptism is not to be equated with the inward regeneration of the heart. The external rite is not a guarantee of internal regeneration. If baptism does not save, why then do we insist on it? First, baptism is God's command, which we must obey. Second, baptism initiates us into a local church in which we must serve and worship. Third, it marks us as separating ourselves unto God from the world to which we are a light bearing the testimony of our Lord Jesus.",
        "part6": "THOUGHT",
        "part7": "While saving grace is not conferred by the act of baptism, A.A. Hodge says that baptism is \"a visible sign of our covenant to be the Lord's and devoted to His service ... it is a public profession of our faith into the Christian Church, and a symbol of our union with our fellow-Christians.\"",
        "part8": [
            "JEREMIAH 32",
            "2 CORINTHIANS 11:1-15"
        ]
    },
    "12 JULY": {
        "part1": "Romans 4:11",
        "part2": "Baptism as a Seal",
        "part3": "VERSE 11",
        "part4": "And he received the sign of circumcision, a seal of the righteousness of the faith which he had yet being uncircumcised: that he might be the father of all them that believe, though they be not circumcised; that righteousness might be imputed unto them also.",
        "part5": "Baptism, as a sacrament, is also a seal of God's promise. The word seal is derived from the practice of formalizing documents. In ancient times, when a contract was made or when the king passed a decree, a small amount of wax was melted on the document and a seal affixed. If it was a decree, the seal would be the king's signet ring. The seal proved the authenticity of the document. Even today, seals are used on important documents, such as diplomas, marriage certificates, etc.\n\nJust as the sign of baptism is not a miraculous act, so the seal of baptism does not make regeneration a reality for the baptised person. Just like a person who has never attended school but buys a diploma off the internet, possession of that piece of paper does not make him a graduate.\n\nBaptism as a seal is a promise to the true believer that he is saved by God's grace alone and through faith alone. And as surely as he has been baptised by water, he can be certain his sins have been cleansed by the precious blood of our Lord Jesus Christ. Water baptism does not do this, but it testifies to the believer the reality of saving grace.\n\nThe real seal is the Holy Spirit. When the Spirit seals us inwardly, God puts His stamp of ownership upon us which indicates that we belong to Him and nothing can change that ownership. This inward seal is signified by the outward sign of baptism. Thus the sacraments - water baptism and the Lord's Supper - are signs and seals of the veracity of God's promises.",
        "part6": "THOUGHT",
        "part7": "Christ has \"sealed us, and given the earnest of the Spirit in our hearts\" [2 Corinthians 1:21-22].",
        "part8": [
            "JEREMIAH 33",
            "2 CORINTHIANS 11:16-33"
        ]
    },
    "13 JULY": {
        "part1": "Romans 4:11",
        "part2": "Old Testament and Infant Baptism",
        "part3": "VERSE 11",
        "part4": "And he received the sign of circumcision, a seal of the righteousness of the faith which he had yet being uncircumcised: that he might be the father of all them that believe, though they be not circumcised; that righteousness might be imputed unto them also.",
        "part5": "When God called Abraham out of the Ur of the Chaldees to a land which He had reserved for him, God gave the promise not only to Abraham but also his children [Genesis 12:7; 13:15-16]. God would seal the covenant with circumcision, the sign that the covenant applied not just to Abraham alone but also to every male child in his household [Genesis 17:7-10]. God said, \"He that is eight days old shall be circumcised among you, every man child in your generations ...\" [Genesis 17:12].\n\nWhile both the sons of Abraham - Ishmael and Isaac - were circumcised [Genesis 17:25], a distinction is made between them. \"God said unto Abraham ... in Isaac shall thy seed be called\" [Genesis 21:12]. This simply means that while God's covenant relationships extended beyond Abraham to his family, with circumcision being the sign of the covenant, not all who were circumcised belonged to the seed of Abraham. Paul made this clear - \"For they are not all Israel, which are of Israel: Neither, because they are the seed of Abraham, are they all children: but, in Isaac shall thy seed be called\" [Romans 9:6-7].\n\nThe same idea applies to infant baptism. It is a sign given to believing parents because God has always dealt with His people through covenant relationships. When children are baptised, it is not an indication they are saved. It also does not mean their salvation is necessarily assured in the future.\n\nWhen parents present their infants for baptism, it is a consecration of the hands and heart and a promise on the part of the parents to nurture the child in the ways of God. In the baptism of our children - who are the \"heritage of the LORD\" - God asks us not simply to trust Him, but to remember that He trusts us with His very own.",
        "part6": "THOUGHT",
        "part7": "Lo, children are an heritage of the LORD: And the fruit of the womb is his reward. - Psalm 127:3",
        "part8": [
            "JEREMIAH 34",
            "2 CORINTHIANS 12"
        ]
    },
    "14 JULY": {
        "part1": "Romans 4:11",
        "part2": "Infant Baptism Defended",
        "part3": "VERSE 11",
        "part4": "And he received the sign of circumcision, a seal of the righteousness of the faith which he had yet being uncircumcised: that he might be the father of all them that believe, though they be not circumcised; that righteousness might be imputed unto them also.",
        "part5": "Presbyterians have been accused of - wrongfully - baptising infants. That is an inaccurate and misleading statement. Presbyterians baptise two groups of people - adults who have confessed Christ as their Saviour and children of Christians. The Westminster Confession of Faith teaches \"Not only those that do actually profess faith in and obedience unto Christ, but also the infants of one or both believing parents, are to be baptized\" (Chapter 28.4).\n\nAbraham believed, and the LORD counted it to him for righteousness. Then, the covenantal sign - circumcision - was given. Abraham was circumcised when he was 99 years old; Ishmael was circumcised when he was 13. Isaac was circumcised at eight days old. What was the spiritual status of Ishmael and Isaac when they were circumcised? They were children of Abraham who believed God. So, on account of Abraham's faith, God entered into a covenant with Abraham's children. In other words, a believer's children are included in the covenant on the basis of the believer's faith.\n\nPresbyterians believe in the continuity of the covenant of grace in the Old and New Testaments, meaning that the covenant is an \"everlasting covenant\" [Genesis 17:13; Hebrews 13:20]. So while the covenantal sign has changed from circumcision to baptism, the administration of the covenant has not. When God said to Abraham, \"This is my covenant ... between me and you and thy seed after thee; every man child among you shall be circumcised\" [Genesis 17:9-10]. The principle of \"you and thy seed\" continues in the new administration. In the baptism of children, they are marked out as God's property, assuring Christian parents that the covenant God has made with them is also made with their children.",
        "part6": "THOUGHT",
        "part7": "For the promise is unto you, and to your children, and to all that are afar off, even as many as the Lord our God shall call. - Acts 2:39",
        "part8": [
            "JEREMIAH 35",
            "2 CORINTHIANS 13"
        ]
    },
    "15 JULY": {
        "part1": "Romans 4:12",
        "part2": "First Step - The Obedience of Faith",
        "part3": "VERSE 12",
        "part4": "And the father of circumcision to them who are not of the circumcision only, but who also walk in the steps of that faith of our father Abraham, which he had being yet uncircumcised.",
        "part5": "In his commentary, The Epistle to the Romans, Scottish theologian, John Murray (1898-1975) describes Abraham as the leader of the faithful, adding that \"we walk, not abreast, but in file, following in the footprints left by Abraham.\" The Christian life is a pilgrimage. We who come later walk in the footsteps of those who have gone before us; at the same time, we leave our footprints of faith for those that will come after us. And we are all heading in the same direction.\n\nAbram was an idol-worshipper [Joshua 24:2]. Like all sinners, Abram did not have any interest in, nor was he seeking the living and true God. It was God who called Abram to leave Ur of the Chaldees [Genesis 12:1], and he \"obeyed; and he went out, not knowing whither he went\" [Hebrews 11:8].\n\nThe initiative of faith coming from God is clearly shown in Genesis 12 - \"I will shew thee (a land) ... I will make of thee a great nation ... I will bless thee ... (I will) make thy name great ... I will bless them that bless thee ... (I will) curse him that curseth thee ... unto thy seed will I give this land\" [Genesis 12:1-7]. Abram did nothing to deserve God's blessings.\n\nGod called Abram, and Abram responded to God's calling in obedience. In modern evangelism, especially at altar calls during Gospel meetings, the preacher appeals to the congregation \"to decide for Jesus\" or \"to let Jesus come into your heart\" implying that it is the sinner who does the work of believing so that God will save him. But that turns the Gospel of grace on its head.\n\nTo have faith in God is simply to obey Him. If you are not a believer, God is calling sinners to Himself. In response, they are to obey in faith.",
        "part6": "THOUGHT",
        "part7": "Abraham \"obeyed; and he went out, not knowing whither he went\" [Hebrews 11:8]. Faith is obedience to God's calling.",
        "part8": [
            "JEREMIAH 36",
            "GALATIANS 1"
        ]
    },
    "16 JULY": {
        "part1": "Romans 4:12",
        "part2": "Second Step - The Pilgrimage of Faith",
        "part3": "VERSE 12",
        "part4": "And the father of circumcision to them who are not of the circumcision only, but who also walk in the steps of that faith of our father Abraham, which he had being yet uncircumcised.",
        "part5": "In obeying the call of God, Abram exchanged his life as an urbanite for that of a pilgrim. After leaving Ur of the Chaldees, Abram followed the route of the Fertile Crescent, heading in a north-westerly direction to Haran [Genesis 12:5] before heading south toward Shechem [Genesis 12:6]. Even when he finally settled in the land of promise, Abraham considered himself to be \"in a strange country, dwelling in tabernacles with Isaac and Jacob, the heirs with him of the same promise: he looked for a city which hath foundations, whose builder and maker is God\" [Hebrews 11:9-10]. Abraham remained a pilgrim. He never considered Canaan his final destination.\n\nLike Abraham, our life on earth is a pilgrimage of faith - a walk [Galatians 5:25; Ephesians 2:10; 4:1]. We enter the strait gate and walk the narrow way [Matthew 7:13-14]. The thinking that when a sinner is saved, he is no longer a pilgrim is wrong. In fact, the pilgrimage of faith begins at our conversion. Christians are pilgrims. And we ought to live like pilgrims.\n\nThis means we must leave what we are comfortable with and the things we have grown up in, namely the world and all its trappings. We are to leave the past to follow Christ. God called Abram out of Ur, and he departed [Genesis 12:4]. Our Lord Jesus says to Peter and Andrew, \"Follow me, and I will make you fishers of men. And they straightway left their nets ...\" [Matthew 4:19-20a]. That was the start of their pilgrimage of faith. That must also be your experience in your pilgrimage of faith. Have you left? What have you left? What are you still hanging on to?",
        "part6": "THOUGHT",
        "part7": "I have decided to follow Jesus. The world behind me, the cross before me. No turning back, no turning back. - Sadhu Sundar Singh",
        "part8": [
            "JEREMIAH 37",
            "GALATIANS 2"
        ]
    },
    "17 JULY": {
        "part1": "Romans 4:12",
        "part2": "Third Step - The Object of Faith",
        "part3": "VERSE 12",
        "part4": "And the father of circumcision to them who are not of the circumcision only, but who also walk in the steps of that faith of our father Abraham, which he had being yet uncircumcised.",
        "part5": "God called Abraham out of Ur of the Chaldees, and he \"obeyed ... went out, not knowing whither he went\" [Hebrews 11:8]. It may seem Abram was stepping out into the dark, but that is not the case. Abraham did not leave his home in Ur to be a vagrant. God gave this assurance to Abraham, \"Get thee out of thy country ... unto a land that I will shew thee\" [Genesis 12:1].\n\nLikewise, faith is not a leap into the unknown. The value of faith is only as good as the object of that faith. And the object of the Christian's faith is our Lord Jesus Christ. Christ called Peter and Andrew, \"Follow me, and I will make you fishers of men. And they straightway left their nets, and followed Him\" [Matthew 4:19-20]. Christ called Matthew, \"Follow me. And he arose, and followed Him\" [Matthew 9:9].\n\nThat is the essence of discipleship. The basis for discipleship is faith [John 2:11]. The mark of discipleship is to hold on to the words of Christ; \"If ye continue in My word, then are ye My disciples indeed\" [John 8:31]. The expression of discipleship is obedience to Jesus' command to \"love one another\" [John 13:34-35]. The goal of discipleship is to be like Christ, to do what He did. He washed the feet of His disciples as an example of humility for us to follow [John 13:15]. Our Lord Jesus \"went about all the cities and villages ... preaching the gospel of the kingdom\" [Matthew 9:35], and He has given us the Great Commission to do likewise - to \"go ye into all the world, and preach the Gospel to every creature\" [Mark 16:15].\n\nIs there evidence of discipleship in your life?",
        "part6": "THOUGHT",
        "part7": "Be ye followers of me, even as I also am of Christ. - 1 Corinthians 11:1.",
        "part8": [
            "JEREMIAH 38",
            "GALATIANS 3"
        ]
    },
    "18 JULY": {
        "part1": "Romans 4:12",
        "part2": "A Faith like Abraham",
        "part3": "VERSE 12",
        "part4": "And the father of circumcision to them who are not of the circumcision only, but who also walk in the steps of that faith of our father Abraham, which he had being yet uncircumcised.",
        "part5": "God promised He would show Abraham the land where he should go. God also promised this land would be inhabited by Abraham's descendants who would be as numerous as the stars in the sky [Genesis 15:5]. When Abraham left Ur, he was seventy-five years old. However for another decade, Sarah remained childless. With every passing day, the promise of a son was fading. Sarah's childlessness because of age was not only a biological problem, it also posed a spiritual conundrum.\n\nSo, the ageing couple took matters into their own hands. Twenty-six years after leaving Ur, Abraham finally had his first son, Ishmael, through his Egyptian handmaid, Hagar [Genesis 16:1]. But Ishmael was not the son of promise. God told Abraham that the heir must \"come forth out of (his) own bowels\" [Genesis 15:4]. The son of promise must come from the father of faith.\n\nIf Abraham and Sarah were to have a son, it would have to be a miracle from God. Finally, at ninety years of age, Sarah gave birth to a son \"when she was past age, because she judged Him faithful who had promised\" [Hebrews 11:11]. Abraham also believed, who \"against hope believed in hope ... staggered not at the promise of God through unbelief; but was strong in faith ... being fully persuaded that, what He had promised, He was able also to perform\" [Romans 4:18-21].\n\nAbraham and Sarah are the supreme examples of faith. Likely, your situation is different from theirs. Sarah believed God to be faithful. Abraham was fully persuaded God was able to do as He promised. And so should we. The essence and the exercise of our faith should not be any different because the God of Abraham and Sarah is also our God.\n\nDo you have a faith like Abraham's?",
        "part6": "THOUGHT",
        "part7": "If we believe not, yet He abideth faithful: (God) cannot deny Himself. - 2 Timothy 2:13",
        "part8": [
            "JEREMIAH 39",
            "GALATIANS 4"
        ]
    },
    "19 JULY": {
        "part1": "Romans 4:12",
        "part2": "An Obedience like Abraham",
        "part3": "VERSE 12",
        "part4": "And the father of circumcision to them who are not of the circumcision only, but who also walk in the steps of that faith of our father Abraham, which he had being yet uncircumcised.",
        "part5": "Abraham loved Isaac dearly because he came late in Abraham's life. Abraham believed God's promise despite seemingly impossible odds. Abraham's faith would be tested again when God asked him to offer Isaac for a burnt offering [Genesis 22:2]. This was a test of Abraham's obedience to and love for God. Some have speculated that perhaps - Isaac being the son of his old age - Abraham had endeared himself so much to Isaac that he had taken over the place of God in Abraham's life.\n\nGod's test for Abraham was a spiritual one, and it would prove whether he would continue to have faith in and obey God. In this test, Abraham must choose between obeying God's command (to offer Isaac as a burnt offering) and believing God's promise (that Isaac would be the heir from whom all blessings would come). This was the spiritual dilemma facing Abraham: God had promised him his descendants would come from Isaac. Now God was commanding him to sacrifice his son.\n\nAbraham faced a Catch-22 situation. However, his faith in God for the gift of a son (after some 25 years) proved God was not only immutable; He is also the God of the impossible. From a human standpoint, this conundrum could not be resolved. And although Abraham could not see any way out of it, he believed that God had the answer, and so he obeyed.\n\nWhat was the basis of Abraham's obedience? Abraham obeyed God's command because of what he knew about God. Abraham believed and obeyed God even though he did not know the way out of this seemingly impossible situation.",
        "part6": "THOUGHT",
        "part7": "Look to God and assess your circumstance based on what you know about Him, and then obey.",
        "part8": [
            "JEREMIAH 40",
            "GALATIANS 5"
        ]
    },
    "20 JULY": {
        "part1": "Romans 4:13-14",
        "part2": "Promise by Faith",
        "part3": "VERSES 13-14",
        "part4": "For the promise, that he should be the heir of the world, was not to Abraham, or to his seed, through the law, but through the righteousness of faith. For if they which are of the law be heirs, faith is made void, and the promise made of none effect.",
        "part5": "Paul had been defending the doctrine of grace by dispelling the errors of salvation by works, teaching that \"Abraham believed God, and it was counted unto him for righteousness\" [v. 3], the error of salvation by rites, namely circumcision, making the point that Abraham was counted righteous \"not in circumcision, but in uncircumcision\" [v. 10].\n\nIn Romans 4:13, Paul would dispel the notion of salvation by keeping the law. The sign of circumcision was given some 14 years after Abraham believed. The law was given even later, over four centuries later. This meant that circumcision and the law had nothing to do with Abraham being counted righteous. It also meant that neither the rite nor the law replaced the covenant that God had made with Abraham. This was Paul's argument to the Galatians.\n\nPaul also pointed out the futility of keeping the law to earn our righteousness. The Law, by its definition, is contrary to faith. The Law sets a standard by which a man's actions are measured. The Law also demanded volitional obedience - an act on the part of the one observing it. The Law is established so that we may keep it, and thus, failure to do so incurs wrath. If salvation could be earned by keeping the law, then our salvation rests in our hands. If we believe we have kept enough of the law, then God is obliged to save us.\n\nBut that goes against the doctrine of grace. We are not saved by the law but by grace through faith [Ephesians 2:8]. And faith is believing obedience.",
        "part6": "THOUGHT",
        "part7": "Law and religious rituals are enemies of grace.",
        "part8": [
            "JEREMIAH 41",
            "GALATIANS 6"
        ]
    },
    "21 JULY": {
        "part1": "Romans 4:14",
        "part2": "The Value of Faith",
        "part3": "VERSE 14",
        "part4": "For if they which are of the law be heirs, faith is made void, and the promise made of none effect.",
        "part5": "Faith and law are diametrically opposed. It is either faith or law, and neither the twain shall mix. If you choose one, you naturally reject the other. The law focuses on what man must do. Faith on the other hand, emphasises what God has accomplished. If salvation comes by way of our own efforts, it also means we will not be trusting God. And if we believe salvation is by faith in what God has done, then it cannot be earned by our works. In that sense, law is made void by faith, and faith is made void by law.\n\nAnother result of trusting in our own efforts for salvation is that the \"promise (is) made of none effect\" [v. 14]. The phrase \"made of none effect\" means \"to be rendered useless\". It is used to describe the ground in which the fig tree that bore no fruit stood [Luke 13:7]. In Romans 4:14, Paul uses the phrase to point out that human efforts nullify God's grace and His promise of salvation. How so? If salvation depended on our keeping the law, then God's promise of salvation is conditional, meaning if we keep the law, then God promises to save us. But the Word of God states clearly that \"by the deeds of the law there shall no flesh be justified in His sight\" [Romans 3:20], which means no sinner will be saved, and in turn means God's promise is worthless.\n\nThis truth is seen in Christ's dealing with the woman caught in adultery. By her actions, she had failed to keep the law. She deserved God's condemnation. But our Lord Jesus said to her, \"Neither do I condemn thee: go, and sin no more\" [John 8:11]. Her salvation was not based on what she would have to do (sin no more) but on Christ's promise.",
        "part6": "THOUGHT",
        "part7": "If the promise [of salvation] is through the medium of the law ... there would have been no promise at all; it would have been no value whatsoever. - Martyn Lloyd-Jones.",
        "part8": [
            "JEREMIAH 42",
            "EPHESIANS 1"
        ]
    },
    "22 JULY": {
        "part1": "Romans 4:15",
        "part2": "Law Brings Wrath",
        "part3": "VERSE 15",
        "part4": "Because the law worketh wrath: for where no law is, there is no transgression.",
        "part5": "Not only does the law nullify faith and renders the promise of salvation useless [v. 14], but the law also \"worketh wrath\" [v. 15]. Instead of bringing about salvation, the law condemns and brings judgment upon sinners. Imagine a person who thinks that by keeping the law, he will, upon dying, be in heaven only to find to his horror, that he is in the \"furnace of fire: there shall be wailing and gnashing of teeth\" [Matthew 13:42]. Not only did his efforts fail to save him, they actually condemned him. The reason? That was the very purpose for which the law was set up.\n\nThe law says \"Do this, if not, expect judgment.\" But the law offers nothing for man to fulfil it. And if the law means what it says, it offers no reprieve either. \"Keep the law or else ... \" If that is the case, is the law a death trap? The answer is a definitive no! Paul states categorically that \"the law is holy, and the commandment holy, and just, and good\" [Romans 7:12]. The law was set up for a particular purpose. James Montgomery Boice illustrates it this way - \"A mirror is not a defective mirror because it cannot clean your face. That is just not its job. The function of a mirror is to show you that your face is dirty so that ... you will get some soap and water and wash it. In the same way, the law is not bad (defective) because it cannot save you ... The law was given to show you that you cannot get to heaven by keeping it, so that ... you will turn to Jesus Christ and be saved by Him.\"\n\nHowever, if you insist on keeping the law to save yourself, the very law you trust to save will condemn you because no sinner has ever kept the law perfectly and no one ever will. Condemned by the law or saved by grace - the choice is obvious.",
        "part6": "THOUGHT",
        "part7": "The LORD says, \"I have no pleasure in the death of the wicked; but that the wicked turn from his way and live: turn ye, turn ye from your evil ways; for why will ye die, O house of Israel?\" [Ezekiel 33:11]",
        "part8": [
            "JEREMIAH 43",
            "EPHESIANS 2"
        ]
    },
    "23 JULY": {
        "part1": "Romans 4:16",
        "part2": "Grace Brings Life",
        "part3": "VERSE 16",
        "part4": "Therefore it is of faith, that it might be by grace; to the end the promise might be sure to all the seed; not to that only which is of the law, but to that also which is of the faith of Abraham; who is the father of us all.",
        "part5": "If salvation does not come by the keeping of the law, how are sinners saved? By grace through faith [Ephesians 2:8]. This was the path of faith taken by Abraham - \"He believed in the LORD; and he counted it to him for righteousness\" [Genesis 15:6]. Just as works and law are conceptual twins, so are grace and faith. Law shines its spotlight on our actions, behaviour, conduct and deeds. Law lays its demands squarely on us - our works, what we are to do and not to do.\n\nIn contrast, grace, which is the unmerited favour of God without any contribution on our part, comes to us by our simple believing - in other words, by faith. If a person works for a living, his wages are earned. The employer is obliged to pay the worker at the end of the day. By doing so, the employer is not being gracious but merely keeping his end of the agreement. Quid pro quo - work gets done; worker gets paid.\n\nHowever, if the worker falls sick and is unable to work, and the employer continues to pay him; that is grace. The worker did nothing to deserve his wages, and the employer is not obliged to pay him but he does. In the first of His beatitudes, our Lord says, \"Blessed are the poor in spirit: for theirs is the kingdom of heaven\" [Matthew 5:3]. How can a destitute inherit the kingdom of heaven? Certainly not by his own efforts. Therefore, it has to be given to him by grace, and he accepts it by faith.\n\nPraise the LORD our salvation comes by grace and not anything on our part!",
        "part6": "THOUGHT",
        "part7": "Grace and faith are the conceptual twins of salvation. Grace demands faith. Faith establishes grace.",
        "part8": [
            "JEREMIAH 44",
            "EPHESIANS 3"
        ]
    },
    "24 JULY": {
        "part1": "Romans 4:16",
        "part2": "Faith Makes Certain the Promise",
        "part3": "VERSE 16",
        "part4": "Therefore it is of faith, that it might be by grace; to the end the promise might be sure to all the seed; not to that only which is of the law, but to that also which is of the faith of Abraham; who is the father of us all.",
        "part5": "This doctrine of grace grates against the sinner's self-reliance and insults his sense of self- worth. So, for the sake of argument, suppose that our salvation is conditional upon our ability to keep the law and to stick to a standard of morality - like being truthful. The question is how truthful must we be in order to be saved. If a man is 99 percent honest, would he earn the right to go to heaven? What about a second man who is just short of 99 percent because he told one more white lie? Where would we draw the line? What is the moral grade that gives one entry into heaven and denies another?\n\nThe point is that it is impossible to draw such a line. Any line conceived by man would be arbitrary. That poses a serious problem for one to be saved by good works. How much good works must he do? No one knows because no one knows if he has done enough, which means no one is certain. A man living under such a cloud of uncertainty will either be miserable or misguided. Such a person would either be doomed by his own futility or deceived by his self-righteousness.\n\nSalvation by grace on the other hand is certain because God is faithful. His promises fail not. We can be \"confident ... that He which hath begun a good work in you will perform it until the day of Jesus Christ\" [Philippians 1:6]. And Christ \"is able also to save (us) to the uttermost that come unto God by Him, seeing He ever liveth to make intercession for (us)\" [Hebrews 7:25].\n\nGod has given us His only begotten Son, and the Son has made the perfect sacrifice so that in Him, we can be confident and assured of our salvation.",
        "part6": "THOUGHT",
        "part7": "All thy sins were laid on Him, Jesus bore them on the tree; God, who knew them, laid them on Him, And believing , thou art free.",
        "part8": [
            "JEREMIAH 45",
            "EPHESIANS 4:1-16"
        ]
    },
    "25 JULY": {
        "part1": "Romans 4:16",
        "part2": "Inheritance of Faith",
        "part3": "VERSE 16",
        "part4": "Therefore it is of faith, that it might be by grace; to the end the promise might be sure to all the seed; not to that only which is of the law, but to that also which is of the faith of Abraham; who is the father of us all.",
        "part5": "Salvation is not by works, therefore giving hope to all sinners - including you and me - whose lives are wrecked by sin. Salvation is also not by circumcision, which gives hope to all Gentiles. Salvation is not by law because by the law is the knowledge of sin.\n\nSalvation is only \"of faith, that it might be by grace\". The phrase \"faith of Abraham\" is also referenced in verses 11 and 12 in association with circumcision, the Jewish covenantal sign. In other words, only Jews were of \"the faith of Abraham\". However, in verse 16, the promise is to \"all the seed; not to that only which is of the law\".\n\nWe see here an expansion of the scope of those who belong to the \"faith of Abraham\" from the Jews [v. 11-12] to \"all the seed\" [v. 16]. In other words, all who believe whether they be Jews or Gentiles are \"of the faith of Abraham; who is the father of us all\".\n\nFaith opens the door of salvation to all. The promise of salvation is not restricted to the Jews or a few Gentiles. It is open to all who will humble themselves and confess with the mouth the Lord Jesus and believe in their heart that God hath raised Him from the dead (see Romans 10:9). The promise of salvation is open to all. Jew or Gentile, the Gospel is for you. Rich or poor, the Gospel is for you. Learned or illiterate, the Gospel is for you. At the foot of the cross, we are all reduced to the same level - sinners in desperate need of God's saving grace through faith.",
        "part6": "THOUGHT",
        "part7": "If you are excluded from the Gospel, it is only because you prefer your sullied rags of righteousness than the pristine robe of righteousness of our Lord Jesus Christ.",
        "part8": [
            "JEREMIAH 46",
            "EPHESIANS 4:17-32"
        ]
    },
    "26 JULY": {
        "part1": "Romans 4:17",
        "part2": "Father of Many Nations",
        "part3": "VERSE 17",
        "part4": "(As it is written, I have made thee a father of many nations,) before him whom he believed, even God, who quickeneth the dead, and calleth those things which be not as though they were.",
        "part5": "The parenthetical statement in verse 17 must be linked to verse 16. \"Abraham, who is the father of us all\" is also the \"father of many nations\". From the Old Testament, it seemed there was distinction between the Jews and the rest of the peoples. God had chosen the nation of Israel \"to be a special people unto Himself, above all people that are upon the face of the earth\" [Deuteronomy 7:6]. The reason for this so-called distinction is that God chose the Israelites to be the ones through whom the Messiah would be born, and the Messiah would come from the line of Abraham, Isaac and Jacob [Genesis 12:1-3]. Paul in addressing the Jews acknowledged that Abraham was known as the \"father of circumcision\" [Romans 4:12].\n\nBut in verse 16, he dispenses with that distinction and says expressly without any discrimination that Abraham \"is the father of us all\" and \"a father of many nations\". God does not recognize two separate groups of people upon whom He bestows favour. The Gospel and the promise of salvation by grace is not dependent on ethnicity or the rite of circumcision or the keeping of the law. There is only one group, consisting of all genuine believers, and the promise is through faith alone in Christ Jesus.\n\nPaul - in his epistles - emphasizes this point. He said that Christ \"is our peace, who hath made both one, and hath broken down the middle wall of partition between us (Jews and Gentiles)\" [Ephesians 2:14]; that \"there is neither Jew nor Greek ... for ye are all one in Christ Jesus. And if ye be Christ's, then are ye Abraham's seed, and heirs according to the promise\" [Galatians 3:28- 29].",
        "part6": "THOUGHT",
        "part7": "The faith of Abraham is one that rested entirely on God, and so must ours be.",
        "part8": [
            "JEREMIAH 47",
            "EPHESIANS 5:1-21"
        ]
    },
    "27 JULY": {
        "part1": "Romans 4:17",
        "part2": "Quickening the Dead",
        "part3": "VERSE 17",
        "part4": "(As it is written, I have made thee a father of many nations,) before him whom he believed, even God, who quickeneth the dead, and calleth those things which be not as though they were.",
        "part5": "In Romans 4:17, Paul describes two attributes of God - He quickens and calls. These are the two acts of God which are the bases for Abraham's faith. They describe the starting points of Abraham's faith. They also explain how we come to faith in Christ.\n\nGod \"quickeneth the dead\" means that God who gives life in the first place also has power to raise the dead [Ephesians 1:19-20]. There are several instances in Abraham's life that display his trust on this matter. The first is God's promise that Abraham would be fruitful and be a father of many nations [Genesis 17:4-6]. God made that promise to Abraham when he was old. But Paul tells us that Abraham \"being not weak in faith, he considered not his own body now dead, when he was about an hundred years old, neither yet the deadness of Sarah's womb: He staggered not at the promise of God through unbelief; but was strong in faith, giving glory to God\" [Romans 4:19-20]. God quickened Abraham's body so that he fathered Isaac when he was a centenarian.\n\nA second instance was God's testing of Abraham by asking him to offer Isaac as a burnt offering. The account in Genesis 22 does not give any hint of Abraham's reluctance. The Bible tells us that \"by faith Abraham, when he was tried, offered up Isaac: and he that had received the promises offered up his only begotten son ... accounting that God was able to raise him up, even from the dead; from whence also he received him in a figure\" [Hebrews 11:17-19].\n\nIt is only as Abraham had such faith in God's power exemplified in raising the dead that he could have believed the promise he would be the father of many nations.\n\nDo you have the faith of Abraham?",
        "part6": "THOUGHT",
        "part7": "Jesus says, \"If ye have faith as a grain of mustard seed ... nothing shall be impossible unto you\" [Matthew 17:20].",
        "part8": [
            "JEREMIAH 48",
            "EPHESIANS 5:22-33"
        ]
    },
    "28 JULY": {
        "part1": "Romans 4:17",
        "part2": "Calling into Being",
        "part3": "VERSE 17",
        "part4": "(As it is written, I have made thee a father of many nations,) before him whom he believed, even God, who quickeneth the dead, and calleth those things which be not as though they were.",
        "part5": "The second of God's attributes that Paul describes in Romans 4:17 is that He \"calleth those things which be not as though they were.\" In Greek, the phrase literally means God \"calling the things not being as being\". Young's Literal Translation renders it this way - God \"is calling the things that be not as being\". Another translation has it as God calling \"into existence the things that do not exist\". The Chinese translation [Shi Wu  Bian Wei You ] means \"cause to change from nothing to something\".\n\nThere are several interpretations to this phrase. Some have taken this phrase to refer to God's creatio ex nihilo - God creating out of nothing. However, Paul does not say that God \"calleth into being things that are not\" but that God \"calleth the things that are not as being\". There are others who use this phrase to say that God has control over things actual (things which are) and possible (things which are not); however, there is a huge interpretative gap to cross from \"things which be not\" into \"things possible\".\n\nA more accurate reading of this phrase is that Abraham believed the promises that God made to him were as good as fulfilled although they had not yet come to pass. Paul writing to the Corinthians on God's calling sinners to salvation uses similar phraseology - \"For ye see your calling, brethren, how that not many wise men after the flesh, not many mighty, not many noble, are called ... and things which are not, to bring to nought things that are\" [1 Corinthians 1:26-28]. By His sovereign will, God calls sinners who are not saints as though they are, on account of what Christ's redemptive work has accomplished.\n\nGod's promise was for Abraham as good as fulfilment. It is on this truth that Abraham's faith rested.",
        "part6": "THOUGHT",
        "part7": "Faith is the belief that God will do what He has promised in spite of your present circumstances.",
        "part8": [
            "JEREMIAH 49",
            "EPHESIANS 6"
        ]
    },
    "29 JULY": {
        "part1": "Romans 4:18",
        "part2": "What is Hope?",
        "part3": "VERSE 18",
        "part4": "Who against hope believed in hope, that he might become the father of many nations, according to that which was spoken, So shall thy seed be.",
        "part5": "\"I hope to lose weight.\" \"I hope it will not rain tomorrow.\" These statements expressing hope are mere wishes which have no absolute certainty of fulfilment. This is not what the Bible means by hope. The biblical definition of hope is \"confident expectation\". The writer of Hebrews says that \"faith is the substance of things hoped for, the evidence of things not seen\" [Hebrews 11:1], meaning that it is the assurance of things that are yet unknown. Hope is a key component of the believer's life. Without hope, life loses its meaning. The Bible exhorts us: \"Let not thine heart envy sinners: but be thou in the fear of the LORD all the day long. For surely there is an end; And thine expectation (or hope) shall not be cut off \" [Proverbs 23:17-18].\n\nIn Romans 4:18, the object of Abraham's hope was the fulfilment of God's promise that he would have a son, and from which all the promises of God flow - \"I will make thee exceeding fruitful, and I will make nations of thee ... I will establish my covenant between me and thee and thy seed after thee ... for an everlasting covenant ... I will give unto thee, and to thy seed after thee ... and I will be their God\" [Genesis 17:6-8].\n\nFor years, the promises did not come to pass, but Abraham's faith never waned, and his hope never diminished. And in God's appointed time, all these promises were fulfilled to the jot and tittle.\n\nThe Christian's hope is found in Christ. He alone is our hope [1 Timothy 1:1], and by His resurrection, we have a \"lively hope\" [1 Peter 1:3]. So we persevere and press on because of the certain expectation of Christ's promises.",
        "part6": "THOUGHT",
        "part7": "When I fear my faith will fail, Christ will hold me fast.",
        "part8": [
            "JEREMIAH 50",
            "PHILIPPIANS 1"
        ]
    },
    "30 JULY": {
        "part1": "Romans 4:18",
        "part2": "Hoping against Hope",
        "part3": "VERSE 18",
        "part4": "Who against hope believed in hope, that he might become the father of many nations, according to that which was spoken, So shall thy seed be.",
        "part5": "There is a hiking trail in Vancouver called the Grouse Grind. It is a three-kilometre trail up the face of Grouse Mountain. Our journey so far through Paul's epistle to the Romans has been somewhat like a spiritual Grouse Grind. From its opening words, Paul has been leading us - step by step - up the mountain of truth. At times, the climb has been tough and challenging because of the steep doctrinal incline. Now, we are nearing the top, and we begin to see a glimpse of what lies ahead.\n\nAbraham's pilgrimage of faith has not been an easy one. In verse 18, Paul says that Abraham \"against hope believed in hope\". The phrases \"against hope\" and \"in hope\" are diametrically opposed. \"Against hope\" describes all the circumstances that - from a human perspective - have no possibility of fulfilment. \"Against hope\" was what Abraham knew from human experience, that it was impossible for a man as old as he was to father a son, much less be a father of many nations [v. 17-18].\n\nWhen Paul says Abraham \"believed in hope\", it does not mean that Abraham had faith in his own hope. Rather, when Abraham \"believed in hope\", he is exercising faith in what God has promised. \"In hope\" is the working out of faith in God even when the circumstances are impossible. \"In hope\" is what Abraham believed, and he is \"fully persuaded that, what (God) had promised, He was able also to perform\" [v. 21].\n\nFaith and hope are complementary and inextricably linked. Faith is unreserved trust in God and His promises, and hope is the confident certainty of absolute fulfilment of God's promises.",
        "part6": "THOUGHT",
        "part7": "The certainty of our hope is dependent upon our faith in God and His promises.",
        "part8": [
            "JEREMIAH 51",
            "PHILIPPIANS 2"
        ]
    },
    "31 JULY": {
        "part1": "Romans 4:18",
        "part2": "Believe that which was Spoken",
        "part3": "VERSE 18",
        "part4": "Who against hope believed in hope, that he might become the father of many nations, according to that which was spoken, So shall thy seed be.",
        "part5": "In Romans 4:18, Paul lists two promises that God made to Abraham; that he would be \"the father of many nations\" [Genesis 17:4], and that as he was, \"so shall thy seed be\" [Genesis 15:5]. Both promises fell within the scope of Abraham's faith. Both promises were \"according to that which was spoken\" [v. 18].\n\nCommenting on this verse, Martyn Lloyd-Jones said that Abraham's faith was based on \"the bare Word of God and on nothing else whatsoever\". When God first gave that promise to Abraham, he was seventy-five years old [Genesis 12]; then the situation might not seem so hopeless. At eighty- five years old [Genesis 15], there might have been some tension of trust in Abraham. It would not be accurate to say that Abraham did not experience a struggle in his faith. He did! [Genesis 17:17-18].\n\nBut that tension of trust was immediately assuaged when God told Abraham, \"Sarah thy wife shall bear thee a son indeed; and thou shalt call his name Isaac: and I will establish my covenant with him for an everlasting covenant, and with his seed after him\" [Genesis 17:19]. It was on that spoken word, that Abraham believed in the LORD. It is in this sense that Abraham's faith did not waver and was even strengthened.\n\nCan we have faith like Abraham's? The answer is yes! That which saves us is the bare Word of God, and that which sustains and strengthens us in the faith is also the bare Word of God. Apart from the Word of God, we know nothing about our future. So, if we would know anything of the hope we have in Christ, it has to be the bare Word of God.",
        "part6": "THOUGHT",
        "part7": "Christ says, \"For verily I say unto you, till heaven and earth pass, one jot or one tittle shall in no wise pass from the law, till all be fulfilled\" [Matthew 5:18].",
        "part8": [
            "JEREMIAH 52",
            "PHILIPPIANS 3"
        ]
    },
    "1 AUGUST": {
        "part1": "Roman 4:19",
        "part2": "Unwavering Faith",
        "part3": "VERSE 19",
        "part4": "And being not weak in faith, he considered not his own body now dead, when he was about an hundred years old, neither yet the deadness of Sara's womb.",
        "part5": "God first called Abraham in Ur of the Chaldees [Acts 7:2-3] and then again at Haran. He promised to give Abraham a land, make him a great nation and a great name, and he and his descendants would be a blessing to the nations of the world [Genesis 12:1-3]. By faith in God, Abraham obeyed, took his family, departed from Haran and journeyed on.\n\n\"By faith Abraham, when he was called to go out into a place which he should after receive for an inheritance, obeyed; and he went out, not knowing whither he went. By faith he sojourned in the land of promise, as in a strange country, dwelling in tabernacles with Isaac and Jacob, the heirs with him of the same promise: For he looked for a city which hath foundations, whose builder and maker is God.\" [Hebrews 11:8-10]\n\nWhen God called Abraham, He divinely prompted faith in Abraham's heart. Abraham believed the One, who had called, to be the true and living God whom he could trust wholeheartedly - God Omnipotent, Omniscient, Omnipresent, Creator of heaven and earth, Holy and Righteous, Immutable and Faithful - Who will not lie nor break His promises. Abraham's faith in God was strong and unwavering.\n\nBy faith, \"Abraham believed God and it was counted unto him for righteousness\" [Romans 4:3]. Abraham was justified and saved. Dear reader, for your salvation, by faith believe in God's promise - \"Believe on the Lord Jesus Christ, and thou shalt be saved, and thy house.\" [Acts 16:31]. May the Lord grant us an unwavering faith to trust and obey Him always to the glory of His name.",
        "part6": "THOUGHT",
        "part7": "For all the promises of God in Him are yea, and in Him Amen, unto the glory of God by us. - 2 Corinthians 1:20",
        "part8": [
            "LAMENTATIONS 1",
            "PHILIPPIANS 4"
        ]
    },
    "2 AUGUST": {
        "part1": "Roman 4:19",
        "part2": "Dead Bodies, Living Faith",
        "part3": "VERSE 19",
        "part4": "And being not weak in faith, he considered not his own body now dead, when he was about an hundred years old, neither yet the deadness of Sara's womb.",
        "part5": "Through his sojourn and even after settling down in Canaan, Abraham and Sarah remained childless even though God had repeatedly assured Abraham of His promise: \"And he brought him forth abroad, and said, Look now toward heaven, and tell the stars, if thou be able to number them: and he said unto him, So shall thy seed be. And he believed in the LORD; and he counted it to him for righteousness.\" [Genesis 15:5-6; 17:21; 18:11-18].\n\nAbraham had not witnessed any miracle by God nor was there any physical evidence that a man or woman their age could still bear children for \"his own body now dead ... neither yet the deadness of Sarah's womb\". Yet Abraham exercised living faith in God - trusted Him for forty years now - and believed in this \"God, who quickeneth the dead, and calleth those things which be not as though they were\" [v. 17]. Abraham was confident God would fulfil His promise and perform it to the uttermost. When Abraham was a hundred years old, God miraculously quickened Abraham's \"dead body\" and Sarah's \"dead womb\". Sarah conceived and bore him the son of promise, Isaac [Genesis 21:1-3].\n\nWe were at one time spiritually dead in sin and trespasses. By God's grace and mercy, we were quickened unto life [Ephesians 2:1], saved by grace through faith [Ephesians 2:8] in our Lord Jesus who died for our sins and resurrected to redeem us unto everlasting life. In humble gratitude to our Saviour, we exercise our living faith by conforming to Him and living for Him even though the body dies. True faith never dies but is living and lives on.",
        "part6": "THOUGHT",
        "part7": "Even so faith, if it hath not works, is dead, being alone. - James 2:17",
        "part8": [
            "LAMENTATIONS 2",
            "COLOSSIANS 1"
        ]
    },
    "3 AUGUST": {
        "part1": "Romans 4:20",
        "part2": "Staggering Faith",
        "part3": "VERSE 20",
        "part4": "He staggered not at the promise of God through unbelief; but was strong in faith, giving glory to God.",
        "part5": "By faith Abraham left Haran and continued his journey to the land of promise. God, in His initial call to Abraham, had promised He would make from Abraham a great nation and his descendants would be as many as the stars in heaven, but through the years of sojourning and even on arrival in Canaan, God's promises still had not materialized. Yet Abraham did not stagger in unbelief or doubt. Abraham's spiritual eyes were fixed on God and not on his circumstances. God was the object and the source of his faith.\n\nNoah, when called upon by God to build an ark [Genesis 6:14], obeyed because God had told Noah that He would \"bring a flood of waters upon the earth\" [Genesis 6:17]. Noah believed God, his faith did not waver. He persevered in building the Ark, and his family was saved.\n\nThe ten spies, on account of their doubt, fears and unbelief perished in the wilderness. Joshua and Caleb exercised believing faith, and God allowed them into the Promised Land.\n\nPeter was able to walk on water as long as he looked at the Lord Jesus. But when he turned and noticed the boisterous waves, he began to sink. Then Jesus held him and rebuked him for his doubt and little faith [Matthew 14:24-31]. How often the surging waves of doubt can weaken one's faith rendering one ineffective for God.\n\nMay the Lord deliver us from the sin of unbelief and fear so that our faith will not stagger. May He find us faithful until we reach our Promised Land.",
        "part6": "THOUGHT",
        "part7": "But without faith it is impossible to please Him: for he that cometh to God must believe that He is, and that He is a rewarder of them that diligently seek Him. - Hebrews 11:6",
        "part8": [
            "LAMENTATIONS 3",
            "COLOSSIANS 2"
        ]
    },
    "4 AUGUST": {
        "part1": "Romans 4:20",
        "part2": "Strengthening Faith",
        "part3": "VERSE 20",
        "part4": "He staggered not at the promise of God through unbelief; but was strong in faith, giving glory to God.",
        "part5": "After Abraham arrived in Canaan, still childless and landless, his faith was further tested. He encountered famine [Genesis 12:10], a potentially hostile Pharoah [Genesis 12:14-20], conflict with his nephew Lot [Genesis13:5-9] and experienced fear [Genesis 15:1]. While God had prompted faith in Abraham's heart, He tested and strengthened it by not immediately fulfilling His promises. But through the years of waiting, God graciously reiterated His promises to Abraham [Genesis 15:4- 5; 17:21; 18:1-18].\n\nBy God's mercy and grace, He gave us the faith to believe in Him and His Son, our Lord and Saviour [Ephesians 1:4-5; 2:8]. He strengthens our faith by assuring us of our salvation in Christ's finished work at Calvary [Hebrews 10:10-12, 14]; that He will perfect the good work He has begun in us [Philippians 1:6]; and that He will never leave us nor forsake us [Deuteronomy 31:6, 8]. Our faith will be tried betimes [1 Peter 1:7] but nothing can separate us from God's love [Romans 8:35, 38-39]. Christ has given us His rest ([Matthew 11:28-30], peace [John 14:27], the Holy Spirit [John 14:16-17] and He is coming again for us [John 14:1-6].\n\nSo, strengthen your faith in God, draw nigh to Him [James 4:8] daily in worship and prayer [1 Thessalonians 5:16-18], in studying and meditating upon His Word [2 Timothy 2:15] and growing in grace and knowledge of the Lord [2 Peter 3:18]. Let us be resolved to lead sanctified lives with eternity's values in view [Colossians 3:1-17]. Our salvation is purchased with such a great price as the precious blood of our Lord and Saviour Jesus Christ, let us surrender our lives to serve and honour Him [Romans 12:1-2].",
        "part6": "THOUGHT",
        "part7": "Looking unto Jesus the author and finisher of our faith; who for the joy that was set before Him endured the cross, despising the shame, and is set down at the right hand of the throne of God. - Hebrews 12:2",
        "part8": [
            "LAMENTATIONS 4",
            "COLOSSIANS 3"
        ]
    },
    "5 AUGUST": {
        "part1": "Romans 4:21",
        "part2": "God's Promises",
        "part3": "VERSE 21",
        "part4": "And being fully persuaded that, what he had promised, he was able also to perform.",
        "part5": "The promises of God are an announcement by God about what He is going to do. It shows God's voluntary undertaking of an action. Here, God promised patriarch Abraham a son to be born by Sarah. God promised He would make Abraham a father of many nations [Genesis 17:4].\n\nPromises and their fulfilments are dependent on the one who makes the promise. The will and desire of the \"promiser\" are revealed and further confirmed by the fulfilment of the promise and his track record. Promises also reflect the relationship between the parties involved. An understanding of the character, ability and trustworthiness of the promiser is key to whether he is to be believed and can be trusted.\n\nThus, the promises of God are secured by His revealed character. He is gracious and the promises made are gracious toward His creatures. God's promises are true for He does not lie. We know His promises will come to pass as He is the Sovereign Almighty God, who has been faithful and has kept every single one of His promises to us. God sending His Son Jesus Christ to save us from our sins is the fulfilment of His greatest promise to us, proving He is who He says He is and will do exactly as He says.\n\n\"God is not a man that He should lie; neither the son of man that He should repent: hath He said, and shall He not do it? or hath He spoken and shall He not make it good?\" [Numbers 23:19]. \"For all the promises of God in Him are yea and in Him Amen, unto the glory of God by us\" [2 Corinthians 1:20].",
        "part6": "THOUGHT",
        "part7": "In hope of eternal life, which God, that cannot lie, promised before the world began. -Titus 1:2",
        "part8": [
            "LAMENTATIONS 5",
            "COLOSSIANS 4"
        ]
    },
    "6 AUGUST": {
        "part1": "Romans 4:21",
        "part2": "Fully Persuaded",
        "part3": "VERSE 21",
        "part4": "And being fully persuaded that, what he had promised, he was able also to perform.",
        "part5": "Abraham knew God and His character in an intimate way, leading him to be fully persuaded of His trustworthiness. To be fully persuaded is a description of true faith. Abraham came to the point of being fully assured, totally submitting and placing faith in God. He surrendered to God wholeheartedly. Abraham was fully convinced and assured of the eventual outcome.\n\nAbraham exhibited faith by his action in obeying God when He called him out of Ur of the Chaldees [Genesis 12:1-4]. The Word of God records for us how Abraham struggled with his faith at times, even initially doubting the promise he would have a child by Sarah [Genesis 16:2; 17:17]. Yet in time, he reached the point when he was fully assured that God would do as He promised.\n\nThat is precisely the journey of faith for God's children. The child of God begins with a little faith as a grain of mustard seed which grows over time till it becomes a faith that can move mountains. As faith in God grows by our continually turning to Him, trusting Him and His Word in the changing scenes of life, we will grow to know and trust Him deeper.\n\nThus assurance (being fully persuaded) grows out of such faith. The child of God's initial faith is given by God. Thus, even when struggling with little faith, he is in fact humbly crying out for more faith: \"Lord I believe: help Thou mine unbelief \" [Mark 9:24].",
        "part6": "THOUGHT",
        "part7": "Know therefore that the LORD thy God, He is God, the faithful God, which keepeth covenant and mercy with them that love Him and keep His commandments to a thousand generations. - Deuteronomy 7:9",
        "part8": [
            "EZEKIEL 1",
            "1 THESSALONIANS 1"
        ]
    },
    "7 AUGUST": {
        "part1": "Romans 4:21",
        "part2": "God is Able",
        "part3": "VERSE 21",
        "part4": "And being fully persuaded that, what he had promised, he was able also to perform.",
        "part5": "Abraham knew God's promises. His faith in God grew over time even as he went through trials and found Him faithful and further surrendered to Him. He thus gained full assurance in God Himself. All this because God had revealed Himself, His character, and shown Himself faithful. All this was dependent on God being able to perform as He said He would. An impotent God would not be able to fulfil His promises. God promised Abraham and Sarah, who were of advanced age and beyond child-bearing years, they would have a child. Humanly speaking, this was an impossibility.\n\n\"With men this is impossible; but with God all things are possible\" [Matthew 19:26b]. God has revealed Himself to be the Almighty and Sovereign God. He is able to do what man cannot. He has already done what mankind cannot understand fully.\n\n\"In the beginning God created the heaven and the earth\" [Genesis 1:1]. \"Through faith we understand that the worlds were framed by the word of God, so that things which are seen were not made of things which do appear\" [Hebrews 11:3].\n\nAs God was able to create the universe and physical life from nothing, He can also enable an aged woman to conceive if He wills it. God was able to bring forth His Son from a virgin [Isaiah 7:14] and by the Lord Jesus' sinless life, death and resurrection, give spiritual life to those who are spiritually dead [Ephesians 2:1]! Indeed, only God is able to save mankind through Jesus Christ, His only begotten Son.",
        "part6": "THOUGHT",
        "part7": "But our God is in the heavens: He hath done whatsoever He hath pleased. - Psalm 115:3",
        "part8": [
            "EZEKIEL 2",
            "1 THESSALONIANS 2"
        ]
    },
    "8 AUGUST": {
        "part1": "Romans 4:22-23",
        "part2": "Imputed Righteousness",
        "part3": "VERSE 22",
        "part4": "And therefore it was imputed to him for righteousness.",
        "part5": "What man is unable to do, God is able to. By man's own ability and on his own account, he is helpless to attain to the perfect righteousness God requires for entry into His sinless heavenly abode. If we depend on ourselves, then we are all completely hopeless and doomed.\n\nBut God in His infinite love and wisdom provided the means. He would put on our account the very righteousness He requires. This unilateral provision for man's deliverance He made from the time of man's fall until this present age comes to a close and the sinful world order is destroyed and restored to its original state of perfection, was exemplified by the patriarch Abraham of whom it is said: \"And he believed in the LORD; and he counted it to him for righteousness\" [Genesis 15:6].\n\nThis righteousness was not Abraham's on account of his works but imputed to him on account of his faith in believing and obeying the Lord.\n\nUnder the Old Covenant, the perfect sacrifice for sin was foreshadowed and typified in the sacrifices prescribed by the Law. In the covenant of the New Testament, this perfect and ultimate sacrifice was made manifest and clear to all in the life, death and resurrection of the incarnate Second person of the Godhead - Jesus Christ, the Son of God. His sinless righteousness is imputed to all who believe and accept Him by faith as their Lord and Saviour. Not by works lest any man should boast. This is the only acceptable means by which entrance into God's heavenly home is granted.",
        "part6": "THOUGHT",
        "part7": "No other way! - \"Jesus saith unto him, I am the Way, the Truth, and the Life: no man cometh unto the Father, but by Me\" [John 14:6].",
        "part8": [
            "EZEKIEL 3",
            "1 THESSALONIANS 3"
        ]
    },
    "9 AUGUST": {
        "part1": "Romans 4:24",
        "part2": "For Us Also",
        "part3": "VERSE 24",
        "part4": "But for us also, to whom it shall be imputed, if we believe on him that raised up Jesus our Lord from the dead;",
        "part5": "God chose and called Abraham from the myriads of people in history. His family background was idol-worshipping. There was nothing special in him that merited his choice. But Abraham exercised faith to believe God's promises and obey God's directions and that counted as sufficient righteousness for his salvation.\n\nFor us too, who have nothing to boast, God is calling. For us too will only such simple believing faith open the gates for God's grace to flow and cover us with the righteousness of the Risen Christ, but only if we believe and obey what God has revealed to us in His Son the living Word and His written Word. For us too will the righteousness of the Son of God alone be necessary and sufficient for admittance into the presence of the most holy God.\n\nMore privileged than Abraham, we now possess the complete canon of Scripture and have a full picture. The Lord Jesus came into our world to save us. God's Son was the perfect atoning sacrifice for our sins and His righteousness is imputed to all who believe so that we are made acceptable to God. This work of Christ was finished on the cross. No more types and shadows of the promised Deliverer, but \"We see Jesus, who was made a little lower than the angels for the suffering of death, crowned with glory and honour; that he by the grace of God should taste death for every man.\" [Hebrews 2:9]. So, heed God's Word and live!\n\nSalvation is by faith though grace, then, now and forevermore [Ephesians 2:8].",
        "part6": "THOUGHT",
        "part7": "Even as Abraham believed God, and it was accounted to him for righteousness. Know ye therefore that they which are of faith, the same are the children of Abraham. - Galatians 3:6-7",
        "part8": [
            "EZEKIEL 4",
            "1 THESSALONIANS 4"
        ]
    },
    "10 AUGUST": {
        "part1": "Romans 4:24",
        "part2": "If We Believe",
        "part3": "VERSE 24",
        "part4": "But for us also, to whom it shall be imputed, if we believe on him that raised up Jesus our Lord from the dead;",
        "part5": "To the Philippian jailer who asked what he needed to do for salvation, the apostle replied, \"Believe on the Lord Jesus Christ, and thou shalt be saved, and thy house\" [Acts 16:31]. To the Roman Christians, Paul again said, \"That if thou shalt confess with thy mouth the Lord Jesus, and shalt believe in thine heart that God hath raised him from the dead, thou shalt be saved.\" [Romans 10:9]\n\nIn His epic encounter with Nicodemus, the Lord Jesus said, \"For God so loved the world, that He gave His only begotten Son, that whosoever believeth in Him should not perish, but have everlasting life\" [John 3:16]. And then as if to make sure there would be no doubt about what He said, the Lord reiterated, \"He that believeth on him is not condemned: but he that believeth not is condemned already, because he hath not believed in the name of the only begotten Son of God\" [John 3:18].\n\nMan can never be saved by his sin-tainted works and best-intended efforts. Because of our sin-nature, our \"righteousnesses are as filthy rags\" [Isaiah 64:6]. Only the untainted righteousness of the sinless paschal Lamb of God put on our account will meet God's perfect standard and make us acceptable to Him who can tolerate no sin. Salvation is of the Lord, but we must believe this. God the Father provided the only Way in God the Son, our Lord and Saviour Jesus Christ, so we can be saved.",
        "part6": "THOUGHT",
        "part7": "I will greatly rejoice in the LORD, my soul shall be joyful in my God; for He hath clothed me with the garments of salvation, He hath covered me with the robe of righteousness, as a bridegroom decketh himself with ornaments, and as a bride adorneth herself with her jewels. - Isaiah 61:10",
        "part8": [
            "EZEKIEL 5",
            "1 THESSALONIANS 5"
        ]
    },
    "11 AUGUST": {
        "part1": "Romans 4:25",
        "part2": "Delivered for Us",
        "part3": "VERSE 25",
        "part4": "Who was delivered for our offences, and was raised again for our justification.",
        "part5": "The uniqueness of the Christian faith lies in the fact that God saves the unworthy and the undeserving by providing the means for meeting the standard He has set for these to be accepted by Him. His standard of holiness and purity befitting the holy and righteous God is infinitely high. Left to our own devices, the best of man's efforts, our good works, our meritorious achievements all amount to nothing and fall hopelessly short. The mere scent of sin will sully the purity of God's heavenly kingdom.\n\nSo, the loving and wise God sent His only begotten Son - sinless and divine, equal to Himself in substance, power and glory - to do the impossible for us. Jesus the Messiah took on human form to be the sinless sacrifice and acceptable atonement for all humanity's sin. Christ alone could satisfy God's holy standards. Christ alone could do what generations of priests and countless animal sacrifices could not. Divinity alone could accomplish what mortal flesh could never do. The Saviour would die so that sin's penalty was paid in full, God's justice fully satisfied and His divine love manifested all in one perfect sacrifice.\n\nThe Son of God was delivered for our offences, despised and rejected by men, wounded and bruised for our transgressions. The chastisement which procures our peace with God was put on Him. The Father laid the iniquity of mankind upon His Son. He went to the cross and suffered the death of a common criminal so that sinful man can live again. Hallelujah, what a Saviour, what a gift!",
        "part6": "THOUGHT",
        "part7": "God's perfect love and absolute justice are fulfilled in the Lord Jesus Christ. \"For if by one man's (Adam's) offence death reigned by one; much more they which receive abundance of grace and of the gift of righteousness shall reign in life by one, Jesus Christ\" [Romans 5:17].",
        "part8": [
            "EZEKIEL 6",
            "2 THESSALONIANS 1"
        ]
    },
    "12 AUGUST": {
        "part1": "Romans 4:25",
        "part2": "Raised for Us",
        "part3": "VERSE 25",
        "part4": "Who was delivered for our offences, and was raised again for our justification.",
        "part5": "If Jesus Christ the Son of God had died and remained in the grave, He would have been like any other man, another great martyr in history giving his life for a cause. His death would be considered a noble sacrifice but that would be the sum of it and soon forgotten. Those who believed and placed their trust in Him, who followed and suffered for His sake would have believed and trusted a lie. There would be no consequences for the wicked and no vindication for the righteous. Paul told the Corinthians, \"If Christ be not raised, your faith is in vain; ye are yet in your sins ... If in this life only we have hope in Christ, we are of all men most miserable\" [1 Corinthians 15:17, 19]. How true!\n\nBut our Lord Jesus did not remain in the tomb. Death could not retain Him just as darkness cannot resist light, for this our Christ is the light of the world and in Him is the light of life. Jesus said, \"Because I live, ye shall live also\" [John 14:19]. His was no empty boast. The Saviour of the world who died for our sins rose again from the grave as He said He would, so death was vanquished and everlasting life a reality.\n\nThe Lord Jesus said to Martha, \"I am the Resurrection, and the Life: he that believeth in Me, though he were dead, yet shall he live: And whosoever liveth and believeth in Me shall never die. Believest thou this?\" [John 11:25-26]\n\nWhat is your answer?",
        "part6": "THOUGHT",
        "part7": "Resurrection of the dead to eternal life - the linchpin of the Gospel. Read 1 Corinthians 15.",
        "part8": [
            "EZEKIEL 7",
            "2 THESSALONIANS 2"
        ]
    },
    "13 AUGUST": {
        "part1": "Romans 5:1",
        "part2": "Peace through Christ",
        "part3": "VERSE 1",
        "part4": "Therefore being justified by faith, we have peace with God through our Lord Jesus Christ:",
        "part5": "Romans 5:1 is a powerful verse. It states unequivocally that we sinners can only be made right with God through faith in the Lord Jesus Christ who died for us on the cross. As believers and disciples of Christ, we are then able to enjoy this wonderful relationship with God. God's grace works to restore us and help us recognise the need to trust and obey the Lord.\n\nThrough Christ, we are justified. We can neither justify ourselves by good works nor rely on our own will to be obedient to the law. We were all alienated from God by our sin nature, unable to bridge the chasm between God and man. Proverbs 28:13 tells us that it is human nature for us to cover our sins but only those who confess and seek forgiveness will find mercy. Blessed is he whose transgression is forgiven [Psalm 32:1].\n\nThe only way to reconcile with God is through believing that Jesus Christ is the Saviour. Justification is by faith alone, and not of works, lest any man should boast [Ephesians 2:8-9]. It is the gift of God. Only through Christ can we taste the sweetness of peace with God. We can rest in Him with the assurance of eternal salvation. It is an amazing experience to have this peace.\n\nWe will only enjoy true peace when we are made right with God and stand justified before Him. Isaiah 32:17 reminds us that \"the work of righteousness shall be peace; and the effect of righteousness quietness and assurance for ever.\"",
        "part6": "THOUGHT",
        "part7": "For he is our peace, who hath made both one, and hath broken down the middle wall of partition between us. - Ephesians 2:14",
        "part8": [
            "EZEKIEL 8",
            "2 THESSALONIANS 3"
        ]
    },
    "14 AUGUST": {
        "part1": "Romans 5:1",
        "part2": "Peace of God and Peace with God",
        "part3": "VERSE 1",
        "part4": "Therefore being justified by faith, we have peace with God through our Lord Jesus Christ:",
        "part5": "Romans 5:1 speaks of \"peace with God\" rather than the \"peace of God\". But it is true that when we believe in the Lord, we will enjoy the peace of God that transcends all human understanding. In times of anxiety and stress, believers of Christ are able to turn our worries into prayers and enjoy the peace of God which Philippians 4:6-7 talks about.\n\nHowever, to enjoy God's peace in our hearts, we need first to establish our peace with Him through faith in our Lord Jesus Christ. Apostle Paul in Romans 1 speaks of the sinfulness of mankind. Throughout history even up to the present, sin has driven man to pursue the passions of the world and neglect God's truth and way. We grieve the Holy Spirit when we put ourselves above God in our daily thoughts and actions. Our God is just and He cannot let sin go unpunished. Thankfully, in His mercy and grace, He satisfied His wrath against men in Jesus Christ. The Lord Jesus shed His blood for us and we receive the benefits of His atonement by believing in Him, which leads to the establishing of peace with God.\n\nPeace has been provided by God sending His only Son to wash away our sins. Peace is received by us when our sins are forgiven through our repentance and faith in Christ. This peace gives us strength and courage to weather the trials of life. Nothing can take away our eternal security and the peace God has made with us because now we can boldly (confidently) seek His help in time of need [Hebrews 4:16].",
        "part6": "PRAYER",
        "part7": "O Lord my God, thank You for giving me the assurance that I have eternal peace with You. Strengthen my faith and let me be Your witness to others. Help me to share this wonderful Gospel with unsaved souls. Amen.",
        "part8": [
            "EZEKIEL 9",
            "1 TIMOTHY 1"
        ]
    },
    "15 AUGUST": {
        "part1": "Romans 5:2",
        "part2": "Access to God",
        "part3": "VERSE 2",
        "part4": "By whom also we have access by faith into this grace wherein we stand, and rejoice in hope of the glory of God.",
        "part5": "The Greek word translated \"access\" has the meaning of \"introduction\" or \"the right and freedom to enter\". To the Jews, it was unthinkable that man could have direct access to God. Our sins made us offensive to the holy God so we could never approach Him. In the Temple, a heavy curtain served as a barrier to entry into the Holy of Holies where God's divine presence was manifested. None could enter in except the High Priest who went in only once a year to make atonement for the sins of the nation and for himself. Even then, he could not enter unworthily lest he lose his life.\n\nThe death of our Lord Jesus Christ on Calvary's cross put an end to that. Although He was righteous and sinless, He bore all our sins upon Himself and faced the wrath of the Father by enduring the punishment we should have had. God the Father accepted the atoning sacrifice of His Son as evidenced by the tearing of the veil separating the Holy of Holies from the rest of the Temple [Matthew 27:51], a sign we can now approach God directly on the merit of our Saviour's work on the cross. Priests are no longer needed to be man's mediators before God.\n\nThere are no other means for us to have peace with God and gain access to Him, except by believing and accepting that the Lord Jesus Christ saved us from our sins. Have you placed your faith in the Saviour to do that?",
        "part6": "THOUGHT",
        "part7": "For through Him we both have access by one Spirit unto the Father. - Ephesians 2:18",
        "part8": [
            "EZEKIEL 10",
            "1 TIMOTHY 2"
        ]
    },
    "16 AUGUST": {
        "part1": "Romans 5:2",
        "part2": "Confidence before God",
        "part3": "VERSE 2",
        "part4": "By whom also we have access by faith into this grace wherein we stand, and rejoice in hope of the glory of God.",
        "part5": "The death of our Lord Jesus Christ on the cross for our sins results in His righteousness being imputed to us who believe. Now we stand before God, not as sinners and children of wrath but as His own, redeemed by the blood of the Lamb. Our adoption as sons and daughters of our heavenly Father grants us \"access with confidence\" to Him [Ephesians 3:12]. We have confidence God will hear our prayers and answer them according to His wise and perfect will. There is no fear God will ignore or refuse to answer because we have been justified by faith in Jesus to save us. This assurance should move us to come boldly and freely before God's throne of grace with all our petitions and intercessions.\n\nOur justification also affords us confidence before God because our position as His child is firm and immovable. We are saved by God's grace and kept saved by it. Our almighty and loving God is willing and able to keep us in His grace. Our Father who began a good work in us will perform it until we get to heaven [Philippians 1:6]. Christ's atoning death covers all our sins before our conversion and every iniquity thereafter. Our salvation is preserved and maintained not by our own efforts, thus there is no fear we can lose it through ignorance or neglect.\n\nEven as we seek our gracious Father each day, let us present our petitions to Him in the knowledge that He loves to commune with us and desires to bless us richly with His abundant mercies.",
        "part6": "THOUGHT",
        "part7": "Having therefore, brethren, boldness to enter into the holiest by the blood of Jesus, let us draw near with a true heart in full assurance of faith. - Hebrews 10:19, 22a",
        "part8": [
            "EZEKIEL 11",
            "1 TIMOTHY 3"
        ]
    },
    "17 AUGUST": {
        "part1": "Romans 5:2",
        "part2": "Glory of the Father and the Son",
        "part3": "VERSE 2",
        "part4": "By whom also we have access by faith into this grace wherein we stand, and rejoice in hope of the glory of God.",
        "part5": "The glory of God is rich in meaning and impossible to explain in a simple sentence because it encompasses several spiritual concepts.\n\nFirstly, glory is given to God who is the Almighty, so magnificent and excellent that He deserves our highest esteem and adoration. When we glorify and worship God, we are assigning to Him His true worth of being greatest of all. Our God is most worthy to be praised and most deserving of honour and glory because of who He is in His attributes. Thus the angels who worshipped God when they appeared to the shepherds at the birth of our Lord Jesus proclaimed, \"Glory to God in the highest\" [Luke 2:14].\n\nSecondly, the shekinah glory describes the visible manifestation of God's glory. It shines so brilliantly it cannot be approached. This glory reflected off Moses' face after he spent forty days and nights on Mount Sinai with God causing the Israelites to fear looking at him [Exodus 34:29-35]. The same glory descended onto the tabernacle [Exodus 40:34-38] and the Temple [1 Kings 8:10-11] so that Moses and the priests could not enter in to minister.\n\nAt the mount of Transfiguration, the disciples, Peter, James and John were given a glimpse of the glory that Jesus, the Son of God, shared with the Father [Matthew 17:1-5]. When Christ came to earth, His glory was hidden from man. His transfiguration revealed momentarily His glory to the disciples so they could bear witness of it. It was also a preview of His future glorification as King of kings. May we His disciples also acknowledge God's greatness and seek to glorify His name by our lives.",
        "part6": "THOUGHT",
        "part7": "Glory to God and praise and love, be ever, ever given, By saints below and saints above, the church in earth and heaven. - Charles Wesley",
        "part8": [
            "EZEKIEL 12",
            "1 TIMOTHY 4"
        ]
    },
    "18 AUGUST": {
        "part1": "Romans 5:2",
        "part2": "Hope of  glory",
        "part3": "VERSE 2",
        "part4": "By whom also we have access by faith into this grace wherein we stand, and rejoice in hope of the glory of God.",
        "part5": "Our justification grants us peace with God [v. 1] and access to Him. It enables us to rejoice in the hope of His glory. Paul was telling all Christians that we can be so joyful as to boast in the certainty we will possess the glory of God one day.\n\nThis glory is too wonderful and marvellous to comprehend. We will behold God's glory in heaven because we will live eternally with Him, clothed in the righteousness of our Saviour. God's Word promises us that when we die, we will be raised again. Our vile and perishable bodies will be \"fashioned like unto his glorious body\" [Philippians 3:21]. It will be immortal [1 Corinthians 15:53-54] and we will see Christ as He is [1 John 3:2].\n\nJob, in the midst of suffering, demonstrated a clear understanding of the resurrection when he said, \"though after my skin worms destroy this body, yet in my flesh I shall see God\" [Job 19:26]. He had faith God would raise him, give him a glorified body and he would see Jesus in heaven. At the Transfiguration, Moses and Elijah, who had died centuries earlier, appeared with the Lord Jesus in glorified bodies, signifying that believers who have died will enjoy eternal life in God's glory because our hope is in the Christ.\n\nWhat an incredible hope God has promised us. May we lay aside every doubt and fear, and live joyfully in anticipation of that blessed day when we will appear before our Lord in glory.",
        "part6": "THOUGHT",
        "part7": "Blessed be the God and Father of our Lord Jesus Christ, which according to His abundant mercy hath begotten us again unto a lively hope by the resurrection of Jesus Christ from the dead, to an inheritance incorruptible, and undefiled, and that fadeth not away, reserved in heaven for you. - 1 Peter 1:3-4",
        "part8": [
            "EZEKIEL 13",
            "1 TIMOTHY 5"
        ]
    },
    "19 AUGUST": {
        "part1": "Romans 5:3",
        "part2": "Glory in Tribulations",
        "part3": "VERSE 3",
        "part4": "And not only so, but we glory in tribulations also: knowing that tribulation worketh patience;",
        "part5": "Not only do we rejoice in the hope of the glory of God, but we glory in our present sufferings and afflictions. Take note it is one thing to submit to or endure tribulations without complaint, but it is quite another to find grounds for glorying in the midst of them. As old soldiers glory in their battle scars of honour, so do believers glory in their present sufferings and afflictions.\n\nPaul experienced many sufferings for the sake of the Gospel. He was whipped, beaten with rods, stoned, and shipwrecked [2 Corinthians 11:24- 25]. Peter and the apostles in Acts 5:27 were apprehended for preaching yet they were found \"rejoicing that they were counted worthy to suffer shame for his name\" [Acts 5:41]. Satan detests and despises the Gospel work being done. And he will throw everything in his arsenal to discourage the Christian. But we know that not even tribulation can separate us from the love of Christ [Romans 8:35].\n\nThe beauty of tribulation is in the end product that comes forth. The purpose of tribulation is not to produce a depressed and downcast Christian but to produce patience, experience, and hope. This is the true test of character. Tribulation tests and examines the Christian's heart, whether he/she is truly saved. And whenever our faith is successfully tested, it will be \"found unto (the) praise and honour and glory at the appearing of Jesus Christ\" [1 Peter 1:7].",
        "part6": "PRAYER",
        "part7": "Dear God, teach me to rejoice in the midst of trials, and help me to count it worthy to suffer for your name's sake. Amen.",
        "part8": [
            "EZEKIEL 14",
            "1 TIMOTHY 6"
        ]
    },
    "20 AUGUST": {
        "part1": "Romans 5:3-4a",
        "part2": "Purpose of Tribulation (1) - Patience",
        "part3": "VERSE 3",
        "part4": "And not only so, but we glory in tribulations also: knowing that tribulation worketh patience;",
        "part5": "Paul lists three purposes of tribulation, the first being patience. James in his letter reinforces this idea by stating that \"the trying of your faith worketh patience\" [James 1:3]. Although we desire tribulations to be resolved quickly, it is tribulations that cultivate patience within the believer. When Job lost his wealth, family and livelihood, his wife said to him, \"curse God, and die\" [Job 2:9]. Job instead, wept, prayed, and patiently endured until he was restored by God.\n\nDavid is another example. Although Samuel anointed David to be Israel's second king, David waited for God to remove Saul. Saul tried repeatedly to kill David, yet David remained patient until the day he was crowned king. Believers likewise can patiently endure because tribulations have a finite time. Peter describes tribulations and temptations as lasting only for a season implying the temporal nature of tribulations [1 Peter 1:6].\n\nIt is in the midst of tribulations that enduring faith in God's Word is tested - whether we stand on His precious promises or become impatient and turn to the world for solutions. The key is the foundation we are standing on. Have you strengthened your faith in God so that you can patiently endure through your tribulation? God's precious promises are like unused gift card credits which we have misplaced. There is much value in God's Word yet we fail to utilize it. Build up your defenses in times of peace so that you can patiently endure when Satan hurls trials and testings your way.",
        "part6": "PRAYER",
        "part7": "Dear Father, teach me to trust in your precious promises so that I can patiently endure the trials of life. Amen.",
        "part8": [
            "EZEKIEL 15",
            "2 TIMOTHY 1"
        ]
    },
    "21 AUGUST": {
        "part1": "Romans 5:4b",
        "part2": "Purpose of Tribulation (2) - Experience",
        "part3": "VERSE 4",
        "part4": "And patience, experience; and experience, hope:",
        "part5": "The tribulation which has wrought in us the habit of reliance on God, the patient persistence of endurance, develops in us the virtue of experience. Our modern definition of \"experience\" refers to the actual living through an event; however, \"experience\" means \"approvedness\" or \"proof \". Job's tribulation wrought patience, and that patience produced proof that he still \"hold(s) fast his integrity\" [Job 2:3]. Fake gold will darken under a flame while true gold will glow brighter. Tribulation holds the believer to a flame and proves his character.\n\nTribulations endured patiently show the believer what he or she is really made of. It validates the believer's faith and trust in God. When we endure, we demonstrate not only to ourselves but also to the world who and what we really are. In Daniel 3 when Shadrach, Meshach, and Abednego refused to worship Nebuchadnezzar's golden image, they were thrown into a fiery furnace. Their preservation from death proved they \"trusted in Him\", referring to God [Daniel 3:28].\n\nShadrach, Meshach, and Abednego's faith also demonstrated the power of the Almighty God. At times our patient endurance and experience speak louder than words. In 1 Peter 3:1, believing wives are to obey God's commandment of submission to the unbelieving husbands so that they would \"be won by the (conduct) of the wives\".",
        "part6": "THOUGHT",
        "part7": "Let your light so shine before men, that they may see your good works, and glorify your Father which is in heaven. - Matthew 5:16",
        "part8": [
            "EZEKIEL 16",
            "2 TIMOTHY 2"
        ]
    },
    "22 AUGUST": {
        "part1": "Romans 5:4b-5a",
        "part2": "Purpose of Tribulation (3)  - Unashamed Hope",
        "part3": "VERSE 5",
        "part4": "And hope maketh not ashamed; because the love of God is shed abroad in our hearts by the Holy Ghost which is given unto us.",
        "part5": "Patient endurance produces a tested character, and the latter possesses confident hope. Tribulations, rather than threatening or weakening our hope, as might be expected, will instead increase our certainty in that hope. One of the great obstacles to a strong hope in the glory of God is the fear that we are hypocrites. But when our faith has been put to the test and we have patiently endured tribulations, we have hope because it proves that we are genuine and real Christians.\n\nWorldly hope contains several degrees of uncertainty and is deceiving at times. We hope something will happen, and when they don't turn out as we hope for, we are embarrassed and almost always painfully disappointed. But the hope of God's glory does not put us to shame nor will it disappoint us. This hope is \"both sure and steadfast\" and is based on the certainty of divine love [Hebrews 6:19].\n\nWhen we patiently endure through tribulations we are assured that our faith is not hypocritical. Will we endure through tribulation in faith and hope and in the end be disappointed? Paul reassures us that we can have an unashamed hope because the Holy Spirit has come into our lives and has begun to flood our hearts with an immediate sense of God's reality and love.",
        "part6": "THOUGHT",
        "part7": "... Behold, I lay in Sion a chief corner stone, elect, precious: and he that believeth on Him shall not be confounded. - 1 Peter 2:6",
        "part8": [
            "EZEKIEL 17",
            "2 TIMOTHY 3"
        ]
    },
    "23 AUGUST": {
        "part1": "Romans 5:5b",
        "part2": "Love of God Shed in our Hearts",
        "part3": "VERSE 5",
        "part4": "And hope maketh not ashamed; because the love of God is shed abroad in our hearts by the Holy Ghost which is given unto us.",
        "part5": "Paul reminds us that after we believe we are \"sealed with (the) Holy Spirit of promise\" [Ephesians 1:13]. It is the ministry of the Holy Spirit to fill us with the love of God. The grammatical tense implies that the Holy Spirit filled our hearts in the past and still fills it today. Note God's love for us is not rationed drop by drop. On the contrary, the Holy Spirit sheds and pours it into the hearts of the redeemed.\n\nThe confidence we have in the day of judgment is not based only on our intellectual recognition of the fact of God's love, or even on the demonstration of God's love on the cross, but also on the inner, subjective certainty that God loves us. This is the point Paul is making when he affirmed that God's love has been \"shed abroad in our hearts by the Holy Spirit which is given unto us\".\n\nHow can a believer glory in tribulation? Because we have a certain hope that is buoyed by the love of God that keeps us afloat. Whenever you are facing difficult circumstances remind yourself of the wondrous love of God at the cross and it will fill your heart with the strength it needs to patiently endure. This is our \"anchor that keeps the soul steadfast and sure while the sea billows roll\" [Priscilla J. Owens].",
        "part6": "THOUGHT",
        "part7": "There is no room for fear, anxiety, stress, and despair once the love of God is shed abroad in our hearts.",
        "part8": [
            "EZEKIEL 18",
            "2 TIMOTHY 4"
        ]
    },
    "24 AUGUST": {
        "part1": "Romans 5:6",
        "part2": "God's Love for Sinners",
        "part3": "VERSE 6",
        "part4": "For when we were yet without strength, in due time Christ died for the ungodly.",
        "part5": "The Bible states clearly that we are God's enemies by nature. This enmity is expressed in our sinful rebellion against Him. The common view of this is that we are estranged from God, but He is not estranged from us. The hostility is all one-sided and that God goes on loving us with an unconditional love while we remain hateful toward Him. We tend to think God must love us for some reason within ourselves. But Scripture clearly says there is nothing in us to love. God is the One who loved us and gave us our salvation. We were not given salvation because we had earned it or worked for it.\n\nThe precious promise of God is that while we were weak and ungodly, without strength and hope, the Lord Jesus died for us who were dead in trespasses and sins. Yes, Jesus died for the ungodly. Jesus did not wait for us to get everything together and be somehow righteous before He was prepared to die for us. Our sins necessitated His sacrifice, and even before we truly understood that, Jesus paid the price to reverse our fallen condition.\n\nNow eternally saved by grace, we can glory in the trials and tribulations of life which God uses to develop perseverance in us. We can only be in awe, as we realize the Lord gave up so much for the redemption of a people who deserve nothing at all. May we grasp the depth of our sin and thus better appreciate this Divine love for odious sinners.",
        "part6": "THOUGHT",
        "part7": "God loves the sinful, who are repentant and trusting Christ, and hates our sin.",
        "part8": [
            "EZEKIEL 19",
            "TITUS 1"
        ]
    },
    "25 AUGUST": {
        "part1": "Romans 5:6",
        "part2": "God's Love at Calvary",
        "part3": "VERSE 6",
        "part4": "For when we were yet without strength, in due time Christ died for the ungodly.",
        "part5": "When we consider the holy and righteous God and our unclean and rebellious character, we realize there is no reason why He should love us. Yet God has proven the depths of His love by sending His beloved Son, Jesus Christ, to deliver us from our sins by His blood, and then transform us progressively to be like Him in holiness and righteousness. The Lord Jesus' death on the cross is the ultimate expression of God's love for mankind: He sent His one and only Son into the world so we who are dead in sin might live through Him. This is love: not that we loved God, but that He loved us and gave His Son to be the atoning sacrifice for our sins.\n\nThe Cross of Calvary is the symbol of God's love. Words and songs may speak of this love, but it is the action of Jesus dying on the Cross that manifests the greatness of God's love for us. The desire and cry of every true believer's heart then is not only to apprehend the love of God more clearly, but to rest in it and be conformed more fully to it in their personal character and daily life.\n\nYou may have doubted God's love for you at some point in your life when you were faced with tough decisions, financial concerns, emotional and physical heartache or personal loss. Look to the Lord Jesus in faith and the Sun of righteousness will dispel the fog of doubt [Malachi 4:2].",
        "part6": "THOUGHT",
        "part7": "At Calvary, the love of God met the need of sinful man, and the ultimate price was paid for our redemption.",
        "part8": [
            "EZEKIEL 20",
            "TITUS 2"
        ]
    },
    "26 AUGUST": {
        "part1": "Romans 5:7",
        "part2": "Dying for a Friend - Human Love",
        "part3": "VERSE 7",
        "part4": "For scarcely for a righteous man will one die: yet peradventure for a good man some would even dare to die.",
        "part5": "When the Lord Jesus confided in His disciples [John 15:14-15] about His impending persecution, desertion, crucifixion, death and resurrection, Peter's reply was, \"I will lay down my life for thy sake,\" [John 13:37b] and \"Likewise also said all the disciples\" [Matthew 26:35b]. The love they had for the Lord was undeniably genuine and sincere but it was only human love. When He was arrested, they all forsook Him.\n\nLove is a profound word but often loosely used. People casually say \"I love this dish or ice-cream, that dress or shoes.\" In biblical Greek however, love is expressed in four different forms. Familial love is expressed as \"storge\"; love between husband and wife or romantic love, \"eros\"; friendship or brotherly love, \"philia\"; God's sacrificial love, \"agape\".\n\nAfter His resurrection, Christ asked Peter, \"lovest (agape) thou me ...?\" to which Peter replied, \"Yea, Lord; thou knowest that I love (philia) thee\" [John 21:15]. Christ here spoke of agape but Peter replied with philia. He asked Peter again to his same reply. Christ asked the third time, \"lovest (philia) thou me?\" and Peter was grieved because Christ now spoke of a lesser love, philia.\n\nPeter was unable to reciprocate the love his Lord had for him. Yet he was not rejected but given the commission to \"feed my lambs\" and \"feed my sheep\". God knows our limitations. \"A bruised reed shall he not break, and smoking flax shall he not quench\" [Matthew 12:20a]. Peter's love for Christ would grow as he continued in His love. And this reformed and restored disciple would finally give his life for His Master [John 21:18-19]. The greatest commandment still is to love God with all our heart, mind, soul and strength.",
        "part6": "THOUGHT",
        "part7": "We love Him, because He first loved us. - 1 John 4:19",
        "part8": [
            "EZEKIEL 21",
            "TITUS 3"
        ]
    },
    "27 AUGUST": {
        "part1": "Romans 5:8",
        "part2": "Dying for Your Enemy - Divine Love",
        "part3": "VERSE 8",
        "part4": "But God commendeth his love toward us, in that, while we were yet sinners, Christ died for us.",
        "part5": "Naturally, we love those who love us; we love those who do good to us. We are angry with, even hate those who intentionally seek to hurt us. To love those who love us is human; to hate those who love us is devilish; to love those who hate us is divine.\n\nIn the past, we were alienated from God and were His enemies by our wicked works. We broke every law of God, and the handwriting of ordinances was against us; the wrath of God was upon us, and a certain fearful looking for of judgment and fiery indignation awaits us. From divine justice's point of view, we deserve hell.\n\nO helpless, hopeless sinner, how can we stand before a holy and just God who is angry with the wicked every day? Not only have we broken all His commandments, we broke His heart. We have often provoked Him to anger, wearied Him with our countless sins, grieved and quenched the Holy Spirit. Often, we resist the Holy Spirit's prompting and shut our ears to His tender voice. How shall we flee the wrath to come?\n\nHow is \"love thine enemy\" demonstrated in the Person of the God-man, Christ Jesus? He died for the ungodly, He took the sinners' place and drank the cup of God's wrath on their behalf because He loves them with a perfect love. He died for them; He lives for them; He is coming again for them. Before, condemned sinners and haters of God, now, beloved of God and lovers of Him.",
        "part6": "THOUGHT",
        "part7": "Amazing love! How can it be that Thou, my God, shouldst die for me?",
        "part8": [
            "EZEKIEL 22",
            "PHILEMON"
        ]
    },
    "28 AUGUST": {
        "part1": "Romans 5:8",
        "part2": "The Greatness of God's Love",
        "part3": "VERSE 8",
        "part4": "But God commendeth his love toward us, in that, while we were yet sinners, Christ died for us.",
        "part5": "By man's tragic fall to sin, the greatness of God's love was fully manifested in the death of His Son Jesus Christ. We sometimes wish our first parents Adam and Eve had never sinned. Then life would be perfectly blissful for them and their descendants - free from sin, sickness, sorrow, misery and death. It would be heaven on earth. But then, we would only know the benevolent love of God. Who would have thought, not even the angels, that God would humble Himself, take on human flesh, live a sinless life, and offer Himself a sacrifice on behalf of fallen men that they might live again unto eternal life in God? Without controversy, great is the mystery of godliness!\n\nLove is such a powerful force that it caused the omnipotent God to sacrifice Himself to save undeserving and unworthy sinners whom He loves. For love's sake, Christ was willing to suffer the humiliation of cruel men, mockery of sinners, scorn of the wicked, crucifixion by the ungodly. Charity suffereth long, and is kind ... beareth all things ... endureth all things [1 Corinthians 13:4, 7]. Here is love in its noblest form, love of every love the best! But where the curse of sin abounds, the love of God did much more abound!",
        "part6": "THOUGHT",
        "part7": "O matchless love! O love divine! It's length, and breadth, and height, and depth, Should shed abroad this heart of mine, Amazing love so strong as death! Come love of Christ, Inflame my heart, So sweet, unchanging and pure. How shall I from this love depart, unconditional and sure.   Could we with ink the ocean fill, ... and every man a scribe by trade. To write the love of God above, would drain the ocean dry. - Frederick M. Lehman",
        "part8": [
            "EZEKIEL 23",
            "HEBREWS 1"
        ]
    },
    "29 AUGUST": {
        "part1": "Romans 5:9a",
        "part2": "Justified by the Son's Blood",
        "part3": "VERSE 9a",
        "part4": "Much more then, being now justified by His blood ...",
        "part5": "Two keywords in Romans 5:9a are the focus of our meditation today. The first is \"justified\". Justification, as explained by John Calvin, is simply \"the acceptance with which God receives us into his favour as righteous men\" (John Calvin, Institutes of the Christian Religion). In a court of law, when an innocent man is wrongly accused of a crime and brought before a just judge, he will be judged according to his innocence and said to be \"justified\" before the judge. However, no sinner can find favour in God's eyes, because sin is an abomination to Him. Since no man is perfectly innocent of sin, no man can be justified before God.\n\nThis brings us to the second keyword, which is \"blood\". In this context, it is the blood of the Lord Jesus Christ. We are justified by Christ's blood, which He shed when He died on the cross. Blood represents life and death, and plays an important role in the Jewish rituals of cleansing and atonement for the people's sins. The blood of animals sacrificed in the temple signifies that a death had occurred in atonement and shows the way for transgressors to be reconciled to God. So, Christ would shed His blood and sacrifice His life to perfectly and fully atone for the sins of the world.\n\nAre you troubled by the guilt of your sins? Look to Christ's sacrificial blood and come to God in faith. You will be justified in God's sight because Christ died and shed His blood for your sins.",
        "part6": "THOUGHT",
        "part7": "So Christ was once offered to bear the sins of many; and unto them that look for Him shall He appear the second time without sin unto salvation. - Hebrews 9:28",
        "part8": [
            "EZEKIEL 24",
            "HEBREWS 2"
        ]
    },
    "30 AUGUST": {
        "part1": "Romans 5:9b",
        "part2": "Saved from the Father's Wrath",
        "part3": "VERSE 9b",
        "part4": "... we shall be saved from wrath through Him.",
        "part5": "Our focus today is the fearful wrath of God, which in our referenced text says we, who have been justified, are saved from. God's wrath comes from His aversion to and displeasure against sin. It is manifested in the consequential calamities He metes out to the unrepentant. When Pharaoh hardened his heart and did not let the Hebrews go, God sent plagues to punish him. The Bible is full of examples that tell us how God deals with those who disobey Him, even the Jews. See for example, Ezekiel 22.\n\nGod's wrath is as real today as it was in biblical times. We all are born sinners, and from the moment of birth God's wrath is upon us [Ephesians 2:2-3]. Indeed, for all unrepentant sinners, God's wrath awaits the last day, when Christ will come to judge the world. This \"wrath to come\" [Matthew 3:7; Luke 3:7; 1 Thessalonians 1:10] is synonymous with the judgment of hell, reserved for all who do not repent of their sins and accept the offered way of salvation.\n\nDear readers, do not delay. If you are enjoying the pleasures of sin, know that it is but for a season, and there is a wrath to come, an eternity of hell to suffer for this brief period of sinful enjoyment. Repent now, confess your sins to the Lord Jesus Christ and ask Him to forgive and take away the guilt in your hearts. He died for your sins and rose again the third day to deliver you from the wrath to come.",
        "part6": "THOUGHT",
        "part7": "But if we walk in the light, as He is in the light, we have fellowship one with another, and the blood of Jesus Christ His Son cleanseth us from all sin. - 1 John 1:7",
        "part8": [
            "EZEKIEL 25",
            "HEBREWS 3"
        ]
    },
    "31 AUGUST": {
        "part1": "Romans 5:10",
        "part2": "Reconciliation",
        "part3": "VERSE 10",
        "part4": "For if, when we were enemies, we were reconciled to God by the death of His Son, much more, being reconciled, we shall be saved by His life.",
        "part5": "Granted that we cannot get along with everyone we meet in life, and there may be those we consider to be \"enemies\". They could be our good friends formerly who have offended or been offended by us, and now we refuse to fellowship or even make eye contact with. God and Adam had a perfect relationship until the day Adam sinned. Adam broke his commitment to God's command by eating the forbidden fruit. So, Adam and all humankind after him suffered a broken relationship with God. Now, only God can initiate reconciliation with man by dealing with Adam's sin. The sin of disobedience to God's Word continued from Adam to us today. The penalty for sin is death. However, God loved us and does not wish that anyone should die. \"But (God) is longsuffering to us-ward, not willing that any should perish, but that all should come to repentance.\" [2 Peter 3:9] God in His mercy and grace sent His Son Jesus to pay the penalty of man's sin. Being fully man, the Incarnate Christ could represent sinful mankind like us. But He is also fully God and therefore sinless. He is the only One qualified to be the perfect and acceptable atoning sacrifice for our sins by dying on our behalf. Those who trust in Him are reconciled with God. To be reconciled is to have fellowship with God. Since God is eternal, we too will have eternal life. We can live because the Lord Jesus died for us.",
        "part6": "THOUGHT",
        "part7": "For as by one man's disobedience many were made sinners, so by the obedience of one shall many be made righteous. - Romans 5:19",
        "part8": [
            "EZEKIEL 26",
            "HEBREWS 4"
        ]
    },
    "1 SEPTEMBER": {
        "part1": "Romans 5:10",
        "part2": "Saved by His Life",
        "part3": "VERSE 10",
        "part4": "For if, when we were enemies, we were reconciled to God by the death of His Son, much more, being reconciled, we shall be saved by His life.",
        "part5": "Would you do anything to save one who was your enemy? Because of our sins, we were enemies with God who is holy. Sin and holiness are like water and oil. The two cannot mix. In our sinful state therefore, God can have no relationship with us. But out of love, He sent His Son, the Lord Jesus to die as the payment for our sins. This is the only way to make reconciliation between the holy God and sinful man.\n\nJesus as the Son of God was obedient to the Father. He knew His mission was to come into the world to die for sinful mankind. As a man, Jesus endured all the hardships of physical life. He felt hunger, sorrow and was acquainted with all the emotions we experience. He worked as a man and fully understood the temptations and difficulties we face in life. He knows our weaknesses and fears. Yet He was without sin. As a man, Jesus could represent us and take our penalty. As God, He could obey and keep perfectly the whole Law of God.\n\nGod accepted this \"offering lamb\" in Jesus to atone for our sins because Jesus is the perfect man. He obeyed God to the very end to die on the cross. He took over our sins. On His account, we are free from its penalty and God counts all who believe in His Son to be absolved from guilt. We who were once enemies of God are now reconciled through His death on the cross and His resurrection from the grave. No more enemies but children of God in Christ Jesus.",
        "part6": "THOUGHT",
        "part7": "For Christ also hath once suffered for sins, the just for the unjust, that he might bring us to God, being put to death in the flesh, but quickened by the Spirit. - 1 Peter 3:18",
        "part8": [
            "EZEKIEL 27",
            "HEBREWS 5"
        ]
    },
    "2 SEPTEMBER": {
        "part1": "Romans 5:11",
        "part2": "Reconciled and Rejoicing",
        "part3": "VERSE 11",
        "part4": "And not only so, but we also joy in God through our Lord Jesus Christ, by whom we have now received the atonement.",
        "part5": "What are the remarkable benefits for those whom God has declared righteous by faith in Him? Not only are we justified by the blood of Christ, not only are we saved by Christ from God's wrath, but we are also reconciled to Him. Our relationship with the holy God is transformed. We no longer fear Him as a distant, frightening figure who is impossible to please.\n\nTo grasp how wondrous Paul's declaration is, just recall the time you were in bitter argument with someone. It was difficult even to be in the same room with them. Our hearts were twisted in anger at the very thought of them. \"Reconciliation\" is when two such estranged persons forgive each other. The relationship is not only restored but can now develop into one where both enjoy each other's presence.\n\nSimilarly, we were separated bitterly from God while we did not have faith in Christ. Our dispute with Him was no simple human quarrel. God is holy, pure and perfect, and He hates sin [Isaiah 6:3; Psalm 5:4]. As sinners, we were like filthy rags before God [Isaiah 64:6]. To make things right between us and God, Christ had to die on the cross, bearing the wrath of God against sin. Thus, while we are still imperfect, Paul tells us that by our faith in Jesus Christ we have now received the atonement.\n\nIn Christ, we are saved and safe because we are now reconciled with God and will forevermore be.",
        "part6": "THOUGHT",
        "part7": "The LORD is my strength and song, and is become my salvation. The voice of rejoicing and salvation is in the tabernacles of the righteous: the right hand of the LORD doeth valiantly. [Psalm 118:14-15].",
        "part8": [
            "EZEKIEL 28",
            "HEBREWS 6"
        ]
    },
    "3 SEPTEMBER": {
        "part1": "Romans 5:11",
        "part2": "Atonement",
        "part3": "VERSE 11",
        "part4": "And not only so, but we also joy in God through our Lord Jesus Christ, by whom we have now received the atonement.",
        "part5": "Once a year on the Day of Atonement, the high priest would enter the inner sanctum of the Holy Temple in Jerusalem to perform a complex ceremony to ask God's forgiveness on behalf of all Israel [Leviticus 16]. A scapegoat would be chosen to be presented alive before God, \"to make an atonement with him\", and then it would be released into the wilderness bearing the sins of the people, who would then be clean from all their sins before God [Leviticus 16:8-10, 16-29]. This annual cycle would go on. Atonement through ritual sacrifice was of temporary and limited effectiveness and had to be repeated again and again by the priests.\n\nIn contrast, when the Lord Jesus Christ died for us on the cross, He \"offered one sacrifice for sins for ever\" and then gloriously \"sat down on the right hand of God\" [Hebrews 10:10, 12]. The Day of Atonement in Leviticus 16 foreshadowed and anticipated a greater, permanent cleansing of God's people which would be accomplished by the one and forever sacrifice of a perfect high priest - Christ.\n\nWhen we wrong someone, we are expected to make amends or face retribution. In response, we try to remedy the situation and make it up to the other person. With God, we who ought to bear the punishment for our sins are let off scot-free, because Christ, the God-incarnate, took our place as the perfect, permanent sacrifice. Through His atonement, we are reconciled forever with God.",
        "part6": "THOUGHT",
        "part7": "Jesus my great High Priest, Offered His blood and died; My guilty conscience seeks, No sacrifice beside. His powerful blood did once atone, And now it pleads before the Throne. - Isaac Watts",
        "part8": [
            "EZEKIEL 29",
            "HEBREWS 7"
        ]
    },
    "4 SEPTEMBER": {
        "part1": "Romans 5:12",
        "part2": "Sin and Death through Adam",
        "part3": "VERSE 12",
        "part4": "Wherefore, as by one man sin entered into the world, and death by sin; and so death passed upon all men, for that all have sinned:",
        "part5": "When Russian president Putin declared war on Ukraine, many ordinary Russians who did not agree with him suffered the consequences. Economic sanctions by Western countries caused hardship for the people. Russian soldiers suffered and died in the fighting. \"It's so unfair\" they may say. Because of one man's decision, the whole country suffers. But those are the 'rules' of government and politics. It is based on the representative principle. This principle is clearly taught in the answer to Question 16 of the Westminster Shorter Catechism: \"The covenant being made with Adam, not only for himself, but for his posterity; all mankind, descending from him by ordinary generation, sinned in him, and fell with him, in his first transgression.\"\n\nPaul states it very simply in our text; \"as by one man sin entered into the world, and death by sin\". God warned Adam not to eat of the tree of the knowledge of good and evil, saying; \"for in the day that thou eatest thereof thou shalt surely die\" [Genesis 2:17]. But Adam, our first parent disobeyed. Theologians call his transgression the Original Sin, which is defined as \"that moral corruption in which every human being is born with, and it consists of both the judicial guilt and the actual corruption of humanity which results from Adam's sin\".\n\nYes, we are all sinners, and as sinners, we have to suffer its consequences. The Bible tells us \"the wages of sin is death\" [Romans 6:23]; but thank God the same verse also says \"but the gift of God is eternal life through Jesus Christ our Lord.\"",
        "part6": "THOUGHT",
        "part7": "Fear nothing but to sin. This should be every believer's motto. - James Smith, Daily Remembrancer",
        "part8": [
            "EZEKIEL 30",
            "HEBREWS 8"
        ]
    },
    "5 SEPTEMBER": {
        "part1": "Romans 5:12",
        "part2": "All have Sinned",
        "part3": "VERSE 12",
        "part4": "Wherefore, as by one man sin entered into the world, and death by sin; and so death passed upon all men, for that all have sinned:",
        "part5": "Note this significant fact: a man is not condemned to death because of Adam's sin. Scripture clearly says: \"Death passed upon all men, for that all have sinned.\" A man dies because of his own sins, not his father's. Every man is personally responsible to God. The phrase, \"all have sinned\" does not merely mean that all men have sinned at some time or other, but that all sinned representatively when Adam sinned. John Owen, in his book The Holy Spirit: His Gifts and Power, explains it this way: \"Sin is either original or actual. Original sin is the habitual inconformity of our natures to the holiness of God, expressed in the law of creation. Actual sin is in our inconformity to God and His holiness, expressed in the particular commands of the law.\" To put it simply, we have all been born with a sin nature, and we all sin.\n\nThere are many verses in the Bible attesting to this indisputable fact. Here are a few: \"For there is no man that sinneth not\" [1 Kings 8:46]; \"Who can say, I have made my heart clean, I am pure from my sin?\" [Proverbs 20:9]; \"The heart is deceitful above all things, and desperately wicked: who can know it?\" [Jeremiah 17:9]; \"For there is not a just man upon earth, that doeth good, and sinneth not.\" [Ecclesiastes 7:20].\n\nUnderstanding this simple truth should cause us all to cry out in desperation as the Philippian jailer did, \"What must I do to be saved?\" [Acts 16:30]",
        "part6": "THOUGHT",
        "part7": "And they said, Believe on the Lord Jesus Christ, and thou shalt be saved, and thy house. - Acts 16:31",
        "part8": [
            "EZEKIEL 31",
            "HEBREWS 9"
        ]
    },
    "6 SEPTEMBER": {
        "part1": "Romans 5:12",
        "part2": "Why and How",
        "part3": "VERSE 12",
        "part4": "Wherefore, as by one man sin entered into the world, and death by sin; and so death passed upon all men, for that all have sinned:",
        "part5": "Just as God had warned, when Adam disobeyed God, he died; first spiritually, and then, physically. But it did not end there: it affected the entire creation, the whole earth, all living things and most crucially, all his descendants. Louis Berkhof explains it this way in his Systematic Theology.\n\n\"As result of the fall, the father of the race could only pass on a depraved human nature to his offspring. From that unholy source, sin flows on as an impure stream to all the generations of men, polluting everyone and everything with which it comes in contact. It is exactly this state of things that made the question of job so pertinent, 'Who can bring a clean thing out of an unclean? not one' [Job 14:4].\"\n\nToday, every one of us lives with the consequences of Adam's sin. We possess a sin nature and struggle daily with sin. The Apostle Paul describes his frustration in Romans 7:14-25; a frustration every Christian can identify with. Our sinful flesh refuses to respond to the requirements of God's Law. Those things which we as Christians despise, we find ourselves doing. Those things which we as Christians desire, we fail to accomplish. No matter how much we may wish to serve God in our minds, we find ourselves sinning in our bodies. Like the Apostle, we cry out; \"O wretched man that I am! who shall deliver me from the body of this death?\" [Romans 7:24]. But we thank God for providing the answer to that question in the person of the Lord Jesus Christ, the Second Adam.",
        "part6": "THOUGHT",
        "part7": "As the salt flavours every drop in the Atlantic, so does sin affect every atom of our nature. - Charles H. Spurgeon",
        "part8": [
            "EZEKIEL 32",
            "HEBREWS 10"
        ]
    },
    "7 SEPTEMBER": {
        "part1": "Romans 5:13",
        "part2": "No Law, No Sin",
        "part3": "VERSE 13",
        "part4": "For until the law sin was in the world: but sin is not imputed when there is no law.",
        "part5": "\"Sin is not imputed when there is no law.\" Theoretically, this is correct. Since sin is a violation of law, people cannot be held guilty unless there is a law which they knowingly violate. But sin and death existed long before the giving of the Moral Law in Exodus 20. People know innately that they have sinned against God when they commit certain acts. For example, Joseph rejected the advances of Potiphar's wife saying; \"how then can I do this great wickedness, and sin against God\" [Genesis 39:9]. Similarly, when the men of Sodom demanded that Lot handed over the two angels who were with him, he pleaded with them to \"do not so wickedly\" [Genesis 19:7]. Both Joseph and Lot lived long before Moses gave the commandment against adultery and taught the people that homosexuality was an abomination in God's eyes.\n\n\"For until the law sin was in the world\". All have sinned, because sin was always in the world, not only after the law was given by Moses, but also before. So sin was imputed or charged upon man even before Moses' time, and death passed upon all.\n\nTragically, we live in an age where people knowingly violate the Law of God. They call good evil, and evil good. For example, in so-called Christian societies like Canada, America and Great Britain, anyone who dares to call homosexuality a sin is labelled as hateful and punishable by law. Some pastors even solemnize same-sex marriages in their churches. May the Lord protect us and our children in this wicked and perverse generation.",
        "part6": "THOUGHT",
        "part7": "Wherefore come out from among them, and be ye separate, saith the Lord, and touch not the unclean thing; and I will receive you. - 2 Corinthians 6:17",
        "part8": [
            "EZEKIEL 33",
            "HEBREWS 11"
        ]
    },
    "8 SEPTEMBER": {
        "part1": "Romans 5:14",
        "part2": "The Reign of Death",
        "part3": "VERSE 14",
        "part4": "Nevertheless death reigned from Adam to Moses, even over them that had not sinned after the similitude of Adam's transgression, who is the figure of him that was to come.",
        "part5": "The phrase \"death reigned\" and a variation of it appear three times in Romans chapter 5: \"death reigned from Adam to Moses\" in verse 14; death reigned \"by one man's offence\" verse 17; and \"sin hath reigned unto death\" verse 21. The repetition implies the importance of this concept for understanding the passage.\n\nBy saying that \"death reigned\", Paul is not only reiterating the point that death is universal, but also emphasizing the power death holds over mankind. Like an absolute monarch, death rules over all with complete authority. All are subject to death because all have sinned. God's holiness and justice require all sinners to be punished with death.\n\nThe phrase \"death reigned' also suggests that death can be defeated. Since the reign of death is a result of God's judgment for sin, the power of sin and death would be overcome when God's justice is satisfied. Indeed, God's justice was satisfied in Christ - by His suffering and death as a substitute for sinners. For those who trust in Christ as their Lord and Saviour, the penalty for their sins has been fully paid for by His atoning death.\n\nFor believers, although our bodies will still die, sin and death have no power over us. We triumph over sin in this life because we have spiritual life in Christ. When Christ returns, death will be destroyed [1 Corinthians 15:26]. The bodies of the dead shall be resurrected and all who are in Christ shall enjoy eternal life with Him.",
        "part6": "THOUGHT",
        "part7": "Forasmuch then as the children are partakers of flesh and blood, he also himself likewise took part of the same; that through death he might destroy him that had the power of death, that is, the devil. And deliver them who through fear of death were all their lifetime subject to bondage. - Hebrews 2:14-15",
        "part8": [
            "EZEKIEL 34",
            "HEBREWS 12"
        ]
    },
    "9 SEPTEMBER": {
        "part1": "Romans 5:14",
        "part2": "From Adam to Moses",
        "part3": "VERSE 14",
        "part4": "Nevertheless death reigned from Adam to Moses, even over them that had not sinned after the similitude of Adam's transgression, who is the figure of him that was to come.",
        "part5": "In verse 14, Paul links the reign of death to a specific time period: \"from Adam to Moses\". But death reigns over all men and over all time periods. Whether they live in the past, present or future, they die. So why does Paul specify a time period for death's reign?\n\nHere, Paul is not limiting the reign of death to a specific period, but highlighting the fact that people died even during the time between Adam and Moses. What is so special about that period? It is the period before the law was given to Moses. Earlier in verse 13, Paul makes it clear that no one can be accused of violating the law if the law does not exist. So even though the people of that period actually sinned, sin could not be counted against them because the law had not been given to them. Consequently, they could not be subjected to death. They had not sinned like Adam who disobeyed a direct commandment of God. But still, they died - not for their personal transgressions, but for the sin of Adam, who represented all men in his sin.\n\nFor believers, our sins are also not counted against us but for a different reason. Our sins have been imputed to the Lord Jesus Christ, who took upon Himself the full punishment that we deserve for our sins. This does not give us the license to sin as much as we want. Death continues to be a sombre reminder of the gravity of sin, and this should guide us in how we should live.",
        "part6": "THOUGHT",
        "part7": "Let us hear the conclusion of the whole matter: Fear God, and keep his commandments: for this is the whole duty of man. For God shall bring every work into judgment, with every secret thing, whether it be good, or whether it be evil. - Ecclesiastes 12:13-14",
        "part8": [
            "EZEKIEL 35",
            "HEBREWS 13"
        ]
    },
    "10 SEPTEMBER": {
        "part1": "Romans 5:14",
        "part2": "All must die",
        "part3": "VERSE 14",
        "part4": "Nevertheless death reigned from Adam to Moses, even over them that had not sinned after the similitude of Adam's transgression, who is the figure of him that was to come.",
        "part5": "Death is no respecter of persons. Regardless of one's age, race, religion, and social status, all must die. Knowing that we will all die someday, what is your attitude towards death?\n\nSome accept death as a natural and inevitable part of life. Some are fatalistic, thinking that death comes as it wills; there is nothing they can do to delay it. Others deny death's inevitability. They go to great lengths to defeat this enemy - through diets, fitness programs, health spas, nutritional supplements, and a host of programs and procedures to enhance their physical and mental well-being. Whether a person accepts or denies death, few face it without a tinge of fear. And for those who have been robbed of their loved ones, few have not been struck by pain and grief.\n\nWhat should the Christian's attitude towards death be? Christians defy death. While death is inevitable for all, it is by no means natural. Death is not part of God's design for man at creation, but the result of God's judgment upon all for the sin of Adam [Romans 5:12]. And God provides the solution. He sent His only Son, the Lord Jesus, to take the punishment for our sins. Jesus suffered and died in our place and rose again. Because of His resurrection, all who believe in Him will have the blessed hope of bodily resurrection and eternal life. So, although Christians also die physically, death and sin no longer have power over us, for the Lord Jesus Christ has conquered death.",
        "part6": "THOUGHT",
        "part7": "O death, where is thy sting? O grave, where is thy victory? The sting of death is sin; and the strength of sin is the law. But thanks be to God, which giveth us the victory through our Lord Jesus Christ. - 1 Corinthians 15:55-57",
        "part8": [
            "EZEKIEL 36",
            "JAMES 1"
        ]
    },
    "11 SEPTEMBER": {
        "part1": "Romans 5:14",
        "part2": "Adam - A Figure to Come",
        "part3": "VERSE 14",
        "part4": "Nevertheless death reigned from Adam to Moses, even over them that had not sinned after the similitude of Adam's transgression, who is the figure of him that was to come.",
        "part5": "Paul describes Adam as \"the figure of him that was to come\". The word \"figure\" is translated from the Greek word typos. The original meaning of typos is a mark made as a result of a blow or pressure, like the marks made by the nails on the hands of the risen Christ [John 20:25]. Later, typos took on a wider range of meanings. It can mean a person, object or event that typified or prefigured something besides itself, just as Adam is a \"type\" or \"figure\" of the One who was to come, that is the Lord Jesus Christ. Through Adam, we see glimpses of truths that would be fully revealed later in Christ.\n\nAdam is not the only \"type\" of Christ. On the road to Emmaus, Jesus explained to two disciples what was said in \"all the Scriptures\" concerning Himself [Luke 24:27]. This means that the Old Testament, in one way or another, points to Christ. For example, Solomon, a great teacher of wisdom, prefigures Christ, the greatest teacher of wisdom. The raising of the brazen serpent foreshadows Christ's death on the cross.\n\nTypology underscores the sovereignty and immutability of God. God directs history in such a way that the past foreshadows the future. There is an unbroken continuity in His redemptive plan; we can trust Him to bring His purposes to pass. We can also find comfort in knowing God is not capricious or random but will deal with us in the same way as He dealt with people in the past.",
        "part6": "THOUGHT",
        "part7": "The counsel of the LORD standeth for ever, the thoughts of his heart to all generations. - Psalm 33:11",
        "part8": [
            "EZEKIEL 37",
            "JAMES 2"
        ]
    },
    "12 SEPTEMBER": {
        "part1": "Romans 5:14",
        "part2": "Adam and Christ - Similarities",
        "part3": "VERSE 14",
        "part4": "Nevertheless death reigned from Adam to Moses, even over them that had not sinned after the similitude of Adam's transgression, who is the figure of him that was to come.",
        "part5": "It may seem strange that Adam is described as a figure of Christ. How can sinful Adam be said to represent Jesus Christ, the sinless Son of God? In what ways are they similar?\n\nAdam parallels Christ in several important ways. First, they were both appointed by God to be representatives of humanity. Paul calls them the \"first Adam\" and \"last Adam\" respectively, suggesting that there are only two representative heads for humanity [1 Corinthians 15:45]. The entire human race is split into two based on the individual's relationship with them. Adam represents the old humanity: those lost in sin who stand in rebellion against God. Christ is the head of the new humanity: those who have been redeemed and saved by Christ. With each of them, God made a covenant - the covenant of works with Adam and the covenant of grace with Christ. Both covenants are centred on their obedience to God. As heads of their respective covenants, the effect of their obedience or disobedience is passed on to all whom they represent.\n\nSome may think it unjust that all mankind should be condemned because of their representative's personal decision to disobey. But what makes us think we can do better than Adam who was created in a state of sinlessness and lived in a sinless world? Rather, it is precisely through this principle of covenant headship that God brings forth His most precious gift of saving grace to all His people - for in Christ we attain the righteousness we could never earn on our own.",
        "part6": "THOUGHT",
        "part7": "Paul speaks of Adam and Christ as if there had never been anyone else in the world; for these two men have all other people hanging from their belts. - Thomas Goodwin",
        "part8": [
            "EZEKIEL 38",
            "JAMES 3"
        ]
    },
    "13 SEPTEMBER": {
        "part1": "Romans 5:14",
        "part2": "Adam and Christ - Differences",
        "part3": "VERSE 14",
        "part4": "Nevertheless death reigned from Adam to Moses, even over them that had not sinned after the similitude of Adam's transgression, who is the figure of him that was to come.",
        "part5": "Typology in the Bible is concerned with how Old Testament patterns prefigure those in the New Testament. Their similarities are usually in view. In Romans chapter 5, however, Paul uses typology not only to bring out the similarities in the overall pattern between Adam and Christ, but also to highlight their profound differences. It is in these differences that the incomparable glories of Christ and His works are made manifest.\n\nAdam was the first man to be created - formed out of dust and made a living soul. Adam was given dominion over all creatures. He was to rule over and care for God's creation. By his disobedience, he brought a curse upon creation, and sin and death to all men as their representative. In Adam, there is only judgment and condemnation.\n\nChrist was described as the last Adam and a life-giving spirit [1 Corinthians 15:45]. Although He is God, He condescended Himself to be born into this world and took upon Himself the full punishment for the sins of all His people. By His perfect obedience and atoning death, He brings forgiveness of sins and eternal life to all who believe in Him. In Christ, there is justification and abundance of grace.\n\nAre you in Adam or in Christ? No doubt, we are all in Adam. He represents the whole human race. But for those who believe and follow Christ, we have been justified by grace and are new creatures in Christ. Old things are passed away and all things are become new [2 Corinthians 5:17].",
        "part6": "THOUGHT",
        "part7": "For as in Adam all die, even so in Christ shall all be made alive. - 1 Corinthians 15:22",
        "part8": [
            "EZEKIEL 39",
            "JAMES 4"
        ]
    },
    "14 SEPTEMBER": {
        "part1": "Romans 5:15",
        "part2": "Salvation, not like the sin",
        "part3": "VERSE 15",
        "part4": "But not as the offence, so also is the free gift. For if through the offence of one many be dead, much more the grace of God, and the gift by grace, which is by one man, Jesus Christ, hath abounded unto many.",
        "part5": "Adam's offence happened when he placed his will above God's. Because of his transgression, the whole human race after him fell under the dominion of sin. God could have left us to perish in darkness since mankind is merely suffering what he deserves. Yet God did not let us meet our natural and deserved end. He saved us through a supernatural divine plan - He sent His only begotten Son to this natural world to take on the punishment of our sin, and to offer eternal life freely to whosoever believes in Him.\n\nOffence is an act of man, but salvation is the will of God. God has given us a gift which we do not deserve - this is God's gift to us by His grace. On the one hand, man's offence against God speaks of his pride and presumptuousness, on the other, God's gift to man tells of His love and grace. There is a gulf of difference between the fall of all mankind through the First Adam and the salvation of a remnant through the Second.\n\nThere may also be an inclination for us to equate the two \"many\" in this verse. If through the offence of one, many (not all) be dead, is it therefore true to say that some do not suffer from the consequences of original sin? The full counsel of scripture tells us this is not the case. \"Many\" in this verse is not quantitative. This verse is not telling us that a great but finite number had fallen, and the same great and finite number will be made right given God's grace. Paul here is merely explaining how, though the entire human race had fallen because of one man's sin, yet the free gift of grace was offered to all whom God has chosen to receive.",
        "part6": "THOUGHT",
        "part7": "In that day shall the Lord of hosts be for a crown of glory, and for a diadem of beauty, unto the residue of His people. - Isaiah 28:5",
        "part8": [
            "EZEKIEL 40",
            "JAMES 5"
        ]
    },
    "15 SEPTEMBER": {
        "part1": "Romans 5:16",
        "part2": "Judgment  by One Sin; Salvation for Many",
        "part3": "VERSE 16",
        "part4": "And not as it was by one that sinned, so is the gift: for the judgment was by one to condemnation, but the free gift is of many offences unto justification.",
        "part5": "Sin falls largely into two categories: \"original sin\" and \"actual sins\". Original sin is the sin we inherited from Adam, whereas actual sins are the sins we commit every day in our thoughts, words and actions. In a way, we can say original sin leads to actual sins. After Adam ate from the tree of knowledge of good and evil (the original sin), the human race fell from a state of being \"able to sin but also able not to sin\" to one of being \"not able not to sin\". In this wretched depraved condition, we commit numerous actual sins.\n\nToday's verse highlights the difference between these two kinds of sin. Because of Adam's first sin, the human race suffered condemnation. But after that particular sin, Adam would continue to commit actual sins, as do His descendants. Yet when the Lord Jesus Christ came into this world to die for our sins, He died for both our original sin and our actual ones. Thus, we see a great difference between the works of Adam and that of Christ: Adam caused the whole mankind to fall by one sin, whereas our Lord died not only to save us from the original sin, but also the effects of it - for the many offences committed by the human race after Adam's first sin.\n\nA common question asked is: \"Since Jesus died for our actual sins, why should we still confess them and ask for His forgiveness every day?\" The answer is this: \"Our Lord died for all our sins - past, present and future - and if we come before Him to confess them, God will forgive us because of what Jesus has already done for us on the cross. God will be faithful to the covenant He has with us through our Saviour.\"",
        "part6": "THOUGHT",
        "part7": "If we confess our sins, He is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness. - 1 John 1:9",
        "part8": [
            "EZEKIEL 41",
            "1 PETER 1"
        ]
    },
    "16 SEPTEMBER": {
        "part1": "Romans 5:17",
        "part2": "The Reign of Death and Life",
        "part3": "VERSE 17",
        "part4": "For if by one man's offence death reigned by one; much more they which receive abundance of grace and of the gift of righteousness shall reign in life by one, Jesus Christ.",
        "part5": "Death reigned over humanity since man's fall to sin. All in Adam are spiritually lost and condemned to physical and spiritual death. Here the apostle Paul contrasts the reign of death with the reign of life.\n\n\"For if by one man's offence death reigned by one.\" This thought is repeated in several different ways in the preceding and succeeding verses: \"Wherefore, as by one man sin entered into the world, and death by sin; and so death passed upon all men, for that all have sinned\" [v. 12]; \"For if through the offence of one many be dead' [v. 15]; \"the judgment was by one to condemnation\" [v. 16]; \"by the offence of one judgment came upon all men to condemnation\" [v. 18]; \"For as by one man's disobedience many were made sinners\" [v. 19]. Paul establishes the causal connection between what Adam did and the sinfulness of all people throughout all time. In Adam, the reign of death.\n\nBut now the gift of righteousness reigns in life through God's abundant grace to those who are justified by Jesus Christ who has freed them from the condemnation they are in. \"The grace of God, and the gift by grace, which is by one man, Jesus Christ, hath abounded unto many\" [v. 15]; \"So by the obedience of one shall many be made righteous\" [v. 19]. In Christ, the reign of life!\n\nLife here is opposed to death and expresses the state of our existence, both now and hereafter. God's ultimate gift is life eternal after our bodies die and an endless perfect communion with God. Which would you choose: death or life?",
        "part6": "PRAYER",
        "part7": "O LORD, my most high God, help me to humbly acknowledge Thy supreme reign in life, and to give all thanks and glory to Thee.",
        "part8": [
            "EZEKIEL 42",
            "1 PETER 2"
        ]
    },
    "17 SEPTEMBER": {
        "part1": "Romans 5:17",
        "part2": "Amazing Grace",
        "part3": "VERSE 17",
        "part4": "For if by one man's offence death reigned by one; much more they which receive abundance of grace and of the gift of righteousness shall reign in life by one, Jesus Christ.",
        "part5": "The apostle Paul attributes our salvation to God's grace - \"To the praise of the glory of His grace, wherein He hath made us accepted in the beloved. In whom we have redemption through His blood, the forgiveness of sins, according to the riches of His grace\" [Ephesians 1:6-7]. Paul further says, \"For by grace are ye saved through faith; and that not of yourselves: it is the gift of God\"[Ephesians 2:8]. In his letter to Titus, Paul again emphasizes this amazing and gracious work of God: \"For the grace of God that bringeth salvation hath appeared to all men\" [Titus 2:11]. Salvation is the gift of God by His grace. In fact, it is the gift of His grace.\n\nThe Greek word for 'grace' is charis, meaning 'favour'. Grace is the act of conferring favour upon one who does not deserve it. Grace is unmerited and given at the giver's discretion.\n\nGrace is defined as 'the free and unmerited favour of God as manifested in the salvation of sinners and the bestowal of undeserved blessings, divine assistance given to humans for their regeneration or sanctification.' God's grace is absolutely free and amazing; it is that which conquers sin both in its penalty and its power [Romans 5:12-21; 6:1-23].\n\nTo quote John Piper, \"Grace is the enabling of God not to sin; grace is power, not just pardon.\" May we let God's enabling grace work in our lives till this same amazing grace leads us home to glory!",
        "part6": "THOUGHT",
        "part7": "Amazing Grace, how sweet the sound That saved a wretch like me. I once was lost, but now am found, Was blind but now I see. - John Newton",
        "part8": [
            "EZEKIEL 43",
            "1 PETER 3"
        ]
    },
    "18 SEPTEMBER": {
        "part1": "Romans 5:17",
        "part2": "Abundant Grace",
        "part3": "VERSE 17",
        "part4": "For if by one man's offence death reigned by one; much more they which receive abundance of grace and of the gift of righteousness shall reign in life by one, Jesus Christ.",
        "part5": "Sin and death reigned over humanity because of the trespasses of one man - Adam. However, that power has been abolished. Grace overturns the consequences of sin and life triumphs over death \"by one, Jesus Christ\". Our Lord Jesus has overturned the act of Adam. Through one Man, Jesus Christ, the abundance of grace and the gift of righteousness reign in life.\n\nIn this verse, Paul speaks of two gifts which God gives us through His Son Jesus Christ - God's abundant provision of grace and His gift of righteousness. We do not deserve, and could not earn God's favour, yet He has abundantly blessed us with His grace. The reign of grace includes deliverance from the penalty of sin (justification), deliverance from the power of sin (transformation and sanctification through fellowship and growth with God) and deliverance finally from the presence of sin (translation into His eternal presence in our glorification).\n\nRighteousness means rightness of relationship and rightness of life. \"That as sin hath reigned unto death, even so might grace reign through righteousness unto eternal life by Jesus Christ our Lord\" [v. 21]. The abundance of grace is specified as 'the gift of righteousness' [Romans 1:17; 3:22- 23; Philippians 3:9]. Therefore it is a righteousness which comes through faith alone, a righteousness which justifies. It is the objective imputed righteousness of the Lord Jesus Christ, which is the covering for believing sinners [Isaiah 61:10].",
        "part6": "PRAYER",
        "part7": "O LORD, thank You for Your abundant grace, which You have freely given us through Your beloved Son, Jesus Christ. Use us in proclaiming Your gift of grace and righteousness to those in need of eternal salvation.",
        "part8": [
            "EZEKIEL 44",
            "1 PETER 4"
        ]
    },
    "19 SEPTEMBER": {
        "part1": "Romans 5:18",
        "part2": "Justification",
        "part3": "VERSE 18",
        "part4": "Therefore as by the offence of one judgment came upon all men to condemnation; even so by the righteousness of one the free gift came upon all men unto justification of life.",
        "part5": "As the offence of the first Adam led to a pronouncement of death upon all humans, Paul here writes that the righteousness of the Second Adam has led to a pronouncement of eternal life for those who believe in Him. Justification refers to man being pronounced righteous and just, and deserving of eternal life. This pronouncement is made not because of anything we did, rather, we can be declared righteous because of the Lord Jesus Christ, the second Adam, who paid our penalty and made it possible.\n\nNow declared righteous, how do we live our lives? Are we still choked by the cares of this world and continuing in our habitual sins? Are we making an effort to show forth Christ in our lives? If we are righteous in Him, then the way we live must show that we have His likeness. Let us strive for a godly hatred of sin. Let us declare the righteousness of Christ in a way which humbles ourselves and exalts God.\n\nLet the justified not continue in their sinful ways. When we inadvertently fall into sin, let us also not be discouraged. Remember we already have the victory of eternal life. We are now dead to sin and have the strength and ability to overcome our sinful ways because the Holy Spirit who indwells us is Immanuel \"God with us\" and our helper. The true child of the thrice holy God cannot stop striving for holiness.",
        "part6": "THOUGHT",
        "part7": "Remember, \"Therefore being justified by faith, we have peace with God through our Lord Jesus Christ.\" [Romans 5:1]",
        "part8": [
            "EZEKIEL 45",
            "1 PETER 5"
        ]
    },
    "20 SEPTEMBER": {
        "part1": "Romans 5:19",
        "part2": "Obedience of Christ",
        "part3": "VERSE 19",
        "part4": "For as by one man's disobedience many were made sinners, so by the obedience of one shall many be made righteous.",
        "part5": "The more we realize our human weakness, the more amazing and awe-inspiring Christ's life on earth will be to us. The idea in Romans 5 is that we are righteous because when God the Father looks at us, He sees Christ's righteousness imputed on us. We have been declared righteous because Christ lived a righteous life, and this sinless life of perfect righteousness has been imputed to us. When we examine ourselves, we can see how difficult, even impossible, it is to live a life of perfect obedience to God. Often in thought, word and deed, we sin without even realising it!\n\nWhen the Lord Jesus Christ was on Earth, He demonstrated not just perfect obedience to God in following and obeying the letter of the law as the hypocritical Pharisees did, but also the spirit of it which was impossible for man to do. His standard of obedience was a divine standard unachievable by anyone else. (Read Matthew 5:21-48).\n\nAre we appropriately thankful that Christ lived the perfect life of obedience on our behalf ? Think about the \"little\" sins we commit. How often we deceive ourselves thinking \"it is just a small thing\". In the searchlight of Christ's perfect obedience, our attitude towards these \"little sins\" must change.\n\nAs we strive day by day to live a life pleasing to our Lord, we appreciate the impossibility of our task in our frail carnal bodies in this sin-cursed world. Therefore, have a heart of utmost gratitude to the One who has done it for us.",
        "part6": "THOUGHT",
        "part7": "Take time to be holy, be calm in thy soul, Each thought and each motive beneath His control. Thus led by His Spirit to fountains of love, Thou soon shalt be fitted for service above. - William D Longstaff",
        "part8": [
            "EZEKIEL 46",
            "2 PETER 1"
        ]
    },
    "21 SEPTEMBER": {
        "part1": "Romans 5:19",
        "part2": "All of Grace",
        "part3": "VERSE 19",
        "part4": "For as by one man's disobedience many were made sinners, so by the obedience of one shall many be made righteous.",
        "part5": "Many confuse grace and justice. Often, you will hear atheists argue that they do not want to believe in the Christian God because it is unjust that He has chosen some to be saved and left others to eternal damnation. However, let us better understand these two attributes of God's character - justice and grace.\n\nJustice is getting one's just desserts. If we were to abide strictly by the principle of justice, God, who is just is perfectly justified in condemning us all to eternal death - for all have sinned and the wages of sin is death.\n\nYet, He is also full of grace. Grace is the unmerited giving to us of something we do not deserve. No one deserves eternal life. But it is God's prerogative to grant eternal life to whoever He chooses. Just because God chose to extend His grace to some does not make Him any less just.\n\nIn the sinner's salvation, both attributes of God are fully met.\n\nIn Romans 5:19, we further read about the extent of God's grace. The Christian religion is different from any other because it is the only religion where eternal life is presented as a free gift to all. We can do nothing to earn it. It is all of grace. No action of ours can add or subtract a day to the amount of \"life\" we get. It is eternal because it has already been earned on our behalf by another - our Lord and Saviour Jesus Christ.",
        "part6": "THOUGHT",
        "part7": "He left His Father's throne above, So free, so infinite His grace; Humbled Himself in matchless love, And bled for Adam's helpless race; 'Tis mercy all, immense and free; For, O my God, it found out me. - Charles Wesley",
        "part8": [
            "EZEKIEL 47",
            "2 PETER 2"
        ]
    },
    "22 SEPTEMBER": {
        "part1": "Romans 5:20a",
        "part2": "Entrance of the Law",
        "part3": "VERSE 20a",
        "part4": "Moreover the law entered, that the offence might abound ...",
        "part5": "As believers who love and fully trust in the Lord Jesus, we may find it perplexing why the law is so important in God's written Word. We may have expected this in the Old Testament, but here in the New Testament the Greek word for \"law\" appears 197 times, of which 75 are in the book of Romans. Why spill so much ink over this when Christ has already come?\n\nThe law is God's manual for living our lives according to His will and plan. When we purchase a washing machine, we read its manual first, so we know how to operate it. Otherwise, we may wash our delicate clothing using the \"intensive\" cycle and cause them damage. Likewise, without the law to guide, we will not be able to properly distinguish between right and wrong because the human heart is deceptive and evil.\n\nThe law is also God's 'guard rail' as we navigate the narrow path on this side of heaven. In Bunyan's \"Pilgrim's Progress\", Christian was to walk on the path along the fence and not cross over it. The law acts the same way. It teaches us the fundamentals of Christian living so that we do not end up on the wrong side.\n\nBeloved, the law is there for our good. Although it may look demanding and stringent, just take a step back and look at the loving Father who gave you this law so that you can live and enjoy a life as that of a tree planted by rivers of living water, and whatsoever you do will prosper.",
        "part6": "THOUGHT",
        "part7": "Have you been following God's guard rail all your life? Or have you wandered away from the path?",
        "part8": [
            "EZEKIEL 48",
            "2 PETER 3"
        ]
    },
    "23 SEPTEMBER": {
        "part1": "Romans 5:20a",
        "part2": "Purpose of the Law - Conviction of Sin",
        "part3": "VERSE 20a",
        "part4": "Moreover the law entered, that the offence might abound ...",
        "part5": "Today we dig a little deeper on the purpose for the law and why it is still relevant for the modern day Christian. Why do we need the law if Christ has already fulfilled the law for us?\n\nThe law is needful, because without it, we will have nothing to teach and convict us of sin. It is an important tool in God's arsenal to allow us to enjoy and appreciate what Christ died for. Our sinful hearts cry: \"If there is nothing to tell us how bad we are, we must be good! Therefore, we do not need God at all.\"\n\nIf there is no conviction, we are left unaware of our sin and will not realise we need a Saviour until it is too late. Christ came to save sinners and the law enables us to realise we are indeed sinners, so that we may run to Him and seek forgiveness. The law makes the fragrance of Christ's work on the cross smell even sweeter. It allows us to see with clear lenses why there are scars on Christ's hands and feet.\n\nAs we compare our lives with the law and realise how much we are like 'open sepulchres', we will greatly appreciate God's grace, and worship Him with endless thanks and praise for He is the merciful God who is more than worthy of all our praise.\n\nBeloved, recognise the gravity of your sins, but realise that the Lord Jesus Christ came to die for them.",
        "part6": "THOUGHT",
        "part7": "Are you unaware of any sins in your life? Pray regularly for the Holy Spirit to reveal them to you so you can repent.",
        "part8": [
            "DANIEL 1",
            "1 JOHN 1"
        ]
    },
    "24 SEPTEMBER": {
        "part1": "Romans 5:20",
        "part2": "Grace Abounds Even More",
        "part3": "VERSE 20",
        "part4": "Moreover the law entered, that the offence might abound. But where sin abounded, grace did much more abound.",
        "part5": "Sin is deadly business and we all sin. Right after a time and act of sin, the Accuser comes alongside and whispers in our ears: \"Wow you're horrible! How could you do that? Your family is better off without you. Your church does not need you! You are not indispensable. Your friends don't love and care for you anymore. Why would they waste time with such a hopeless person like you? You can never change!\" And if the grief of committing the sin was not enough, we now have to deal with the 'half-truths' and accusations of the devil.\n\nPaul tells us today that no matter how grievous, socially unacceptable, how hurtful your sins were, the grace of God surpasses them all. Do not believe the lies of the devil! Do not succumb to the temptation of giving up hope just because you have transgressed. Instead, turn your eyes upon the cross and the Lord Jesus Christ. Examine His nail- pierced hands and gaze on the scars which your sins have caused. There are scars which testify that Christ has already paid for your sins, past, present and future.\n\nDespite the gravity of our sins, none is too great for the cross. There, Christ drank the full cup of God's wrath so that we instead may partake the cup of blessing. No sin is so great that the blood of Christ cannot cover.\n\nIf and when we sin, repent immediately, stop sinning and seek God's grace to abound in your life. Do not wallow in sin and self-pity. Instead, get up and live for Him who has paid it all for you.",
        "part6": "THOUGHT",
        "part7": "Recognise the deception of the devil and realise God's over-abounding grace for you.",
        "part8": [
            "DANIEL 2",
            "1 JOHN 2"
        ]
    },
    "25 SEPTEMBER": {
        "part1": "Romans 5:21",
        "part2": "No Withholding of Grace",
        "part3": "VERSE 21",
        "part4": "That as sin hath reigned unto death, even so might grace reign through righteousness unto eternal life by Jesus Christ our Lord.",
        "part5": "We read in verse 20 the purpose of the law. It convicts us of our sin and depravity, so that we can turn to God for help. And this is where God's grace comes in - where sin abounds, God's grace much more abounds, if man will only repent and turn to God for His bountiful provision. Today's verse is linked to verse 20 with the conjunction \"that\". In Greek, it is the word hina, which can also be translated \"so that\" or \"in order that\". Paul hereby transits from the purpose of the Law to that of God's grace.\n\nWhat stands out in verse 21 is the word \"reign\". Without God, we live in the darkness of sin. Sin corrupts our every faculty. Our eyes are blinded to truth. Our minds cannot think beyond the finitude of what we can see. Our hearts are held captive to our lusts and pride. But all these belong to the past because of what the Lord Jesus has done on the cross for us. We are reconciled to God the Father. The Spirit of God indwells and strengthens everyone who comes to the Father through His Son. Sin no longer has dominion over us, for our Lord Jesus not only paid the penalty for our trespasses, but he has also granted us the power to overcome sin.\n\nAnd the good news is, the battle has already been won. If we trust in Jesus Christ to be our Saviour, then He must also be our Lord to reign over every part of our lives and thereby God will grant us strength to lead victorious and abundant lives for His glory.",
        "part6": "THOUGHT",
        "part7": "All things are delivered unto me of my Father: and no man knoweth the Son, but the Father; neither knoweth any man the Father, save the Son, and he to whomsoever the Son will reveal him. Come unto me, all ye that labour and are heavy laden, and I will give you rest. - Matthew 11:27-28",
        "part8": [
            "DANIEL 3",
            "1 JOHN 3"
        ]
    },
    "26 SEPTEMBER": {
        "part1": "Romans 5:21",
        "part2": "No Depletion of Grace",
        "part3": "VERSE 21",
        "part4": "That as sin hath reigned unto death, even so might grace reign through righteousness unto eternal life by Jesus Christ our Lord.",
        "part5": "Because of Christ's finished work on the cross, God the Father will not withhold His grace from anyone who comes before Him in the name of His Son. This not only speaks of God's love for us, it also reminds us God is faithful to His promises. He will not leave or forsake any of His children.\n\nThis to a certain extent could also be said of our earthly parents. We hear stories of parents who love their children so much they are willing to sacrifice all they have for them. However, there is a limit to what a parent can give. As much as a parent loves the child, they cannot be with them every moment of his life; their understanding of the children's troubles is also limited by their own ability to empathize. But this cannot be said of God. Our God is with us now and forever, and He has promised every one of His children He will be with us. Every time we ask for His strength, He will provide. He understands all the challenges we are going through. Not only is God willing, He is able to grant us His grace, and in times of need, He will even give more than we ask for.\n\n\"Call unto me, and I will answer thee, and show thee great and mighty things, which thou knowest not\" [Jeremiah 33:3]. Having tasted the goodness of God and His faithfulness, let us therefore not waver in faith nor rely on our own wisdom. Trust in God's providence and call upon His name; His grace is always sufficient for us.",
        "part6": "THOUGHT",
        "part7": "Jesus answered and said unto her, Whosoever drinketh of this water shall thirst again: But whosoever drinketh of the water that I shall give him shall never thirst; but the water that I shall give him shall be in him a well of water springing up into everlasting life. - John 4:13-14",
        "part8": [
            "DANIEL 4",
            "1 JOHN 4"
        ]
    },
    "27 SEPTEMBER": {
        "part1": "Romans 5:21",
        "part2": "Purpose of Grace - Make Us Right",
        "part3": "VERSE 21",
        "part4": "That as sin hath reigned unto death, even so might grace reign through righteousness unto eternal life by Jesus Christ our Lord.",
        "part5": "What are the purposes of God's grace? Why did God grant us, undeserving sinners, the ability to believe in Him and follow Him? The most direct answer is found in the words of today's verse - \"unto eternal life\". Out of God's own good pleasure, He has chosen a remnant among the fallen human race to experience His favour, to be made right with Him and to spend eternity in His glory.\n\nTo put man as an objective in God's salvation plan would perhaps cause some to think too highly of humankind. Alas, \"When I consider thy heavens, the work of thy fingers, the moon and the stars, which thou hast ordained; What is man, that thou art mindful of him? and the son of man, that thou visitest him?\" [Psalm 8:3-4]. Yet it is also true that God's message to the lost world is this: \"For God so loved the world, that He gave His only begotten Son, that whosoever believeth in Him should not perish, but have everlasting life.\" [John 3:16]\n\nWhat should our response to God's grace then be? It should be akin to that of a criminal on death row who is given the opportunity to live on - a second chance to start all over again. There should not be any sense of self-righteousness or pride in us. Instead, we can only sing of His grace.\n\nWhy should God save man? Why should God save me? Thank God for His mercy and grace, for it is He \"Who hath saved us, and called us with an holy calling, not according to our works, but according to His own purpose and grace, which was given us in Christ Jesus before the world began\" [2 Timothy 1:9].",
        "part6": "THOUGHT",
        "part7": "For thus saith the high and lofty One that inhabiteth eternity, whose name is Holy; I dwell in the high and holy place, with him also that is of a contrite and humble spirit, to revive the spirit of the humble, and to revive the heart of the contrite ones. - Isaiah 57:15",
        "part8": [
            "DANIEL 5",
            "1 JOHN 5"
        ]
    },
    "28 SEPTEMBER": {
        "part1": "Romans 5:21",
        "part2": "Purpose of Grace - To Do Right",
        "part3": "VERSE 21",
        "part4": "That as sin hath reigned unto death, even so might grace reign through righteousness unto eternal life by Jesus Christ our Lord.",
        "part5": "God's grace transforms our lives. When Jesus shines like light into the darkness of our sin, we begin to understand God's love and have a desire to lead a life pleasing in His sight. We forsake our old ways and seek the will of God. We put off the old man and put on the new. We change to be more and more like Christ each day.\n\nWe are saved unto eternal life in God's kingdom of glory. And while waiting for the day when we see the Lord Jesus Christ face to face, we live in God's kingdom of grace. We are made right through the blood of our Lord, so that we can do right by His grace. \"For by grace are ye saved through faith; and that not of yourselves: it is the gift of God: Not of works, lest any man should boast. For we are his workmanship, created in Christ Jesus unto good works, which God hath before ordained that we should walk in them\" [Ephesians 2:8-10].\n\nAre our lives a good testimony of God's grace? Do we bear both fruits of repentance and regeneration? Can others see Christ through us? Let us watch our thoughts, words and actions, and walk worthy of the calling wherewith we are called [Ephesians 4:1]. Every time we fail, we can come before God and confess - and He will surely forgive us through Christ. Yet every time we manage to do right, remember not to be proud, for it is also by His grace that we can do so.\n\nCommit our ways to God, and God will grant us the wisdom and strength to lead a life that glorifies Him and edifies others.",
        "part6": "THOUGHT",
        "part7": "Looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ; Who gave Himself for us, that He might redeem us from all iniquity, and purify unto Himself a peculiar people, zealous of good works. - Titus 2:13-14",
        "part8": [
            "DANIEL 6",
            "2 JOHN"
        ]
    },
    "29 SEPTEMBER": {
        "part1": "Romans 5:21",
        "part2": "Purpose of Grace - Make Known the Wisdom of God",
        "part3": "VERSE 21",
        "part4": "That as sin hath reigned unto death, even so might grace reign through righteousness unto eternal life by Jesus Christ our Lord.",
        "part5": "Next, we go beyond the interest of man to look at God's salvation plan from His perspective. God's purpose in showing His grace through the deliverance of all who believe in Him is to make known to them His perfect wisdom.\n\nThe biblical account started with how man fell. Together with that, the world was cursed. We also read in Isaiah 14 and Ezekiel 28, how Lucifer (Satan) and many of the angels fell too because of pride. Satan sought to exalt himself above His Creator. He tempted Adam, who by his disobedience in turn corrupted the world.\n\nThe tempter and the tempted will fail because our sovereign God is always in control. He will judge all - both angels and man. He will save those who have chosen to trust in Him. Both the justice and love of God display His wisdom and glory. Satan, who thought he was equal to God, will be defeated and outwitted by God. Our Lord will judge the world, but He will also save a remnant of humankind whom He loved - not through power and violence, but through humility and love.\n\n\"To the intent that now unto the principalities and powers in heavenly places might be known by the church the manifold wisdom of God\" [Ephesians 3:10], God's infinite wisdom triumphs and reigns over His creation. \"O the depth of the riches both of the wisdom and knowledge of God! how unsearchable are his judgments, and his ways past finding out! For of him, and through him, and to him, are all things: to whom be glory for ever. Amen.\" [Romans 11:33, 36]",
        "part6": "THOUGHT",
        "part7": "And I beheld, and I heard the voice of many angels round about the throne and the beasts and the elders: and the number of them was ten thousand times ten thousand, and thousands of thousands; saying with a loud voice, Worthy is the Lamb that was slain to receive power, and riches, and wisdom, and strength, and honour, and glory, and blessing. - Revelation 5:11-12",
        "part8": [
            "DANIEL 7",
            "3 JOHN"
        ]
    },
    "30 SEPTEMBER": {
        "part1": "Romans 5:21, Ephesians 1:23",
        "part2": "Purpose of Grace - the Fullness of Christ",
        "part3": "EPHESIANS 1:23",
        "part4": "Which is his body, the fulness of him that filleth all in all.",
        "part5": "In Ephesians 1:17-23, Paul had prayed for his readers that God would give them the spirit of wisdom and revelation in the knowledge of Christ, that their eyes would be enlightened to know the hope of God's calling, the riches of His inheritance and His power, which He had shown forth through our Lord's death on the cross, His resurrection and exaltation. Ephesians 1:22 tells us God has put all things under the feet of our Lord and gave Him to be the head over all things to the church, which is His body, which He will fill with His fullness.\n\nIt is thus God's purpose that since His salvation plan centres around the Person and work of our Lord, the church of God's people should thus show forth the bountiful grace and infinite glory of Her Saviour. The question to us His church and true believers of God's saving grace is therefore, do our lives tell of God's mercies and faithfulness? We have the indwelling of the Holy Spirit, but are we filled with the fullness of God? Or are we satisfied with the mediocre life of a nominal Christian?\n\nIn Luke 17, our Lord Jesus cleansed ten lepers who had called out to Him to show mercy upon them in their wretched condition. Jesus healed them but only one (ironically a despised Samaritan) returned to glorify God with a loud voice. To him the Lord said, \"Arise, go thy way: thy faith hath made thee whole.\"\n\nDear reader, if we have truly experienced God's grace, how can we not want to live a life filled with thanksgiving and praise for Him who died for us to save us?",
        "part6": "THOUGHT",
        "part7": "Wherefore be ye not unwise, but understanding what the will of the Lord is. And be not drunk with wine, wherein is excess; but be filled with the Spirit; Speaking to yourselves in psalms and hymns and spiritual songs, singing and making melody in your heart to the Lord; Giving thanks always for all things unto God and the Father in the name of our Lord Jesus Christ. - Ephesians 5:17-20",
        "part8": [
            "DANIEL 8",
            "JUDE"
        ]
    }
}