{
    "1 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 18 relationship with God 1s wrong,",
        "part4": "For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men, who hold the truth in unrighteousness.",
        "part5": "Today's devotion identifies and describes the objects of God's wrath - the ungodly and unrighteous who hold the truth in unrighteousness. The ungodly lack reverence for God and refuse to worship Him as the one true and holy God. Such behaviour leads a person to revere and worship someone or something else, culminating in unrighteous thoughts, acts and speech. Ungodliness inevitably leads to unrighteousness because our relationship with God is wrong.\n\nGod's Word tells us that no man is righteous, and none can meet His holy standard [Psalm 14:2, Romans 3:23]. God's Word is clear, even the most morally upright person is still sinful and deserves the full weight of God's retribution as his just reward. Apostle Paul explains that we persist in our ungodly ways when we suppress the truth in unrighteousness. Even though God has given ample warning in His Word concerning His intolerance of sin, men bury the truth and ignore its existence, preferring to believe lies. Shunning the truth, they allow themselves to be deceived and think God will not hold them accountable or judge them for rejecting and disobeying Him. They cling tightly to their ungodly and unrighteous ways, trampling the truth underfoot.\n\nDo we do the same? Do we reject the notion of a holy God because acknowledging Him means having to give up some sin we love? We must choose between righteous living that pleases God or rejecting God and living in ungodliness. May God convict us of our sins so we will repent, acknowledge Him as the true God and worship Him as He deserves.",
        "part6": "",
        "part7": "And this is the condemnation, that light is come into the world, and men loved darkness rather than light, because their deeds were evil. For every one that doeth evil hateth the light, neither cometh to the light, lest his deeds should be reproved. - John 3:19-20",
        "part8": []
    },
    "2 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 19 reinforced by what we experience and see around",
        "part4": "Because that which may be known of God is manifest in them; for God hath shewed it unto them.",
        "part5": "God's wrath against sinful man is justified for a few reasons. Firstly, God has revealed Himself to mankind. While we cannot search for God and know everything about Him of our own accord, He has not left us helpless but graciously provided evidence of Himself. In fact, everything we need to know about God He has made clear to us already and continues to do so. This knowledge was infused into our minds by God and is reinforced by what we experience and see around us. It is securely established in our consciousness and just not a hazy, vague and indistinct knowledge.\n\nMany people even unbelievers call upon God to address injustice when evildoers escape punishment, indicating an understanding that sin is in opposition to a just God. The Egyptians saw God's power in the Ten Plagues and the miracle of Israel crossing the Red Sea. The Canaanites witnessed how God enabled Israel to defeat nation after nation to possess the Promised Land. The Philistines, Syrians and other armies were defeated by Israel despite having vast numerical advantage. Even though they would not believe or worship the God of Israel, these pagans readily acknowledged the manifestation of God's power and mercy on behalf of Israel.\n\nThe strength and wisdom we have each day to perform our work, protection from harm, food and drink to nourish our bodies all point to a merciful God who provides and blesses all mankind. These do not happen by chance, but by design. How can we deny that God exists? May God open our spiritual eyes to see all that God has shown of Himself to us.",
        "part6": "",
        "part7": "Nevertheless He left not Himself without witness, in that He did good, and gave us rain from heaven, and fruitful seasons, filling our hearts with food and gladness. - Acts 14:17",
        "part8": []
    },
    "3 FEBRUARY": {
        "part1": "Romans 1:20",
        "part2": "The visible invisible",
        "part3": "VERSE 20",
        "part4": "For the invisible things of Him from the creation of the world are clearly seen, being understood by the things that are made, even His eternal power and Godhead; so that they are without excuse.",
        "part5": "The second reason that God's wrath upon sinful man is justified is because God has revealed Himself through His creation. We can learn the invisible attributes of God when we examine the natural things around us.\n\nIn the beginning, God created the heavens and the earth, and it was perfect [Genesis 1:1, 31]. Everything in creation proclaims God's nature and character. The celestial bodies and all nature on earth exhibit His omniscience and omnipotence. As we marvel at the minutest of creatures on earth or the vastest of galaxies, we observe incredible order, great variety and infinite beauty in all these things. Purpose and laws that prevent chaos are clearly evident. All these point to the existence of a Supreme Creator whose intelligence, knowledge, power and wisdom far exceeds anything we know or have ever seen. Our Creator must be infinitely beautiful, majestic and worthy of honour and glory.\n\nThe changing seasons, rain and sunshine, and even day and night cycles declare God's divine nature and attributes of love, mercy and grace. God did not create the world and leave it to spin out of control. Instead, He cares and provides for all His creatures. Through reproductive cycles, the young replace the old, repopulating the earth. Water and oxygen are replenished and renewed through natural cycles. Why does man stubbornly refuse to believe in this God? As we contemplate the glories of the universe, may the eyes of our soul be deeply impressed when it beholds the invisible divine nature of God, so we will acknowledge and worship Him.",
        "part6": "THOUGHT",
        "part7": "The heavens declare the glory of God; and the firmament sheweth His handywork. - Psalm 19:1",
        "part8": [
            "JOB 2",
            "MARK 6"
        ]
    },
    "4 FEBRUARY": {
        "part1": "Romans 1:20",
        "part2": "Inexcusable!",
        "part3": "VERSE 20",
        "part4": "For the invisible things of Him from the creation of the world are clearly seen, being understood by the things that are made, even His eternal power and Godhead; so that they are without excuse.",
        "part5": "The Word of God declares that mankind is without excuse because the natural world we see proves that God exists. Even His everlasting power and the Godhead with its fully glorious attributes can be understood through His creation. Man has no excuse. The Greek language expresses this with a single word meaning \"no defense\". The same word is used in Romans 2:1 (the inexcusable man) and then positively (that is, having an excuse/ mounting a defense) in Romans 2:15.\n\nThe scenario depicted is a courtroom, where the defendant is mounting his defense in a public trial. We can imagine how imbalanced it would be if he attempted to mount his defense without any evidence or argument. The ground he stands on would be so weak and flimsy as to be non- existent and it would be clear to everyone in court that the defendant is defenceless! It would be akin to engaging in a battle without a weapon and protection, yet expecting to be victorious! What utter foolishness!\n\nThe Almighty God declares that He exists, and His creation is clearly and easily understood by His creatures, and they can see His awesome power and divine nature manifested. He declares in His Word that the evidence is such it is futile for His creatures to deny His existence because of what He has revealed of Himself. The outcome of such a trial would be conviction of guilt and sentencing by the Judge. This is already happening now, not just on Judgment Day.",
        "part6": "THOUGHT",
        "part7": "Children of the Almighty God have and must be ready to give an answer (defense) for our hope in the Lord Jesus Christ. Read 1 Peter 3:15.",
        "part8": [
            "JOB 3",
            "MARK 7"
        ]
    },
    "5 FEBRUARY": {
        "part1": "Romans 1:21",
        "part2": "The defiant intellectual",
        "part3": "VERSE 21",
        "part4": "Because that, when they knew God, they glorified Him not as God, neither were thankful; but became vain in their imaginations, and their foolish heart was darkened.",
        "part5": "God's Word has stated plainly that His creatures actually knew (perceived) God. Mankind as a whole and every person individually have an understanding and knowledge of God. Man has no excuse to say he does not know God exists. Having laid the grounds and basis for that [v. 20], the Holy Spirit, the Third Person of the Triune Godhead, inspired Paul to write and show step-by-step what happens to ungodly and unrighteous mankind who persist in their denial of God's existence.\n\nThe creature who is defiant by his denial of what is already known does not give God the glory due to Him. He does not honour God for who He has revealed Himself to be. His divine and glorious attributes are rejected in defiance. He does not praise, extol and magnify Him for who He is. The defiant creature has knowledge but uses this unrighteously [v. 18]. It is unrighteousness that results in rebellion, an act of treason against the Almighty God. The creature uses his own sinful and flawed reasoning (imaginations) to arrive at his own conclusions. In so doing, he regards God as nothing and self as the source of knowledge and intellect. This rebellion however does not change in any way who God is or His character. Rather it is the defiant \"intellectual\" who will suffer the far-reaching consequences of his defiance and rebellion.",
        "part6": "THOUGHT",
        "part7": "God declares that atheists do not exist.",
        "part8": [
            "JOB 4",
            "MARK 8"
        ]
    },
    "6 FEBRUARY": {
        "part1": "Romans 1:21",
        "part2": "The defiled intellectual",
        "part3": "VERSE 21",
        "part4": "Because that, when they knew God, they glorified Him not as God, neither were thankful; but became vain in their imaginations, and their foolish heart was darkened.",
        "part5": "We see the sad but sure chain of events that result in man having the truth but denying it in his sinful mind [v. 18]. The defiant creature is wise in his own eyes and will not give God the glory and honour that He alone deserves.\n\nThe suppression and misuse of the truth of God's being defiles the creature's heart and mind. God declares such to be in darkness and devoid of purpose. Man who was made in God's image [Genesis 1:26-27] and given dominion over His Creation thus rendered himself useless, because of his vain imaginations, reasoning and lofty thoughts of self.\n\nThe sin of Adam in the Garden defiled all mankind. Every imagination that comes forth from the defiled creature cannot acknowledge God for who He has revealed Himself to be.\n\n\"And God saw that the wickedness of man was great in the earth, and that every imagination of the thoughts of his heart was only evil continually\" [Genesis 6:5]. \"The fool hath said in his heart, there is no God. They are corrupt, they have done abominable works, there is none that doeth good\" [Psalm 14:1]. The defiled intellectual is a fool before God. His foolish reasoning worsens his darkened (ignorant, immoral and ungodly) heart, and he is further alienated from the source of all life, truth and righteousness.",
        "part6": "THOUGHT",
        "part7": "Praise God the Father \"who hath delivered us from the power of darkness, and hath translated us into the kingdom of His dear Son\" [Colossians 1:13].",
        "part8": [
            "JOB 5",
            "MARK 9"
        ]
    },
    "7 FEBRUARY": {
        "part1": "Romans 1:21",
        "part2": "The danger of ingratitude",
        "part3": "VERSE 21",
        "part4": "Because that, when they knew God, they glorified Him not as God, neither were thankful; but became vain in their imaginations, and their foolish heart was darkened.",
        "part5": "Having a perception of God from His Creation, defiant mankind did not acknowledge and glorify Him. This defiance was ingratitude. We see that ingratitude is not innocent or harmless. Ingratitude arises despite being conscious of God's existence, power and righteousness. Man is ungrateful despite receiving blessings from God.\n\n\"Nevertheless, He left not Himself without witness, in that He did good and gave us rain from Heaven, and fruitful seasons, filling our hearts with food and gladness\" [Acts 14:17]. \"Every good gift and every perfect gift is from above, and cometh down from the Father of lights, with whom is no variableness, neither shadow of turning\" [James 1:17].\n\nIngratitude has far-reaching consequences for the ungrateful person. It is shown here to arise from rejecting God, and an intermediate step towards having a vain and faulty reasoning. This in turn leads to moral decline as the heart is darkened. Ingratitude is dangerous as it betrays an unregenerate heart. There is nothing innocent about not glorifying God. Neither does it leave the ungrateful rebel unharmed. The fallen man develops a worldview without God which leads to a futile, meaningless life. This absence of divine truth results in the sinner being plunged deeper into darkness. This impacts the entire human society and the way mankind lives.\n\n\"For men shall be lovers of their own selves, covetous, boasters, proud, blasphemers, disobedient to parents, unthankful, unholy, without natural affection, trucebreakers, false accusers, incontinent, fierce, despisers of those that are good.\" [2 Timothy 3:2-3]",
        "part6": "THOUGHT",
        "part7": "A regenerate heart must express praise and thanks to God.",
        "part8": [
            "JOB 6",
            "MARK 10"
        ]
    },
    "8 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 22 to disregard God's command we will face the",
        "part4": "Professing themselves to be wise, they became fools.",
        "part5": "This short verse of eight words has a valuable lesson for us. Let us heed its grave warning because how the wise becomes a fool is something that must not happen to us. When we stray from God, everything will turn out bad. Our foolish hearts are rendered senseless and blind. It is tragic. It shows the way of man when we wilfully choose to go our own way. The minute we choose to disregard God's command we will face the consequences of our actions.\n\nHow did the wise become fools? When men rejected God. By doing so, they create their own gods in their minds. Man needs to fill their hearts with some other god to give purpose and direction to their lives. Whatever they decide on is that to which they give their devotion. It is idolatry when we allow anything other than God to take first place in our lives.\n\nAs believers who are wise, we must be prepared to look foolish to the world for our Lord's sake. In fact, the apostle states in 1 Corinthians 4:10a that \"we are fools for Christ's sake\". Others will know right away from the Christian's conduct and may consider him to be a fool, but such is really a \"wise fool\". What do you want to be - a fool to the world but wise in God's eyes or vice versa? Pray for God's wisdom to make the right choice.",
        "part6": "",
        "part7": "Are you willing to be a fool for the Lord Jesus Christ?",
        "part8": [
            "JOB 7",
            "MARK 11",
            "THOUGHT Are you willing to be a fool for the Lord Jesus",
            "Christ?"
        ]
    },
    "9 FEBRUARY": {
        "part1": "Romans 1:23",
        "part2": "Foolish exchange",
        "part3": "VERSE 23",
        "part4": "And changed the glory of the uncorruptible God into an image made like to corruptible man, and to birds, and fourfooted beasts, and creeping things.",
        "part5": "This is the reason why God shows His wrath towards man. How low can man get? Here we see his spiritual declension - from idolising the image of corruptible man to birds, four-footed beasts and creeping things. At each stage we can see the pride and worsening depravity of the human race.\n\nBut a foolish exchange indeed. The first stage, humanism, places man above God. The minute we do this, we are guilty of idolatry. Hence, God shows His wrath because men became proud and turned away from Him.\n\nThis is the greatest tragedy in human history. Man rejects God because he believes himself to be too wise, too capable, too resourceful, too masterful, too reasonable and rational to need God. By so doing, God judged them to be fools and condemned them. How utterly absurd that men choose to worship the creature more than the Creator!\n\nMan exchanged the holy, incorruptible and eternal God for some corruptible man-conceived image. Man swapped God to idolise himself and his own inventions, worshipping self as the captain of his own destiny. May we be true and faithful to God in our worship.",
        "part6": "THOUGHT",
        "part7": "I am the LORD: that is My name: and My glory will I not give to another, neither My praise to graven images. - Isaiah 42:8",
        "part8": [
            "JOB 8",
            "MARK 12"
        ]
    },
    "10 FEBRUARY": {
        "part1": "Romans 1:23",
        "part2": "Evil inventions",
        "part3": "VERSE 23",
        "part4": "And changed the glory of the uncorruptible God into an image made like to corruptible man, and to birds, and fourfooted beasts, and creeping things.",
        "part5": "We see man's conceit when he exchanged the incorruptible God for some corruptible invention of his own making. They turn from the only living and true God, and make gods in their own image, as they wish their gods to be. God then revealed His displeasure and wrath toward man\n\nHence, we read of the evil inventions in today's verse - birds, four-footed beasts and creeping things. Do you notice the downward trend of those creatures? This is what happens when man rejects God. Even in this present age, man still worships idols made by their own hands and conceived in their own minds. One wonders how much lower man can go.\n\nThis kind of change in man's behaviour is the result of his own decision. He wants to be his own master in deciding his own future. This was so from the beginning of man's history. But humanism is still very much with us in the modern scientific and industrialised societies we live in, perhaps even more so.\n\nLet us learn from this passage not to be stubborn in wanting our own way. Do not test God's loving patience. God is love as demonstrated by Christ's death at Calvary. Man who chooses to go against God will pay the price for it. The question is, \"Is it worth it?\"",
        "part6": "THOUGHT",
        "part7": "For I am the LORD, I change not. - Malachi 3:6a",
        "part8": [
            "JOB 9",
            "MARK 13"
        ]
    },
    "11 FEBRUARY": {
        "part1": "Romans 1:24",
        "part2": "Wherefore ... God gave up!",
        "part3": "VERSE 24",
        "part4": "Wherefore God also gave them up to uncleanness through the lusts of their own hearts, to dishonour their own bodies between themselves.",
        "part5": "Here is another tragic, terrible and frightening scene. \"God gave them up!\" Can you imagine being abandoned by God? Man has a free will which God will not interfere with, for to do so would be to take away man's freedom to choose.\n\nToday's lesson reminds us of the sin of homosexuality in the book of Genesis. Sodom and Gomorrah were destroyed because of it. Here we see God giving man up to the uncleanness and depravity in his heart. Notice that sin starts in the heart before it is put into action.\n\nMan living an unclean life is living in idolatry. He serves the gods and idols he conjures in his mind. By abandoning the true God, his warped mind rationalises that the god created by him understands his situation and need, and will not judge him for his uncleanness and immorality. He can live the unclean life he craves.\n\nGod is always loving and caring, showing His care and concern to even little children. However, His holiness means He will not condone sin of any kind. Hence God judges man by abandoning him to live in his uncleanness. But this is not the end. God warns of the imminent and final judgment to come which is death.",
        "part6": "THOUGHT",
        "part7": "And He said, That which cometh out of the man, that defileth the man. - Mark 7:20",
        "part8": [
            "JOB 10",
            "MARK 14"
        ]
    },
    "12 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 24 21, \"Now the works of the flesh are manifest,",
        "part4": "Wherefore God also gave them up to uncleanness through the lusts of their own hearts, to dishonour their own bodies between themselves.",
        "part5": "God has revealed that He is the Creator, Provider and the Almighty One who controls all things, but the people in their sin chooses to reject Him. Instead of acknowledging Him as the only living and true God, they choose to see themselves as the centre of their universe. They devoted their time and energy to their own desires, foolishly pursuing their idols and lusts. Due to man's sinful nature, as stated in Galatians 5:19- 21, \"Now the works of the flesh are manifest, which are these; adultery, fornication, uncleanness, lasciviousness, idolatry, witchcraft, hatred, variance, emulations, wrath, strife, seditions, heresies ... that they which do such things shall not inherit the kingdom of God.\" We are exactly like those people then.\n\nHence, God decided to step away. In His wrath, God gave humanity over to their corrupt sexual desires and every other kind of sin. This is akin to the father of the prodigal son who let his son leave his house, even giving him his share of his inheritance early.\n\nDoes life without God really give us the freedom and happiness we desire? We should seriously consider the painful consequences of God giving us up. It is dreadful to think God would let us fall and indulge in all kinds of sinful practices that lead to misery and ultimately His eternal punishment. Freedom to sin is no freedom at all. Sin enslaves us to Satan.\n\nLet not our thoughts, minds and souls be corrupted. Do not be addicted to things that occupy us and take away our focus from the Lord. Be sensitive to the prompting of the Holy Spirit, meditate on God's Word and live each day under the power of the Lord Jesus Christ.",
        "part6": "",
        "part7": "That every one of you should know how to possess his vessel in sanctification and honour; not in the lust of concupiscence, even as the Gentiles which know not God. - 1 Thessalonians 4:4-5",
        "part8": [
            "to dishonour their own bodies",
            "between themselves.",
            "Let not our thoughts, minds and souls be",
            "JOB 11 corrupted. Do not be addicted to things that",
            "MARK 15 occupy us and take away our focus from the Lord.",
            "Be sensitive to the prompting of the Holy Spirit,",
            "meditate on God's Word and live each day under",
            "the power of the Lord Jesus Christ.",
            "THOUGHT That every one of you should know how to possess",
            "his vessel in sanctification and honour; not in the",
            "lust of concupiscence, even as the Gentiles which",
            "know not God. -- 1 Thessalonians 4:4-5"
        ]
    },
    "13 FEBRUARY": {
        "part1": "Romans 1:25",
        "part2": "Foolish transaction -- truth for lie",
        "part3": "VERSE 25",
        "part4": "Who changed the truth of God into a lie, and worshipped and served the creature more than the Creator, who is blessed for ever. Amen.",
        "part5": "The godless and wicked people substituted the truth with a lie, a fantasy of their own imagination. When men live in uncleanness, they serve other gods - false gods and idols. Man conceives a god that will allow him to do what his heart desires. He serves the 'master' he imagines in his mind.\n\nThe apostle Paul reminds us of the sinful nature of men's hearts, which are filled with all manner of unrighteousness, evil, deceit, maliciousness, filthiness. Many have chosen to abandon God as they prefer to satisfy the lust of the flesh, and the lust of the eyes, and the pride of life [1 John 2:16]. Their hearts are filled with lust, pride and greed. Their focus is on pursuing fame, wealth, sensual pleasure and earthly treasures.\n\nGuard our thoughts, words, actions, habits and character. Be careful of the information from media, internet and our social circle as they often infect our Christian values with sinful unwholesome values of the world. Be wary of what you read and hear. The Bible is the only truth.\n\nLet us be mindful we are not living lives displeasing to God, and that we are not as the people Jeremiah 2:13: \"For My people have committed two evils; they have forsaken Me the fountain of living waters, and hewed them out cisterns, broken cisterns, that can hold no water.\" It is very silly of us to choose and cling to the broken promises of unstable 'cisterns' (money, things that take our attention away from God) when we can hold on to God's promise of eternal life and His living waters of blessing.",
        "part6": "PRAYER",
        "part7": "O Lord my God, I pray I will not be tempted to serve both You and idols. Keep me faithful as I only want to serve You. Amen.",
        "part8": [
            "JOB 12",
            "MARK 16"
        ]
    },
    "14 FEBRUARY": {
        "part1": "Romans 1:25",
        "part2": "Worship of self",
        "part3": "VERSE 25",
        "part4": "Who changed the truth of God into a lie, and worshipped and served the creature more than the Creator, who is blessed for ever. Amen.",
        "part5": "An unbeliever lives in uncleanness [Ephesians 5:3] and pursues the lusts in his heart. His worldly view and morals determine the changing gods he follows. As believers and followers of the Lord Jesus Christ, we have received eternal salvation and are changed into a new man with a transformed heart, a new spirit and a new Master. This does not grant us immunity from the lusts and pride of the world, and our flesh can still succumb to sin but we are not hopelessly enslaved to them.\n\nA big god in many of our lives today is the god of materialism - the pursuit and desire of greater status, fame, power, pleasures and things. With modern technology, whether by a quick tap on our phones or a click on our computers, we can easily give in and indulge in the lusts of our flesh. Instead of devoting ourselves to God's Word, we expend our time and energy to doing things that neither strengthen our spiritual life nor edify others. Paul in 2 Timothy 2:22 tells us to \"flee also youthful lusts: but follow righteousness, faith, charity, peace, with them that call on the Lord out of a pure heart\".\n\nLet us not be stumbling blocks for others to believe in the Lord Jesus Christ. As Christians, we are being watched so let us ensure we are a good testimony for our Lord. We are called to be holy [1 Corinthians 1:2]. We are chosen to be set apart for His service. Let us focus on worshipping the Lord (not self), serving our one and only Master, the Lord Jesus Christ. Be resolved always to make the right choice: a faithful follower of our Lord Jesus Christ, not the servant of Satan.",
        "part6": "PRAYER",
        "part7": "Thank You Lord for Your mercy and grace to keep me as a chosen and blessed one. Guide me to be diligent so that I may present myself approved unto You as a workman who does not need to be ashamed.",
        "part8": [
            "JOB 13",
            "LUKE 1"
        ]
    },
    "15 FEBRUARY": {
        "part1": "Romans 1:25",
        "part2": "Worship of creatures",
        "part3": "VERSE 25",
        "part4": "Who changed the truth of God into a lie, and worshipped and served the creature more than the Creator, who is blessed for ever. Amen.",
        "part5": "One of the great tendencies of man is summed up here - exchanging the truth of God for a lie, and worshipping and serving the creature rather than the Creator. Instead of humanity striving to grow into the image of God, we now strive to make god in our image. Paul warns sternly against the effects of engaging in the lust of the heart.\n\nThere is no such thing as religious neutrality in the human heart and mind. When people reject the living and true God, they do not stop worshipping; they just direct their religious affections elsewhere. This redirecting of our devotion is nothing but foolishness. The glory of God is exchanged for images made of human and animal forms. Rejecting God, embracing worldly ways and wisdom and living a lifestyle of sin causes man to turn his worship from God to His creatures.\n\nWhat does it mean to worship the creature more than the Creator? We can make idols out of people, heroes, even religious figures. We can make idols out of what we do and the things we pursue. Things that make us feel distinct, special, and superior to others. We can make graven images in our heads and in our minds. Our imaginations create idols; these lofty imaginations which the apostle exhorts the Christian to cast down, for they quickly and easily cause us to exalt ourselves above and against God [2 Corinthians 10:5].\n\nWorshipping the blessings more than the God who bestows the blessing is worshipping the creature more than the Creator. Make sure you are not pursuing a fantasy but the true God. Do not suppress the truth about Him merely to indulge in your own desires and lifestyle.",
        "part6": "THOUGHT",
        "part7": "To reject God, to turn away from the Light, naturally brings darkness.",
        "part8": [
            "JOB 14",
            "LUKE 2"
        ]
    },
    "16 FEBRUARY": {
        "part1": "Romans 1:26",
        "part2": "Wherefore ... God gave up",
        "part3": "VERSE 26",
        "part4": "For this cause God gave them up unto vile affections: for even their women did change the natural use into that which is against nature.",
        "part5": "Paul pictures this verse as an expression of God's wrath against humanity's depravity. Because of their idolatrous and deviant practices, God left them, both men and women, to their dishonourable actions, which were neither His design nor intent.\n\nGod wants to remove the sin and restore the sinner - and He will do so, as long as the sinner does not stubbornly distort or reject the truth. But God's wrath is justly meted out against those who persist in a sinful lifestyle; He gives them over so that these people will do whatever satisfies their carnal desires. They will have their freedom, but it will prove an enslaving and deadly freedom.\n\nIn pouring out His wrath now, in anticipation of the great day of wrath to come, the Lord allows the people to have exactly what they want. He does not merely stand back and watch as they run off after idols; He allows them to indulge in their false worship. When human beings refuse to love the one true God, He will confirm them in their sin.\n\nMan is a fool when he makes his ideas, his opinions and his imaginations, instead of God's will, the standard and law of life. The sinner's folly consists in making man the master of things. He forms his standards in his own opinions and not in the laws of God, because he looks to himself and not to God. He lives in a self-centred instead of a God-centred world. Instead of walking according to God, he walks according to self, and like a blind man who cannot see where he is going, he falls.",
        "part6": "THOUGHT",
        "part7": "Behind the wrath of God is the love of God.",
        "part8": [
            "JOB 15",
            "LUKE 3"
        ]
    },
    "17 FEBRUARY": {
        "part1": "Romans 1:26",
        "part2": "Doing what comes unnaturally",
        "part3": "VERSE 26",
        "part4": "For this cause God gave them up unto vile affections: for even their women did change the natural use into that which is against nature.",
        "part5": "The logic of Paul's argument should not be missed. Those who reject what they know of God divorce themselves from truth and reality. This means, among other things, a person who is out of touch with God is also out of touch with reality, including the truth about his humanity. To be out of touch with humanity is a crisis of identity which manifests itself in many ways, not least in perversion of human sexuality.\n\nWhen sexuality is misunderstood, the power of unrestrained sexual drive and twisted sexual thoughts will produce all manner of abnormal sexual behaviour. In short, when God and His instructions on decency and morality are rejected; it breeds confusion about man, which in turn produces sexual confusion and perversion. Far from scaling the heights of an enlightened age of sexual freedom, as claimed by many, Paul's warning shows us the unrepentant sinner is sliding down to the abyss of immorality, perversion, and divine judgment. The sinner exchanges the natural for the unnatural, and heaps upon himself God's wrath.\n\nIn this light, Leviticus 18:6-29 carries an important message. Its intent is to define the boundaries of godly human sexual relationships, and God's judgment upon those that breach these boundaries. The spread of abnormal and unnatural sexual behaviour is the result of nations turning from the Lord. He has given the people as a nation over to the sinful desires of their hearts. Given the fact that the moral boundaries are increasingly torn down in our culture, it is going to be more and more challenging for believers to remain morally upright. So, we must guard ourselves by drawing nigh to God [James 4:8].",
        "part6": "THOUGHT",
        "part7": "Idolatry always leads to immorality.",
        "part8": [
            "JOB 16",
            "LUKE 4"
        ]
    },
    "18 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 27 the moral perversions of the world, we should",
        "part4": "And likewise also the men, leaving the natural use of the woman, burned in their lust one toward another; men with men working that which is unseemly, and receiving in themselves that recompence of their error which was meet.",
        "part5": "The Greek word translated \"lust\" in Romans 1:27 occurs only once. It is not the same word that describes the man who \"looketh on a woman to lust after her\" [Matthew 5:28]. Paul here is not talking about the natural desires of a man for a woman. Rather, he is specifically speaking out against the perverted and unnatural sexual \"lust\" of men towards men - homosexuality.\n\nBut before we point an accusing finger at the moral perversions of the world, we should first examine ourselves. Paul says that the people \"burned in their lust\". Literally, it means that they were enflamed in an uncontrolled and unrestrained lust. A man who rejects God and His Word will indulge himself with total disregard for God and the consequences. Lust maintains a power over us when we submit ourselves to its control.\n\nSatan knows our vulnerabilities in this area. When we step outside the bounds that God has set, we will use our bodies to seek pleasure in a way that is against God. And we degrade ourselves; we abuse and misuse what God has intended for our good. We dishonour our bodies, and we dishonour God. The result is despair, devastation and destruction.\n\nAllowing sin of any kind to sit on the throne of our lives brings disaster. God directs our way through the hazards of life and beyond the burden of sexual sin. Solomon asks, \"Can a man take fire in his bosom, and his clothes not be burned? Can one go upon hot coals, and his feet not be burned?\" [Proverbs 6:27-28].\n\nBecause our fight is not against flesh and blood, our weapons of defence are also not physical. Paul urges us to \"put on the whole armour of God\" [Ephesians 6:11]. The more you know God, the less you will desire to go down the road of sin.",
        "part6": "",
        "part7": "Decisions made in the darkness (physical or spiritual) leads to grave danger.",
        "part8": []
    },
    "19 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 27 There were sodomites in the days when the",
        "part4": "And likewise also the men, leaving the natural use of the woman, burned in their lust one toward another; men with men working that which is unseemly, and receiving in themselves that recompence of their error which was meet.",
        "part5": "The unnatural sexual behaviour of man partnering with man was not something which happened only in the days when Paul wrote this epistle to the Romans. Scripture records also the time of Abraham when God rained fire and brimstone from heaven to destroy Sodom and Gomorrah, a clear and stern warning to all who walk unashamedly in the same degraded manner [Genesis 19].\n\nThere were sodomites in the days when the judges ruled among the tribe of Benjamin [Judges 19:22]; and in the times of the kings in Judah [1 Kings 14:24]. Even as these were present in the near and distant past, so are they also in our day. Alarmingly in some countries now, same gender marriages have been legalized.\n\nIt is argued that some men are born with unnatural inclinations towards the same gender and therefore, we should respect their different or alternate lifestyle for who are we to judge? Notwithstanding that fact, in God's eyes, sodomy is outright rebellion and defiance against His order of creation, design and providence, and His wrath will be kindled against those who commit this abomination. Yet, God who is longsuffering and patient toward sinful men, is not willing that any should perish but that they should repent of their sins, and turn to Him for He is ever ready to forgive and to transform them.\n\nGod condemns the sin of sodomy and all other forms of sin. Except we repent, we shall likewise perish. All unrighteousness is sin, yet there is not a sin unto death if the sinner turns repentantly to the Lamb of God which taketh away the sins of the world.",
        "part6": "",
        "part7": "Know ye not that the unrighteous shall not inherit the kingdom of God? Be not deceived: neither fornicators, nor idolaters, nor adulterers, nor effeminate, nor abusers of themselves with mankind. - 1 Corinthians 6:9",
        "part8": []
    },
    "20 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 27 create unrest in his heart and prick him with guilt.",
        "part4": "And likewise also the men, leaving the natural use of the woman, burned in their lust one toward another; men with men working that which is unseemly, and receiving in themselves that recompence of their error which was meet.",
        "part5": "There is in man a candle of the LORD [Proverbs 20:27] called conscience. It is a watchdog, a whistleblower, a moral awareness God has implanted in every heart so it can differentiate right from wrong. Man may not know the letter of the law of God, nevertheless God has written the sense and spirit of it in their hearts [Romans 2:15]. When man goes against that light of conscience by his willful sin, an alarm will sound to warn and create unrest in his heart and prick him with guilt. Persistent suppression of this inner voice will result in a calloused conscience.\n\nThen man was given the law of God which is perfect, converting the soul, and the commandment of the LORD which is pure, enlightening the eyes [Psalm 19:7-8]. The Holy Spirit inspired holy men of God to write them down so it would convict and convert fallen man. When man resists and rejects God's Word, their hearts begin to harden. Continual rejection of God's Word will begat a hardened heart.\n\nQuenching the voice of conscience and resisting the law of God - a calloused conscience, a hardened heart - what hope is there left for such man? Divine judgment has already begun. God had withdrawn Himself when He said, \"My Spirit shall not always strive with man\" [Genesis 6:3a].\n\nThis blatant sin of homosexuality is becoming increasingly acceptable in society. As this acceptance gains momentum and continually provokes God, so is His day of vengeance approaching. As in the days of Sodom and Gomorrah, so shall it be in our day when iniquity is become full.",
        "part6": "",
        "part7": "A new heart also will I give you, and a new spirit will I put within you: and I will take away the stony heart out of your flesh, and I will give you an heart of flesh. - Ezekiel 36:26",
        "part8": []
    },
    "21 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 28 Israel insisted strongly on having a human",
        "part4": "And even as they did not like to retain God in their knowledge, God gave them over to a reprobate mind, to do those things which are not convenient.",
        "part5": "They shut their doors of hearing to refuse the entry of God's warning into their hearts. When exhortations from God's Word are unheeded, when rebuke from Scripture is in vain, when the admonition from God's messengers are scorned, when His law is despised, God withdraws Himself and abandons the sinner. As these made an end of hearing God's Word, God likewise made an end of showing them mercy.\n\nIsrael insisted strongly on having a human king (when God was their King). Despite the protestations of prophet Samuel against this [1 Samuel 8:5-9], God finally gave them their request but sent leanness into their soul [Psalm 106:15]. We have other instances in Scripture of those explicitly rejected by God - Cain was rejected for his offering because he did not come to God by faith [Genesis 4:5]; Saul was rejected as king over Israel because he rejected the Word of the LORD [1 Samuel 15:22]; Esau despised his birthright and was rejected for there was no repentance in his heart, only regret as he sought to redeem it in tears [Hebrews 12:17].\n\nThere is a line drawn which we should fear to cross. God is longsuffering but He has a set time. He waited and warned (for 120 years) in the days of Noah, as the ark was being built, but so few, only eight souls were saved [1 Peter 3:20] and the rest of the disobedient world perish.\n\nNo one in the Judgment can say that they were not warned or lacked the opportunity to forsake their sins and turn to God. The Gospel sounds loud and clear, near and far. God will not reject sinners unless they continually reject Him.",
        "part6": "",
        "part7": "But My people would not hearken to My voice; and Israel would none of Me. So I gave them up unto their own hearts' lust: and they walked in their own counsels. - Psalm 81:11-12.",
        "part8": []
    },
    "22 FEBRUARY": {
        "part1": "Romans 1:28",
        "part2": "Reprobate mind",
        "part3": "VERSE 28",
        "part4": "And even as they did not like to retain God in their knowledge, God gave them over to a reprobate mind, to do those things which are not convenient.",
        "part5": "These sodomites consciously and willfully disallowed place in their minds for the thought of God that they might worship, reverence and glorify Him. Instead, they did freely what they wanted without fear and accountability. And as they cast out every thought or knowledge of God from their minds, God judicially bypassed them and left them to their own corruptions, to indulge their vile passions and base lusts. As the Jews of old said, \"Add iniquity unto their iniquity: and let them not come into Thy righteousness.\" [Psalm 69:27]\n\nAs a consequence of their determination to forget God and fulfill their own lust, God gave them over to a reprobate mind, a mind incapable of approving what is good and disapproving what is evil; a heart devoid of conscience that has lost its sense of morality, disapproved by the righteous God, and all good men.\n\nContrarily, the thought of God uplifts the heart, cheers the spirit and comforts the soul. The old hymnwriter wrote, \"Only to sit and think of God, O what a joy it is! To think the thought, to breathe the name, earth has no higher bliss.\" O soul, if you are so busy in the many different callings of this mundane world that you hardly can find more time to be alone with God, let this thought be in you, \"The fluttering wings of the bird do not weigh it down but instead it supports and moves the bird forward\" (AW Tozer), so is the thought of God and the conscious awareness of His abiding and overshadowing presence.",
        "part6": "THOUGHT",
        "part7": "A Godless mind, that's the Devil's delight and he can say, \"This soul is truly mine.\"",
        "part8": [
            "JOB 21",
            "LUKE 9"
        ]
    },
    "23 FEBRUARY": {
        "part1": "Romans 1:28",
        "part2": "Inconvenient acts",
        "part3": "VERSE 28",
        "part4": "And even as they did not like to retain God in their knowledge, God gave them over to a reprobate mind, to do those things which are not convenient.",
        "part5": "When men reject God and refuse to acknowledge Him, God gives them over to a debased mind. Without the light of God's Word and His restraining grace, the reprobate mind is unable to recognise evil for what it is and will be naturally attracted to it, and do \"things which are not convenient\". The word \"convenient\" means \"fitting or proper\". Inconvenient acts refer to improper behaviour or unbecoming conduct - acts that a moral being would naturally regard as evil or wrong.\n\nGod made us moral creatures with a conscience. Everyone has some knowledge of God's law written in their hearts, so no one has any excuse for doing evil. However, when we abandon God in our minds, our ability to make sound moral judgment becomes defective and our conscience becomes distorted. This can be seen in the moral decadence of society today. The media relentlessly bombards us with memes and messages that make sin look normal. Our culture is constantly engaged in redefining what is proper and improper. What was condemned in the past is now accepted or even welcomed as a lifestyle alternative. In particular, the sexual revolution is lauded for promoting authenticity and expressive individualism.\n\nDo the inconvenient acts and behaviour that are condemned in the Bible still repulse you today? Christians must be wary of allowing the world or our culture to shape our conscience and beliefs. How we define what is proper or improper, right or wrong, must be based on God's Word, not the world's standards.",
        "part6": "THOUGHT",
        "part7": "Worldliness is that system of values ... which makes sin look normal and righteousness seem strange. - David F. Wells",
        "part8": [
            "JOB 22",
            "LUKE 10"
        ]
    },
    "24 FEBRUARY": {
        "part1": "Romans 1:29",
        "part2": "Unrighteousness, fornication, wickedness",
        "part3": "VERSE 29",
        "part4": "Being filled with all unrighteousness, fornication, wickedness, covetousness, maliciousness; full of envy, murder, debate, deceit, malignity; whisperers,",
        "part5": "Next, Paul gives a long list of vices. He states that a depraved man is filled with these vices. This suggests that a depraved mind will lead to the corruption of every aspect of man's nature. It will drive a person to all kinds of sinful acts and affect every area of his life.\n\nThe list begins with sins that are more general in nature. The first is unrighteousness. An unrighteous person is one who acts unjustly, be it towards God or man. The second sin is fornication. This word has a broad range of meanings. It encompasses all kinds of sexual immorality such as sexual promiscuity, premarital sexual activities, adultery, rape and incest. The third is wickedness. It refers to someone who is actively evil and seeks to harm others. Queen Jezebel is an example of an unrighteous and wicked person. She not only ordered the killing of God's prophets, but also orchestrated the murder of Naboth to get his vineyard for her husband.\n\nLest we think we are innocent of these hideous sins, let us realize every sin is an offence against the holy God. This makes us all unrighteous and guilty before Him. But thank God for His gift of salvation through faith in the Lord Jesus Christ. Because the righteousness of the Lord Jesus was imputed to us who had no righteousness of our own, and our sins imputed to Him who knew no sin. Those who trust Him as their Saviour have their sins forgiven and enjoy eternal life with God in heaven when life on earth ends.",
        "part6": "THOUGHT",
        "part7": "His robes for mine: O wonderful exchange! Clothed in my sin, Christ suffered 'neath God's rage. Draped in His righteousness, I'm justified. In Christ I live, for in my place He died. - Chris Anderson",
        "part8": [
            "JOB 23",
            "LUKE 11"
        ]
    },
    "25 FEBRUARY": {
        "part1": "Romans 1:29",
        "part2": "Covetousness, maliciousness, envy",
        "part3": "VERSE 29",
        "part4": "Being filled with all unrighteousness, fornication, wickedness, covetousness, maliciousness; full of envy, murder, debate, deceit, malignity; whisperers,",
        "part5": "The next three sins listed are covetousness, maliciousness, and envy. Covetousness is a desire so intense that a person loses contentment in God Himself and what He has given, and seeks satisfaction in things instead. Covetousness is idolatry. It is the root of many other sins. It can cause us to become angry, bitter, envious, or critical of those who have what we desire. It can even drive us to use sinful means to get what we want, such as stealing, cheating, adultery, rape or going into debt. Do you covet recognition or success so much that you spend inordinate hours at work at the expense of all other relationships and commitments? Are you resentful when God does not give you the schools or courses that you covet for yourself or for your children?\n\nNext is maliciousness - a vicious and spiteful spirit that seeks the harm of others. We can be guilty of maliciousness when we intentionally withhold information from co-workers we dislike just to watch them fail, or when we partake in malicious gossip or do not put a stop to it.\n\nEnvy stems from a dissatisfied heart and a resentful spirit. It not only desires what others have but also resents those who have it. It not only wants others to suffer losses but gloats over their misfortunes. Are you critical of the colleague who got the promotion you think you deserve? Are you cold towards those born with a silver spoon or those whose lives seem to be plain sailing?\n\nMay the Lord convict us if we are guilty of these sins and help us to change.",
        "part6": "THOUGHT",
        "part7": "But godliness with contentment is great gain. For we brought nothing into this world, and it is certain we can carry nothing out. And having food and raiment let us be therewith content. - 1 Timothy 6:6-8",
        "part8": [
            "JOB 24",
            "LUKE 12"
        ]
    },
    "26 FEBRUARY": {
        "part1": "Romans 1:29",
        "part2": "Murder, Debate, Deceit",
        "part3": "VERSE 29",
        "part4": "Being filled with all unrighteousness, fornication, wickedness, covetousness, maliciousness; full of envy, murder, debate, deceit, malignity; whisperers,",
        "part5": "Murder is the unjust killing of another person. It is a sin against the sixth commandment. The Lord Jesus taught that God requires not only outward conformity to the law but also inward spiritual righteousness [Matthew 5:21-26]. Do we harbour anger, hatred, bitterness, or malice towards others in the heart? If these inner attitudes are left unchecked, then murder is in our heart. So do not think we are not susceptible to this sin, but rather ask God for grace to forgive those who may have hurt us and to cultivate a spirit of humility and gentleness.\n\nThe next sin, debate, refers not so much to formal discussion, but to strife and contention. Underlying this fault is a prideful and quarrelsome spirit quick to pick fights. Christians can be susceptible to this when defending their faith and beliefs with non-believers or when dealing with other believers in theological controversies. We should contend for the faith, but do we do it in a hostile and critical manner or do we speak the truth in love with grace?\n\nDeceit is the denial, concealment, distortion, or misrepresentation of truth. A deceitful person uses craft and underhanded methods to ensnare, mislead, or beguile others in order to get what he wants. The Bible cautions that \"the heart is deceitful above all things, and desperately wicked\" [Jeremiah 17:9]. Be vigilant and ask God to search our hearts lest we deceive ourselves into thinking our hearts are a great deal better than what they really are.",
        "part6": "THOUGHT",
        "part7": "Let your speech be always with grace, seasoned with salt, that ye may know how ye ought to answer every man. - Colossians 4:6",
        "part8": [
            "JOB 25",
            "LUKE 13"
        ]
    },
    "27 FEBRUARY": {
        "part1": "Romans 1:29b-30",
        "part2": "Malignity, whisperers, backbiters  VERSES 29b-30 ... Malignity, whisperer, Backbiters, haters of God, despiteful, proud, boasters, inventors of evil things, disobedient to parents,  To CompPLETE THE BIBLE",
        "part3": "",
        "part4": "... malignity; whisperers, Backbiters, haters of God, despiteful, proud, boasters, inventors of evil things, disobedient to parents,",
        "part5": "Malignity is an evil disposition. Such a person always suspects evil in others, looks for the worst in others, passes on the worst about others, and wishes evil upon others. This may sound extreme but think again. Do you take offence easily, even when the remarks or actions are actually innocent? Are you always suspicious of other people's motives? Do you allow malicious gossip to colour your opinions of others?\n\nThe next two are sins of the tongue. Both whisperers and backbiters speak evil of others. They take pleasure in destroying others' reputation and do not care if the tales they carry are true or not. The difference between a whisperer and a backbiter is that the former slanders a person secretly behind his back, leaving no means for him to defend himself, while a backbiter makes and asserts his accusations openly.\n\nWe may think not all gossip is harmful and we are merely stating \"facts\" or giving well-intentioned warning to others. But these \"facts\" are often unverified and even if true, it is not for us to spread them in a casual manner. Is that showing love to the hearer or the accused? Can we sincerely say we are not indirectly showing off our own righteousness or secretly enjoying the attention for knowing some \"juicy\" news? James reminds us that our tongue, though little, can kindle a great fire [James 3:5]. Our words can destroy others' reputation and stumble their faith. Let us bridle our tongue and only say things that glorify God and edify others.",
        "part6": "THOUGHT",
        "part7": "Let no corrupt communication proceed out of your mouth, but that which is good to the use of edifying, that it may minister grace unto the hearers. - Ephesians 4:29",
        "part8": [
            "JOB 26",
            "LUKE 14"
        ]
    },
    "28 FEBRUARY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 30 -- unbelievers often use the name of the Lord Jesus",
        "part4": "Backbiters, haters of God, despiteful, proud, boasters, inventors of evil things, disobedient to parents,",
        "part5": "God's Word commands mankind - who is created in His image - to love, obey and fear Him and to reverence His name. But what do we see all around us in our twenty-first century society? People are doing just the opposite. They hate His commandments, His words, the values He teaches, and they hate His name. They hate God and they hate His Son [John 15:23]. One simple illustration - unbelievers often use the name of the Lord Jesus as a swear word, even in expletives! But they would not dare to do the same with the names of leaders of other religions. Why this blasphemy against our Lord Jesus? Because they hate Him. And we should not be surprised, because that is what He clearly foretold.\n\nWhy do they hate Him? The reason is simply because their deeds (and hearts) are evil. The Lord Jesus is the Light of the world, but men loved darkness rather than light, neither cometh to the light, lest their deeds should be reproved [John 3:19-20]. When the Lord Jesus exposed the pride and hypocrisy of the religious leaders of His day, they did not repent but sought to kill Him.\n\nOur Lord warns that when we follow Him, the world will hate us as well. He also teaches us to respond to such hatred with love. He came to this world to die for people who hate Him. He loves them and we should love them as well. And the best thing we can do for them is to share His Gospel of saving grace with them.",
        "part6": "",
        "part7": "That at the name of Jesus every knee should bow, of things in heaven, and things in earth, and things under the earth. - Philippians 2:10",
        "part8": [
            "JOB 27",
            "LUKE 15",
            "THOUGHT That at the name of Jesus every knee should bow,",
            "of things in heaven, and things in earth, and things",
            "under the earth. -- Philippians 2:10"
        ]
    },
    "1 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 30 venting their vitriol against those they dislike.",
        "part4": "Backbiters, haters of God, despiteful, proud, boasters, inventors of evil things, disobedient to parents,",
        "part5": "Paul lists several characteristics of people who hate the Lord Jesus Christ. They are despiteful. They treat those they dislike with injurious insolence. They are loud, boisterous, abusing the characters and persons of those whom they can. We see such people often in social media. All day long they rant against their political opponents and those in positions of authority. Quite often we see them in the news, protesting in the streets and venting their vitriol against those they dislike.\n\nPaul also says they are proud and boasters. Again, we see them everywhere in society today. They exalt themselves continually while disparaging others. Today's management gurus extol pride and self-esteem as values to be cherished if one wants to get ahead in life. Parents and educators are taught they should never criticize or punish children but instead encourage them to love themselves and develop self-confidence and pride. Paul in his second epistle to Timothy warned that such a trend will become prominent during the perilous times just before the second coming of the Lord.\n\nThe Bible has much to say about the sin of pride. Followers of the Lord Jesus Christ must guard against this deadly sin. We are to learn of Him who was meek and lowly in heart [Matthew 11:29], who washed the disciples' feet, humbled Himself and bore our sins on the Cross. Never forget, \"For by grace are ye saved through faith; and that not of yourselves: it is the gift of God: Not of works, lest any man should boast.\" [Ephesians 2:8-9]",
        "part6": "",
        "part7": "Yea, all of you be subject one to another, and be clothed with humility: for God resisteth the proud, and giveth grace to the humble. - 1 Peter 5:5b",
        "part8": []
    },
    "2 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 30 obviously merciless people who do not care about",
        "part4": "Backbiters, haters of God, despiteful, proud, boasters, inventors of evil things, disobedient to parents,",
        "part5": "Paul says these God-haters with reprobate minds invent evil things. He does not specify what the \"evil things\" are. They could mean new ways of doing evil, or new ideas of sinning. Whichever interpretation, both are prevalent and multiplying in our modern society. Phone scams, internet scams, child pornography, drug trafficking and terrorism are just a few of the countless new types of evil we see daily in the news; crimes that were unheard of just a few generations ago. The perpetrators are obviously merciless people who do not care about the pain and suffering they inflict on their victims.\n\nAnd then there are those who are not content with the ordinary and \"traditional\" ways of sinning. They seek the thrill of new ideas of sinfulness, sinking to new depths of depravity. Tragically, many of these evils are targeted at our children. For example, under the guise of \"inclusion\" and \"love\", children are taught to embrace all types of perverted sexual identities, from homosexuality to bisexuality to asexuality. Admonition of children in any form is also wrong. As a result, we have a generation of young people who disobey parents and despise authority. Satan is clearly out to destroy the family unit.\n\nAs Christians, our only defence is to lead godly lives, and bring up our children in the nurture and admonition of the Lord. We should also be united as a church family, loving and caring for one another, assembling together regularly for fellowship, Bible study and worship, and praying together for our church and families.",
        "part6": "",
        "part7": "For we wrestle not against flesh and blood, but against principalities, against powers, against the rulers of the darkness of this world, against spiritual wickedness in high places. - Ephesians 6:12",
        "part8": []
    },
    "3 MARCH": {
        "part1": "Romans 1:31",
        "part2": "Without understanding or natural affections",
        "part3": "VERSE 31",
        "part4": "Without understanding, covenantbreakers, without natural affection, implacable, unmerciful.",
        "part5": "Paul concludes his description of evil-doers with five more characteristics in verse 31 - one of which we have considered earlier. \"Without understanding\" describes the man who is a fool, who will not use the mind and brain that God has given to him. Consequently, he is unable to discern between what is right or wrong in the eyes of his Creator. Covenant breakers are disloyal and break agreements, oaths and vows, thus cannot be trusted. In the light of the other sins Paul listed, this term may have a special emphasis pertaining to the marriage bond. Divorce rates in modern societies are soaring and a common reason cited by couples for divorce is \"irreconcilable differences\" or \"irretrievable breakdown of marriage\". Paul labels this unforgiving, vindictive attitude as \"implacable\".\n\n\"Without natural affections\" refers to an absence of the affection founded upon natural God-ordained relationships such as that between parent and child, or husband and wife. This evil prevailed in Paul's days and before, among the pagans who sacrificed their own children to idols. Today it takes the cruel form of abortion where millions of unborn babies are killed every year throughout the world. In the United Kingdom for example, repeat abortions among teenage girls has been rising.\n\nSadly, many of these sins are found even among professing Christians. This is something the Apostle warned would happen especially in the last days. May the Lord have mercy on us. May His Holy Spirit speak to our hearts to turn away from such evil and come to Him in humble repentance and obedience.",
        "part6": "THOUGHT",
        "part7": "For our conversation is in heaven; from whence also we look for the Saviour, the Lord Jesus Christ. - Philippians 3:20",
        "part8": [
            "JOB 30",
            "LUKE 18"
        ]
    },
    "4 MARCH": {
        "part1": "Romans 1:32",
        "part2": "God's judgment",
        "part3": "VERSE 32",
        "part4": "Who knowing the judgment of God, that they which commit such things are worthy of death, not only do the same, but have pleasure in them that do them.",
        "part5": "In January 1996, the Church of England's Doctrine Commission published a report entitled \"The Mystery of Salvation\", which basically said that, while Hell exists, the traditional images of Hell as an eternal torment were wrong. Bishop John Taylor, one of the report's authors said, \"Hell as ultimate non-being is the way in which we have put it. The horrible demons are the imaginations of inventors and medievalists.\" The report had more good news for unbelievers - while salvation comes only from God, and only through the cross, it did not mean that God rejects people of other faiths. \"God will save ultimately those who are willing to be saved, by their penitence and acceptance of the love which stretches out to them.\"\n\nAny true follower of the Lord Jesus Christ who knows and takes the Bible seriously should recognise that the above statements are heresies. They contradict everything the Lord taught about hell and judgment. The Lord Jesus often warned His listeners that hell is a real place of torment and eternal punishment. He warned that \"there shall be weeping and gnashing of teeth\". By this He meant that in hell, people would not only suffer in agony, but they would also feel much regret.\n\nTragically, many churches continue to preach such a perverted Gospel. Little wonder that the world is plunging headlong towards the sad state foretold by the Apostle in this chapter. It is vitally important for those who profess to be followers of the Lord Jesus Christ to search the Scriptures and confirm for ourselves what the Bible teaches about sin and judgment.",
        "part6": "THOUGHT",
        "part7": "And I saw the dead, small and great, stand before God; ... and the dead were judged out of those things which were written in the books, according to their works. - Revelation 20:12",
        "part8": [
            "JOB 31",
            "LUKE 19"
        ]
    },
    "5 MARCH": {
        "part1": "Romans 1:32",
        "part2": "Mocking hell",
        "part3": "VERSE 32",
        "part4": "Who knowing the judgment of God, that they which commit such things are worthy of death, not only do the same, but have pleasure in them that do them.",
        "part5": "We mock hell when we commit deeds worthy of death whilst knowing the judgment of God is coming. Judgment may feel very far away to us when we are in the dark, when we think we are alone, experiencing the fleeting pleasure of sin. And even though God has announced that those who sin deserve death, we continue sinning anyway, and His warnings of judgment fall on deaf ears. The pleasure of sin blinds us, and we presume that God will simply turn a blind eye to our indulgence of the flesh. Some long-time churchgoers or professing Christians may be tempted to think that Paul's warning in verse 32 is for the unbeliever who is very distant from God, not them. But Paul later points out in Romans 2:12 he is referring to all, even the believer who is consciously trying to abide by God's laws. The same root of sin rules in our hearts, expressing itself in some way in our lives. It is true we may not receive immediate judgment for our sin in this life. But Paul tells us \"be not deceived; God is not mocked: for whatsoever a man soweth, that shall he also reap\" [Galatians 6:7]. Do not buy into the lie that judgment for sin will not come. We will eventually reap the everlasting consequences of sins we commit now. \"Ye that love the Lord, hate evil\" [Psalm 97:10].",
        "part6": "PRAYER",
        "part7": "Dear Father, thank You that Your judgment is just, and thank You for Your mercy available to all. Save us from our blindness to the consequence of sin and help us to repent and to hate sin. In Jesus' name, Amen.",
        "part8": [
            "JOB 32",
            "LUKE 20"
        ]
    },
    "6 MARCH": {
        "part1": "Romans 1:32",
        "part2": "Delight in sin",
        "part3": "VERSE 32",
        "part4": "Who knowing the judgment of God, that they which commit such things are worthy of death, not only do the same, but have pleasure in them that do them.",
        "part5": "Even the Bible declares that there can be pleasure in sin. The deception of its pleasure is that it is only temporary, \"for a season\" [Hebrews 11:25]. The prodigal son in Luke 15 was tempted by all the pleasures of the world beyond his home. He asked for his inheritance from his father, left home and foolishly squandered it on the world's temporal pleasures. The Bible says, \"there [he] wasted his substance with riotous living.\" After the prodigal son had spent all and a famine arose, he was forced to feed pigs to survive.\n\nIf sin were as distasteful as its consequence, we would easily flee from it. But sin is seductive and irresistible. Sin wraps itself in what looks harmless and pleasurable. The fruit on the tree of knowledge of good and evil was \"good for food\", \"pleasant to the eyes\" and \"a tree to be desired to make one wise\" [Genesis 3:6]. Sin delivers on its promise to grant temporal gratification in its first bite. But once the fleeting pleasure is over, it forces us into shame and hiding from God, and separates us from Him.\n\nDelight no more in sin - hate it. But do not be discouraged by your sinful past - even for Paul, the battle against sin was a war against the law of his renewed mind, bringing him into captivity to the law of sin [Romans 7:23]. It is not by our own efforts, but God alone Who transforms our desires through the Lord Jesus Christ.",
        "part6": "THOUGHT",
        "part7": "Among whom also we all had our conversation in times past in the lusts of our flesh, fulfilling the desires of the flesh and of the mind; and were by nature the children of wrath ... But God, who is rich in mercy, for His great love wherewith He loved us, Even when we were dead in sins, hath quickened us together with Christ, (by grace ye are saved;) - Ephesians 2:3-5",
        "part8": [
            "JOB 33",
            "LUKE 21"
        ]
    },
    "7 MARCH": {
        "part1": "Romans 2:1",
        "part2": "The inexcusable man",
        "part3": "VERSE 1",
        "part4": "Therefore thou art inexcusable, O man, whosoever thou art that judgest: for wherein thou judgest another, thou condemnest thyself; for thou that judgest doest the same things.",
        "part5": "In Romans 1:18-32, Paul has shown that there is no excuse for the unbelieving Gentiles in their fallen and lost condition. God has given them sufficient knowledge of Himself through general revelation (nature). His invisible attributes of external power and divinity are clearly perceived, and consequently the wicked are without excuse [Romans 1:20]. Man knows God exists but has refused and rejected the God Who is good. The pagan Gentiles suppressed the truth by their unrighteousness, ungodliness and wickedness, and became idol worshippers, immoral and depraved. Sinful man is under God's condemnation. Upon him, God's wrath is revealed from heaven. They had no excuse for their sins and depravity before the righteous God.\n\n\"Inexcusable\" is translated from the Greek word anapologetos, which means \"without excuse\". In Romans chapter 2, Paul begins to demonstrate that all the self-righteous are also without excuse. If the Gentiles having general revelation and the internal voice of conscience [Romans 1:18-20] were inexcusable, then much more so the Jews, the chosen people who had the Law - the revealed will of God - and thus had greater knowledge than the Gentiles. Paul shows the self-righteous are also guilty sinners and under God's wrath.\n\nTo know God, read the Bible. Find out what God has revealed about Himself [Exodus 34:6-7; Leviticus 19:2; Jeremiah 32:27]. Then find out what was said about Him and His remarkable attributes [Psalm 19:1-4; Romans 1:16-20; 1 John 4:8-10]. Finally, take a look at the amazing things He has done [Genesis 1:1; Exodus 14:10-31; John 3:16].",
        "part6": "THOUGHT",
        "part7": "Sin can only be forgiven through the shed blood of our risen Lord and Saviour Jesus Christ. - Hebrews 9:22b",
        "part8": [
            "JOB 34",
            "LUKE 22:1-38"
        ]
    },
    "8 MARCH": {
        "part1": "Romans 2:1",
        "part2": "Judging others and judging self",
        "part3": "VERSE 1",
        "part4": "Therefore thou art inexcusable, O man, whosoever thou art that judgest: for wherein thou judgest another, thou condemnest thyself; for thou that judgest doest the same things.",
        "part5": "\"Whosoever thou art that judgest: for wherein thou judgest another, thou condemnest thyself.\" Here, \"thou\" refers to those who pass judgment on others based on their own moral standards, and have themselves fallen short of the standard of God, the ultimate Judge. In Romans chapter 2, Paul turns his attention to the moralists. These were the people who perceived themselves to be morally superior, and had set themselves apart from heathen Gentiles. They expressed freely and critically the character and destruction of the Gentiles. They were in the habit of accusing and condemning them (the heathen Gentiles) as wicked, while excusing themselves on the grounds that they possessed the law and oracles of God, and were His chosen people. Therefore, they would escape God's judgment.\n\nThe habitual self-righteous fault-finder must remember that he himself can expect to be condemned not only by men but especially by God. The man who sins without the law, and the man who sins in the law, will both be judged. The moralist, the person who judges others, is as guilty as the person he judges. For this reason, we are not to judge, criticize and find fault with others.\n\nIn judging others, we automatically judge ourselves. Judging others elevates self and lowers others, exalts self and denigrates others. In God's eyes, this is wrong. It is sinful self-righteousness, pride and arrogance.\n\nInstead, we are exhorted to judge ourselves. \"Examine yourselves, whether ye be in the faith; prove your own selves\" [2 Corinthians 13:5a]. \"For if we would judge ourselves, we should not be judged\" [1 Corinthians 11:31]. \"If we would thoroughly search and explore ourselves and condemn and correct what we find amiss, we should prevent divine judgment\" (Matthew Henry).",
        "part6": "THOUGHT",
        "part7": "Let a man judge, not his fellow-men, but himself, lest he incur the righteous judgment of God.",
        "part8": [
            "JOB 35",
            "LUKE 22:39-71"
        ]
    },
    "9 MARCH": {
        "part1": "Romans 2:2",
        "part2": "Certain judgment",
        "part3": "VERSE 2",
        "part4": "But we are sure that the judgment of God is according to truth against them which commit such things.",
        "part5": "Paul has revealed in Romans 1:18-32 that God's wrath is revealed in judgment against the sinful Gentile because he has rejected His revelation and descended into idolatry and horrifying vice. In chapter 2, Paul indicts the Jews and all morally superior people, that based on God's truth, they are under God's judgment and without excuse also. The Jews believed they were chosen, born into the line of Abraham, and the fact they had God's law and were circumcised would exempt them from judgment. They judged others based on their own standards but did not think of themselves as sinners.\n\nReading the judgment described in Romans 2, we realize that nobody will escape God's judgment for personal sin. God's righteous judgment is certain and unavoidable. The judgment of the true and living God is according to truth. The expression \"according to truth\" has two meanings. In Hebrew, it sometimes is used to denote \"truly\" or \"certainly\". God will certainly judge and punish such deeds. (The judgment of God is according to deeds: eternal reward or punishment). Evil-doers suffer judgement and well-doers are rewarded.\n\nAnother meaning is that God will judge those who are guilty of such things (sinful acts mentioned in chapter 1) not according to appearance but based on His complete knowledge of all the evidence: \"for the LORD seeth not as man seeth; for man looketh on the outward appearance, but the LORD looketh on the heart\" [1 Samuel 16:7b]. However, Paul also tells us God's real desire is not judgment, but salvation that comes through repentance. Now is the time to repent and take hold of His patient love [Romans 2:4].",
        "part6": "PRAYER",
        "part7": "Lord, may those outside Your Kingdom be convicted of their sin [1 John 1:9] and confess the Lord Jesus as their personal Lord and Saviour [Romans 10:9-10].",
        "part8": [
            "JOB 36",
            "LUKE 23"
        ]
    },
    "10 MARCH": {
        "part1": "Romans 2:2",
        "part2": "Judgment according to truth",
        "part3": "VERSE 2",
        "part4": "But we are sure that the judgment of God is according to truth against them which commit such things.",
        "part5": "Man's judgment is usually subjective. Intentionally or not, our judgments are coloured by various lenses. Age, experience, conviction, personal preference, and selfishness affect the way we judge a thing. Therefore, we ought often to examine our own judgments and not be quick to condemn the actions of others. In contrast to us, God's judgments are altogether true and righteous. That is a sobering thought, for at the moment we judge and condemn another's behaviour, His true and righteous judgement falls upon us.\n\nOften, we pride ourselves on being \"better\" than those whom we judge. We judge others' actions and feel better about ourselves. Perhaps, we condemn others so that we can maintain an appearance of holiness. \"Not in MY house ...,\" \"Unlike them, I would ...,\" \"I would never ...\" are some common expressions that could indicate that instead of truly being concerned for the other person, we are more concerned with portraying our own \"righteousness\". Take heed, for here we are warned that God is able to truly judge both others and ourselves.\n\nHow then can we avoid this tendency of being critical and censorious of others? One way would be always to regard the actions of others in the most magnanimous and charitable light while adopting the strictest view when examining ourselves. When we see others engaging in behaviour that we might not necessarily agree with, let our first response be one of love.",
        "part6": "THOUGHT",
        "part7": "Do I point out the flaws of others because I want them to be closer to God?",
        "part8": [
            "JOB 37",
            "LUKE 24"
        ]
    },
    "11 MARCH": {
        "part1": "Romans 2:3",
        "part2": "Thinkest thou this...",
        "part3": "VERSE 3",
        "part4": "And thinkest thou this, O man, that judgest them which do such things, and doest the same, that thou shalt escape the judgment of God?",
        "part5": "Often, we engage in sinful judgment of others with a condemnatory spirit because we have a wrong thinking about sin. A common misconception we have is that there are significant differences with regard to sin. While the Bible does suggest there are varying degrees of sin, let us remember that whoever commits even one sin is pronounced guilty of all [James 2:10]. The ultimate punishment whether for one small sin, for one grievous sin, or many sins is the same - death.\n\nWe struggle to consciously think this way. Instead, in our pride we draw arbitrary distinctions with regard to sin. It would be ridiculous for an adulterer to proudly point at a murderer and say, \"at least I am better than he.\" It is equally ridiculous for liars, online pirates, gluttons, and materialistic people to point at one another and say, \"at least I am not like you.\" Our sins may manifest differently, but they are \"the same\" because they are all sins.\n\nThe problem is not that we think others are sinful. The real problem is we often do not recognise we are equally, if not more sinful than they. When our faults are pointed out to us, we tend to react defensively and say, \"but my sin is different from his and therefore irrelevant to this situation.\" To protect ourselves, we suspend our thinking after pointing a finger at others in judgment. In short, our problem is pride. We think too highly of ourselves and too little of others.",
        "part6": "THOUGHT",
        "part7": "How would consciousness of my own sins affect how I view others?",
        "part8": [
            "JOB 38",
            "JOHN 1"
        ]
    },
    "12 MARCH": {
        "part1": "Romans 2:3",
        "part2": "No escape!",
        "part3": "VERSE 3",
        "part4": "And thinkest thou this, O man, that judgest them which do such things, and doest the same, that thou shalt escape the judgment of God?",
        "part5": "Another reason we are quick to point out the sin of others could be that we want to obscure and avoid thinking about our own sinful nature. We find it easy to gossip with a group of friends about the faults of others, yet we have difficulty sharing about our own struggles with sin. Perhaps, we engage in judgmentalism to avoid being judged for our own sin. In truth, what we are doing is adding sin upon sin. By condemning others in order to avoid drawing attention to ourselves, we add to ourselves the sin of not judging righteously.\n\nThe scary thing about this sin is that we seem to get away with it. We may be able to live a holy, \"perfect\" Christian life on earth pointing out the sins of others while managing to conceal our own. Paul here warns that even if this is the case, there is no escape from the righteous judgement of God.\n\nYou may be able to fool the world into thinking you are an exemplary Christian but what does that matter in light of the fact that God knows, and He will be the ultimate judge. Furthermore, no matter how well we hide our sins, the Bible promises that it will eventually be brought to light [1 Corinthians 4:5]. In recent years, we have seen countless examples of this even among public Christian figures, both living and dead.",
        "part6": "THOUGHT",
        "part7": "If we confess our sins, He is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness. - 1 John 1:9",
        "part8": [
            "JOB 39",
            "JOHN 2"
        ]
    },
    "13 MARCH": {
        "part1": "Romans 2:4",
        "part2": "Despisest the riches of God",
        "part3": "VERSE 4",
        "part4": "Or despisest thou the riches of His goodness and forbearance and longsuffering; not knowing that the goodness of God leadeth thee to repentance?",
        "part5": "Over the past few days, we have been meditating on the sin of judging others without a proper view of ourselves. Today, we are presented with a solution to this sin. Paul accused the judgmental Christians of despising the riches of God's goodness, forbearance, and longsuffering. Indeed, when we judge others and condemn them, we are implicitly saying that their sin is beyond God's patience and ability to forgive. At the same time, we are presuming on God's goodness and patience by persisting in obscuring our own sinful nature and pride, expecting He would continue to be patient with us, overlooking our own sins, even as we point out the sins of others. This is hypocrisy at its best. Towards others we cheapen the riches of God's goodness, forbearance, and longsuffering. And yet we ourselves rely on these very attributes of God's character to continue in condemning others. To deal with our hypocrisy, let us realize what the richness of God's grace and mercy means. He has promised if we truly repent of our sins and confess them, He will forgive us. When we turn to God, there is no sin which He cannot forgive. This ought to be the clear, consistent message we remind ourselves and tell others. Instead of having a \"holier than thou\" attitude towards others who have committed errors and transgressions, lovingly share our own experience of the riches of God's forgiveness with them. The message ought to be \"just as the Lord Jesus Christ was rich enough to forgive me, He can forgive you too.\"",
        "part6": "THOUGHT",
        "part7": "How many are the lost that I have lifted? How many are the chained I've helped to free? I wonder, have I done my best for Jesus, When He has done so much for me? - Ensign Edwin Young",
        "part8": [
            "JOB 40",
            "JOHN 3"
        ]
    },
    "14 MARCH": {
        "part1": "Romans 2:4",
        "part2": "The goodness of God",
        "part3": "VERSE 4",
        "part4": "Or despisest thou the riches of His goodness and forbearance and longsuffering; not knowing that the goodness of God leadeth thee to repentance?",
        "part5": "This verse explicitly highlights the goodness, forbearance, and longsuffering of God. God is infinitely good. Apart from His glorious creation, God's goodness is particularly manifested in His work of redemption, where \"the kindness and love of God our Saviour toward man appeared\" [Titus 3:4]. The extent of God's goodness is seen in the glory of the Person and the majesty of His work given as the propitiation for our sins: the Lord Jesus Christ - the only begotten Son of God and the humiliation and sufferings He had to undergo [Philippians 2:6-8] in contrast to the unworthiness of us whom He bore the sins for. The reason for that sacrifice is so that we could be rescued from the great horrors of eternal hellfire.\n\nWe are richly blessed with both the blessings of the life that now is, and of that which is to come. God is rich, and we are directed to His wealth of goodness. This is an ocean unfathomable; we know so little of its vastness that we can only stand and gaze on its surface. The riches of divine goodness are beyond what we can ask or think. This goodness of God is manifested in His longsuffering and forbearance - how He withheld His judgment which we so rightfully deserved and gave us every opportunity to turn to Him despite our utter wilfulness and sin.\n\nCan we then despise such riches? How then should we respond to God's goodness? Ought it not humble us and fill us with gratitude and love? It is wonderful that God acts as He does. May we not spurn such divine goodness extended towards us.",
        "part6": "PRAYER",
        "part7": "Father in Heaven, we thank You for such great love You have towards us. Your goodness, forbearance and longsuffering towards us is far-reaching and unsearchable. While we cannot fully comprehend it, let us immerse ourselves in it. In Jesus' Name. Amen.",
        "part8": [
            "JOB 41",
            "JOHN 4"
        ]
    },
    "15 MARCH": {
        "part1": "Romans 2:4",
        "part2": "Repentance",
        "part3": "VERSE 4",
        "part4": "Or despisest thou the riches of His goodness and forbearance and longsuffering; not knowing that the goodness of God leadeth thee to repentance?",
        "part5": "Repentance involves the changing of one's heart and mind, and turning from one's old habits of error and sin to a new and better course of life. \"The goodness of God leadeth thee to repentance\" tells us it is God who deals directly with sinners as we are. Some individuals are driven to remorse and fear by the consequences of sins - Ahab was driven by Divine threats, Pharaoh by supernatural judgments, and Judas by the terror of his own conscience. But to be led to genuine repentance from sin, one must be allured by the discovery of heavenly hope, and the attraction of divine love.\n\nFollowing yesterday's theme on God's goodness, it is the very nature of Divine goodness that leads sinners to true repentance. In the context of Romans 2, it makes no difference between the Jew or the Gentile. Sin is sin regardless of whether one is a descendant of Abraham or not. When we realize the exceeding sinfulness of sin and the utter goodness of God, then we will recognize our obligation to love and serve God, the great Author of our being and of the mercies we receive. The result of true repentance appeals to our gratitude, assures our hope and banishes our fears. While the goodness we secure in our repentance is so great, the consequences for us are correspondingly tremendous should we remain in wilful rebellion toward Him.\n\nAll who truly love God will feel the constraining power of His goodness. By God's goodness are we made penitent, believing, thankful, and obedient. Is this our response? May He help us.",
        "part6": "THOUGHT",
        "part7": "When I survey the wondrous cross On which the Prince of glory died My richest gain I count but loss And pour contempt on all my pride Were the whole realm of nature mine, That were a present far too small; Love so amazing, so divine Demands my soul, my life, my all. - Isaac Watts",
        "part8": [
            "JOB 42",
            "JOHN 5"
        ]
    },
    "16 MARCH": {
        "part1": "Romans 2:5",
        "part2": "Hardness of heart",
        "part3": "VERSE 5",
        "part4": "But after thy hardness and impenitent heart treasurest up unto thyself wrath against the day of wrath and revelation of the righteous judgment of God.",
        "part5": "Having previously considered the goodness of God that leads us to repentance, we see another group of people who chooses the way contrary to Him and His earnest call. While some recognize the exceeding sinfulness of sin and its consequences, thereby turning to God in grief and humble repentance, others remain unyielding and obstinately in opposition to Him and His truth. Hardness of heart is not merely an insensibility of emotions or feelings. The Lord Jesus rebuked his accusers for their hardness of heart [Mark 3:5]. Paul described it as blindness [Romans 11:25]. Hard- heartedness speaks of a calloused and stubborn heart that controls a person's entire being, just as Pharaoh whose heart was hardened despite witnessing all the wonders of God and partaking in His painful judgment. He had a fixated desire to oppose God, and a zealous hatred of His truth - manifesting itself in blasphemy towards God and persecution of His people.\n\nWhile it is the very effect of our human depravity, hard-heartedness does not manifest itself to its full extent overnight. Instead, it is a natural consequence of indulging in sin. The cultivation of virtue begets more virtue. Likewise, the wallowing in sin begets deeper and more grievous sin - a sinful hardening of the heart.\n\nWhat then should we do, and how should we react? Dread it; withstand it; pray against it; flee from it. The Word of God exhorts us, \"Harden not your heart, as in the provocation, and as in the day of temptation in the wilderness\" [Psalm 95:8]. May this serve as a warning to all readers.",
        "part6": "THOUGHT",
        "part7": "For readers who have not known the Lord, turn to Him and harden not your hearts to His call to repentance and salvation. For those who are His, pray for those who are still unrepentant and wilful in rejecting Him, that they may humbly turn to the Lord in repentance.",
        "part8": [
            "ECCLESIASTES 1",
            "JOHN 6"
        ]
    },
    "17 MARCH": {
        "part1": "Romans 2:5",
        "part2": "Hoarding wrath",
        "part3": "VERSE 5",
        "part4": "But after thy hardness and impenitent heart treasurest up unto thyself wrath against the day of wrath and revelation of the righteous judgment of God.",
        "part5": "Verse 5 can be paraphrased as: \"But because of your stubborn and unrepentant heart, you are storing up wrath for yourself on the day of wrath when God's righteous judgement will be revealed.\" There is a tinge of irony here when Paul uses the words \"treasurest up\". The phrase \"treasurest up\" or \"storing up\" normally refers to storing up good things (Deuteronomy 32:34; Matthew 6:20), but here Paul uses it in a negative sense. When reading this verse, the irony highlights to the reader that we ought to be storing up blessings and not wrath.\n\nThe important question is whether we are storing up judgment or blessing for ourselves. For unrepentant sinners, the Bible tells us that they will be condemned on Judgment Day when the Lord Jesus Christ returns again, or if their lives here end. But when the Lord Jesus Christ came the first time, He gave us the gift of grace by dying on the cross, so that we may escape judgment and partake of blessings in the Eternal Kingdom.\n\nFor the believer, has Christ's death on the cross become a \"license to sin\" instead of a motivation to flee from sin? Do we sometimes willingly indulge in sin because we will be forgiven later on anyway? Let this verse be a warning to keep us in step with God, to always keep 'short accounts' with God through frequent prayer and sincere repentance.\n\nLet it also be an encouragement to store up blessings by drawing closer to our Saviour in His Word, by prayer and serving Him in His ministries, for our God is a God who loves to bless His people.",
        "part6": "THOUGHT",
        "part7": "Is there more that we can do in our walk with God? Perhaps serving more or spending more time in His Word and prayer?",
        "part8": [
            "ECCLESIASTES 2",
            "JOHN 7"
        ]
    },
    "18 MARCH": {
        "part1": "Romans 2:6",
        "part2": "Just pay for a life of sin",
        "part3": "VERSE 6",
        "part4": "Who will render to every man according to his deeds:",
        "part5": "In yesterday's devotion, we learnt that if we choose to remain unrepentant sinners, we will be storing up judgement. Verse 6 goes on to say that God will \"render\" or \"payback\" every man according to his deeds on earth. Paul tells us there will be \"payback\" for every sin committed, past, present and future on the Day of Judgement. There will be eternal judgement for sin.\n\nTo the unrepentant sinner who exclaims: \"God is unfair\", this verse says otherwise. God will judge everyone impartially and equitably using the same standard - works. Some of us believe the Devil's lie that we can get away with \"minor sins\"; that some sins are not so serious, so it is of little consequence if we commit \"minor sins\" every now and then.\n\n\"It's okay to tell a white lie so that my colleague's feelings are not hurt.\" \"The restaurant forgot to charge me for a dish but that's okay. There's no need to point it out to them because it is clearly their fault.\" \"It's okay to curse and swear to prove a point so that the other person won't make the same mistake again.\" These are lies we believe in. Sin is sin and there is no \"grey area\". Do we justify our sins in this manner?\n\nAs believers, are we taking the Lord's payment in blood for granted? Our God is gracious and yearns to forgive us. What we have to do is to repent, flee from sin and cling to our Lord and Saviour.\n\nFor those who do not know the Lord Jesus Christ yet, do you dare to face God's wrath without the covering of Christ? Accept Jesus Christ as your Lord and Saviour today!",
        "part6": "THOUGHT",
        "part7": "Every sin committed has a price. Do we yearn to pursue a life lived for Christ knowing the price He has paid for our sins?",
        "part8": [
            "ECCLESIASTES 3",
            "JOHN 8"
        ]
    },
    "19 MARCH": {
        "part1": "Romans 2:6",
        "part2": "Judged according to works",
        "part3": "VERSE 6",
        "part4": "Who will render to every man according to his deeds:",
        "part5": "God will judge every man according to his deeds on earth, but this verse must be read in context of the book of Romans and also in context of the entire Bible. While it is true that God will judge us impartially according to our works, this does not mean we will be excused from eternal damnation as long as we live a life filled with good works.\n\nIn Ephesians 2:8-9, Paul tells us that it is only by grace through faith in the Lord Jesus Christ that we are saved. We are not saved by works but by grace alone. This truth is known to every Reformed believer, but it must be hammered home again because we still subconsciously believe the lie that good works save.\n\nReflect on how many times you have tried to do something good after feeling the guilt of sinning? After doing wrong to another person, do we first seek repentance from God or try to right the wrong by our own strength? We may truly believe that salvation is through faith in the Lord Jesus Christ alone but our sinful minds sometimes instinctively cause us to think otherwise. It is only natural for us to react in such ways, which is why we need to constantly remind ourselves of this great truth.\n\nMay the guilt of sinning draw us closer to our Saviour who yearns to forgive. May we spend more hours studying His Word, communing with Him in intimate closet prayer and serving Him so that we may hear His sweet voice saying: \"Well done, thou good and faithful servant ... enter thou into the joy of thy Lord.\" [Matthew 25:21]",
        "part6": "THOUGHT",
        "part7": "Our Lord Jesus Christ drank the cup of wrath so that we will not have to face judgement according to our works. How are we acting in response to His grace?",
        "part8": [
            "ECCLESIASTES 4",
            "JOHN 9"
        ]
    },
    "20 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 7 eternal life in heaven, but Paul here is saying the",
        "part4": "To them who by patient continuance in well doing seek for glory and honour and immortality, eternal life.",
        "part5": "Paul goes on to tell us that those who seek glory, honour and immortality through perseverance in doing good deeds, God will grant eternal life. As we learnt in yesterday's devotion, Paul is not saying we need to do good works to be saved. Rather, Paul is highlighting the importance of godliness and good works in a believer who has been saved by grace through faith in the Lord Jesus Christ. Yes, all Christians who have faith in the Lord will receive eternal life in heaven, but Paul here is saying the desire to patiently persevere in doing good must be a characteristic of every Christian.\n\nThere are seasons in life when our good intentions produce bad results. For example, more time could have been put to good use in studying for the upcoming examinations than serving in church; doing what was best for the Lord's sake at work resulted in no increment or bonus for that year; speaking the truth in love to a loved one resulted in a strained and awkward relationship. These \"bad experiences\" may tempt us to steer away from doing good, to \"not care\" or do \"some bad\" every now and then, but that is not what our Lord wants us to do.\n\nOur Lord fulfilled His promise to us by sending His Son to die for our sins, and He too will fulfil this same promise of immortality, honour and eternal life to those who persevere in doing good; despite the adverse results of doing so. Rest in the fact that our Lord sees all, and knows your heart whenever you persevere in doing good for His name's sake.",
        "part6": "",
        "part7": "Do we choose to persevere in doing good or to do what is convenient?",
        "part8": []
    },
    "21 MARCH": {
        "part1": "Romans 2:8",
        "part2": "Being contentious and disobedient",
        "part3": "VERSE 8",
        "part4": "But unto them that are contentious, and do not obey the truth, but obey unrighteousness, indignation and wrath.",
        "part5": "We read in the previous verses that there will be a day of wrath and judgement when all will be judged according to God's righteous standards. God will judge everyone for all the sins they have committed. In today's verse, we consider those who are contentious and do not obey the truth. Matthew Henry comments that those who strive against God, are contentious. He explains that \"every wilful sin is a quarrel with God, it is striving with our Maker, the most desperate contention\".\n\nThe root of our contention with God is the love of sin. This is especially so for the unregenerate man, who being shown the truth, strives against it, rejecting it because he loves sin more than anything else. To the Christian, this struggle is a reality because of the fact we are still in our carnal bodies and subject to the trials and temptations of this world. The apostle Paul aptly describes this in Romans 7:22-24. As long as we live in our sin- cursed mortal bodies, we will struggle with sin and the temptation to sin.\n\nHow then should we guard ourselves against contention and disobedience? Let us put aside our pride and our love for sin, and put on Jesus Christ; \"that ye put off ... the old man, which is corrupt according to the deceitful lusts; ... and that ye put on the new man, which after God is created in righteousness and true holiness\" [Ephesians 4:22- 24].",
        "part6": "THOUGHT",
        "part7": "Only by pride cometh contention: but with the well advised is wisdom. - Proverbs 13:10",
        "part8": [
            "ECCLESIASTES 6",
            "JOHN 11"
        ]
    },
    "22 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 8 unrighteousness. Matthew Henry writes, \"Those",
        "part4": "But unto them that are contentious, and do not obey the truth, but obey unrighteousness, indignation and wrath",
        "part5": "As any parent knows, children are most afraid of the displeasure of their father or mother when they misbehave. Good parents who rule over their household well, need only to display their displeasure towards a child's wrongdoing to stop them in their tracks and bring them back to repentance. In Romans 2:8, we see God's response towards those who are contending against Him, who do not obey the truth but obey unrighteousness. Matthew Henry writes, \"Those that refuse to be the servants of truth will soon be the slaves of unrighteousness.\"\n\nTo these, God shows His displeasure through His indignation and wrath. \"It is a fearful thing to fall into the hands of the living God\" [Hebrews 10:31]. To the unrepentant sinner, God reserves His displeasure and anger, and on the day of judgement, the sinner will be without excuse, having lived their lives in contention against God and disobedience to His truth. \"And fear not them which kill the body, but are not able to kill the soul: but rather fear Him which is able to destroy both soul and body in hell\" [Matthew 10:28].\n\nLet us even right now examine our lives to see if we are deserving of God's indignation and wrath. Better still, ask God, who is all merciful and compassionate, to search our hearts and reveal to us areas of our lives where we may have transgressed His holy laws, that we may seek His forgiveness and be cleansed through the blood and righteousness of our Lord and Saviour Jesus Christ.",
        "part6": "",
        "part7": "And be not conformed to this world: but be ye transformed by the renewing of your mind, that ye may prove what is that good, and acceptable, and perfect, will of God. - Romans 12:2",
        "part8": []
    },
    "23 MARCH": {
        "part1": "Romans 2:9",
        "part2": "The terrifying end of sinners (2)",
        "part3": "VERSE 9",
        "part4": "Tribulation and anguish, upon every soul of man that doeth evil, of the Jew first, and also of the Gentile;",
        "part5": "Yesterday, we saw how God shows His displeasure towards those who are contentious and disobedient. Today's verse continues with the effect of God's indignation and wrath. To every person who does evil, regardless of whether they are Jew or Gentile, there will be tribulation and anguish as a consequence of their sinful deeds. To the unrepentant soul is reserved, on the final judgement day, God's displeasure and wrath, which will be terrible to bear. His soul will be tormented in hell, in eternal tribulation and anguish.\n\nDear reader, it is imperative that we reach out to our loved ones and friends with the Gospel of the Lord Jesus Christ, to bring them to a saving knowledge of what He had done on the cross for us. Tell them the terrifying end of sinners, how God's terrible punishment is reserved for them on judgment day, and how eternal conscious torment and suffering will be all a sinner experiences in hell for all eternity. Tell them how the Lord Jesus Christ, the sinless Lamb of God, died on the cross, and whosoever believes in Him shall have their sins forgiven and cleansed. They shall stand before God, accepted as His sons and daughters, made righteous through the atoning blood and imputed righteousness of the Lord Jesus Christ.\n\nSo let us work while it is still day, because Christ is coming back again to judge all according to their works.",
        "part6": "THOUGHT",
        "part7": "For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord. - Romans 6:23",
        "part8": [
            "ECCLESIASTES 8",
            "JOHN 13"
        ]
    },
    "24 MARCH": {
        "part1": "Romans 2:9",
        "part2": "The priority of judgment",
        "part3": "VERSE 9",
        "part4": "Tribulation and anguish, upon every soul of man that doeth evil, of the Jew first, and also of the Gentile;",
        "part5": "In an ironic twist, Paul uses the same phrase that maintained the priority of the Jew as the recipient of the good news of salvation [Romans 1:16] to assert the same priority in judgment. As the word of the promise has gone \"first\" to the Jew, so does punishment for failure to respond to that word go \"first\" to the Jew. In contrast with the Jews' tendency to regard their election as a guarantee they would be \"first\" in salvation and \"last\" in judgment, Paul insists their priority would be applied equally to both. God will hold those with greater revelation more accountable.\n\nIt may be that the Gospel promises have come to a number of us early on in our lives before others. We had the opportunity to hear the Gospel in Christian homes and in Christian circles. We had the freedom to sit under the preaching of the Word. It was indeed such a blessing and privilege to know the Lord Jesus Christ.\n\nHowever, in Luke 12:35-48, the parable reminds us that \"unto whomsoever much is given, of him shall be much required\". This is a reminder for us who are privileged and have the advantage of knowing God's will through His revealed Word. Do we simply ignore God's commands which we have often heard and been taught through the years? Do we not heed the call to do His kingdom work but instead occupy ourselves with the cares of the world?",
        "part6": "THOUGHT",
        "part7": "And that servant, which knew his lord's will, and prepared not himself, neither did according to his will, shall be beaten with many stripes. - Luke 12:47",
        "part8": [
            "ECCLESIASTES 9",
            "JOHN 14"
        ]
    },
    "25 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 10 expression in the believer's life. And before the",
        "part4": "But glory, honour, and peace, to every man that worketh good, to the Jew first, and also to the Gentile.",
        "part5": "We already know \"by the deeds of the law there shall no flesh be justified in His sight\" [Romans 3:20], and thus salvation cannot be bought by good works. Therefore, verse 10 must pertain to Christians who persistently engage in doing good. Christians, and only Christians, because of their union with the Lord Jesus Christ, are able to produce works acceptable to God in the judgment. This is possible as the fruit of faith comes to expression in the believer's life. And before the judgment seat of Christ, everyone will \"receive the things done in his body, according to that he hath done, whether it be good or bad\" [2 Corinthians 5:10].\n\nThe reward for such is glory, honour, and peace. It is marvellous that not only are we blessed with undeserving salvation, but God has also showered us with His blessing of glory, honour, and peace. The word \"peace\" should be interpreted in its broadest sense, as indicating salvation full and free, joyful and never-ending participation, with a renewed soul and body, in all the blessings of the new heaven and earth. This, of course, includes sweet fellowship with the Triune God and with all the redeemed.\n\nAlthough the priority in the disbursement of judgment has the same order of Jews followed by the Gentiles, note that the standard of judgment is the same. God will judge every person on the same basis - by works, not by religious heritage or national identity. God will not deal more generously with the Jew than with the Gentile.",
        "part6": "",
        "part7": "To Paul, a faith which did not lead to action was a travesty of faith; in fact, it was not faith at all. He would have said that the only way in which you can see people's faith at all is by their actions. Do your actions confirm your faith?",
        "part8": []
    },
    "26 MARCH": {
        "part1": "Romans 2:11",
        "part2": "No partiality with God",
        "part3": "VERSE 11",
        "part4": "For there is no respect of persons with God.",
        "part5": "We live in a world of inequity and inequality. Man must have the respect of persons in the intricate web of human affairs: the presidential train should cause the ordinary express to take the side track; the table of honour should seat the more distinguished guests. And there are human affairs where unfair and preferential treatment is shown in job promotions, favours, judicial rulings based on race, wealth, social status, beauty and not on merit. With regards to salvation, however, God looks with perfect equity on both Jew and Gentile; in other words, God has no favorites.\n\nGod offers Heaven equally to the thief on the cross and to the Pharisee. God offers salvation to the high and to the low. God offers salvation to the intellectual and to the ignoramus. And if we stop to analyse it, we can see that it is the only path open to pure justice. Suppose God made salvation contingent on the understanding of theology, then the intelligent would be saved and the ignorant lost. That would not be just. Suppose God made salvation contingent on material possession, then the wealthy would be saved and those born to poverty would be lost. That would not be just. God sees us all as lost sons of Adam.\n\nAs image-bearers of the Lord Jesus Christ, we too should emulate this impartiality in our daily lives. James tells us that ministering both to the rich and the poor is fulfilling the royal law of loving \"thy neighbour as thyself \" [James 2:8]. So, no matter who steps into the church, may we look upon them as lost souls who need to hear the good news of the Gospel. And once they are saved, no matter if they are rich or poor, may we be no respecter of persons but look upon them as children of God.",
        "part6": "PRAYER",
        "part7": "Dear God, thank You for being just and no respecter of persons. May You help me to demonstrate the same impartiality in my service and ministry for You. Amen.",
        "part8": [
            "ECCLESIASTES 11",
            "JOHN 16"
        ]
    },
    "27 MARCH": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 12 of God's law will still be judged by the civil law",
        "part4": "For as many as have sinned without law shall also perish without law: and as many as have sinned in the law shall be judged by the law.",
        "part5": "The apostle Paul addresses two groups of people here - those who have not heard the law (\"without law\"), and those who are given God's law. For the latter, it seems there is no excuse if they should wilfully violate God's law (having known it), but how about the former group? Can they claim to be blameless on the grounds of ignorance, since God's law was not explicitly declared to them?\n\nThe answer is no. Those who are not aware of God's law will still be judged by the civil law of society and more importantly, the law in their conscience. The civil law in society is given by the common grace of God. Every community has, to different extents, an awareness of what is universally right and wrong, which is aligned to God's standard and judgment. Besides that, when man without knowledge of God's law violates what by nature he was designed for or the common interest of his community, he will also be condemned by his conscience, because the moral law has been written in his heart.\n\nPaul is not talking about salvation by works here. Instead, he is highlighting man's depravity. Man, without the grace of God, is condemned. Led by his lust and pride, he will always fall short of God's requirement. A law-abiding citizen might take consolation in not having committed anything society could find fault with, but his conscience will find him to have fallen short, be it from sinful thoughts harboured deep within his heart, or unbecoming words and actions he has been able to conceal from man's eyes.",
        "part6": "",
        "part7": "For all have sinned, and come short of the glory of God. - Romans 3:23",
        "part8": []
    },
    "28 MARCH": {
        "part1": "Romans 2:12",
        "part2": "Judgment of the Jews",
        "part3": "VERSE 12",
        "part4": "For as many as have sinned without law shall also perish without law: and as many as have sinned in the law shall be judged by the law.",
        "part5": "Yesterday we considered those who do not know God's law. Now we examine those who are \"in the law\". The Jews in Paul's context were well- known for their piety. They deemed themselves the privileged ones who were given God's law, and thus knew God's direction for righteousness. Problem is, they thought they could meet God's standard in their own strength.\n\nIt is perhaps not surprising to see some confidently claiming they had kept all the commandments, thus deserving of eternal life [Luke 18:18-21]. We are reminded in the Lord's teaching that this presumptuousness, leading to self-righteousness, is misplaced and results in a worse spiritual condition [Luke 18:10-14]. The truth is no one can meet the standard of God's holy law.\n\nThe two groups of people mentioned yesterday and today are similar in some ways. Both sought justification against God's judgment in their own wisdom. Those not knowing God's law excuse themselves on the grounds of ignorance. Those who knew God's law justify themselves by their good works and observance of the law. Both were sadly mistaken. With or without the knowledge of the law, both have sinned, both will be judged, and both condemned.\n\nAll must realize they are hopeless without God's mercy and grace, \"that they should seek the Lord, if haply they might feel after Him, and find Him, though He be not far from every one of us\" [Acts 17:27]. The right understanding of our depravity is the first step to seeking God and being found by Him.",
        "part6": "THOUGHT",
        "part7": "And they that heard it said, Who then can be saved? And He said, The things which are impossible with men are possible with God. - Luke 18:26-27",
        "part8": [
            "SONG OF SOLOMON 1",
            "JOHN 18"
        ]
    },
    "29 MARCH": {
        "part1": "Romans 2:13",
        "part2": "Hearers of the law",
        "part3": "VERSE 13",
        "part4": "For not the hearers of the law are just before God, but the doers of the law shall be justified.",
        "part5": "The hearing of God's Word is the first step to believing, for \"faith cometh by hearing, and hearing by the word of God\" [Romans 10:17]. Yet Paul reminds us here it would be of no effect if we just stop at hearing. Many lives have been wasted because their reaction to God's Word was \"we will hear thee again of this matter\" [Acts 17:32]. Many opportunities were lost because of the lack of follow-through after the seeds of the Gospel were sown, in order that men would cleave to it and believe [Acts 17:34].\n\nThe Lord Jesus told a parable in Matthew 13. The Gospel seed sown into hearts of men could fall by the wayside and eaten by fowls; they could fall on the stony places and grow no roots; they could land among thorns and be choked by them. The world has a way of undoing the work of the sower, but the seed falling on prepared soil would bear the fruit of repentance.\n\nLet this be a reminder to those who believe. We often think hearing has to do only with non- believers. But our Lord also painted a picture of the victorious believer: \"But he that received seed into the good ground is he that heareth the word, and understandeth it; which also beareth fruit, and bringeth forth, some an hundredfold, some sixty, some thirty\" [Matthew 13:23].\n\nBelievers should be bearing the fruit of the Spirit, not to earn salvation, but as a result of it. \"Even so every good tree bringeth forth good fruit; but a corrupt tree bringeth forth evil fruit\" [Matthew 7:17].",
        "part6": "THOUGHT",
        "part7": "Who hath ears to hear, let him hear. - Matthew 13:9",
        "part8": [
            "SONG OF SOLOMON 2",
            "JOHN 19"
        ]
    },
    "30 MARCH": {
        "part1": "Romans 2:13",
        "part2": "Doers of the law",
        "part3": "VERSE 13",
        "part4": "For not the hearers of the law are just before God, but the doers of the law shall be justified.",
        "part5": "\"The doers of the law shall be justified.\" This again looks like a call for salvation by works. But Paul is gradually bringing his readers round to the Gospel; indeed no one is able to fulfil the law's requirement fully - be it through his genuine efforts or his hypocritical application of it.\n\nSome during Paul's time might truly be seeking justification through obedience. We are often cynical about the Pharisees' efforts, but there were those possessed of true zeal. The Lord Jesus once said, \"For I say unto you, That except your righteousness shall exceed the righteousness of the scribes and Pharisees, ye shall in no case enter into the kingdom of heaven\" [Matthew 5:20]. We could even say that Paul, before his conversion, was a sincere believer of God. Paul sincerely thought he could be justified by doing everything required of the law, and his persecution of Christians was a misguided understanding of God's truth.\n\nYet it is also true that there were hypocrites during Paul's time who knowing the demands of God's law, sought only to adhere to it superficially, deceiving both self and others. Upon these the Lord pronounced, \"Woe unto you, scribes and Pharisees, hypocrites! for ye are like unto whited sepulchres, which indeed appear beautiful outward, but are within full of dead men's bones, and of all uncleanness. Even so ye also outwardly appear righteous unto men, but within ye are full of hypocrisy and iniquity\" [Matthew 23:27-28].",
        "part6": "THOUGHT",
        "part7": "Every way of a man is right in his own eyes: but the LORD pondereth the hearts. - Proverbs 21:2",
        "part8": [
            "SONG OF SOLOMON 3",
            "JOHN 20"
        ]
    },
    "31 MARCH": {
        "part1": "Romans 2:13",
        "part2": "Who is justified?",
        "part3": "VERSE 13",
        "part4": "For not the hearers of the law are just before God, but the doers of the law shall be justified.",
        "part5": "In the reformed confessions, the purposes of God's law are summarized as three. Firstly, it acts as a curb to keep our sinful nature in check. Believer or not, God's law should stop a sinner in his track and prevent him from sinning further. God's law warns the sinner of the consequences of sinful actions. It is not by chance that the Ten Commandments are phrased in the strongest prohibitive tense in the original language.\n\nSecondly, it serves as a mirror to reflect the sinner's sinfulness against the light of God's perfection and point him toward the Saviour. \"For if any be a hearer of the Word, and not a doer, he is like unto a man beholding his natural face in a glass: For he beholdeth himself, and goeth his way, and straightway forgetteth what manner of man he was. But whoso looketh into the perfect law of liberty, and continueth therein, he being not a forgetful hearer, but a doer of the work, this man shall be blessed in his deed\" [James 1:23-25].\n\nThirdly, for believers, it is a guide to help them live a regenerated and God-pleasing life. Justified by the finished work of the Lord Jesus Christ, we do not rely on our own good works to be saved. Yet God's law gives us direction in our sanctification. It tells us what God loves and hates. With each passing day, we can therefore seek to align our will with God's, \"confident of this very thing, that He which hath begun a good work in you will perform it until the day of Jesus Christ\" [Philippians 1:6].",
        "part6": "THOUGHT",
        "part7": "But be ye doers of the Word, and not hearers only, deceiving your own selves. - James 1:22",
        "part8": [
            "SONG OF SOLOMON 4",
            "JOHN 21"
        ]
    }
}