{
    "1 DECEMBER": {
        "part1": "2 Samuel 22:27b-28",
        "part2": "God's justice (2)",
        "part3": "VERSE 28",
        "part4": "And the afflicted people Thou wilt save: but Thine eyes are upon the haughty, that Thou mayest bring them down.",
        "part5": "Verse 28 is a clear warning for the haughty. He is watching them, and He will bring them down. There are numerous verses in the Bible which carry the same warning. Isaiah 13:11b is one of them. God says, \"I will cause the arrogancy of the proud to cease, and will lay low the haughtiness of the terrible.\"\n\nIf proud and wicked men try to devise evil schemes against the innocent, God will outwit them and thwart their plans [v. 27b]. There are numerous examples in the Bible. The Book of Esther provides a classic example of how God judged proud and evil Haman. Haman had become one of King Xerxes' chief advisers, but power went to his head. When everyone began to kneel and pay him homage, he noticed that Mordecai, Esther's adoptive father, did not. Mordecai, being a Jew, knew God's command about bowing to anyone but the Lord. This infuriated arrogant Haman [Esther 3:5]. He went to the king devising an evil plan that would destroy Mordecai and the entire Jewish race. But through a series of 'coincidences' God rescued the Jews and Haman was hung on the gallows that he had prepared for Mordecai.\n\nWe live in an evil and perverse generation where pride is taught as a virtue and unscrupulous methods often lauded as cleverness. May those who name the name of the Lord Jesus Christ never fall prey to such insidious philosophies. If we seek to be happy, to be led by the Spirit, to avoid destruction, we need to cultivate meekness and humility.",
        "part6": "THOUGHT",
        "part7": "Pride is the ground in which all the other sins grow, and the parent from which all the other sins come. - William Barclay",
        "part8": [
            "1 CHRONICLES 26-27",
            "2 PETER 3"
        ]
    },
    "2 DECEMBER": {
        "part1": "2 Samuel 22:29",
        "part2": "God's light",
        "part3": "VERSE 29",
        "part4": "For Thou art my lamp, O LORD: and the LORD will lighten my darkness.",
        "part5": "David testified that the Lord was his lamp. He gave light to enlighten David's understanding so that he knew what to do and which way to turn in order to be victorious in life. The Lord also gave David the light of brilliant strategy when he faced enemies who confronted him throughout his life. In Psalm 27:1, David similarly testified: \"The LORD is my light and my salvation; whom shall I fear? the LORD is the strength of my life; of whom shall I be afraid?\" God had lifted him out of a condition of depression and contempt into one of glory and honour.\n\nAs Christians, we are privileged to have for our Master, the Lord Jesus Christ who is the light of the world. We possess the Holy Spirit who illuminates our understanding. God has called us out of darkness into His marvellous light that we may show forth His praises [1 Peter 2:9]. Paul cautions us to \"walk as children of light\" [Ephesians 5:8]. In other words, we are to eschew evil and glorify God in our lives [Matthew 5:16].\n\nWe live in dark and perilous times. There is danger everywhere around us. Every day, we hear of people including Christians, who fall into diverse temptations and \"pierced themselves through with many sorrows\" [1 Timothy 6:10]. But thanks be to God, who has given us His precious Word. This Word is a lamp unto our feet - directing our footsteps, and light unto our path - showing us the way to tread [Psalm 119:105]. But we need to study it, know it and wield it effectively in our fight against sin.",
        "part6": "THOUGHT",
        "part7": "It may be a day of darkness with us, but the Lord is our everlasting light. - James Smith, Daily Remembrancer",
        "part8": [
            "1 CHRONICLES 28",
            "1 JOHN 1"
        ]
    },
    "3 DECEMBER": {
        "part1": "2 Samuel 22:30",
        "part2": "God's power",
        "part3": "VERSE 30",
        "part4": "For by Thee I have run through a troop: by my God have I leaped over a wall.",
        "part5": "The Lord gave David power to conquer and prevail against enemies who confronted him. The Lord also gave him the power to scale the walls of opposition and adversity - the problems, difficulties, and barriers thrown up against him. While Saul is portrayed as a man of the flesh who tries in his own right to please God but fails miserably, David is the picture of the man after God's own heart - a follower in whom the Spirit of God dwells, sensitive to the instruction of the Spirit, who is taught to walk in the Holy Spirit.\n\nAs we see David being brought by God to the place of ruling his kingdom, we will see how the Holy Spirit is working to bring us to the place of ruling our lives by the Lord Jesus Christ. As His followers, we need His strength to fight the battles of life. The Apostle Paul encouraged us to be strong in the Lord and in the power of His might [Ephesians 6:10]. God has a resource of power (His might) that He makes available to us by faith. We are unable to be strong in our own strength, but we are strong only in His.\n\nThe Lord Jesus Christ is the vine, and we are the branches. As the branch cannot bear fruit of itself, except it abide in the vine, we cannot achieve anything of spiritual value except we abide in Him and let His Word and His spirit abide in us [John 15:4-7].",
        "part6": "THOUGHT",
        "part7": "Whatever God calls us to do, we can do with His help; otherwise, He would never have called us. - Warren W. Wiersbe, On Being a Servant of God",
        "part8": [
            "1 CHRONICLES 29",
            "1 JOHN 2"
        ]
    },
    "4 DECEMBER": {
        "part1": "2 Samuel 22:31",
        "part2": "God's way",
        "part3": "VERSE 31",
        "part4": "As for God, His way is perfect; the word of the LORD is tried: He is a buckler to all them that trust in Him.",
        "part5": "\"I did it my way\" is a line from a popular song. Proud man always want to do things his own way, but that often leads to disaster. It is true of our world today. Just look at the state we are in - fighting, unrest, pollution, poverty and corruption everywhere. It was also true for Israel. One of the lowest periods in Israel's history was the era of the Judges; and the cause is well-known - \"every man did that which was right in his own eyes\" [Judges 21:25].\n\nThe golden age of Israel, a period when she enjoyed peace with the surrounding nations, her borders stretching from the Mediterranean to the Euphrates, was during the reign of King David about the time when he penned this psalm in 2 Samuel 22. What was David's secret? He faithfully followed God's way. Whenever he led his army against Israel's enemies, he would first \"enquired of the LORD\" [2 Samuel 5:19, 23] and the result was \"And David went on, and grew great, and the LORD God of hosts was with him\" [2 Samuel 5:10].\n\nGod's way is the perfect way. It was true for Israel then and it is true for our church and family now. It was true for David and it is true for you and me. The oft-quoted advice of Proverbs 3:5- 6 is worth remembering; \"Trust in the LORD with all thine heart; and lean not unto thine own understanding. In all thy ways acknowledge Him, and He shall direct thy paths\".",
        "part6": "THOUGHT",
        "part7": "Stumbling by sight has always been easier than walking by faith. - Michael Barrett, God's Unfailing Purpose",
        "part8": [
            "2 CHRONICLES 1-2",
            "1 JOHN 3"
        ]
    },
    "5 DECEMBER": {
        "part1": "2 Samuel 22:32-33",
        "part2": "God's protection",
        "part3": "VERSE 32",
        "part4": "For who is God, save the LORD? and who is a rock, save our God?",
        "part5": "In verse 32, David reminds us of two important truths about the God we worship. Firstly, only Jehovah is the LORD, the only true living God. There is none beside Him, nor any like Him. There are many so-called \"gods\", but they are merely nominal deities, who are not by nature gods but fictitious ones, idols of pagans made of gold, silver, brass, wood and stone. Secondly, only our God is able to protect and save. Like other inspired writers of the Old Testament such as Moses and Isaiah, David refers to God as the Rock, a symbol of power, strength, protection and stability.\n\nDavid had experienced first-hand God's protection. From the lowest ebbs of life when he was fleeing from Saul to the jubilant times when he was victorious over Israel's enemies, \"the LORD preserved David whithersoever he went\" [2 Samuel 8:14b]. Likewise, God protected His servants like Joseph, Mordecai, Daniel and his three friends even as they were far from home and the temple, living under pagan kings and surrounded by idol worshippers.\n\nIn these perilous times we are living in, as the signs of our Lord's second coming increase and converge, God's people need more than ever the protection of this Rock. We need spiritual protection from false teachers and deceivers, and the moral decay around us. We need physical protection from pestilences, wars and natural disasters. In times like these, we too find comfort in David's declaration; \"Who is a rock, save our God?\"",
        "part6": "THOUGHT",
        "part7": "On Christ the solid rock I stand. All other ground is sinking sand; all other ground is sinking sand.",
        "part8": [
            "2 CHRONICLES 3-4",
            "1 JOHN 4"
        ]
    },
    "6 DECEMBER": {
        "part1": "2 Samuel 22:34",
        "part2": "God's provision (1)",
        "part3": "VERSE 34",
        "part4": "He maketh my feet like hinds' feet: and setteth me upon my high places.",
        "part5": "David declared his praise for his God who constantly answered his prayers. As one who frequently engaged in war and faced strife in his life, David was blessed by God with speed to flee from as well as pursue his foes.\n\nDavid praised God for giving him feet like the hinds' (deer) which are agile, swift and sure-footed even on rocky terrain. The deer skips from place to place with agility, seeming never to lose their footing. They bound unimpeded over the mountain tops. David acknowledged that God granted him the advantage by setting him on the high-ground in battle. These high places were the mountain strongholds, even Mount Zion, the occupation of which accorded him control of the land. The Lord endowed David with much power to conquer his foes.\n\nDavid recognised and rejoiced in his God who provides His children with security and keeps them from falling. The Lord enabled David to walk safely along the difficult and dangerous mountain peaks of trials and temptations. David's praise resembled the praise of Moses who sings that God \"made him ride on the high places of the earth\" [Deuteronomy 32:13] and the prophet Habakkuk who testified that the \"LORD God is my strength, and He will make my feet like hinds' feet\" [Habakkuk 3:19]. David recognised God's hand in all the advantages he had in life and praised God joyfully for them.",
        "part6": "PRAYER",
        "part7": "Dear Lord, let me never forget that everything I have comes from You. Help me to continually glorify You with everything You have blessed me with. In Jesus' name, Amen.",
        "part8": [
            "2 CHRONICLES 5",
            "1 JOHN 5"
        ]
    },
    "7 DECEMBER": {
        "part1": "2 Samuel 22:35",
        "part2": "God's provision (2)",
        "part3": "VERSE 35",
        "part4": "He teacheth my hands to war; so that a bow of steel is broken by mine arms.",
        "part5": "David beautifully praised God for delivering him from great danger and providing him with remarkable preservation.\n\nThe ability to bend a steel bow is proof of incredible strength. David praised God for the advantages of physical strength and energy. While David acknowledged God's gifts to him, he also acknowledged that it was God who taught him, saved him and gave him victory in battle.\n\nNotably, David did not blame God for the exacting wars, conflicts and strife in his life. Rather, David thanked God for preparing his hands for his battles. David acknowledged that wars would be a part of his life. But he was conscious of God's continual hand throughout his life and in the constant preparation he underwent for the trials before him. When the battle came, God's divine enablement allowed David to overcome strong foes.\n\nWe may face numerous difficulties in life and be earnestly wishing for an easier time. Instead of focussing on his troubles, David proclaimed that the Lord strengthened him. Like David, let us focus less on the seemingly insurmountable trials before us and remember we have a God who delights in preparing us to face the challenges He has set for us. We can do all things through our Lord Jesus Christ who strengthens us [Philippians 4:13].",
        "part6": "THOUGHT",
        "part7": "While there may be trials and sore temptations before us, God grants us the skill and strength we require for each battle. If God is for us, truly who can be against us?",
        "part8": [
            "2 CHRONICLES 6",
            "2 JOHN"
        ]
    },
    "8 DECEMBER": {
        "part1": "2 Samuel 22:36-37",
        "part2": "God's provision (3)",
        "part3": "VERSE 36",
        "part4": "Thou hast also given me the shield of Thy salvation: and Thy gentleness hath made me great.",
        "part5": "David was able to look back on the years of blessings and divine provision which gave him victories over his enemies and established his throne. The LORD gave David His shield of salvation. The shield speaks of protection. God provided David eternal deliverance or salvation. He also bestowed strength, stability and skill which made David swift to pursue and subdue the bitter enemies of God. David praised the character and provision of God. He is a shield too for all His people as we see in Genesis 15:1 and Psalm 84:11.\n\nDavid remembered what he had been - an unknown shepherd boy. All the greatness of his present exalted position as Israel's king was owed to God's favour. He acknowledged it was divine goodness and gentleness that made him the great king, not because of any merit of his own.\n\nGod had preserved and protected David. When Saul viciously sought David's life, he became a fugitive hiding in the mountains. There were no easy roads there he could travel on. As David scaled the pathways up the mountain peaks of life (seeking to conquer the trials and evade his enemies), the Lord gave him a wide path and kept his feet from slipping. It was as if God was there right in front of David, making a clear escape route for him to follow easily. \"Thou hast enlarged my steps under me; so that my feet did not slip\" [v. 37]. So, God too enables His people to walk safely. He is with us always.",
        "part6": "THOUGHT",
        "part7": "God, when called upon for help, provides the believers with a broad space for free motion, removing obstructions and stumbling-blocks out of the way.",
        "part8": [
            "2 CHRONICLES 7",
            "3 JOHN"
        ]
    },
    "9 DECEMBER": {
        "part1": "2 Samuel 22:38-39",
        "part2": "David's complete victory",
        "part3": "VERSE 38",
        "part4": "I have pursued mine enemies, and destroyed them; and turned not again until I had consumed them.",
        "part5": "In verses 38-39, David speaks in the first person about what 'I' have been able to accomplish: total destruction of his enemies. God defeats his enemies in different ways. Here He enabled David to chase and conquer: David pursued his enemies and did not give up till they were utterly consumed. David likely is recalling the events recorded in 1 Samuel 30.\n\nThere, during David's absence, an Amalekite raiding party had sacked and burned Ziklag,. They carried away David's family and all the inhabitants. David took counsel from God. In His providence, they found a sick Egyptian slave abandoned by his Amalekite master, who led the Israelites to the Amalekite's encampment. There David's men routed them and recovered all their families and properties. God provides believers with defensive protection and offensive power. We should expect victory in our Christian lives too, instead of living lives of defeat and frustration [Romans 8:31-39].\n\nShatter and subdue: \"And I have consumed them, and wounded them, that they could not arise: yea, they are fallen under my feet\" [v. 39]. This was true not only of the Amalekites, but of all whom David engaged in battle. They were either slain or subjugated like the Philistines, Moabites, Syrians and Edomites [2 Samuel 8]. David spoke of the complete destruction of his enemies in verses 38, 39 and 43. He praised the LORD for his strength and for the victories he had wrought.\n\nDavid's victories remind us of a greater victory still to come. At the end of the Tribulation, our Lord Jesus Christ will judge and destroy all who are His enemies. For we, who are His elect, victory is assured. Praise the LORD, we are bound for glory land.",
        "part6": "PRAYER",
        "part7": "Lord, You have given me the desire to serve You. Please give me Your strength to battle and be victorious over the deceptions of Satan.",
        "part8": [
            "2 CHRONICLES 8",
            "JUDE"
        ]
    },
    "10 DECEMBER": {
        "part1": "2 Samuel 22:40-41",
        "part2": "God's doing",
        "part3": "VERSE 40",
        "part4": "For Thou hast girded me with strength to battle: them that rose up against me hast Thou subdued under me.",
        "part5": "As David looked back at almost 70 years of life, he recognized how much God had done on his behalf. As a young shepherd, he faced a bear and a lion and slew them both. After he was anointed, he slew the Philistine Goliath to defend the Lord's honour [1 Samuel 17].\n\nLater, God delivered David from the constant attacks of Saul, and from Absalom's rebellion. His rise to power and prominence was in God's sovereign hand. David's lust led him to commit gross adultery and murder. His penitence spared him personal death. He praised God as his rescuer, refuge, his source of strength and victory. He knew it was God who preserved his life. He was restored to a vibrant relationship with the LORD. If a man like David can give God the glory, certainly we should as well.\n\nDavid was a man of war throughout his life [1 Chronicles 22:8]. With the LORD's strength, he had killed many of Israel's (that is God's) enemies. He defeated Israel's arch-enemy, the Philistines [2 Samuel 5:17-25]. Their defeat and the Mediterranean Sea secured their western front. With the Moabites subdued, the desert provided a safe border to the east. In the north, David defeated Hadadezar and the Aramaeans at Damascus, and in the south Edom and Hamath were subdued [2 Samuel 8:6, 14; 1 Chronicles 18]. In these regions, garrisons were established for defence.\n\nThis key statement is repeated twice: \"And the LORD preserved David whithersoever he went\" [2 Samuel 8:6, 14]. David ruled a mighty Israel with God's power and justice. God made David who he was. His victories were ultimately God's doing. So David rightly praised the LORD for every deliverance and every benefit he had experienced through his entire life.",
        "part6": "PRAYER",
        "part7": "Lord, let me look always to Thee, the mighty Fortress.",
        "part8": [
            "2 CHRONICLES 9",
            "REVELATION 1"
        ]
    },
    "11 DECEMBER": {
        "part1": "2 Samuel 22:42-43",
        "part2": "Enemy's total defeat",
        "part3": "VERSE 43",
        "part4": "Then did I beat them as small as the dust of the earth, I did stamp them as the mire of the street, and did spread them abroad.",
        "part5": "David was troubled by a myriad of enemies both external (the Philistines, the Moabites, the Edomites) and internal (King Saul). There were many times when his life was in jeopardy and only by God's grace, was he able to escape. Now, nearing the end of his life, David testified how God was faithful to him and helped him not only to escape death on many occasions, but also to have many victories over his foes. This was despite the fact that some of his adversaries were much stronger and more powerful like Goliath, the Philistines and even King Saul.\n\nAs such, when we read of David's victories over his enemies, we should realize this was a result of the continual and constant relationship he had with God. Complete triumph over God's enemies is something equally available to us in this day and age. These may not be physical enemies threatening our lives, but unseen spiritual foes tempting us to sin against God, and undermining our faith and confidence in Him. The Bible promises that just as David won a complete victory over his enemies, we too can have victory over the spiritual foes as we nurture our relationship with our Lord Jesus Christ [Romans 8:34; 2 Corinthians 10:4; Colossians 2:12- 15].\n\nLet us therefore not be discouraged when we recognise strongholds of sin in our life. Instead, turn to God in obedience and faith, and let the battle be His, and the victory and the glory as well.",
        "part6": "THOUGHT",
        "part7": "What shall we then say to these things? If God be for us, who can be against us? - Romans 8:31",
        "part8": [
            "2 CHRONICLES 10",
            "REVELATION 2"
        ]
    },
    "12 DECEMBER": {
        "part1": "2 Samuel 22:44-46",
        "part2": "Blessings of triumph",
        "part3": "VERSE 44",
        "part4": "Thou also hast delivered me from the strivings of my people, Thou hast kept me to be head of the heathen: a people which I knew not shall serve me.",
        "part5": "Today, we meditate on the fact that David's triumph over his enemies was not just in the battlefield. David enjoyed much political success. From being king in Hebron, David gained the love and respect of all Israel and became king over a unified kingdom. As he continued winning victories against the surrounding nations, he subdued them and built garrisons therein [2 Samuel 8]. He was admired and gained favour even with the Gentile nations thus making Israel to grow in prominence and enter its golden era.\n\nThere are at least two other instances in the Bible where God's people gain favour and respect even from the world. As both Samuel [1 Samuel 2:26] and the Lord Jesus Christ [Luke 2:52] grew in wisdom and stature, and in their relationship with God, we see that they were in favour with men. It is biblically attested that the world will hate Christians [1 John 3:13]. Yet despite the natural hatred which the world bears, God allows the faithful Christian to thrive in adverse circumstances so that the world cannot help but grudgingly acknowledge their successes and deeds. Like David, we may be surrounded by people or by events that constantly discourage and tempt us to sin but as we persevere in righteousness, we can have peace because our Lord has overcome the world [John 16:33].\n\nLet us therefore hold fast to our Lord Jesus Christ and live in a manner acceptable in His sight. Our uncompromising testimony in the face of adversity will give Him glory.",
        "part6": "THOUGHT",
        "part7": "These things I have spoken unto you, that in Me ye might have peace. In the world ye shall have tribulation: but be of good cheer; I have overcome the world. - John 16:33",
        "part8": [
            "2 CHRONICLES 11-12",
            "REVELATION 3"
        ]
    },
    "13 DECEMBER": {
        "part1": "2 Samuel 22:47-49",
        "part2": "Chorus of blessing (1)",
        "part3": "VERSE 48",
        "part4": "It is God that avengeth me, and that bringeth down the people under me.",
        "part5": "We often worry about our relationship with God when we are going through persecution or hard times. However, let us consider that perhaps it is during life's good times that our relationship with Him may be even more threatened. We may be tempted to think the smooth-sailing state of our circumstances came about through our own hard work. David prevents himself from taking such credit by bringing to mind the fact that God exists, and He is the One who helped bring about his present good circumstances.\n\nThis is a good example to emulate. Besides keeping us humble and God-focused, intentionally remembering God's goodness to us in the past also strengthens and prepares us for adverse circumstances in the future. We will benefit from taking time to list the many ways God has blessed us, and praise Him for each item with thanksgiving. First, David acknowledged the living God as his source of support and salvation. Next, David praised God for avenging the wrongs done to him. He lists specifically what God had done - bringing many people under David's subjection, delivering David from his enemies, keeping him safe and out of harm's reach, exalting him above those who rose up against him, and granting him paths of escape from violent men and situations.\n\nAim to be like David. Practise counting your blessings.",
        "part6": "THOUGHT",
        "part7": "Count your blessings, name them one by one ... And it will surprise you what the Lord hath done. - Johnson Oatman Jr.",
        "part8": [
            "2 CHRONICLES 13",
            "REVELATION 4"
        ]
    },
    "14 DECEMBER": {
        "part1": "2 Samuel 22:50-51",
        "part2": "Chorus of blessing (2)",
        "part3": "VERSE 50",
        "part4": "Therefore I will give thanks unto Thee, O LORD, among the heathen, and I will sing praises unto Thy name.",
        "part5": "Yesterday we saw David recalling the many ways God had blessed him. By counting his blessings, David reminded himself of his dependence on God, gave Him the glory, and cultivated his personal relationship with Him.\n\nToday, let us also consider how counting our blessings can help us to be a good testimony for God's glory. Now that David was the paramount public figure in the kingdom, respected by both Israelites and the surrounding nations, he boldly declared God's goodness in a public setting. Even \"among the heathen\", David asserted he would continue giving thanks to the Lord. Unlike many Christians today who keep quiet about their faith when they are in the public eye, David used those situations to continue giving God the glory, despite the possibility his testimony might portray him as a weak man, one who was solely dependent on God!\n\nPerhaps we may be uncomfortable displaying such a \"weak\" image through constantly thanking God for all the things He has done for us. We may feel that the world will laugh at our complete reliance on Him. Let us examine if it is a matter of our pride and self-love. Let us also remember not to deceive ourselves. We are in fact human and weak. Without God's grace, it would not have been possible to accomplish any work we do.\n\nSo let us direct all glory to Him and save none for ourselves.",
        "part6": "THOUGHT",
        "part7": "If we are truthful and humble, we will not hesitate to acknowledge God's work in our lives. \"I am the vine, ye are the branches: He that abideth in Me, and I in him, the same bringeth forth much fruit: for without Me ye can do nothing.\" [John 15:5]",
        "part8": [
            "2 CHRONICLES 14-15",
            "REVELATION 5"
        ]
    },
    "15 DECEMBER": {
        "part1": "2 Samuel 23:1",
        "part2": "Who was David?",
        "part3": "VERSE 1",
        "part4": "Now these be the last words of David. David the son of Jesse said, and the man who was raised up on high, the anointed of the God of Jacob, and the sweet psalmist of Israel, said...",
        "part5": "As he neared the end of his life, David made four statements about himself in the third person. If there is any question about who David was, the answer would be that he was the son of Jesse; he was raised up on high; he was the anointed of God; and he was the sweet psalmist of Israel.\n\nThe first statement points to his humble origin. David was the youngest of Jesse's seven sons from the nondescript town of Bethlehem. In other words, David was a nobody. Second, David was \"raised up on high\", meaning his accomplishments were not the result of his own abilities. From a shepherd David became king, but it was God who chose him and \"took him from the sheepfolds ... to feed Jacob his people, and Israel his inheritance\" [Psalm 78:70-71]. It was God who raised David up.\n\nThird, David was \"the anointed of the God of Jacob\". David was referring to the time when as a teenager he was anointed by Samuel to be king [1 Samuel 16:13]. The word \"messiah\" is a transliteration of the Hebrew word \"anointed\", meaning David was the man on whom God set His heart for His own purpose. David's greatness did not come from what he had done; rather, David was great because God had called and laid His purpose on him.\n\nFourth, David was \"the sweet psalmist of Israel\", meaning he was the composer of the psalms sung in Israel. And in his psalms, David points us beyond himself to his Greater Son, our Lord Jesus Christ.\n\nDavid's last words were not for self- aggrandizement. Rather, they are a testimony of what God had done in him, and what God can do in us when we \"yield (ourselves) unto God ... and (our) members as instruments of righteousness unto God\" [Romans 6:13b].",
        "part6": "THOUGHT",
        "part7": "What you would put on the epitaph of your gravestone is how you should live your life.",
        "part8": [
            "2 CHRONICLES 16-17",
            "REVELATION 6"
        ]
    },
    "16 DECEMBER": {
        "part1": "2 Samuel 23:1-2",
        "part2": "David as prophet",
        "part3": "VERSE 1",
        "part4": "Now these be the last words of David. David the son of Jesse said, and the man who was raised up on high, the anointed of the God of Jacob, and the sweet psalmist of Israel, said...",
        "part5": "These are the final words of David spoken under the inspiration of God's Spirit. By God's grace, he had been raised from low estate to become king. His description as being \"the sweet psalmist of Israel\" (literally \"pleasant in Israel's songs of praise\") is indeed deserved as he transcends the role of ruler to be used by God to teach His people through the Psalms he wrote.\n\n\"The Spirit of the Lord spake by me, and His word was in my tongue\" [v. 2]. As in the Psalms, the words recorded here are divinely inspired with David speaking as a prophet. In these verses it will be seen that David's final words point us in the same direction as the rest of David's reign - the eternal kingdom of the Lord Jesus Christ. As we consider and meditate on His eternal kingdom, it will help us develop a right expectation of things that count for eternity and hold greater importance in this life.\n\n\"While we look not at the things which are seen, but at the things which are not seen: for the things which are seen are temporal; but the things which are not seen are eternal\" [2 Corinthians 4:18]. This constant reminder will keep our hearts and minds oriented toward serving our Lord Jesus Christ in everything. Let us meditate on the eternal Kingdom of God this day, remembering that all will not be set right until our Lord returns again. Meanwhile, He strengthens us to press on.",
        "part6": "PRAYER",
        "part7": "Father in heaven, may our hearts be set on the things which count for eternity. Grant us faith and discernment for Your truth. In Jesus' name, Amen.",
        "part8": [
            "2 CHRONICLES 18",
            "REVELATION 7"
        ]
    },
    "17 DECEMBER": {
        "part1": "2 Samuel 23:2-3",
        "part2": "Process of communication",
        "part3": "VERSE 3",
        "part4": "The God of Israel said, the Rock of Israel spake to me, He that ruleth over men must be just, ruling in the fear of God.",
        "part5": "The inspired words of prophecy recorded by David was the Spirit of God speaking through him. He and other holy men of God spoke and wrote as they were moved by the Holy Ghost - \"Knowing this first, that no prophecy of the scripture is of any private interpretation. For the prophecy came not in old time by the will of man: but holy men of God spake as they were moved by the Holy Ghost\" [2 Peter 1:20-21].\n\nVerses 2 and 3 stamp the prophecy with a fourfold mark of divine inspiration:",
        "part6": "THOUGHT",
        "part7": "1. The Spirit of the Lord spake by me. 2. His word was in my tongue. 3. The God of Israel said. 4. The Rock of Israel spake to me.  This is a such a remarkable introduction as we look forward to what will be declared. We note that it is the 'Rock of Israel' who gives this declaration. He is the strength, defense and protector of His chosen people, Israel. He is our protector and defender too because in our Lord Jesus Christ, we are also God's chosen. Knowing the origin of these words must surely give us great assurance and comfort. They hold true, and stand fast in might and authority because its foundation is the Rock. There is perfect reliability on what God has declared.     The works of His hands are verity and judgment; all His commandments are sure. - Psalm 111:7",
        "part8": [
            "2 CHRONICLES 19-20",
            "REVELATION 8"
        ]
    },
    "18 DECEMBER": {
        "part1": "2 Samuel 23:3b-4",
        "part2": "David as ruler",
        "part3": "VERSE 4",
        "part4": "And he shall be as the light of the morning, when the sun riseth, even a morning without clouds; as the tender grass springing out of the earth by clear shining after rain.",
        "part5": "At the outset, we consider the subject of the prophecy - an earthly ruler over men. David describes the ideals of a king, \"He that ruleth over men must be just, ruling in the fear of God\" [v. 3]. A king should rule his subjects with justice. He is controlled and guided by the fear of God. Despite David's notable shortcomings, he was one who led Israel in accordance with God's justice. Likewise, we must thank God if we have earthly rulers who fear the Lord, who wield their authority in truth and righteousness.\n\nThe result of such benevolent leadership will be the blessings described picturesquely here as the life-giving sun's rays on a cloudless morning and the lush green fields springing up from the abundant sunshine and rain.\n\nBeyond this earthly monarch, we are assured of a greater Ruler who is not merely a ruler over a nation but a ruler over all men. This ruler's authority is not limited by earthly boundaries but prevails over all His creatures and creation. The distinct attribute of this Ruler is 'righteousness'. David's prophecy points to none other than the Messiah, our Lord Jesus Christ, the King of kings and Lord of lords. Through His righteousness, the just and holy King has redeemed us. Unlike the temporal blessings earthly rulers promise, our Lord Jesus Christ is the eternal light of the morning, and as His people we spring forth with great eternal joy. Question is: Do you belong to this Kingdom?",
        "part6": "PRAYER",
        "part7": "Father in heaven, we look forward to the return of our Messiah. While He tarries in His return, may we be found faithful. In Jesus' name, Amen.",
        "part8": [
            "2 CHRONICLES 21",
            "REVELATION 9"
        ]
    },
    "19 DECEMBER": {
        "part1": "2 Samuel 23:5",
        "part2": "The Davidic Covenant",
        "part3": "VERSE 5",
        "part4": "Although my house be not so with God; yet He hath made with me an everlasting covenant, ordered in all things, and sure: for this is all my salvation, and all my desire, although He make it not to grow.",
        "part5": "Looking back at his life, David had his regrets. There were times when he and his house had failed God's calling to be wise and godly. Yet David knew one important truth - had it not been for God's covenantal love, he and his descendants would be lost forever.\n\nDavid points us here to the covenant which God made with him in 2 Samuel 7:13-16, usually referred to as the Davidic covenant. God promised to establish the throne of his house forever. Indeed, there will be times when his descendants commit great iniquity, but God has promised that He will, after a period of right chastening, shower mercy upon them. God will preserve the Davidic line and this is the hope of the dying David - a steadfast hope in God Who orders the steps of a good man and upholds him with His hands [Psalm 37:23-24], Who is his salvation [Psalm 27:1] and his only desire [Psalm 27:4].\n\nYet David did not possess the full revelation of God's redemption plan. The reason the Davidic line was preserved was because the Messiah would be born to this house. That is why even when the kings of Judah after David were faithless, God remained faithful. He is faithful to His own covenant and will to establish the house of David.\n\nBelievers in the Lord Jesus Christ today inherit the blessings of the Davidic Covenant. Those who believe in the Lord Jesus are adopted into His kingdom to be co-heirs with Him, inheriting everlasting life and every spiritual blessing. Today, we have a better hope than David, so all the more we should echo David's praises of God's faithfulness.",
        "part6": "THOUGHT",
        "part7": "Thy mercy, O LORD, is in the heavens; and Thy faithfulness reacheth unto the clouds. - Psalm 36:5",
        "part8": [
            "2 CHRONICLES 22-23",
            "REVELATION 10"
        ]
    },
    "20 DECEMBER": {
        "part1": "2 Samuel 23:6-7",
        "part2": "Condemnation of the wicked",
        "part3": "VERSES 6-7",
        "part4": "But the sons of Belial shall be all of them as thorns thrust away, because they cannot be taken with hands: But the man that shall touch them must be fenced with iron and the staff of a spear; and they shall be utterly burned with fire in the same place.",
        "part5": "This section on David's last words concludes with a description of what will happen to the sons of Belial - worthless and wicked people who deny God. Like thorns which prick and injure those touching them, these unworthy people will be cast away. Yet they will put up a last struggle before they suffer their fate, that is to be burned with fire and destroyed in their place of mischief. Those who handle them must be well-protected.\n\nThis description reminds us of what will happen at the Great White Throne Judgement [Revelation 20:15]. The contrast in destinies between the saints and the sinners, found throughout the Bible, is again made clear. It serves both as a clear warning to the wicked, and an encouragement to the one who is wondering why the wicked seem to triumph, and the righteous suffer wrong. Indeed, the judgement of God, like His love for us, sings of His glory.\n\nThank God for His grace and mercy, for He has saved us out of darkness into His marvellous light. He has not abandoned us in our depravity but took away our stony heart and replaced it with a heart of flesh. Let us therefore eschew the wicked ways, for \"Blessed is the man that walketh not in the counsel of the ungodly, nor standeth in the way of sinners, nor sitteth in the seat of the scornful. But his delight is in the law of the LORD; and in his law doth he meditate day and night. And he shall be like a tree planted by the rivers of water, that bringeth forth his fruit in his season; his leaf also shall not wither; and whatsoever he doeth shall prosper\" [Psalm 1:1-3].",
        "part6": "THOUGHT",
        "part7": "Be ye not unequally yoked together with unbelievers: for what fellowship hath righteousness with unrighteousness? and what communion hath light with darkness? And what concord hath Christ with Belial? or what part hath he that believeth with an infidel? - 2 Corinthians 6:14-15",
        "part8": [
            "2 CHRONICLES 24",
            "REVELATION 11"
        ]
    },
    "21 DECEMBER": {
        "part1": "2 Samuel 23:8-12",
        "part2": "Three mighty men",
        "part3": "VERSES 8a, 12b",
        "part4": "These be the names of the mighty men whom David had: ... and the LORD wrought a great victory.",
        "part5": "From verse 8, David listed the \"mighty men\" and their courageous deeds. These were the warriors who stood alongside David through good times and bad. Three names were mentioned - Adino the Eznite, Eleazar the son of Dodo the Ahohite, and Shammah the son of Agee the Hararite. These were men of great courage and ability. These were men who were committed not just to David but also to God's work. They did not abandon David when he was old; neither did they switch their loyalties when he was weak. These men stood together with David for the LORD.\n\nDavid had his mighty men. Paul had his co- labourers. In his epistles, Paul named his co- labourers - Aquila and Priscilla who for the work of the Gospel \"laid down their own necks\" [Romans 16:4]; Epaphroditus who ministered to Paul in prison [Philippians 2:25]. The work of the Gospel is too heavy for one person to carry. In his last letter, Paul lamented he was abandoned; no one stood with him; only Luke was with him, and he longed for the company of Mark [2 Timothy 4:11, 16]. Yes, the Lord Jesus stood with Paul and strengthened him [2 Timothy 4:16-17], but we should not discount the value of the fellowship of saints.\n\nSolomon wrote: \"Two are better than one ... if two lie together, then they have heat: but how can one be warm alone? And if one prevail against him, two shall withstand him; and a threefold cord is not quickly broken\" [Ecclesiastes 4:9-12]. This begs the question: Are you committed to the Lord Jesus Christ? Are you committed to your church? Are you a co-labourer in the Gospel ministry? Are you a companion or a complainer to your pastor? Pray for him. Co-labour with him. Be a mighty man/woman in the work of the Gospel.",
        "part6": "THOUGHT",
        "part7": "Stand fast in one spirit, with one mind striving together for the faith of the Gospel. - Philippians 1:27b",
        "part8": [
            "2 CHRONICLES 25",
            "REVELATION 12"
        ]
    },
    "22 DECEMBER": {
        "part1": "2 Samuel 23:13-17",
        "part2": "Other mighty men",
        "part3": "VERSE 17",
        "part4": "And he said, Be it far from me, O LORD, that I should do this: is not this the blood of the men that went in jeopardy of their lives? therefore he would not drink it. These things did these three mighty men.",
        "part5": "Our passage continues the honour roll to commend three unidentified mighty men of David. David was hiding in the cave of Adullam, and a Philistine garrison occupied his hometown Bethlehem. In this difficult moment, David made a remark out of homesickness and longing for his home only to be surprised as these three men heard it and risked their lives to collect some water from the well of Bethlehem for him.\n\nDavid responded to their act of dedication and courage by pouring out the water before Yahweh in an act of worship. In David's eyes, the water represented the blood of the men who risked their lives, and this offering belonged to God alone.\n\nThe author did not reveal the names of the three, but the king knew who they were. Likewise, our efforts in serving our King may not be penned on paper or engraved in stone. Loving acts performed in the name of the Lord Jesus Christ may even be forgotten over time by the people to whom love has been shown. But rest assured, God knows, and He does not forget.\n\nCrave not the attention and commendation of men, but only that of God. When we are unappreciated for all the hard work we have expended, look only to Him and wait expectantly for that promised day when He will say: \"Well done, good and faithful servant; you were faithful over a few things, I will make you ruler over many things. Enter into the joy of your lord.\"\n\nThe Master knows His servants and all they have done for Him.",
        "part6": "THOUGHT",
        "part7": "Do we care more about present human recognition or the recognition that God will give in Eternity?",
        "part8": [
            "2 CHRONICLES 26",
            "REVELATION 13"
        ]
    },
    "23 DECEMBER": {
        "part1": "2 Samuel 23:18-23",
        "part2": "Benaiah",
        "part3": "VERSE 20a",
        "part4": "And Benaiah the son of Jehoiada, the son of a valiant man, of Kabzeel, who had done many acts ...",
        "part5": "The focus of today's devotion is on Benaiah, a mighty man of God. The author listed some of his valiant acts here. He slew two strong and fierce Moabites; he slew a lion in a pit in winter and he slew a fearsome Egyptian [1 Chronicles 11:23] with his own spear. There might be other exploits, but the author listed only three to show why Benaiah was considered worthy to be called a \"mighty man\".\n\nIf we delve a bit deeper, we will see that this man had a name which relates to \"Yahweh\". A direct translation of Benaiah's name is \"Yahweh hath built up\", meaning it was God Himself who gave strength for Benaiah's exploits. The author commended Benaiah for these valiant acts, but from the meaning of his name alone, all glory really can be directed to Whom it truly belongs - God Himself.\n\n(Thank God) we may not be called to take a weapon from our enemy's hands to kill him with it, but as we drive to work, attend classes in school, help a friend in need, take our children to the zoo, do our lives reflect \"Yahweh's presence\" in us? We really do not need a name which declares \"Yahweh hath built up\" to glorify Him. We can do it in our daily lives and actions. But in order to do so, we must first realize the strength that allows us to live and breathe everyday comes from Him. We need to look daily to Him in His Word and prayer to draw strength from above. Then only can we truly declare that our strength comes from God, and He is helping us to live for Him.",
        "part6": "THOUGHT",
        "part7": "Do we realise that God gives us strength everyday to get out of bed to live this life on earth for Him?",
        "part8": [
            "2 CHRONICLES 27-28",
            "REVELATION 14"
        ]
    },
    "24 DECEMBER": {
        "part1": "2 Samuel 23:24-39",
        "part2": "The thirty honourable men",
        "part3": "VERSE 39b",
        "part4": "... thirty and seven in all.",
        "part5": "\"The thirty\" was a collective way of describing the roster of David's mighty men and not its precise number. Each name listed here contributed valiantly to David's kingdom, and because David is Yahweh's chosen king, these men were in fact serving Yahweh. These were loyal men who fought well for God's kingdom.\n\nAs you read today's passage you may be thinking to yourself: \"Wait ... it's Christmas Eve, why am I reading a list of names which I know nothing of ? Should I not just take a cursory glance at this list?\"\n\nRealize that these gallant men's names were preserved in God's book for generations to read and remember. God does not forget the deeds that were done for His kingdom.\n\nLikewise, if we are faithful and persevering in serving our Lord, our names will also be written down, only in an even better book, the Lamb's book of Life. This passage reassures us that our God is a faithful God who remembers and commends His faithful servants. Even though these names are foreign to us, may they give us encouragement that one day, when that book is opened and the roll is called up yonder, our names will be there.\n\nWe may sometimes find life on earth tiring and meaningless. Wicked people appear to have the edge in the corporate world because they have access to the devil's armoury of tricks and devices. Those who profess the Lord Jesus Christ seem to 'lose out', but remember, this earth is not our home, and we are just passing through. Our vindication and the real living lie ahead of us because our names are written in the book of Life, and we will finally spend eternity with our Creator forever.",
        "part6": "THOUGHT",
        "part7": "How much do I desire for my name to be in the book of Life? Then confess the Lord Jesus Christ as your Lord and Saviour. Am I now living my life in such a way that says my name is written in that book?",
        "part8": [
            "2 CHRONICLES 29",
            "REVELATION 15"
        ]
    },
    "25 DECEMBER": {
        "part1": "2 Samuel 24:1-4",
        "part2": "David's pride and Joab's warning",
        "part3": "VERSE 1",
        "part4": "And again the anger of the LORD was kindled against Israel, and he moved David against them to say, Go, number Israel and Judah.",
        "part5": "It appears pride had crept into David's heart and the Lord permitted David to have his way in counting the number of Israel's fighting men. While we are unable to peer into David's heart to know his true intentions, the passage clearly informs that this was a sinful act permitted by God for purposes known to Him alone.\n\nJoab tried to dissuade David from carrying out this senseless census, but David was insistent. Joab and his captains then went throughout the land to number the people. How many times have we also cast aside the small voice in our conscience telling us to desist and flee from involvement in sin but we did it anyway?\n\nBeloved, beware of pride and wilfulness in our lives. Reflect often and keep careful watch over our dark hearts where sin may lurk. Engage in frequent repentance. If, like David we persist in our sin despite the warnings of the Holy Spirit, God may allow us to have our way only to suffer its consequences later.\n\nFor God's people however, His punishment is really 'loving discipline'. He would rather cause us momentary physical or emotional pain, than have us condemned for all eternity. Regardless of what God's purpose is for allowing sin and chastisement in your life, remember He is a merciful God. God displays His mercy by rescuing us from sin. When we are out of fellowship with Him, sometimes He brings about our deliverance through the sacrifice of temporal conveniences and even physical pain.",
        "part6": "THOUGHT",
        "part7": "Our God is always loving and merciful towards us whatever our circumstances may be. Always.",
        "part8": [
            "2 CHRONICLES 30",
            "REVELATION 16"
        ]
    },
    "26 DECEMBER": {
        "part1": "2 Samuel 24:5-9",
        "part2": "The cursed census",
        "part3": "VERSE 9",
        "part4": "And Joab gave up the sum of the number of the people unto the king: and there were in Israel eight hundred thousand valiant men that drew the sword; and the men of Judah were five hundred thousand men.",
        "part5": "We saw previously how God allowed David to be moved to conduct the census, even though David would regret doing it because it was sinful. Although not explicitly revealed why God was displeased, we know from 1 Chronicles 21:1 that the devil was complicit in the decision of the king. Even Joab had his reservations though he proceeded to carry out the census as David ordered. Could Joab have had done otherwise? It would be to the detriment of his personal safety and position as King David's right-hand man. Today's passage shows us how human government is fallible and imperfect. Nations and national leaders make decisions every day, and often because of man's sinful nature, the decisions are bad. As a result, we hear of troubles in many places. In history, the world suffered two world wars, and many other conflicts where innocent people are affected, even killed. Bad decisions are made by selfish and self-centred leaders without the conscience to realise their erroneous thinking; and by conceited rulers with misplaced notions of greatness and power because of the positions God has placed them in. We live in perilous times in an uncertain world. As God's children, let us be reminded we should not be part of the problem in this world, but rather to be witnesses and messengers for our Lord Jesus Christ, whose sole purpose for coming to this world was to save mankind from God's judgement upon a sin-cursed world.",
        "part6": "THOUGHT",
        "part7": "We ought to obey God rather than men. - Acts 5:29b",
        "part8": [
            "2 CHRONICLES 31",
            "REVELATION 17"
        ]
    },
    "27 DECEMBER": {
        "part1": "2 Samuel 24:10",
        "part2": "David's sensitivity to sin",
        "part3": "VERSE 10",
        "part4": "And David's heart smote him after that he had numbered the people. And David said unto the LORD, I have sinned greatly in that I have done: and now, I beseech Thee, O LORD, take away the iniquity of Thy servant; for I have done very foolishly.",
        "part5": "After Joab returned with the results, David's heart was pricked by the guilt of wrongdoing. David confessed to the Lord in contrition and sought His forgiveness for his foolish transgression. Though chosen and anointed by God, his human nature was still prone to sin, but David was quick to realize his iniquities, and quicker still to go to the Lord for forgiveness.\n\nToday's passage teaches us several precious lessons. The first, even though we are all saved when we confess our sins to the Lord, we, like David, are still weak and struggle with besetting sins in our lives. Let us realize we are all sinners and while still clothed in earthly flesh, we must contend daily with the temptations of sin in our lives. Like Paul (and David), we cry daily, \"O wretched man that I am! who shall deliver me from the body of this death?\" [Romans 7:24].\n\nThe second, as Christians having confessed and committed our sins to the Lord, we must still go each time to Him with humble and repentant hearts when we transgress. Our God is a loving and faithful God. If we truly repent, and forsake our sins, then He is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness [1 John 1:9]. What wonderful grace from our heavenly Father! Let us therefore, boldly go before the throne of grace, to obtain mercy, and to find grace when we are tempted [Hebrews 4:16].",
        "part6": "THOUGHT",
        "part7": "For we have not an high priest which cannot be touched with the feeling of our infirmities; but was in all points tempted like as we are, yet without sin. - Hebrews 4:15",
        "part8": [
            "2 CHRONICLES 32",
            "REVELATION 18"
        ]
    },
    "28 DECEMBER": {
        "part1": "2 Samuel 24:11-14",
        "part2": "No good options",
        "part3": "VERSE 13",
        "part4": "So Gad came to David, and told him, and said unto him, Shall seven years of famine come unto thee in thy land? or wilt thou flee three months before thine enemies, while they pursue thee? or that there be three days' pestilence in thy land? now advise, and see what answer I shall return to Him that sent me.",
        "part5": "In response to David's confession, the Lord's judgement was pronounced by the prophet Gad. David had three choices: endure seven years of famine in the land, be pursued for three months by his enemies, or suffer three days of pestilence. As Israel's king, all three were detrimental to the kingdom, but David had to choose one.\n\nAt times, we too have difficult decisions to make. It may not be as harmful or deadly as David's choices, but nonetheless, they are difficult ones. One thing we must ask ourselves and search our hearts is whether these choices were the consequence of our sinful actions, as in David's case. Did we obey the Lord fully in our daily lives and life choices? And even if we have not transgressed, realize God may allow difficult situations in our lives without giving us the reason until we meet Him in our heavenly home.\n\nWhat then? Shall we question God and be angry at Him? No, because we know and Scripture affirms that our God is compassionate and He always works things out for the good of those who love Him. We persevere and trust in His goodness and faithfulness to see us through whatever difficult situations we may be put in. Like David, our response to difficult choices should be: \"... let us fall now into the hand of the LORD; for His mercies are great: and let me not fall into the hand of man\" [v. 14]. So trust God and not rely on human wisdom, especially our own.",
        "part6": "THOUGHT",
        "part7": "Trust in the LORD with all thine heart; and lean not unto thine own understanding. In all thy ways acknowledge Him, and He shall direct thy paths. - Proverbs 3:5-6",
        "part8": [
            "2 CHRONICLES 33",
            "REVELATION 19"
        ]
    },
    "29 DECEMBER": {
        "part1": "2 Samuel 24:15-17",
        "part2": "No way out",
        "part3": "VERSE 15",
        "part4": "So the LORD sent a pestilence upon Israel from the morning even to the time appointed: and there died of the people from Dan even to Beersheba seventy thousand men.",
        "part5": "Although David chose the punishment with the shortest duration of suffering, no King desires to see his people suffer and die. David pleaded with God to lay the punishment upon himself and his family for it was David who originally ordered the numbering of the people [v. 17]. And though David's sin was the immediate cause, the great increase of national offenses at this time had kindled the anger of the Lord [2 Samuel 24:1]. The irony is that David's sinful action of numbering the people was punished by the mass deaths caused by the pestilence. And if it were not for the mercy of God, more would have died [v. 16]. We must remember that sin must be punished. There is no way out; no way for David to escape God's punishment by compensating with good works or past merits. Sin will be punished. Due to man's wickedness God sent a global flood to wipe out all but eight people. Adam and Eve were punished for eating the forbidden fruit. David was punished for committing adultery. Does God punish each and every sin we commit? Yes! Although there may not be an immediate punishment directly following our sins, ultimately they are punishable by our eternal damnation. Yet the God of grace deemed it such that His only begotten Son would take the penalty for us on the cross. God's wrath towards sin was not withdrawn but placed instead upon the Lord Jesus. It was on the cross that His wrath was appeased, and our sins forgiven.",
        "part6": "THOUGHT",
        "part7": "Hallelujah for \"God hath not appointed us to wrath, but to obtain salvation by our Lord Jesus Christ\" [1 Thessalonians 5:9].",
        "part8": [
            "2 CHRONICLES 34",
            "REVELATION 20"
        ]
    },
    "30 DECEMBER": {
        "part1": "2 Samuel 24:18-19",
        "part2": "God's instructions for worship",
        "part3": "VERSE 19",
        "part4": "And David, according to the saying of Gad, went up as the LORD commanded.",
        "part5": "Imagine that to honour mother on Mother's Day, you decided to treat her to a meal at a fancy restaurant. It would be selfish if the selection of cuisine was according to your preference and not hers. The same principle applies to our worshipping God. Worship is for God, not man. And God has not left us in the dark as to how we should worship Him, but He has showed us His desire.\n\nThe operative phrase in verse 19 is \"as the LORD commanded\", not as David commanded and not as Gad commanded. The incident of the golden calf exemplifies for us that worship cannot be according to our preferences. Worship that deviates from Scripture is termed as \"strange fire\" [Leviticus 10:1]. God's Word should dictate our worship.\n\nThe \"regulative\" principle of worship is worship that is founded upon the instructions of Scripture. We know from Scripture that worship contains the \"reading, (and) exhortation\" of God's Word [1 Timothy 4:13]; and the singing of \"psalms and hymns and spiritual songs\" [Ephesians 5:19]. Although Scripture is silent on the circumstances of worship (length of time, start time, order of worship etc ...) we should follow the principle given to the church at Corinth that \"all things be done decently and in order\" [1 Corinthians 14:40]. When we worship as God instructed, then our worship will rise as a sweet-smelling savour.",
        "part6": "THOUGHT",
        "part7": "If our whole life is to be lived according to the rule of Scripture, why should our worship be any different?",
        "part8": [
            "2 CHRONICLES 35",
            "REVELATION 21"
        ]
    },
    "31 DECEMBER": {
        "part1": "2 Samuel 24:20-25",
        "part2": "Worship that costs something",
        "part3": "VERSE 24",
        "part4": "And the king said unto Araunah, Nay; but I will surely buy it of thee at a price: neither will I offer burnt offerings unto the LORD my God of that which doth cost me nothing. So David bought the threshingfloor and the oxen for fifty shekels of silver.",
        "part5": "Picture yourself returning home from a restaurant meal with a full belly and leftovers in hand, and you meet a homeless man on the streets. There you sacrifice your leftovers and hand the extra food to him. What did it cost you? Did you suffer hunger because you gave away your leftovers? Did you have to pay extra for the leftovers? No. Your \"sacrifice\" came at no cost. They were mere leftovers.\n\nDavid, however, knew that all genuine sacrifice comes at a price. To offer the Lord burnt offerings that cost him nothing would have been to David a sign of the deepest ingratitude. Although the owner offered them to David for free, he paid for the threshing floor, oxen and wood so that he could build a worthy altar to God. The woman who broke the costly jar of perfume and anointed the Lord Jesus in Mark 14 did so in worshipping Him. The wise men that travelled from afar came bearing valuable gifts of gold, myrrh and frankincense.\n\nIndeed, genuine worship comes at a price. It may require our time and commitment in service. It may require our money for the furtherance of the Gospel work. It may require our gifts and talents in the ministry. Worship is costly and requires our personal sacrifice not because God needs our sacrifice and money but because God is worth it. David worships God because in Him there is forgiveness and mercy in the abatement of the pestilence. Likewise, we worship God because in Him there is eternal life and victory over sin for us at the cross.",
        "part6": "THOUGHT",
        "part7": "What have you \"sacrificed\" in worship?",
        "part8": [
            "2 CHRONICLES 36",
            "REVELATION 22"
        ]
    }
}