{
    "25 SEPTEMBER": "<b><u>25 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:3-4&version=KJV\">1 Samuel 24:3-4</a>\n\n<b>LESSON</b>\nOpportunity for David\n\n<b>VERSE 4</b>\n<i>And the men of David said unto him, Behold the day of which the LORD said unto thee, Behold, I will deliver thine enemy into thine hand, that thou mayest do to him as it shall seem good unto thee. Then David arose, and cut off the skirt of Saul's robe privily.</i>\n\nIn the previous chapter when Saul learnt that David was in the town of Keilah, he deemed it a God-given opportunity to attack him. He interpreted that turn of events as God delivering David into his hands [1 Samuel 23:7]. In today's verses, we have a similar situation. But this time, it was David's turn to be presented that chance, and the difference in David's response showed us why he was indeed a man after God's own heart.\n\nOn the way to Engedi, Saul entered a cave to relieve himself. Little did he realise that cave was already occupied - David and his men were hiding there. Saul was alone and completely vulnerable, and David's men interpreted the situation exactly the way Saul had done before. They told David, \"Today is the day of which the Lord said to you, 'Behold, I will give your enemy into your hand, and you shall do to him as it shall seem good to you.'\"\n\nDavid's men did not hear anything from God. They were just following their carnal and worldly- wise instincts and using God's name in vain by telling David, \"This is the day God is telling you to follow your heart's desire.\"\n\nDavid, however, was not so tempted. He had something else in mind. He moved toward Saul and secretly cut off a corner of Saul's robe. A little action, yet even this would later cause him to be greatly conscience-stricken.\n\n<b>THOUGHT</b>\nThe secret of the LORD is with them that fear Him; and He will shew them His covenant. - Psalm 25:14\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 3&version=KJV\">DANIEL 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 JOHN 3&version=KJV\">1 JOHN 3</a></b>",
    "26 SEPTEMBER": "<b><u>26 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:5&version=KJV\">1 Samuel 24:5</a>\n\n<b>LESSON</b>\nDavid's conscience\n\n<b>VERSE 5</b>\n<i>And it came to pass afterward, that David's heart smote him, because he had cut off Saul's skirt.</i>\n\nDavid had just cut off a corner of Saul's robe. Saul was still relieving himself, oblivious to what was happening. Meanwhile David's men were standing by, ready to kill Saul at their leader's command. Clearly, in the eyes of David's men, this was a God-given opportunity.\n\nIt was at this crucial juncture, when David could easily have slain the adversary who was relentlessly pursuing him that his heart \"smote\" him. This means David's conscience was stricken, not by mere unease over a misdemeanour but by stark apprehension and horror at the sinfulness of what he had just done. Commentators have various opinions as to David's intention in cutting off the corner of Saul's robe and the gravity of this sin. Nevertheless, it is clear from his subsequent words and actions, that David had a tender conscience, one that was sensitive to the prompting of the Holy Spirit, one that was informed and ruled by God, and one that had deep reverence for God's sovereignty and judgement. David did not try to suppress his conscience but allowed his conscience to lead him to do right in God's eyes.\n\nGod has given each of us a conscience too. How is its condition? Is it informed and governed by God's Word? Is it sensitive to the prompting of the Spirit? Do you heed it and exercise it so that God is always honoured and holiness upheld in our lives? May the Lord help us cultivate a healthy conscience that is captive to His will!\n\n<b>THOUGHT</b>\nAnd herein do I exercise myself, to have always a conscience void of offence toward God, and toward men. - Acts 24:16\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 4&version=KJV\">DANIEL 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 JOHN 4&version=KJV\">1 JOHN 4</a></b>",
    "27 SEPTEMBER": "<b><u>27 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:6&version=KJV\">1 Samuel 24:6</a>\n\n<b>LESSON</b>\nThe LORD's anointed\n\n<b>VERSE 6</b>\n<i>And he said unto his men, The LORD forbid that I should do this thing unto my master, the LORD's anointed, to stretch forth mine hand against him, seeing he is the anointed of the LORD.</i>\n\nIf there is one quality that characterises David, it is his profound reverence for God. So deep was his reverence that it extended even to those whom the LORD had anointed. And this was why he refused to harm Saul--because Saul was the \"LORD's anointed\".\n\nWhat is the significance of anointing? Under the old covenant, the act of anointing with oil signified that God had set apart that person and given him authority for his office. Submission to the authority of the LORD's anointed therefore signified one's submission to the Lord Himself; reverence for the LORD's anointing indicates one's reverence for that which is sacred and holy. Although Saul had drifted from God, even seeking to kill David, David revered the LORD behind Saul's throne and continued to give Saul utmost respect.\n\nToday, individuals are no longer anointed to the Old Testament offices because our Lord Jesus Christ, the Anointed One, has perfectly fulfilled all those roles. Nevertheless, God continues to ordain faithful men to lead His church and His work. How much respect do we show our leaders? Do we bear a critical and judgemental attitude towards them, question their decisions, doubt their competence, or criticise their preaching? How easy it is for us to lose sight of the LORD behind the man! While it does not mean we should have an unquestioning servile attitude towards the leadership, it does mean we must accord respect to the office and love for the Lord's ministers. Revere the LORD and wait patiently to see what He will achieve through His ordained servants.\n\n<b>THOUGHT</b>\nLet every soul be subject unto the higher powers. For there is no power but of God: the powers that be are ordained of God. - Romans 13:1\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 5&version=KJV\">DANIEL 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 JOHN 5&version=KJV\">1 JOHN 5</a></b>",
    "28 SEPTEMBER": "<b><u>28 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:7-8&version=KJV\">1 Samuel 24:7-8</a>\n\n<b>LESSON</b>\nLove your enemies\n\n<b>VERSE 8</b>\n<i>David also arose afterward, and went out of the cave, and cried after Saul, saying, My lord the king. And when Saul looked behind him, David stooped with his face to the earth, and bowed himself.</i>\n\nDavid not only refused to take advantage of the situation to kill Saul, he also \"stayed\" his men from doing so. The Hebrew word for \"stayed\" means to tear apart an animal. It is an unusual word to use in this context, but it reflects his radical obedience that stems from a profound reverence for God. Instead of \"tearing apart\" their enemy, David \"tore apart\" their murderous intent to lay hands on the LORD's anointed.\n\nDavid did not stop at sparing his pursuer's life, he went out of the way to assure Saul of his continued allegiance. David waited until Saul was safely out of the cave before calling out to him. He addressed Saul with a term of utmost respect and bowed humbly before him.\n\nDavid's treatment of Saul illustrates what it means to love our enemies, as our Lord Jesus has taught us in Matthew 5:44. Even though Saul sought to kill him, David did not retaliate in kind but overcame evil with good [Romans 12:21]. He was able to do so because he trusted God to accomplish His purpose in his life.\n\nUltimately, David points us to our Lord Jesus. As sinners, we are all enemies of the Holy God. \"But God commendeth His love toward us, in that, while we were yet sinners, Christ died for us\" [Romans 5:8]. Is there anyone you find hard to forgive? Pray and ask God to help you love and forgive your enemies, just as you have been loved and forgiven.\n\n<b>THOUGHT</b>\nDo you bless and pray for your enemy, as our Lord commanded? Do it and experience how God will use your prayers to transform your heart and enable you to love your enemy.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 6&version=KJV\">DANIEL 6</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 JOHN&version=KJV\">2 JOHN</a></b>",
    "29 SEPTEMBER": "<b><u>29 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:9-11&version=KJV\">1 Samuel 24:9-11</a>\n\n<b>LESSON</b>\nDavid's Integrity\n\n<b>VERSE 11</b>\n<i>Moreover, my father, see, yea, see the skirt of thy robe in my hand: for in that I cut off the skirt of thy robe, and killed thee not, know thou and see that there is neither evil nor transgression in mine hand, and I have not sinned against thee; yet thou huntest my soul to take it.</i>\n\nHaving demonstrated his allegiance through his actions, David now defended his integrity through his words. He declared that when providence brought Saul into the cave and some of his men urged him to kill Saul, he refused. Holding up the piece of Saul's robe as proof of his integrity, David declared that he bore no evil in his heart. He had neither transgressed against the Lord nor sinned against Saul; it was Saul who wanted to kill him.\n\nThis passage contrasts David's integrity against Saul's lack thereof. Given the opportunity, David did not use providence or his men's urgings as excuses to take a life. Instead he stood firm doing what he knew was right - giving reverence to the LORD and His anointed. In contrast, Saul was not so much misled by his men's lies, as by the harbouring of evil in his heart because he was jealous of David. Using his men's lies as an excuse, he relentlessly pursued David to kill him. So strong was his evil desire that he diverted three thousand of his best soldiers in the midst of the war with the Philistines to hunt David [v. 2].\n\nOur Lord Jesus taught us that obeying God begins with the heart [Matthew 5:21-32]. Do your actions reflect the integrity of your heart or do you find excuses to cover up your motives? May the Lord help us to walk close to Him with integrity of heart.\n\n<b>PRAYER</b>\nSearch me, O God, and know my heart: try me, and know my thoughts: And see if there be any wicked way in me, and lead me in the way everlasting. - Psalm 139:23-24\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 7&version=KJV\">DANIEL 7</a>\n<a href=\"https://www.biblegateway.com/passage/?search=3 JOHN&version=KJV\">3 JOHN</a></b>",
    "30 SEPTEMBER": "<b><u>30 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:12-15&version=KJV\">1 Samuel 24:12-15</a>\n\n<b>LESSON</b>\nThe LORD be the Judge\n\n<b>VERSE 15</b>\n<i>The LORD therefore be judge, and judge between me and thee, and see, and plead my cause, and deliver me out of thine hand.</i>\n\nIn the face of Saul's false allegations and murderous intent, David did not seek to avenge himself; he called upon the LORD to be the judge. In defence he quoted a proverb to assert his righteousness, demonstrated by his refusal to take Saul's life, unlike Saul who actively sought David's death. David called himself a dead dog and a flea--a contemptible and worthless being too insignificant for a king to bother with.\n\nWhy was David able to wait upon the LORD to judge and avenge him? Because of his faith, reverence, obedience, and humility. As we have seen, David had profound reverence for the LORD and faith in Him to accomplish His purposes in his life. David was also resolute in obeying the LORD and refused to give in to temptation and take things in his own hands. Lastly, he was humble. He had a deep sense of his own insignificance, unworthiness and sinfulness and deferred to the LORD to take up his cause.\n\nYou may think you do not measure up to David, especially in your times of suffering and anguish. But we can and should look to the LORD to be our judge, not because of how good we are, but because of who He is. He is the perfectly just and merciful judge. The wicked will not go unpunished; nor can we escape His judgement. Yet by His mercies through His Son our Saviour, those who repent and put their faith in the Lord Jesus Christ will not be consumed by God's wrath but saved unto eternal life. His compassions fail not; great is His faithfulness.\n\n<b>THOUGHT</b>\nDearly beloved, avenge not yourselves, but rather give place unto wrath: for it is written, Vengeance is mine; I will repay, saith the Lord. - Romans 12:19\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 8&version=KJV\">DANIEL 8</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JUDE&version=KJV\">JUDE</a></b>",
    "1 OCTOBER": "<b><u>1 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:16&version=KJV\">1 Samuel 24:16</a>\n\n<b>LESSON</b>\nSaul's tears\n\n<b>VERSE 16</b>\n<i>And it came to pass, when David had made an end of speaking these words unto Saul, that Saul said, Is this thy voice, my son David? And Saul lifted up his voice, and wept.</i>\n\nSaul had lived under the delusion that David was out to get him, but David's refusal to kill him when he had the chance proved beyond doubt that this was false. David's obedience to God and his sincerity softened Saul's heart. Saul now spoke tenderly and addressed David as \"my son\", in response to the son-in-law who earlier called him \"my father\" [v. 11]. Affected by David's kindness, relieved at being spared certain death, and feeling guilty about his own viciousness, Saul lifted up his voice and wept.\n\nSaul's remorse was evidently genuine, but was it true repentance? From his subsequent actions, we know it was not. It did not \"bring forth fruits meet for repentance\" [Matthew 3:8]. True repentance entails a resolve to cease the wrongful conduct, and replace it with godly living. Where the sin is against an individual, amends must be made to that person. Where possible, an attempt at restitution should be made. A good example is seen in the case of Zacchaeus [Luke 19:8]. Saul's reaction is simply that of a man whose God-given conscience has been pricked. His tears could also be for the misery he had brought on himself through his vindictiveness and jealousy.\n\nThe example of Saul must cause us to examine our own response to the sacrificial death of our Lord Jesus Christ for us, when we were yet without strength [Romans 5:6], and enemies of God [Romans 5:10]. While it is true that there is nothing we can do to save ourselves, repentance - as the Westminster Confession of Faith says - is evangelical grace and a corollary of our salvation, because faith without works is dead [James 2:17].\n\n<b>THOUGHT</b>\nRead Luke 3:10-14. What was John the Baptist's answer to the people who asked him, \"What shall we do then?\"\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 9&version=KJV\">DANIEL 9</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 1&version=KJV\">MATTHEW 1</a></b>",
    "2 OCTOBER": "<b><u>2 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:17-19&version=KJV\">1 Samuel 24:17-19</a>\n\n<b>LESSON</b>\nThou art more righteous\n\n<b>VERSE 17</b>\n<i>And he said to David, Thou art more righteous than I: for thou hast rewarded me good, whereas I have rewarded thee evil.</i>\n\nIn three short verses, Saul shows us why David was called \"a man after God's own heart\". His graciousness and kindness towards a man who hated him for no valid reason, was exactly in conformance to the Lord's teaching on the Sermon on the Mount; \"Ye have heard that it hath been said, Thou shalt love thy neighbour, and hate thine enemy. But I say unto you, Love your enemies, bless them that curse you, do good to them that hate you, and pray for them which despitefully use you, and persecute you;\" [Matthew 5:43-44]. David did not raise his hand against the Lord's anointed, even though Saul had chased him and tried at every opportunity to kill him. Saul acknowledged that David's actions pleased God, and God would reward him accordingly.\n\nJesus Himself was the best example of what it means to love our enemies. With His dying breath, He asked God to forgive the very people who crucified Him and God answered His prayer. On the day of Pentecost, God opened their spiritual eyes to see their wickedness, and in response to Peter's preaching, many \"gladly received his word and were baptised the same day\" [Acts 2:41].\n\nWe may not be as wicked as Saul or the Jews who cried out for the Lord Jesus Christ to be crucified. Still, wretched sinners we are, and just as much do we need to have our sins forgiven. We too need to \"repent, and be baptized ... in the name of Jesus Christ for the remission of sins, and ... receive the gift of the Holy Ghost\" [Acts 2:38].\n\n<b>THOUGHT</b>\nBlessed are they which do hunger and thirst after righteousness: for they shall be filled. - Matthew 5:6\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 10&version=KJV\">DANIEL 10</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 2&version=KJV\">MATTHEW 2</a></b>",
    "3 OCTOBER": "<b><u>3 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:20-22&version=KJV\">1 Samuel 24:20-22</a>\n\n<b>LESSON</b>\nSaul's submission to God's will\n\n<b>VERSE 20</b>\n<i>And now, behold, I know well that thou shalt surely be king, and that the kingdom of Israel shall be established in thine hand.</i>\n\nHaving confessed his own wrongdoings and acknowledged David to be \"more righteous\", King Saul finally accepted the reality that the Lord had rent the kingdom from him, and given it to a neighbour that was better than he [1 Samuel 15:28]. He therefore made David swear he would not cut off his seed after him. In ancient times, it was common practice for a new king to kill all the descendants of the ruler whom he replaced. This prevented them from rising up and re-establishing the dead king's dynasty. Such atrocity happened even in Israel during the time of the Judges [Judges 9:5] and the Kings [2 Chronicles 22:10]. David had already promised Jonathan that he would not kill his descendants [1 Samuel 20:14-17], and here, he made the same promise to Saul. Thus, they parted in peace, David being reassured of God's promotion, and Saul resigned to God's sacking.\n\nSaul's concern is similar to that of Joseph's brothers who were afraid that Joseph would take revenge on them once their father died [Genesis 50:15]. Like Joseph, David too must have asked himself, \"Am I in the place of God?\" [Genesis 50:19].\n\nToday's reading reminds us that the Sovereign God \"ruleth in the kingdom of men, and giveth it to whomsoever He will\" [Daniel 4:32]. Regardless of the political party that comes to power in any country, we should confess like King Nebuchadnezzar, who \"praise and extol and honour the King of heaven, all Whose works are truth, and His ways judgement\" [Daniel 4:37a].\n\n<b>THOUGHT</b>\nObedience to the will of God gives you wings, not chains! - Warren Wiersbe\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 11&version=KJV\">DANIEL 11</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 3&version=KJV\">MATTHEW 3</a></b>",
    "4 OCTOBER": "<b><u>4 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 25:1&version=KJV\">1 Samuel 25:1</a>\n\n<b>LESSON</b>\nDeath of Samuel\n\n<b>VERSE 1</b>\n<i>And Samuel died; and all the Israelites were gathered together, and lamented him, and buried him in his house at Ramah. And David arose, and went down to the wilderness of Paran.</i>\n\nAs is the case with many other heroes of the faith, Scripture does not record much about the death of Samuel, this faithful judge and prophet of Israel. But the much that has been bequeathed to us about his life; even from the time before his birth, till his old age, is precious and millions of believers have been blessed by the study of his words and deeds. As for his people, although they did not appreciate him during his life, they all honoured him in his death.\n\nThere are lessons to be learnt from Samuel's death. First, we are reminded that, as descendants of Adam, none of us can escape physical death. Hence, we need to number our days and apply our hearts to wisdom. One way is to emulate the faithful servants of God like Samuel.\n\nSecondly, we are encouraged that our God is faithful. Even as He calls home His trusted servants, He will raise up others to continue with His work. Thus, we read in the same verse that David \"arose\". Like Samuel, he too was much used in leading Israel to attain its highest glory; and from whose line, the promised Messiah would come. Like Samuel's mother, we as parents should not hesitate to 'lend' [1 Samuel 1:28] our children to God to be used for His glory.\n\nFinally, Samuel's legacy should inspire us to serve the Lord faithfully in whichever area He places us; and trust that He is able to use us, \"unprofitable servants\", to bear much fruit for Him.\n\n<b>PRAYER</b>\nMay the Lord find us faithful. May His Word be our banner held high. - Mac Lynch.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 12&version=KJV\">DANIEL 12</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 4&version=KJV\">MATTHEW 4</a></b>",
    "5 OCTOBER": "<b><u>5 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 25:2-3&version=KJV\">1 Samuel 25:2-3</a>\n\n<b>LESSON</b>\nThe rich fool\n\n<b>VERSE 3</b>\n<i>Now the name of the man was Nabal; and the name of his wife Abigail: and she was a woman of good understanding, and of a beautiful countenance: but the man was churlish and evil in his doings; and he was of the house of Caleb.</i>\n\nThe Bible speaks of two kinds of fools. The first kind are fools in the eyes of the world. They are the Christians. The world cannot understand the things that Christians do, such as giving up their precious Sundays to go to church, even giving money and working for free; \"They are foolishness unto him\" [1 Corinthians 2:14]; they find the Gospel message offensive and regard it as foolishness [1 Corinthians 1:23]. Not many Christians are wise in secular matters, hold high office or powerful positions in the business and political realm, and few are of illustrious birth [1 Corinthians 1:26].\n\nThe second kind of fool is one who says in his heart, there is no God. And the Bible has a lot to say about him. One such fool was Nabal. He was rich and successful [v. 2]. His name actually meant \"fool\" and so obviously it was a name that he acquired. He was 'churlish\", which means rude, harsh or obstinate. We often see such people in positions of power in business. They are intelligent, fast and have no patience for subordinates who cannot keep up with them. Nabal was also \"evil in his doings\". We can safely deduce that he would not hesitate to use unscrupulous methods to get what he wanted. This brings to mind King Ahab and his wife Jezebel and the treacherous scheme they devised to steal Naboth's vineyard [1 Kings 21].\n\nThe Bible tells us of the ultimate destination of these two kinds of fools. We have to choose one. Which would you choose?\n\n<b>THOUGHT</b>\nI had rather be a doorkeeper in the house of my God, than to dwell in the tents of wickedness. - Psalm 84:10b\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HOSEA 1&version=KJV\">HOSEA 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 5&version=KJV\">MATTHEW 5</a></b>",
    "6 OCTOBER": "<b><u>6 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 25:4-8&version=KJV\">1 Samuel 25:4-8</a>\n\n<b>LESSON</b>\nDavid's request for help\n\n<b>VERSE 8</b>\n<i>Ask thy young men, and they will shew thee. Wherefore let the young men find favour in thine eyes: for we come in a good day: give, I pray thee, whatsoever cometh to thine hand unto thy servants, and to thy son</i>\n\nDavid and his men had protected Nabal's shepherds and their flocks. It was important to do so or Nabal's sheep could have been raided by the hostile Philistines, Amalekites, or eaten by wild animals and the shepherds harmed.\n\nDavid and his men were in distress and needed provisions. He waited till the harvest when Nabal could sell the wool from sheep shearing. Traditionally, sheep shearing time was a time of lavish hospitality towards others. Nabal was holding a feast to celebrate, and it was reasonable to expect that he would show appreciation and return the favour to David by providing them with some food.\n\nDavid was mindful to send 10 young men instead of a large troop of fighters so as not to intimidate Nabal. His messengers were told to greet Nabal with peace, wish him well and be humble when making their requests. David also instructed his men to appraise Nabal of all the favours they had rendered, and to emphasise that none of Nabal's shepherds or sheep were harmed. Though an anointed king to be and a man of war, he was respectful in presenting his request.\n\nIt was clear that David desired peace with Nabal. With his troops comprising over six hundred strong fighters, he could have snatched Nabal's flock in the wilderness and everything else in Nabal's house. We see the humility and righteousness of David's heart here despite his status as the future king of Israel. Let us walk humbly with the Lord.\n\n<b>THOUGHT</b>\nWith all lowliness and meekness, with longsuffering, forbearing one another in love - Ephesians 4:2\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HOSEA 2&version=KJV\">HOSEA 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 6&version=KJV\">MATTHEW 6</a></b>",
    "7 OCTOBER": "<b><u>7 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 25:9-13&version=KJV\">1 Samuel 25:9-13</a>\n\n<b>LESSON</b>\nNabal's ingratitude\n\n<b>VERSE 10</b>\n<i>And Nabal answered David's servants, and said, Who is David? and who is the son of Jesse? there be many servants now a days that break away every man from his master.</i>\n\nNabal did not appreciate the help of David's men. Instead, he feigned ignorance of who David was, and called him a runaway slave. He brusquely refused their request for bread, water and meat. This was done not out of sheer ignorance as Nabal would have known David, by now famous in Israel. Instead of being grateful that his property and his shepherds' lives had been preserved by the protection of David's men, he selfishly considered everything to be his own. Just like his name, 'fool', Nabal foolishly refused to acknowledge David and his men, and rudely turned them away.\n\nMany of us today may have made the same mistake as Nabal. All our belongings, our wealth and blessings come from the Lord. Instead of showing appreciation and returning a portion of our wealth through tithing, using our talents and time to serve the Lord, we have made many excuses to avoid doing all these. We need to understand that we are only stewards of the things we own, and we are to use them to expand the kingdom of God rather than our own.\n\nDavid was upset with such ungrateful and offensive behaviour. In anger, he decided to deal ruthlessly with this obnoxious character. He instructed four hundred men to take up their weapons. And in his rashness, he was about to commit sin. Let us also learn that we cannot act impulsively upon our angry and hurt feelings.\n\n<b>THOUGHT</b>\nBe thankful for God's providence. Be good stewards of God's riches. Read 1 Timothy 6:17-21.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HOSEA 3&version=KJV\">HOSEA 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 7&version=KJV\">MATTHEW 7</a></b>",
    "8 OCTOBER": "<b><u>8 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 25:14-17&version=KJV\">1 Samuel 25:14-17</a>\n\n<b>LESSON</b>\nVoice of conscience\n\n<b>VERSE 15</b>\n<i>But the men were very good unto us, and we were not hurt, neither missed we any thing, as long as we were conversant with them, when we were in the fields.</i>\n\nIt was fortunate that foolish Nabal had a perceptive servant. He knew that if he did not ask his master's wife to intervene and resolve the problem created by Nabal, the whole household would be imperilled. The servant told Abigail how David's men had protected the master's herdsmen and flocks while they were out in the fields. Abigail could see that Nabal was in fact blessed by David and that his men had been a wall of protection for her husband's property.\n\nNabal's servant knew how wicked, arrogant and stubborn his master was. He was so proud that nobody could talk to him. Nabal was also ungodly as he refused to acknowledge David, the future king anointed by the Lord. Both Abigail and the servant knew that David was God's favoured and would soon take over as Israel's next king.\n\nWe do not want to be a fool like Nabal. We must learn gratitude, humility and submissiveness. Surely we do not want to be known as a person whom \"no one can talk to\" even when we are on the wrong path. Pray that we will have godly discernment and humility to admit our wrongdoings as well.\n\nAbigail was wise and knew she had to act fast to save her husband and his household. Through Abigail, the Lord interjected to restrain David from sinning and taking lives needlessly. The Lord showed mercy to two sinners that day.\n\n<b>THOUGHT</b>\nDear Lord, help me be like Abigail. Help me come to You for guidance, strength and protection.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HOSEA 4&version=KJV\">HOSEA 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 8&version=KJV\">MATTHEW 8</a></b>",
    "9 OCTOBER": "<b><u>9 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 25:18-22&version=KJV\">1 Samuel 25:18-22</a>\n\n<b>LESSON</b>\nDavid's hasty decision - repay evil for good\n\n<b>VERSE 21</b>\n<i>Now David had said, Surely in vain have I kept all that this fellow hath in the wilderness, so that nothing was missed of all that pertained unto him: and he hath requited me evil for good.</i>\n\nDavid's request was reasonable, legitimate, and in line with the custom of that time. But Nabal was insolently abusive and humiliating, thus inviting retribution. The ingratitude and offence David felt, justified in his mind the violent and vengeful act he was about to carry out. However understandable David's wrath may be, it was really a burst of sinful passion. Solomon said in Proverbs 17:13: \"Whoso rewardeth evil for good, evil shall not depart from his house.\" David should have left it with God to deal with Nabal, and not take matters into his own hands. By carrying out his intention, he would have sinned against the Lord.\n\nWhen someone hurts us, we want to strike back; our natural instinct is to retaliate. We should not return evil for evil, for then we will be doing evil rather than good. We should not take matters into our own hands, because we will be acting as judge. We should return good for evil, so that God will use our actions to bring conviction of sin and repentance to those who are in the wrong.\n\nThe old saying goes that \"revenge is sweet,\" but it is not so. It is a bitter pill that adds only misery. It foments only more hurt and evil. Returning good for evil is never easy but it is God's way. And often it seems impossible if we do not have God's help. Most of us would have responded to Nabal as David did. Our sympathies may lie with David, but our hearts and obedience must be to our Lord Jesus Christ. That is why we need the Holy Spirit's help to do that which we can never do in our own strength.\n\n<b>THOUGHT</b>\nBe ye angry, and sin not: let not the sun go down upon your wrath - Ephesians 4:26\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HOSEA 5&version=KJV\">HOSEA 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 9&version=KJV\">MATTHEW 9</a></b>",
    "10 OCTOBER": "<b><u>10 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 25:23-26&version=KJV\">1 Samuel 25:23-26</a>\n\n<b>LESSON</b>\nAbigail's plea\n\n<b>VERSE 24</b>\n<i>And fell at his feet, and said, Upon me, my lord, upon me let this iniquity be: and let thine handmaid, I pray thee, speak in thine audience, and hear the words of thine handmaid.</i>\n\nAbigail acted wisely to save her family and her servants from David's punishment. She hurried to meet David and poured out her heart to him, accepting all blame and responsibility, interceding for her husband, reminding David of his better self and all the Lord had done and would do for him and through him. The situation was urgent, and the task critical. She sent a gift that would provide something for David and his men. Abigail helped to calm David down and enabled him to see the folly of shedding blood. She also desired to save David himself, so that he would not be guilty of this deed against innocent men.\n\nAbigail was a woman of faith, character and intelligence. She turned David's eyes back to the Lord, keeping him from taking matters into his own hands. She was positive and submissive in her appeal. She appealed to David as someone who had rightful authority over her. Abigail is an example of one who carried herself with utmost grace, gentleness, and courage.\n\nTo many Christians, submission means bearing everything in silence. However, Abigail sets an example for us - submission that speaks - but speaking sweetly instead of sharply. As Paul exhorts, \"Let your speech be alway with grace, seasoned with salt, that ye may know how ye ought to answer every man\" [Colossians 4:6]. Abigail certainly knew how to do this. Hers was a timely message and as a result, an angry man was brought to his senses.\n\n<b>THOUGHT</b>\nWisdom resteth in the heart of him that hath understanding: but that which is in the midst of fools is made known. - Proverbs 14:33\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HOSEA 6&version=KJV\">HOSEA 6</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 10&version=KJV\">MATTHEW 10</a></b>",
    "11 OCTOBER": "<b><u>11 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 25:27-31&version=KJV\">1 Samuel 25:27-31</a>\n\n<b>LESSON</b>\nAbigail's appeasement\n\n<b>VERSE 28</b>\n<i>I pray thee, forgive the trespass of thine handmaid: for the LORD will certainly make my lord a sure house; because my lord fighteth the battles of the LORD, and evil hath not been found in thee all thy days.</i>\n\nAbigail appealed personally to David to change his intentions. She had a calming effect on him. She reminded him of who he was, and what he would become. Her appeal pointed to the Lord, their mutual faith in Him, and their common desire to be kept from doing wrong. She was a wise counsellor. David's anger melted away under the power of her influence and reasoning. Abigail was a peacemaker.\n\nPeace-making is divine work, for peace means reconciliation, and God is the author of peace and of reconciliation. Christian living is ever giving light, comfort and peace. It is manifested in a pure, wise, simple, and useful life. It is governed by an unselfish love that makes holy all that we say and do. However, to be a peacemaker, we have first to deal with the sinful passions of our own hearts. Then we can deal with the conflicts of others.\n\nWe often avoid people who are different or have a different world view from us in order to keep peace. We avoid speaking honestly or engage in insincere flattery so as not to offend. But that is not true peacemaking. James reminds us: \"But the wisdom that is from above is first pure, then peaceable, gentle, and easy to be intreated, full of mercy and good fruits, without partiality, and without hypocrisy\" [James 3:17]. Abigail possessed and exercised this wisdom. She spoke the truth in love. The result? Many lives were saved that day and God was glorified.\n\n<b>THOUGHT</b>\nGod calls us to be peacemakers, not peacekeepers.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HOSEA 7&version=KJV\">HOSEA 7</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 11&version=KJV\">MATTHEW 11</a></b>",
    "12 OCTOBER": "<b><u>12 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 25:31&version=KJV\">1 Samuel 25:31</a>\n\n<b>LESSON</b>\nThe danger of anger\n\n<b>VERSE 31</b>\n<i>That this shall be no grief unto thee, nor offence of heart unto my lord, either that thou hast shed blood causeless, or that my lord hath avenged himself: but when the LORD shall have dealt well with my lord, then remember thine handmaid.</i>\n\nWith exquisite grace, Abigail appealed to the spiritual side of David. She told David that God sent her to stop him from committing murder in anger. She reminded him of the responsibility to keep himself completely free of selfish acts, for if he did what his rage was driving him to, he would regret for the rest of his life.\n\nOftentimes anger is fuelled by a sin that is described as the greatest by some - pride. We are offended because people do not treat us the way we think they should. We feel we have been stepped upon; our rights violated. This happens more often in an increasingly individualistic world, and sadly, in the church of Christ too. Pride causes us to focus on self: \"my achievements\", \"my rights\", \"my privacy\", \"my way\".\n\nSin has a way of hoodwinking us to believe we are right. \"Most men will proclaim every one his own goodness: but a faithful man who can find?\" [Proverbs 20:6]. Let us therefore watch over our hearts and keep it with all diligence, for out of it are the issues of life [Proverbs 4:23]. \"Cease from anger and forsake wrath: fret not thyself in any wise to do evil\" [Psalm 37:8].\n\nThis well-known analogy reminds us that every wicked word uttered, and every sinful deed done, is like a nail driven into a table of wood. Though the nail may be removed, the mark left by it will always remain - on the table of our hearts. Thus, whenever we are tempted to let our anger vent, consider the consequences. \"The discretion of a man deferreth his anger; and it is his glory to pass over a transgression\" [Proverbs 19:11].\n\n<b>THOUGHT</b>\nLet all bitterness, and wrath, and anger, and clamour, and evil speaking, be put away from you, with all malice. And be ye kind one to another, tenderhearted, forgiving one another, even as God for Christ's sake hath forgiven you. - Ephesians 4:31-32\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HOSEA 8&version=KJV\">HOSEA 8</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 12&version=KJV\">MATTHEW 12</a></b>",
    "13 OCTOBER": "<b><u>13 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 25:32-35&version=KJV\">1 Samuel 25:32-35</a>\n\n<b>LESSON</b>\nDavid's restraint\n\n<b>VERSE 33</b>\n<i>And blessed be thy advice, and blessed be thou, which hast kept me this day from coming to shed blood, and from avenging myself with mine own hand.</i>\n\nDavid had been greatly offended and hell- bent on teaching Nabal a lesson. With four hundred men, he set out to punish Nabal for the disdain shown towards him and the harsh unkind treatment of his men. It seemed certain that much blood would be shed that day. But God intervened to prevent His chosen from carrying out this reckless act, which would not only sully his soul, but also cause him shame and sorrow later.\n\nAbigail was the Lord's instrument of David's restraint. She would stand between her present husband and her future king to avert the massacre of Nabal's household including possibly herself.\n\nSuch is God's marvellous mercy and providence which we would do well to realise and remember. He often uses the seemingly insignificant to effect a mighty deliverance or prevent a great misstep. With Naaman, it was an unnamed Jewish servant girl [2 Kings 5:2-3]. For Balaam, it was an ass [Numbers 22:33]. Paul was saved by his young nephew [Acts 23:16]. Here, Abigail intervenes with her timely act of appeasement and persuasive words of peace to save not only Nabal from David, but more crucially David from himself.\n\nMay we be sensitive to God's working through His means. Our conscience troubles us - heed it. God's Word constraints us - obey it. Godly friends counsel us - consider it. Let God's Word dwell in you richly in all wisdom, as your inerrant and infallible guide. Quench not the Spirit but heed His still small voice speaking always for your good.\n\nVery often God intervenes to save His children from their own foolishness.\n\n<b>THOUGHT</b>\nBut they rebelled, and vexed his holy Spirit: therefore he was turned to be their enemy, and he fought against them. - Isaiah 63:10\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HOSEA 9&version=KJV\">HOSEA 9</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 13&version=KJV\">MATTHEW 13</a></b>",
    "14 OCTOBER": "<b><u>14 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 25:36-38&version=KJV\">1 Samuel 25:36-38</a>\n\n<b>LESSON</b>\nHeart of stone\n\n<b>VERSE 37</b>\n<i>But it came to pass in the morning, when the wine was gone out of Nabal, and his wife had told him these things, that his heart died within him, and he became as a stone.</i>\n\nIf David had his way, Nabal would have been slaughtered with his household. Such was David's hurt sensibilities and fury. Had Abigail not interposed, grievous sin would have been committed by the Lord's anointed. But God mercifully intervened and David's hand was stayed. Nabal, meanwhile, was oblivious to the offence he had caused, and his close brush with the avenger's sword. He was feasting and drunk with wine, even as death's storm clouds swirled above his head.\n\nOn the morrow, when Abigail appraised him on all that had transpired, Nabal was so strickened by a heart attack or stroke that left him paralysed. Ten days later he was dead.\n\nNabal's heart of stone, when he was alive (so clearly manifested in his rebuff of David and his pitiless treatment of those needy men) was now requited by the Righteous Judge Himself. The body that was so luxuriously indulged before, became lifeless as stone. This often is the irony of divine justice. We disregard Him and reject His Law, believing it is for our good. Instead, we are just heaping treasures in bags with holes and storing wine in broken cisterns. We build greater barns to stow the fruits of carnal labour and make grand plans for tomorrow, all without God, unaware that tonight our soul will be required of us.\n\nBeware the unbelieving and rebellious heart of stone. Run to Jesus, plead with the Lord, and He will give you a new spirit within and take away the stony heart. In its place, He will give you a heart of flesh, tender and sensitive. Then, you will know true blessedness.\n\n<b>THOUGHT</b>\nA new heart also will I give you, and a new spirit will I put within you: and I will take away the stony heart out of your flesh, and I will give you an heart of flesh. And I will put My spirit within you, and cause you to walk in My statutes, and ye shall keep My judgements, and do them. - Ezekiel 36:26-27\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HOSEA 10&version=KJV\">HOSEA 10</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 14&version=KJV\">MATTHEW 14</a></b>",
    "15 OCTOBER": "<b><u>15 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 25:39-40&version=KJV\">1 Samuel 25:39-40</a>\n\n<b>LESSON</b>\nDavid's prayer\n\n<b>VERSE 39</b>\n<i>And when David heard that Nabal was dead, he said, Blessed be the LORD, that hath pleaded the cause of my reproach from the hand of Nabal, and hath kept his servant from evil: for the LORD hath returned the wickedness of Nabal upon his own head. And David sent and communed with Abigail, to take her to him to wife.</i>\n\nSurely David was stunned. So recently had he been on his way to kill Nabal, and he would have, but for Abigail's intercession. He would have spilt blood and stained his hands. Yet now he could lift up those hands thanking God for preventing the heinous murder from being committed, and for working out things for David's good. It reminded the presumptive king that vengeance belongs not to man but to the Lord [Deuteronomy 32:35]. It is His divine prerogative to avenge what needs avenging.\n\nDavid's heart was in tune with the Lord's. He recognised not only the enabling but also the staying hand of God at work throughout his life. He was a man who without reserve opened his heart to God in confession of sin, in crying for help, and now in acknowledging God's deliverance of His child from committing evil. Certainly, the hurt David felt from Nabal's insults would have dissipated once the heated temper cooled. But murder would have caused him remorse and regret long after.\n\nWhat about us? When assailed by life's circumstances and man's reproach for the Lord's cause, are we quick to doubt the faithfulness of God, swift to take offence and eager in desiring vengeance? Be reminded today that what God says, He will always do and His timing is always best. Trust Him to make all things right in His time and vindicate His name. Our part is to follow behind Him. If we act before He does, we act in foolish haste. David realised this so he wrote: \"The God of my mercy shall prevent me: God shall let me see my desire upon mine enemies\" [Psalm 59:10].\n\nBut when vindication comes, remember like David also to give God the thanks and praise.\n\n<b>THOUGHT</b>\nDearly beloved, avenge not yourselves, but rather give place unto wrath: for it is written, Vengeance is mine; I will repay, saith the Lord. - Romans 12:19\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HOSEA 11&version=KJV\">HOSEA 11</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 15&version=KJV\">MATTHEW 15</a></b>",
    "16 OCTOBER": "<b><u>16 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 25:41-42&version=KJV\">1 Samuel 25:41-42</a>\n\n<b>LESSON</b>\nDavid and Abigail\n\n<b>VERSE 42</b>\n<i>And Abigail hasted, and arose, and rode upon an ass, with five damsels of hers that went after her; and she went after the messengers of David, and became his wife.</i>\n\nNow that Abigail was widowed, David sought to have her for his wife and she agreed. Abigail was a woman of intelligence [25:3]. It is evident from her actions that she had what we today would call \"good EQ\". She also was endowed with beauty. Why a woman with her attributes would marry a nasty and evil character like Nabal we do not know. But why David would desire her for a wife is understandable.\n\nThe Bible narrative does not approve or promote polygamy. It simply mentions when it occurs. The scriptural mandate from the very beginning of creation [Genesis 1:27-28, 2:24] is crystal clear about the exclusive and monogamous marriage union of one man and one woman for life. Our Lord Jesus himself affirmed this when the Pharisees sought to entrap him with the issue of divorce [Matthew 19:3-9]. God's Word has not changed despite the changes in society's view of marriage over time.\n\nWhat the Old Testament narrative does however, is remind us that man at his greatest is still a sinner from Adam's fall, with a hardness of heart and proclivity to deviate from divine injunction, and do what is right in his own eyes. It is a condition that can only be countered and remedied by the grace and atoning righteousness of the Lord Jesus Christ - God's solution to mankind's sin - and the restraining and empowering work of the Holy Spirit, Who indwells the believer when he is born again in Christ. Only then can sin be conquered.\n\nIt was a happy ending for Abigail and we rightly should be glad for this wonderful outcome in her life.\n\n<b>THOUGHT</b>\n\"Oh, to grace how great a debtor, Daily I'm constrained to be. Prone to wander, Lord I feel it, Prone to leave the God I love. Here's my heart, oh, take and seal it, Seal it for Thy courts above.\" - R. Robinson\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HOSEA 12&version=KJV\">HOSEA 12</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 16&version=KJV\">MATTHEW 16</a></b>",
    "17 OCTOBER": "<b><u>17 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 25:43-44&version=KJV\">1 Samuel 25:43-44</a>\n\n<b>LESSON</b>\nDavid's other wives\n\n<b>VERSE 43</b>\n<i>David also took Ahinoam of Jezreel; and they were also both of them his wives.</i>\n\nDavid was married to Michal, Saul's daughter. He then took widowed Abigail to be his wife. Here Ahinoam the Jezreelite became his third wife. But these were not all. In 2 Samuel 3:3-5, we see four other wives David had - Maachah, Haggith, Abital and Eglah. These six wives bore him sons while David was in Hebron. Then David became king and moved to Jerusalem. There Bathsheba became one of his many wives. Thirteen sons were born to David by his wives in Jerusalem. Then 1 Chronicles 3:9 adds the sad commentary that David also had concubines.\n\nThe truth of God's Word does not whitewash the sins and misdeeds of even His most beloved and prominent servants. As we noted yesterday, polygamy is never prescribed, permitted or promoted by God. And wherever this practice is recorded for us in Scripture, a litany of contention and conflict ensuing not only from the wives, but also from their offspring invariably follows. It was so with Abraham and Jacob, and will be with David and Solomon. Success is often a precursor to sin. Pride is prejudicial to purity. The multiplication of David's wives and concubines was a direct violation of Deuteronomy 17:17. Whatever the motivation and reason for it, the unalterable fact is that God's law was contravened, and the consequences which followed would be negative, sometimes disastrous. It is only in God's mercy that things did not turn out more calamitous as a result of these repeated violations.\n\nThe enlightened laws of many nations today have resulted in polygamy being widely banned in modern day society. Nevertheless, even if it were not so, let the Christian always be ruled by God's higher law.\n\n<b>THOUGHT</b>\nGod always has our best interest and welfare at heart. In marriage, it is one man with one woman only. Read Matthew 19:4-9.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HOSEA 13&version=KJV\">HOSEA 13</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 17&version=KJV\">MATTHEW 17</a></b>",
    "18 OCTOBER": "<b><u>18 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 26:1&version=KJV\">1 Samuel 26:1</a>\n\n<b>LESSON</b>\nGibeah\n\n<b>VERSE 1</b>\n<i>And the Ziphites came unto Saul to Gibeah, saying, Doth not David hide himself in the hill of Hachilah, which is before Jeshimon?</i>\n\nGibeah, located in the territory of Benjamin, was the birthplace of Saul. When Saul became king, he ruled from Gibeah and made it his capital. During the period of the Judges, it was the site of an atrocity by some Benjamite men against the concubine of a journeying Levite [Judges 19]. In order to seek justice and revenge for the death of his concubine, he dismembered his concubine into twelve parts and sent one part to each tribe. This incited the wrath of the other eleven tribes against the tribe of Benjamin and triggered the great inter- tribal \"Benjamite War\" which almost resulted in the annihilation of the tribe of Benjamin and the destruction of the city of Gibeah.\n\nThe Levite taking on a concubine; the lack of hospitality for a foreign couple travelling at night; the willingness of the old Ephraimite man to offer his daughter and the Levite to offer his concubine to the Benjamite men to abuse while he slept the night through; and the dismemberment of his concubine; all demonstrated how deep into the dark abyss of sin the nation of Israel had sunk. Gibeah became emblematic of Israel's gross and cruel sensuality, often alluded to by the 8th Century B.C. prophets, Isaiah and Hosea [Hosea 9:9; 10:9], and remains to this day Israel's memorial of shame and evil.\n\nGibeah is a stern warning to all, that disobedience and forsaking God would surely result in dire consequences and disaster. Our heavenly Father has commanded us, \"Be ye holy; for I am holy\" [1 Peter 1:16]. Our duty is to \"fear God, and keep His commandments\" [Ecclesiastes 12:13].\n\n<b>THOUGHT</b>\nRighteousness exalteth a nation: but sin is a reproach to any people. - Proverbs 14:34\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HOSEA 14&version=KJV\">HOSEA 14</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 18&version=KJV\">MATTHEW 18</a></b>",
    "19 OCTOBER": "<b><u>19 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 26:1-4&version=KJV\">1 Samuel 26:1-4</a>\n\n<b>LESSON</b>\nHide and seek\n\n<b>VERSE 2</b>\n<i>Then Saul arose, and went down to the wilderness of Ziph, having three thousand chosen men of Israel with him, to seek David in the wilderness of Ziph.</i>\n\nDavid's success in war and his growing popularity did not please Saul. Instead of being grateful to David for saving Israel and defeating Israel's enemies on his behalf, Saul became increasingly jealous. To compound the problem, the popular folk song \"Saul hath slain his thousands and David his ten thousands\" became a great thorn in his flesh [1 Samuel 18:7-8]. Saul greatly feared David because it was evident that David was specially blessed by God, while the Spirit of God had departed from Saul himself, thus leaving him with no ability to rule as king.\n\nSaul's heart and mind became overwhelmed by yet more sins - hatred, anger, violence, and murder. \"Wrath is cruel, and anger is outrageous; but who is able to stand before envy?\" [Proverbs 27:4]. From then on, Saul embarked on an insane campaign to end David's life [1 Samuel 19 to 27]. For the next few years, David fled for his life as Saul pursued him all over the land, from towns into the wilderness, even hiding in caves as a fugitive. David's godliness and closeness to God was revealed to us during this time through his expressions of sorrow and joy, praise and petitions. He was ever confident of God's providence as he penned his psalms.\n\nIn contrast to Saul, we see in David, a man after God's own heart. He showed patience, love, forgiveness and spiritual insight. Presented with the opportunity to slay Saul [1 Samuel 24:6-7], David desisted for he revered God and yielded to His sovereignty [Psalm 105:15]. May the Lord grant us a heart like David's, ever faithful, seeking and trusting Him always.\n\n<b>THOUGHT</b>\nI waited patiently for the LORD; and He inclined unto me, and heard my cry. - Psalm 40:1\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JOEL 1&version=KJV\">JOEL 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 19&version=KJV\">MATTHEW 19</a></b>",
    "20 OCTOBER": "<b><u>20 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 26:5&version=KJV\">1 Samuel 26:5</a>\n\n<b>LESSON</b>\nAbner\n\n<b>VERSE 5</b>\n<i>And David arose, and came to the place where Saul had pitched: and David beheld the place where Saul lay, and Abner the son of Ner, the captain of his host: and Saul lay in the trench, and the people pitched round about him.</i>\n\nAbner was the important and able military commander under Saul and later David. He was the first cousin of Saul [1 Samuel 14:50] and therefore naturally loyal to, and trusted by, Saul. The successful campaigns of Saul's army extended the kingdom of the twelve tribes south to the Negev and westwards into Philistine land. It was during the campaign against the Philistines that Abner presented David to Saul [1 Samuel 17:55-58].\n\nAbner led Saul's army of three thousand in pursuit of David, and was also Saul's bodyguard. However, he was caught sound asleep beside Saul. David could easily have killed Saul but did not, for David would not touch the Lord's anointed. Abner failed in his most important duty as the king's bodyguard. Even his own life was endangered through his negligence but David also spared him.\n\nBeing complacent and falling into spiritual sleep will likewise render the believer useless for his Saviour King, endangering his own spiritual life. God's Word reminds us that we are in a constant spiritual battle \"against principalities, against powers, against the rulers of the darkness of this world, against spiritual wickedness in high places\" [Ephesians 6:12]. \"Be sober, be vigilant; because your adversary the devil, as a roaring lion, walketh about, seeking whom he may devour\" [1 Peter 5:8]. In these perilous times of apostasy, we are to be vigilant, and guard against false teachings making inroads into the church [2 Peter 2:1]. Where the church has fallen into spiritual slumber, it must be awakened and revived by the faithful preaching of God's Word [Hebrews 4:12,13] and repentance on the part of God's people [2 Chronicles 7:14].\n\n<b>PRAYER</b>\nRevive Thy work, O Lord, Dispel this sleep of death; Revive the slumbering members now, by Thy Almighty breath. - A. Midlane, edited Tow\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JOEL 2&version=KJV\">JOEL 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 20&version=KJV\">MATTHEW 20</a></b>",
    "21 OCTOBER": "<b><u>21 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 26:6-8&version=KJV\">1 Samuel 26:6-8</a>\n\n<b>LESSON</b>\nAbishai\n\n<b>VERSE 6</b>\n<i>Then answered David and said to Ahimelech the Hittite, and to Abishai the son of Zeruiah, brother to Joab, saying, Who will go down with me to Saul to the camp? And Abishai said, I will go down with thee.</i>\n\nAbishai was the son of Zeruiah, sister of David. He was loyal to David, having followed David in his flight from Saul. Of the six hundred men with David, he asked only two, Ahimelech and Abishai, to go with him to Saul's camp. Abishai promptly volunteered. This was clear testimony of Abishai's loyalty and courage. The intrusion into Saul's camp, even in the middle of the night, would be fraught with danger. Abishai was ready to risk his life for his lord. Throughout David's life, Abishai fought beside David against his enemies - the Philistines and Absalom's forces. In one of David's battles, Abishai rescued him by killing the Philistine giant Ishbibenob [2 Samuel 21:16-17]. When they found Saul sleeping soundly, Abishai wanted to kill him on the spot but stayed his hand in obedience to David. Abishai was a loyal courageous soldier, ever ready to follow and obey his leader and king.\n\nThe Apostle Paul, after his conversion was straightaway transformed into a faithful, courageous and obedient servant and soldier of his Master, Saviour and Lord Jesus. He shunned his pedigree, considered his worldly gains but loss and dung, to win and know Christ, pressing \"toward the mark for the prize of the high calling of God in Christ Jesus\" [Philippians 3:4-14], preaching the Gospel for the saving of souls, ready to die for his Master's cause [2 Timothy 4:6-8].\n\nEven as we are saved to be God's children, may He grant us faithfulness, courage and obedience, like Abishai and Paul, to follow His Son, our Lord and Saviour Jesus Christ.\n\n<b>PRAYER</b>\nTake my life and let it be, consecrated Lord to Thee. - Frances R. Havergal\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JOEL 3&version=KJV\">JOEL 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 21&version=KJV\">MATTHEW 21</a></b>",
    "22 OCTOBER": "<b><u>22 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 26:9-10&version=KJV\">1 Samuel 26:9-10</a>\n\n<b>LESSON</b>\nTouch not the Lord's anointed\n\n<b>VERSE 9</b>\n<i>And David said to Abishai, Destroy him not: for who can stretch forth his hand against the LORD'S anointed, and be guiltless?</i>\n\nDavid was named as a man after God's own heart. He honoured whatever the commandments of God were, well almost. David had been a threat to Saul for his kingship. Saul knew that his days were numbered, and David would replace him soon. For this reason, Saul tried all ways and means to kill him. He pursued David to every nook and corner of the wilderness. One night Saul, exhausted, rested sleeping on the hillside. Unknown to him, David was in the vicinity too. Here was an opportunity for David to get rid of his enemy. This was fortuitous timing, even God-sent it seemed. Accompanying David was Abishai who sought permission to kill Saul. However, David would not take the law into his own hands because Saul was God's anointed king.\n\nIn human terms, revenge is sweet and even seemingly justified. We may not kill physically but we have \"soft tools\" of killing. Our tongue can cause great harm and assassinate characters. We have social media at our disposal. It is easy to spread false news, gossip and make untruthful accusations. Spare a thought for the person whom we are harming. We should not find joy in destroying anyone. We will regret it because we will be guilty too in God's reckoning.\n\nWhat is the biblical solution for wrong committed against us? We are to forgive and pray. This will give us peace and lift us from carrying the burden of hatred. Once we have committed to the Lord, we should make right with the person and leave the matter with God. He will recompense.\n\n<b>THOUGHT</b>\nDearly beloved, avenge not yourselves, but rather give place unto wrath: for it is written, Vengeance is mine; I will repay, saith the Lord. - Romans 12:19\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=AMOS 1&version=KJV\">AMOS 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 22&version=KJV\">MATTHEW 22</a></b>",
    "23 OCTOBER": "<b><u>23 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 26:11-12&version=KJV\">1 Samuel 26:11-12</a>\n\n<b>LESSON</b>\nThe Lord's recompense\n\n<b>VERSE 11</b>\n<i>The LORD forbid that I should stretch forth mine hand against the LORD'S anointed: but, I pray thee, take thou now the spear that is at his bolster, and the cruse of water, and let us go.</i>\n\nSaul was the LORD's anointed. David noted that in granting the wish of the Israelites, God had commanded Samuel to anoint Saul as the first king of Israel. Thus, when opportunity arose for David to kill Saul, he gave him a warning instead, by taking away his spear and water bottle. David forgave Saul despite the tremendous hardship Saul caused him. He had faith that God would recompense because Saul's actions were in fact actions against God. David experienced the faithfulness of God though he was still a young man at this point in time. David knew that God was in control and would forever be. He did not dare to offend God by harming His anointed.\n\nGod anoints those whom He chooses and loves. He anoints kings but He also anoints us because of His grace through our Lord Jesus. What a privilege the Almighty Sovereign God extends to us! What should our response be? He makes the first move by His love to anoint us. In return we honour Him by obeying His commandment and laws.\n\nGod anointed Saul and David to the honour of being kings of Israel. What did they do to deserve that? Nothing. Like Saul and David, we have no merit and deserve nothing. But God anoints those who accept the Lord Jesus as their Saviour so that no harm shall come upon them when they die. Heaven is the assured destination for all the anointed ones. He has established a covenant with those who have the Lord Jesus in their hearts. This covenant is a promise that He reserves a place in Heaven for us.\n\n<b>THOUGHT</b>\nNow He which stablisheth us with you in Christ, and hath anointed us, is God. - 2 Corinthians 1:21\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=AMOS 2&version=KJV\">AMOS 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 23&version=KJV\">MATTHEW 23</a></b>",
    "24 OCTOBER": "<b><u>24 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 26:13-16&version=KJV\">1 Samuel 26:13-16</a>\n\n<b>LESSON</b>\nHumiliation of Abner\n\n<b>VERSE 16</b>\n<i>This thing is not good that thou hast done. As the LORD liveth, ye are worthy to die, because ye have not kept your master, the LORD'S anointed. And now see where the king's spear is, and the cruse of water that was at his bolster.</i>\n\nAbner was the cousin of King Saul and the commander-in-chief of his army [1 Samuel 14:50; 20:25]. He was with Saul when David caught them asleep. As a sign, David took Saul's spear and water bottle. Then David rebuked Abner for not performing his duty to protect the king. David chided Abner for his negligence and sleeping on the job.\n\nWhile we earn our living, we work diligently for our earthly master. However, we cannot earn eternal life no matter how hard we work. Our Lord Jesus has already redeemed us and offered this as a free gift to those who put their trust in Him. In gratitude for His love and redemption, it is only right that we serve Him in any way we can.\n\nDo our best in whatever capacity we serve. We may not be able to serve in areas we are not trained in, but we can serve in many other ways. Some jobs may be so small and duty so mundane that nobody notices. But God does. There is no work too small in His eyes. Be faithful to serve with hearts that aim to honour God. We are also to be vigilant to walk close to God. Do not sleep on the job as Abner did.\n\nThanks be unto God for watching over us at all times. We may have fallen asleep or have forgotten God but He is still with us. He is forever faithful. \"He will not suffer thy foot to be moved: He that keepeth thee will not slumber\" [Psalm 121:3].\n\n<b>THOUGHT</b>\nNot slothful in business; fervent in spirit; serving the Lord. - Romans 12:11\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=AMOS 3&version=KJV\">AMOS 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 24&version=KJV\">MATTHEW 24</a></b>",
    "25 OCTOBER": "<b><u>25 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 26:17-18&version=KJV\">1 Samuel 26:17-18</a>\n\n<b>LESSON</b>\nDavid's Rebuke\n\n<b>VERSE 18</b>\n<i>And he said, Wherefore doth my lord thus pursue after his servant? for what have I done? or what evil is in mine hand?</i>\n\nSaul had known perfectly well that David would be king [1 Samuel 24:20], but to preserve his own kingship and lineage, he hounded David, wanting to get rid of him. Here, as in a similar encounter to that in 1 Samuel 24, the hunter found himself at the mercy of the hunted. Notwithstanding, David spared Saul's life because he would not raise his hand against the Lord's anointed.\n\nWith a clear conscience, David put forth these questions to Saul in tender rebuke, suggesting it was both unbecoming of Saul and against his interest to persecute him. David was his servant, and would gladly have continued in his service to do his business, but Saul had driven him away and regarded him as a traitor when he was innocent of any offence.\n\nIn Divine providence, believers can be the victims of malicious plots to oust them, simply because he or she excels in performance or capability and becomes a threat to others. \"To every thing there is a season, and a time to every purpose under the heaven: ... a time to keep silence, and a time to speak\" [Ecclesiastes 3:1, 7]. When opportunity permits, we may speak and maintain our innocence.\n\nIt is natural to react, boil and blow up when untrue reports and false allegations are hurled at us but remember that \"the wrath of man worketh not the righteousness of God\" [James 1:20]. \"Wherefore let them that suffer according to the will of God commit the keeping of their souls to Him in well doing, as unto a faithful Creator\" [1 Peter 4:19] for we know the end of that man who trusts in Him - \"it is well with my soul!\"\n\n<b>THOUGHT</b>\nConsider 1 Peter 2:20-21.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=AMOS 4&version=KJV\">AMOS 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 25&version=KJV\">MATTHEW 25</a></b>",
    "26 OCTOBER": "<b><u>26 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 26:19&version=KJV\">1 Samuel 26:19</a>\n\n<b>LESSON</b>\nDavid's loss\n\n<b>VERSE 19</b>\n<i>Now therefore, I pray thee, let my lord the king hear the words of his servant. If the LORD have stirred thee up against me, let him accept an offering: but if they be the children of men, cursed be they before the LORD; for they have driven me out this day from abiding in the inheritance of the LORD, saying, Go, serve other gods.</i>\n\nDavid's argument in this exchange is stronger than their previous encounter in 1 Samuel 24:8. He appealed to reason and conscience, inviting Saul to join him in reflection about the persecution by the king and calling upon the Lord God to be their Judge and Witness. If guilty of offence, David would humbly submit, seek pardon and reconciliation. But if 'the children of men' had incited Saul to such animosity, David invoked the Lord's vengeance upon them.\n\nBeing persecution, David was driven from the land which God had given to His people for their inheritance, and where He had established His presence and worship. Such would be the message of the persecutors' actions - \"Go, serve other gods\". This troubled David more than the loss of physical comforts. To a mind so intensely God-centred as David's, not only was the private devotion of the heart a necessity, so too was the participation in corporate worship of the Lord [Psalm 42:2; 63:2; 84:2]. As the patriot feels the anguish of exile, so more keenly does a servant of God feel banishment by man from the fellowship and hallowed joys of the sanctuary.\n\nThe recent Covid-19 pandemic has literally \"banished us\" from the assembling of ourselves together for worship and fellowship. This painful denial of the privileges of corporate worship is a severe trial for godly men. Truly they will cry, \"How long?\" Our love for the house of God and for the communion of saints is a measure of the reality of our piety, even as mere religious professors will be thankful to be spared the drudgery of going through the motions in the house of worship.\n\n<b>THOUGHT</b>\nWhen I remember these things, I pour out my soul in me: for I had gone with the multitude, I went with them to the house of God, with the voice of joy and praise, with a multitude that kept holyday. - Psalm 42:4\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=AMOS 5&version=KJV\">AMOS 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 26:1-46&version=KJV\">MATTHEW 26:1-46</a></b>",
    "27 OCTOBER": "<b><u>27 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 26:20&version=KJV\">1 Samuel 26:20</a>\n\n<b>LESSON</b>\nSaul's loss\n\n<b>VERSE 20</b>\n<i>Now therefore, let not my blood fall to the earth before the face of the LORD: for the king of Israel is come out to seek a flea, as when one doth hunt a partridge in the mountains.</i>\n\nDavid likened Saul's pursuit of him to one hunting a flea, something so insignificant yet being sought at great cost and effort; just as a single partridge in the mountains being pursued at great expense when otherwise it would be too insignificant to be hunted at all in the fields since partridges are found in great flocks there. \"People in the east, in hunting the partridge and other game birds, pursue them till observing them becoming languid and fatigued, after they have been put up two or three times, they rush upon the birds stealthily and knock them down with bludgeons (Shaw's Travels). In like manner was Saul persecuting David; seeking him from time to time from his hiding-place, hoping to render him weary of his life or obtain an opportunity of accomplishing his destruction\" (Jamieson-Fausset- Brown Commentary).\n\nIt was Saul's detriment and loss that he was so consumed by his persecution of David. In so doing he suffered as much if not more than David - harbouring hatred, consumed by suspicion and fear, feeling threatened and perpetually possessed in his mind by the fruitlessness of all his efforts. It was perfect torture, taking away his joy, peace and confidence, and killing the benevolent spirit.\n\nMany a times, we lose our peace, joy and confidence in the Lord, and even our sleep, when we start thinking ill of others and justifying ourselves. This promotes self-righteousness and begets a censorious spirit. What does God's Word say? \"And above all things have fervent charity among yourselves: for charity shall cover the multitude of sins\" [1 Peter 4:8]. This is the effective remedy and a divine command.\n\n<b>THOUGHT</b>\nOne was asked what he gains by his consistent, regular praying to God; he paused a while, and then decided to tell of his loss - hot temper, impatience, evil thoughts ... etc.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=AMOS 6&version=KJV\">AMOS 6</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 26:47-75&version=KJV\">MATTHEW 26:47-75</a></b>",
    "28 OCTOBER": "<b><u>28 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 26:21-25&version=KJV\">1 Samuel 26:21-25</a>\n\n<b>LESSON</b>\n| have played the fool\n\n<b>VERSE 21</b>\n<i>Then said Saul, I have sinned: return, my son David: for I will no more do thee harm, because my soul was precious in thine eyes this day: behold, I have played the fool, and have erred exceedingly.</i>\n\nDavid's earnest and compelling appeal flashed a light of enlightenment in Saul and melted his hardened heart. Awakened, he saw his own folly and acknowledged his fault. At his first misstep, Saul had been rebuked by the prophet Samuel, \"Thou hast done foolishly\" [1 Samuel 13:13]. Now years later (and about 60 years of age) looking back upon his long course of disobedience and self-will, and more recently his persecution of David, Saul admitted, \"I have sinned ... Behold, I have played the fool, and have erred exceedingly.\"\n\nThese expressions of Saul do not appear to be the words of one truly penitent. Being enlightened and moved emotionally, he forbore from the pursuit of David but only for a time. Then, at the first offer of help from the Ziphites, he reverted to his old ways, seeking the life of Jesse's son [v. 1-2].\n\nInstances of superficial repentance followed by relapse and deterioration are not rare. Emotion cools and temptation presents itself, as when the Ziphites came to Saul and induced him to resume what he had renounced. So it happens to Christian converts who are changed only on the surface but not in the heart. They endure for a while but relapse under temptation, return to their old follies and sinful ways [2 Peter 2:22].\n\nThere is no sinner so hardened, but God gives him a ray of illumination now and then to show him his foolishness. And under its influence many a man, in reviewing his folly, has been constrained to make a similar confession - \"I have played the fool!\"\n\n<b>THOUGHT</b>\nStrong feelings are often fleeting and never become settled and permanent principles.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=AMOS 7&version=KJV\">AMOS 7</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 27&version=KJV\">MATTHEW 27</a></b>",
    "29 OCTOBER": "<b><u>29 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 26:21&version=KJV\">1 Samuel 26:21</a>\n\n<b>LESSON</b>\n| have erred\n\n<b>VERSE 21</b>\n<i>Then said Saul, I have sinned: return, my son David: for I will no more do thee harm, because my soul was precious in thine eyes this day: behold, I have played the fool, and have erred exceedingly.</i>\n\nSaul acknowledged the sin and folly of his conduct toward David in seeking his life and pursuing him when he had such a convincing proof of his sincerity and faithfulness. He requitted evil for good when David had demonstrated his affection and loyalty toward him, only cutting off the skirts of Saul's garment in the cave and sparing his life. Moved by David's kindness and feeling guilty about his malicious intent, he invited David to return and promised no more harm to him.\n\nAlthough here Saul acknowledged more than ever his folly and declared a change of heart, yet it would turn out that there was no true sense of sin and real repentance of it. Like Pharaoh, his guilty conscience forced out of him a reluctant confession (see Exodus 9:27) but there was no word of sorrow for his sin against God. He did not repent in deeds nor \"bring forth fruits meet for repentance\". Instead, soon afterwards he would renew his enmity toward David.\n\nThe most corrupt heart is capable of receiving good impressions and being touched by emotions. History and observation afford innumerable instances of this fact. Just the experience of such feelings is no certain evidence that the heart has been truly reformed and made right. And as the heart is, so will a man's actions be. Unless the tree is made good from the root, it is vain to expect good fruits of its branches.\n\n<b>THOUGHT</b>\nTo overcome evil with evil is human; to overcome good with evil is devilish; to overcome evil with good is divine.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=AMOS 8&version=KJV\">AMOS 8</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 28&version=KJV\">MATTHEW 28</a></b>",
    "30 OCTOBER": "<b><u>30 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 26:22-24&version=KJV\">1 Samuel 26:22-24</a>\n\n<b>LESSON</b>\nDivine justice and providence\n\n<b>VERSE 23</b>\n<i>The LORD render to every man his righteousness and his faithfulness; for the LORD delivered thee into my hand to day, but I would not stretch forth mine hand against the LORD's anointed.</i>\n\nDavid ended his speech with a prayer which comprised two parts. Firstly, it was an imprecatory prayer calling on God to give Saul his just rewards for dealing unrighteously and unfaithfully with David, despite David's God- honouring behaviour. Secondly, it was a petition to God to grant him protection, mercy and peace.\n\nThis prayer was spoken loudly and clearly for all of Saul's men and David's company to hear. Saul hunted David and sought to kill him. David had a clear chance to kill Saul and end his misery yet he would not do so much as lift a finger to harm him as Saul was God's appointed king. David implied that Saul ought to treat him in a similar way since Saul knew that David was the Lord's anointed too.\n\nDavid's thoughts and actions showed that he committed his life into God's hands. He would let God's plans take its course and would not resist the trials God sent into his life. David would not be overcome by evil desires but chose to overcome evil with good [Romans 12:21]. David had faith in the just and good God to protect and promote him to the throne of Israel at the right time. His faith in the all-wise God prevented him from fretting at God's apparent delay. May God give us strength and grace to bear the persecution and injustices committed against us and trust Him to deliver us from the trials we encounter, knowing that all these are brought into our lives for His glory.\n\n<b>THOUGHT</b>\nFor all things are for your sakes, that the abundant grace might through the thanksgiving of many redound to the glory of God. - 2 Corinthians 4:15\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=AMOS 9&version=KJV\">AMOS 9</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 1&version=KJV\">MARK 1</a></b>",
    "31 OCTOBER": "<b><u>31 OCTOBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 26:25&version=KJV\">1 Samuel 26:25</a>\n\n<b>LESSON</b>\nSaul's benediction\n\n<b>VERSE 25</b>\n<i>Then Saul said to David, Blessed be thou, my son David: thou shalt both do great things, and also shalt still prevail. So David went on his way, and Saul returned to his place.</i>\n\nSaul's error and unjust motives were laid bare before his men. David's godly behaviour and admonition of Saul had pricked his conscience, leading him to admit his sin.\n\nAt the close of the encounter, Saul delivered a benediction on David, calling on God to bless him and grant him success in his endeavours. It was an acknowledgement that David would take over the throne from Saul. This is strikingly similar to the earlier episode in Engedi when David spared Saul's life and Saul declared his submission to God's will for David to be king [1 Samuel 24:20].\n\nWicked men may show remorse when their sins are exposed and appear to repent of their wrongdoing. They may even praise the righteous acts of godly men and women and spout pious words but that does not win them salvation. The ungodly may admire believers for their obedience to God and desire to be holy, but they themselves fail to imitate the lives of believers. Therefore, they remain lost in sin and continue in their evil ways because their hearts are not regenerated.\n\nLet us take care that our lives shine for our Lord Jesus in this dark world of sin. May the love of Christ be evident in our lives so that unbelievers may see it and praise God. May the fruit of the Spirit be clearly seen in our dealings with others, so that even our enemies recognise God is with us and working through us. May God help us live lives that are a blessing to all we meet.\n\n<b>THOUGHT</b>\nJesus bids us shine, as we work for Him, bringing those that wander from the paths of sins, He will ever help us, if we shine, you in your small corner and I in mine. - Susan Warner\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=OBADIAH&version=KJV\">OBADIAH</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 2&version=KJV\">MARK 2</a></b>",
    "1 NOVEMBER": "<b><u>1 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 27:1&version=KJV\">1 Samuel 27:1</a>\n\n<b>LESSON</b>\nDavid's despair\n\n<b>VERSE 1</b>\n<i>And David said in his heart, I shall now perish one day by the hand of Saul: there is nothing better for me than that I should speedily escape into the land of the Philistines; and Saul shall despair of me, to seek me any more in any coast of Israel: so shall I escape out of his hand.</i>\n\nDavid was unconvinced by Saul's declaration of repentance and remorse. He did not have confidence in Saul's blessings either. David was sure Saul would resume his pursuit of him just as he did before.\n\nDavid knew he had to get out of Saul's reach but where could he go? David was scared, alone and vulnerable. He was in despair because he had been on the run for a long time now. He was easily recognised by everybody and Saul had an army tracking him, aided by spies throughout Israel. There did not appear to be anyone David could turn to for help or shelter. Even the men of Keilah, whom David and his band delivered from the Philistines, and the Ziphites would not give him refuge in their land. Who could have thought his fellow tribesmen of Judah would so treacherously expose him?\n\nUnder these dire circumstances, David decided to flee to the land of the Philistines. Saul would not pursue David there. It seemed like a masterstroke except David did not seek God's wisdom in making this decision. It is inexplicable that after all the mercies and protection God had afforded David and his company, he would suddenly feel he had to take matters into his own hands. Are we like David who forgot the blessings of God? Have we become so mired in despondency that we fail to seek God's wisdom and guidance in trying to solve our problems? May God teach us to trust Him no matter what our circumstances are.\n\n<b>THOUGHT</b>\nRest in the LORD, and wait patiently for Him: fret not thyself because of him who prospereth in his way, because of the man who bringeth wicked devices to pass. - Psalm 37:7\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JONAH 1&version=KJV\">JONAH 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 3&version=KJV\">MARK 3</a></b>",
    "2 NOVEMBER": "<b><u>2 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 27:2-3&version=KJV\">1 Samuel 27:2-3</a>\n\n<b>LESSON</b>\nLiving with the heathen\n\n<b>VERSE 2</b>\n<i>And David arose, and he passed over with the six hundred men that were with him unto Achish, the son of Maoch, king of Gath.</i>\n\nDavid was under tremendous strain, as he ran from Saul, and had to be responsible for the lives of 600 followers and their families. It must have been a logistical nightmare to provide food and safety for such a large group. The memory of the many instances where God mercifully protected David should have brought him comfort that the Almighty God could keep them safe in Israel. It seems simple enough for David to gather his people in prayer to seek God's grace and wisdom, but the long period of trial had been a severe test on David's faith and trust in God.\n\nWe read with dismay that David cracked under pressure and sought a quick and convenient solution by living among the heathen. It is ironic that David, who moments earlier had put his life in God's hands and sought God's deliverance from tribulation [1 Samuel 26:24], should forget God now. It seems so out-of-character for the man after God's own heart to behave like this.\n\nThis is a sober warning to us. The Bible records for us the stark truth that even the greatest of Israel's kings was not perfect. But the Word of God also records that in spite of David straying from God and acting on his own, God was compassionate and did not cast him away. God still drew David back with cords of love and blessed him. May God be merciful to us when we stray from Him, and draw us back to His fold.\n\n<b>THOUGHT</b>\nBut thou, O Lord, art a God full of compassion, and gracious, longsuffering, and plenteous in mercy and truth. O turn unto me, and have mercy upon me; give Thy strength unto Thy servant, and save the son of Thine handmaid. - Psalm 86:15-16\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JONAH 2&version=KJV\">JONAH 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 4&version=KJV\">MARK 4</a></b>",
    "3 NOVEMBER": "<b><u>3 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 27:5-7&version=KJV\">1 Samuel 27:5-7</a>\n\n<b>LESSON</b>\nGive a place\n\n<b>VERSE 5</b>\n<i>And David said unto Achish, If I have now found grace in thine eyes, let them give me a place in some town in the country, that I may dwell there: for why should thy servant dwell in the royal city with thee?</i>\n\nIt is ironic, and an indictment against King Saul, that David, the anointed one of Israel, should be running to their arch enemies for protection. David approached Achish and acknowledged his lowly state. He knew he had nothing to offer except being a person hated by Saul, enemy of Achish. He hoped to find favour in Achish's eyes so that the latter would give him a place to live. In seeming humility, he requested a town away from the royal city. It did however suit his purpose not to be living in Gath where he would be under strong influence of the Philistines, and his activities plainly visible to them.\n\nAchish believed David's words and gave him Ziklag to dwell in, which was about 20 km northwest of Beersheba (in southern Israel). Ziklag had belonged to Israel during the time of Joshua [Joshua 15:31]. That Ziklag fell to the Philistines since the time of Joshua, before being reclaimed at the time of the writing of 1 Samuel showed the failure in obedience of the tribes of Israel to God, Who had promised to be with them when they entered Canaan, and that they would be victorious.\n\nDavid sought the favour of an unbelieving pagan. Do we seek men's favour hoping for benefit more than we seek God's favour in our endeavours? Having oftentimes enjoyed God's faithfulness in spite of our faithlessness, are we driven to Him in humble prayer, seeking His will? Do we seem so caught up with His material blessings that we miss out on the far greater blessing of knowing Him intimately?\n\n<b>THOUGHT</b>\nWe miss out on the far greater blessing of knowing God more intimately and enjoying His presence, simply because we settle for less.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JONAH 3&version=KJV\">JONAH 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 5&version=KJV\">MARK 5</a></b>",
    "4 NOVEMBER": "<b><u>4 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 27:8-9&version=KJV\">1 Samuel 27:8-9</a>\n\n<b>LESSON</b>\nDavid's strategy\n\n<b>VERSE 9</b>\n<i>And David smote the land, and left neither man nor woman alive, and took away the sheep, and the oxen, and the asses, and the camels, and the apparel, and returned, and came to Achish.</i>\n\nDavid had asked for a town away from the royal city Gath, where he and his entourage would be free from Philistine influence. He would also be away from their prying eyes and be able to carry out his own plans, that is, raids into the surrounding territories.\n\nDavid led raiding parties against the surrounding inhabitants without the Philistines' knowledge. He did not leave any inhabitants alive, so there was no possibility of his exploits being relayed back to Achish. He also took the livestock and goods of the annihilated people, so his position would be enriched. His forays with his army of 600 were against the Geshurites, Gezrites and Amalekites, who had lived in that land for a long time. They were also not friends of the Philistines.\n\nThe Amalekites were descendants of Esau [Genesis 36:12]. They had heartlessly attacked the vulnerable stragglers at the rear of the Israelite exodus [Exodus 17:8-16] from Egypt. Moses before his death and their entry into Canaan reminded the Israelites of this cruel and barbaric deed. They were thus commanded by God to destroy the Amalekites [Deuteronomy 25:17-19] and never to forget this. Saul failed in this task [1 Samuel 15] and was thus rejected by God. David likely saw himself as carrying out God's will by completing this incomplete task. Whatever the case, God is true to His Word. He will always exact the punishment He says He will mete out.\n\n<b>THOUGHT</b>\nOur sins are too many for us to remember, but God never forgets. Only with the Lord Jesus Christ as our righteousness are we spared His wrath.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JONAH 4&version=KJV\">JONAH 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 6&version=KJV\">MARK 6</a>\n<a href=\"https://www.biblegateway.com/passage/?search=THOUGHT Our sins ate too many for us to remember, but&version=KJV\">THOUGHT Our sins ate too many for us to remember, but</a>\n<a href=\"https://www.biblegateway.com/passage/?search=God never forgets. Only with the Lord Jesus Christ&version=KJV\">God never forgets. Only with the Lord Jesus Christ</a>\n<a href=\"https://www.biblegateway.com/passage/?search=as out righteousness are we spared His wrath.&version=KJV\">as out righteousness are we spared His wrath.</a><a href=\"https://www.biblegateway.com/passage/?search=JONAH 4&version=KJV\">JONAH 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 6&version=KJV\">MARK 6</a></b>",
    "5 NOVEMBER": "<b><u>5 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 27:10-12&version=KJV\">1 Samuel 27:10-12</a>\n\n<b>LESSON</b>\nDavid's deception\n\n<b>VERSE 12</b>\n<i>And Achish believed David, saying, He hath made his people Israel utterly to abhor him: therefore he shall be my servant for ever.</i>\n\nAlthough David might have been sincere in obeying God, by executing His commanded judgement on the Amalekites and other heathen in the land, he was deceitful. He bore false witness to Achish, implying he was carrying out raids into the southern regions of Israel against his own people. Of course he had not turned against his own, but certainly created that impression with Achish by his ambiguous speech. In modern parlance, he was \"economical with the truth\" - he was lying. He was trusting his own carnal wisdom to lie, for fear of the consequences of being truthful.\n\nDavid appeared to be getting everything he wanted so far by his own wisdom. His move into Philistine territory got Saul off his back. His request for dwelling away from the idolatry in Gath allowed more freedom to practise his religion. His not sparing the lives of the vanquished also served his purpose, as word of his military exploits would not be brought to Gath. He lied to Achish to preserve his current state. Having things go our way does not mean God is pleased, even if we claim what we are doing is for Him. Only when we are living in obedience to God's will and command can we be certain He is pleased.\n\n\"Lying lips are abomination to the LORD: but they that deal truly are His delight\" [Proverbs 12:22]. The ends do not justify the means, especially when doing God's work. God's work must be done in God's way, which means obeying His every command. God commands we walk by faith and not by sight [2 Corinthians 5:7].\n\n<b>THOUGHT</b>\nGod's Word never whitewashes even His people's sins. Only the Lord Jesus Christ, the Son of God, is sinless and without guile.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=MICAH 1&version=KJV\">MICAH 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 7&version=KJV\">MARK 7</a></b>",
    "6 NOVEMBER": "<b><u>6 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 28:1-2&version=KJV\">1 Samuel 28:1-2</a>\n\n<b>LESSON</b>\nDavid's promotion\n\n<b>VERSE 2</b>\n<i>And David said to Achish, Surely thou shalt know what thy servant can do. And Achish said to David, Therefore will I make thee keeper of mine head for ever.</i>\n\nDavid's deceitful dealings would catch up with him. The Philistines were gathering for war against the Israelites. Achish knew David was a mighty warrior and had such confidence in his allegiance (due to David's deception) that he expressed his desire to promote David to be his personal bodyguard in the upcoming battle. What was David to do? He had received much goodwill and favour from Achish who was calling for repayment and his assistance in battling the Israelites. He was caught in a dilemma by his past lies and engaged in more double talk!\n\nThe Hebrew phrase \"thou shalt know what thy servant can do\", means \"if you place me in such a position, you shall see what I do\". David could either mean \"you know my fighting ability\" or \"you know what I am capable of in light of my being an Israelite who killed Goliath your champion previously\". It was an ambiguous reply and Achish took it to mean that David had been fighting the Israelites recently [1 Samuel 27:12]. David's lies had finally caught up with him.\n\n\"A false witness shall not be unpunished, and he that speaketh lies shall not escape\" [Proverbs 19:5]. Achish's plan to promote David was no blessing. Receiving promotion is no blessing when derived by dishonest means or when it works against God's people. The human heart can lie to us because it is deceitfully wicked. [Jeremiah 17:9]. Do not trust our heart or even man's smooth words. Trust only God's Word to check our thoughts, words and actions [Hebrews 4:12].\n\n<b>THOUGHT</b>\nThe righteousness of Thy testimonies is everlasting: give me understanding, and I shall live. - Psalm 119:144\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=MICAH 2&version=KJV\">MICAH 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 8&version=KJV\">MARK 8</a></b>",
    "7 NOVEMBER": "<b><u>7 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 28:3-6&version=KJV\">1 Samuel 28:3-6</a>\n\n<b>LESSON</b>\nConnection cut-off\n\n<b>VERSE 6</b>\n<i>And when Saul enquired of the LORD, the LORD answered him not, neither by dreams, nor by Urim, nor by prophets.</i>\n\nSamuel's death has already been mentioned earlier [1 Samuel 25:1] but is recorded again here. It is apparent the author is emphasizing the spiritual vacuum that has been created by his departure. This was especially so for king Saul, who sensed the loss very keenly because he really needed a godly adviser. Without him, Saul was experiencing great distress.\n\nThe Spirit of God had already left him and now his courage very much failed him too. He perceived his own life to be in danger. He had a sense that there was nothing he could hold on to. He began to enquire after God and though he seemed to show some respect and reverence for Him, in all this time his heart was far removed from Him.\n\nObviously, the connecting line had been severed. The silence demonstrates that God will not always answer everyone who seeks Him. When a man is in a place of judgement, he should not be expecting any answers for his prayers. Since Saul had rejected God's revealed will, God would not give him any more answers in spite of his much asking. Danger and distress can cause even a hardened sinner to be dismayed but that is usually all it amounts to. It is not real sorrow for one's sins.\n\nWe must learn to be sensitive and responsive to God's promptings in our lives. At no time should we shut our ears and hearts to the still small voice of God.\n\n<b>THOUGHT</b>\nAnd the LORD came, and stood, and called as at other times, Samuel, Samuel. Then Samuel answered, Speak; for Thy servant heareth. - 1 Samuel 3:10\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=MICAH 3&version=KJV\">MICAH 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 9&version=KJV\">MARK 9</a></b>",
    "8 NOVEMBER": "<b><u>8 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 28:7&version=KJV\">1 Samuel 28:7</a>\n\n<b>LESSON</b>\nSaul turned to witchcraft\n\n<b>VERSE 7</b>\n<i>Then said Saul unto his servants, Seek me a woman that hath a familiar spirit, that I may go to her, and enquire of her. And his servants said to him, Behold, there is a woman that hath a familiar spirit at Endor.</i>\n\nSaul in his earlier days as Israel's leader, had put away all those that practised witchcraft [v. 3]. Although there was clear teaching according to Divine command [Leviticus 20:27; Deuteronomy 18:10-11] that those who practised witchcraft should be cut off from the people of God, it was obvious that Saul did it only because he was under the guidance and influence of Samuel.\n\nIn these verses, Saul was desperate since God was not answering him, and Samuel was no longer around to advise him, so he turned to this forbidden means to seek direction. His own wickedness and spiritual emptiness drove him to seek recourse in one who spoke with the dead, who by the help of evil spirits foretold future events.\n\nFor Saul, it is sad that he was not surrounded by God-fearing servants who could dissuade him from resorting to such ungodly means. Instead his servants led him to a witch!\n\nTroubles and problems should never drive us away from the God of our life. If God is not answering us, then it may be that we have sinned and wandered from Him and His Word. The right thing to do is return to Him in sincerity, truthfulness and repentance, seeking His forgiveness for our sins.\n\n<b>THOUGHT</b>\nIs it not because there is not a God in Israel, that ye go to enquire of Baalzebub the god of Ekron? - 2 Kings 1:3b\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=MICAH 4&version=KJV\">MICAH 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 10&version=KJV\">MARK 10</a></b>",
    "9 NOVEMBER": "<b><u>9 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 28:7&version=KJV\">1 Samuel 28:7</a>\n\n<b>LESSON</b>\nFamiliar spirit\n\n<b>VERSE 7</b>\n<i>Then said Saul unto his servants, Seek me a woman that hath a familiar spirit, that I may go to her, and enquire of her. And his servants said to him, Behold, there is a woman that hath a familiar spirit at Endor.</i>\n\nThe commands in the Mosaic Law to cast out those who practise occultic arts are to be carefully and diligently observed. These mediums and spiritists claim the ability to communicate with the dead and spirit beings, and therefore should have no place among God's people. In fact, such were to be publicly executed and burnt so that nothing should remain of any of their abominations [Exodus 22:18; Deuteronomy 18:10-11].\n\nThe reason why they are so hateful to God is that these people are really under the influence of demons which are contrary to God's holiness. Those who deal with these spiritual beings, have become channels through which they can communicate between the worlds of the living and the dead. Saul was knowingly or unknowingly subjecting himself to the deception of these evil spirits. He was therefore surrendering and selling his soul in order to save his life.\n\nBelievers are warned not to meddle with unclean things such as tarot cards, palm readers, horoscopes and Ouija Boards, all of which are different forms of spiritism. They are dangerously associated with unseen demonic forces, even when undertaken in a spirit of fun. God's children should have nothing to do with these occult arts and practices.\n\nGod's people must take a stand against unseen evil forces. We are to constantly have on the armour of God and resist these spiritual enemies, and not yield to them by our complacency and indolence.\n\n<b>THOUGHT</b>\nPut on the whole armour of God, that ye may be able to stand against the wiles of the devil. - Ephesians 6:11\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=MICAH 5&version=KJV\">MICAH 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 11&version=KJV\">MARK 11</a></b>",
    "10 NOVEMBER": "<b><u>10 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 28:8-9&version=KJV\">1 Samuel 28:8-9</a>\n\n<b>LESSON</b>\nSaul's disguise\n\n<b>VERSE 8</b>\n<i>And Saul disguised himself, and put on other raiment, and he went, and two men with him, and they came to the woman by night: and he said, I pray thee, divine unto me by the familiar spirit, and bring me him up, whom I shall name unto thee.</i>\n\nIt was an adventurous and dangerous journey for Saul to make, yet he was insistent on making it. The village of Endor was located at the opposite end from Israel's camp. For him to reach it, he had to pass over the shoulder of the hill on which the Philistines were encamped. From there he had to traverse another 20 kilometres to where the witch lived.\n\nAs a matter of great urgency, Saul hastily garbed himself incognito, desperate to seek an answer from her. No matter how treacherous the journey was, he was determined to go ahead. And since they could not use the direct route, they must have passed through the army of the Philistines without them noticing. Saul and his men travelled by night, so as not to be discovered by their enemies.\n\nIt was in the night that this woman went about her occultic activities, and Saul had a major part in it. These are works of darkness that cannot come under the scrutiny of God's truth and even human conscience. Darkness and secrecy are analogous, and will usually necessitate the use of undignified and shameful means, carried out under the cover of night to conceal their deception.\n\nAs children of light, we must have nothing to do with the unfruitful works of darkness. Let us walk circumspectly in the light of God's Word so that we may bring light to those who dwell in darkness.\n\n<b>THOUGHT</b>\nBut if ye will not do so, behold, ye have sinned against the LORD: and be sure your sin will find you out. - Numbers 32:23\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=MICAH 6&version=KJV\">MICAH 6</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 12&version=KJV\">MARK 12</a></b>",
    "11 NOVEMBER": "<b><u>11 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 28:10&version=KJV\">1 Samuel 28:10</a>\n\n<b>LESSON</b>\nBending rules\n\n<b>VERSE 10</b>\n<i>And Saul sware to her by the LORD, saying, As the LORD liveth, there shall no punishment happen to thee for this thing.</i>\n\nNecromancy is a kind of divination which this witch was practising. She would claim the power to bring up a deceased person and consult them about secret and future things. But any message really did not emanate from the dead, but from lying spirits, who impersonated the dead person.\n\nUnfortunately, necromancy is still with modern men and women in the 21st century. Even the educated are not ashamed or afraid to engage casually in such demonic arts. They will consult \"mediums\" and their crystal balls for fortune and success. However, these are referred to in the Scriptures as something totally abhorrent to God and utterly forbidden for His people.\n\nHere Saul's oath in the name of the LORD was clearly an act of blasphemy and a direct act of disobedience against Him. An oath was something so sacred in those days, that one could entirely rely on it, and even venture one's life upon it. Thus, Saul's flippant use of God's name meant nothing. This is the last time that Saul would use the name of the LORD in the book of 1 Samuel. As far as God was concerned, he had taken the name of the LORD in vain and he would pay for it. And worse, he used it to swear to an accursed medium that she would not be punished!\n\nWe should never bend God's words to suit our sinful lifestyles and habits. Rather we must let His Word bend our wills and our hearts, so that we can live rightly before Him.\n\n<b>THOUGHT</b>\nBut let your communication be, Yea, yea; Nay, nay: for whatsoever is more than these cometh of evil. - Matthew 5:37\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=MICAH 7&version=KJV\">MICAH 7</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 13&version=KJV\">MARK 13</a></b>",
    "12 NOVEMBER": "<b><u>12 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 28:11-12&version=KJV\">1 Samuel 28:11-12</a>\n\n<b>LESSON</b>\nExposed by a witch\n\n<b>VERSE 12</b>\n<i>And when the woman saw Samuel, she cried with a loud voice: and the woman spake to Saul, saying, Why hast thou deceived me? for thou art Saul.</i>\n\nAlthough this woman was scared at first and refused her visitor's request, after much persuasion and assurances from him, she conceded. The imposing figure pledged that no risk or harm to her would be incurred by compliance to his request. And it is probable that his extraordinary stature, and the deference paid him by his attendants aroused her suspicion that this was an individual of royal stature. Moreover, his proposal to call up the great prophet and first magistrate of Israel, Samuel, confirmed her suspicion. No one had ever been closer to this great prophet than King Saul himself!\n\nThe witch was in a state of shock to see 'the prophet Samuel' standing in front of her. She received more than she had bargained for! Woe indeed to those who meddle with the forces of darkness in the spiritual realm. The witch of Endor was but an instrument of the devil.\n\nThere is a solemn record of Saul given in 1 Chronicles 10:13, \"So Saul died for his transgressions which he committed against the LORD, even against the Word of the LORD, which he kept not, and also for asking counsel of one that had a familiar spirit, to enquire of it.\" G. B. Winer has this to say about the end of Saul, \"It was a shame that the king who had expelled all sorcerers must himself at last fall into the hands of a sorceress.\"\n\nYet it is also true that the sorceress has also no power in her own hands. Both the king and the witch are but fools in great trouble.\n\n<b>THOUGHT</b>\nWherefore come out from among them, and be ye separate, saith the Lord, and touch not the unclean thing; and I will receive you. - 2 Corinthians 6:17\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=NAHUM 1&version=KJV\">NAHUM 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 14:1-42&version=KJV\">MARK 14:1-42</a></b>",
    "13 NOVEMBER": "<b><u>13 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 28:13-14&version=KJV\">1 Samuel 28:13-14</a>\n\n<b>LESSON</b>\nWas it Samuel?\n\n<b>VERSE 13</b>\n<i>And the king said unto her, Be not afraid: for what sawest thou? And the woman said unto Saul, I saw gods ascending out of the earth.</i>\n\nWhen Saul turned to the witch to call up departed Samuel for spiritual guidance against the Philistines, it raised eyebrows. Was it really Samuel who came back from the dead? There are at least two schools of thought.\n\nThe first - Samuel literally came back by God's sovereign intervention to bear bad news to rebellious Saul. This has exegetical support as the text says, \"Samuel spoke to Saul ...\" [v. 15, 16, 20]. If God could sovereignly open the donkey's mouth to speak to Balaam, He can well overrule in recalling Samuel from the dead even through the evil of necromancy. Furthermore, the plain words in the exchange suggest it was Samuel actually speaking with Saul.\n\nThe second - it was just an appearance of, but not Samuel himself. Firstly, the dead cannot return [2 Samuel 12:23; Luke 16:26]. Secondly, necromancy is condemned by God [Deuteronomy 18:11-12a]. God will not commit that which He explicitly forbids. Thirdly, in his desperate and distressed state of mind, Saul under the influence of the witch's words only perceived he saw Samuel [v. 13-14]. Comparing Scripture with Scripture supports what Saul saw was not the actual person.\n\nIn consideration of these two positions, the Westminster Confession of Faith Chapter I.9 - \"Of the Holy Scripture\" states, \"The infallible rule of interpretation of Scripture is the Scripture itself: and therefore, when there is a question about the true and full sense of any Scripture (which is not manifold, but one), it must be searched and known by other places that speak more clearly.\" Scripture speaks plainly; God forbids all practices of witchcraft. As God's people, we are to abstain from all these works of darkness.\n\n<b>THOUGHT</b>\nFor rebellion is as the sin of witchcraft, and stubbornness is as iniquity and idolatry. - 1 Samuel 15:23a\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=NAHUM 2&version=KJV\">NAHUM 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 14:43-72&version=KJV\">MARK 14:43-72</a></b>",
    "14 NOVEMBER": "<b><u>14 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 28:15-16&version=KJV\">1 Samuel 28:15-16</a>\n\n<b>LESSON</b>\nGod's Enemy\n\n<b>VERSE 16</b>\n<i>Then said Samuel, Wherefore then dost thou ask of me, seeing the LORD is departed from thee, and is become thine enemy?</i>\n\nSaul was trying to justify his visit to the witch by blaming God for not answering his prayers. The reasons he gave [v. 15] for calling up Samuel for guidance were met with his reply [v. 16] - It is pointless asking because you know God has turned from you and become your enemy. The circumstances by which Saul became the enemy of the Lord did not begin here in verse 16. All along Saul was harbouring an attitude of arrogance toward Samuel - envy, anger and hatred towards David and disobedience to God's Word. These show that Saul was not a believer at heart though he sounded like one by using God's name. Not everyone who professes and calls the Lord's name is a genuine believer [Matthew 7:21]. The Bible tells us all mankind are sinners separated from God and doomed for eternal judgement. \"But God commendeth His love toward us, in that, while we were yet sinners, Christ died for us\" [Romans 5:8]. But while we were yet enemies, God's love worked in us repentance and faith in Christ. As a result, Romans 5:10 says, \"For if, when we were enemies, we were reconciled to God by the death of His Son, much more, being reconciled, we shall be saved by His life.\" What a sobering thought that if a person rejects God, he becomes an enemy of God. However, if you truly turn to Christ, your relationship changes from an enemy to one dearly beloved. \"But as many as received Him, to them gave He power to become the sons of God, even to them that believe on His name\" [John 1:12].\n\n<b>THOUGHT</b>\nWhat shall we then say to these things? If God be for us, who can be against us? - Romans 8:31\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=NAHUM 3&version=KJV\">NAHUM 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 15&version=KJV\">MARK 15</a></b>",
    "15 NOVEMBER": "<b><u>15 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 28:17-19&version=KJV\">1 Samuel 28:17-19</a>\n\n<b>LESSON</b>\nReason for Saul's downfall\n\n<b>VERSE 18</b>\n<i>Because thou obeyedst not the voice of the LORD, nor executedst His fierce wrath upon Amalek, therefore hath the LORD done this thing unto thee this day.</i>\n\n1Samuel 15:1-35 provides one of the reasons for Saul's downfall. Amalek was under God's judgement for what they did to Israel. Saul was told then, \"Go and utterly destroy the sinners the Amalekites, and fight against them until they be consumed\" [1 Samuel 15:18]. But Saul disobeyed. He kept the best of the sheep and oxen and spared Agag their king. When confronted by Samuel for his disobedience, Saul insisted he had obeyed and blamed the people for keeping the livestock for sacrifices unto the Lord. When he realised that Samuel was unimpressed with his alibi, \"Then he said, I have sinned: yet honour me now, I pray thee, before the elders of my people, and before Israel, and turn again with me, that I may worship the LORD thy God\" [1 Samuel 15:30].\n\nSaul was more concerned with his standing before men than before God. How he appeared in the eyes of men was more important to him than how God sees him. But what does the Lord say to people with such attitudes? \"How can ye believe, which receive honour one of another, and seek not the honour that cometh from God only?\" [John 5:44]\n\nThe reason for the fall of Saul is partial obedience, which in God's sight is as the sin of disobedience. We cannot bargain with God about being more or less obedient. We either obey fully or disobey God's Word. There is no middle ground. We cannot substitute obedience with sacrifices of offerings, good deeds, our giving, as though these can excuse us from obeying what God tells us to do in His Word. Neither can we trade obedience with self-justification as Saul did.\n\n<b>THOUGHT</b>\nAnd Samuel said, Hath the LORD as great delight in burnt offerings and sacrifices, as in obeying the voice of the LORD? Behold, to obey is better than sacrifice, and to hearken than the fat of rams. - 1 Samuel 15:22\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HABAKKUK 1&version=KJV\">HABAKKUK 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 16&version=KJV\">MARK 16</a></b>",
    "16 NOVEMBER": "<b><u>16 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 28:20-21&version=KJV\">1 Samuel 28:20-21</a>\n\n<b>LESSON</b>\nThe voice of man\n\n<b>VERSE 21</b>\n<i>And the woman came unto Saul, and saw that he was sore troubled, and said unto him, Behold, thine handmaid hath obeyed thy voice, and I have put my life in my hand, and have hearkened unto thy words which thou spakest unto me.</i>\n\nFollowing the death of Samuel, Israel again came under the attack of the Philistines. Saul was terrified. But instead of turning to God in repentance for his sins, Saul accused Him of not answering his prayers. We see the traits of a person who does not know God. This becomes clear when we compare him with one who knows the Lord - David. When David felt that God had hidden His face from him because of his sins, he cried out to the LORD even more as in Psalm 13:1-6 and ended up singing unto the LORD. The sad thing is that Saul did not treasure the voice of the LORD. Instead, he sought the voice of a medium, to hear the voice of departed Samuel.\n\nWhat about the woman had obeyed Saul in carrying out the sinful craft of necromancy? Realising that Saul was king of Israel and seeing him filled with much fear, it is not without reason that the voice of Saul aroused fear that he might kill her.\n\nWe hear many voices today. These voices are man's opinion of their values and belief system. There is another voice from the Word of God, which is of a great difference. Man's voice expresses his sin nature of self-will and self-glory that leads to death. Romans 6:23 tells us, \"For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord.\"\n\nGod's voice is Life. Jesus said, \"My sheep hear My voice, and I know them, and they follow Me\" [John 10:27]. May the voice of God calm and strengthen you.\n\n<b>THOUGHT</b>\nAnd other sheep I have, which are not of this fold: them also I must bring, and they shall hear My voice; and there shall be one fold, and one shepherd. - John 10:16\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HABAKKUK 2&version=KJV\">HABAKKUK 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 1:1-38&version=KJV\">LUKE 1:1-38</a></b>",
    "17 NOVEMBER": "<b><u>17 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 28:22-25&version=KJV\">1 Samuel 28:22-25</a>\n\n<b>LESSON</b>\nSpiritual void\n\n<b>VERSE 25</b>\n<i>And she brought it before Saul, and before his servants; and they did eat. Then they rose up, and went away that night.</i>\n\nWhen Saul heard of his impending defeat and death at the hands of the Philistines, his reaction was pathetic. Verse 20 reads, \"Then Saul fell straightway all along on the earth, and was sore afraid, because of the words of Samuel: and there was no strength in him; for he had eaten no bread all the day, nor all the night.\" Seeing how utterly terrified and exhausted Saul was, the medium begged him to take some food. She went on to prepare a meal fit for a king - a fatted calf and unleavened bread. It was meant to comfort Saul in the face of disaster. Saul had no appetite but finally was persuaded to partake, after which he rose and went away that night.\n\nThe word 'night' paints a gloomy picture of the spiritual darkness and deadness of an unbeliever's soul. That was the plight of Judas Iscariot on the night he betrayed the Lord Jesus. He \"went immediately out: and it was night\" [John 13:30]. The sumptuous meal and compassion of the woman for Saul could not alleviate the terror of death and separation from God.\n\nMan without God is spiritually dead in trespasses and sins [Ephesians 2:1]. No matter what he does to fill the emptiness of his heart, there is no peace. No amount of human care, comfort, merry-making can provide relief for his restless soul. Proverbs 14:13 tells us, \"Even in laughter the heart is sorrowful; and the end of that mirth is heaviness.\" Jesus says, \"Come unto Me, all ye that labour and are heavy laden, and I will give you rest\" [Matthew 11:28]. Would you turn to Jesus and find rest for your soul?\n\n<b>PRAYER</b>\nThou hast made us for Thyself, O Lord, and our heart is restless until it finds its rest in Thee. - Augustine of Hippo\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HABAKKUK 3&version=KJV\">HABAKKUK 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 1:39-80&version=KJV\">LUKE 1:39-80</a></b>",
    "18 NOVEMBER": "<b><u>18 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 29:1-2&version=KJV\">1 Samuel 29:1-2</a>\n\n<b>LESSON</b>\nBattle between Philistines and Israelites\n\n<b>VERSE 2</b>\n<i>And the lords of the Philistines passed on by hundreds, and by thousands: but David and his men passed on in the rearward with Achish.</i>\n\nThe event recorded here follows from chapter 27. Israel was at war with the Philistines. Under pursuit by king Saul with his personal vendetta and who wanted him dead, David with his men crossed over to the Philistine king of Gath, Achish. Unlike the other Philistine princes, Achish permitted David to stay with him. In return for that favour, David routed the Philistines' troublesome foes [1 Samuel 27:8, 12]. That convinced Achish that David was trustworthy and allowed him to be near his side. But that preference stood out like a sore thumb among the other Philistine lords.\n\nThe stage was set for a showdown between the Philistines and Israel [v. 1]. As the Philistine chiefs led their vast army, David and his men took up the rear position with Achish. It is hard to imagine Israelite soldiers serving under the same banner of the Philistines. Sooner or later their differences (in appearance, armory and armaments) would be noticed and questions of security and loyalty would be raised. In such a situation, what can we learn about being different?\n\nThe Bible tells us that when in response to God's saving grace we turn to Christ, we are delivered from darkness and brought into the light of everlasting life. God sets us apart for Himself. He transforms us into the image of Christ through life's circumstances. Meanwhile we are in the world but not of the world. Inevitably we find ourselves among the unsaved. We need to trust God for wisdom and grace to continue to be true to Him and be ready always to give an answer for our faith.\n\n<b>PRAYER</b>\nOur Lord Jesus prayed for His own. \"I have given them Thy Word; and the world hath hated them, because they are not of the world, even as I am not of the world\" [John 17:14].\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=ZEPHANIAH 1&version=KJV\">ZEPHANIAH 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 2&version=KJV\">LUKE 2</a></b>",
    "19 NOVEMBER": "<b><u>19 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 29:3&version=KJV\">1 Samuel 29:3</a>\n\n<b>LESSON</b>\nDoubts about David\n\n<b>VERSE 3</b>\n<i>Then said the princes of the Philistines, What do these Hebrews here? And Achish said unto the princes of the Philistines, Is not this David, the servant of Saul the king of Israel, which hath been with me these days, or these years, and I have found no fault in him since he fell unto me unto this day?</i>\n\nThe Philistines who gathered to make war with Israel had grave doubts about David. He was an Israelite who previously held high position in King Saul's court. They were wondering if he would turn on them during the heat of the battle.\n\nAchish, a Philistine king, however had nothing but positive things to say about David. Ever since David came into his service, Achish had found no fault in him, and therefore had absolutely no reason to think that David would be disloyal and betray them. This is an example we can learn from as well.\n\nAs Christians, there will be times when we are alienated from the world. In the work environment, with a culture of cutting corners or compromising on safety in order to maximise profitability, our superiors may doubt if we can achieve the company targets set. Like David, we should aim to be good employees who are able to achieve the high standards set for us without resorting to sin. God willing, this will not just put to rest any doubts that others have about our ability to perform, but also serve to give glory to God as those who work with us can find no fault and cause for offense.\n\nLet us endeavour to maintain good testimonies wherever we go, so that any who doubts may be put to rest by our actions and conduct. \"Do all things without murmurings and disputings: that ye may be blameless and harmless, the sons of God, without rebuke, in the midst of a crooked and perverse nation, among whom ye shine as lights in the world\" [Philippians 2:14-15].\n\n<b>THOUGHT</b>\nBehold, I send you forth as sheep in the midst of wolves: be ye therefore wise as serpents, and harmless as doves. - Matthew 10:16\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=ZEPHANIAH 2&version=KJV\">ZEPHANIAH 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 3&version=KJV\">LUKE 3</a></b>",
    "20 NOVEMBER": "<b><u>20 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 29:4-5&version=KJV\">1 Samuel 29:4-5</a>\n\n<b>LESSON</b>\nDistrust of David\n\n<b>VERSE 4</b>\n<i>And the princes of the Philistines were wroth with him; and the princes of the Philistines said unto him, Make this fellow return, that he may go again to his place which thou hast appointed him, and let him not go down with us to battle, lest in the battle he be an adversary to us: for wherewith should he reconcile himself unto his master? should it not be with the heads of these men?</i>\n\nEven though David presented a blameless testimony to those whom he had direct contact with, there were others who were biased against him because he was a Hebrew. They had good and rational reasons for their caution - perhaps by betraying them, David would be able to regain Saul's favour and return to Israel in triumph.\n\nIn the world today, we often face similar situations. Despite our good testimony, we may have colleagues who undermine our work and attack our credibility. Perhaps they seek faster career advancement, perhaps they genuinely misunderstand our intentions, or maybe they just disagree with the ideas we put forth. Whatever the reasons, it is normal for us to be discouraged by their rejection. However, let us remember that these rejections are all within God's sovereign control and His perfect plan. We can continue to encourage ourselves in the Lord and remember that His will for us is best.\n\nDavid was certainly most relieved when the Philistines turned him away from the battle despite the vote of confidence from Achish. This rejection meant that God had orchestrated events such that he would be spared from battle against his fellow Israelites. As we look back on times when our plans have been thwarted, let us seek to examine those occasions from a higher perspective. Were we thus spared from having to make some difficult and possibly sinful decisions?\n\n<b>THOUGHT</b>\nMany things about tomorrow, I don't seem to understand. But I know Who holds tomorrow, and I know Who holds my hand. - Ira Stanphill\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=ZEPHANIAH 3&version=KJV\">ZEPHANIAH 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 4&version=KJV\">LUKE 4</a></b>",
    "21 NOVEMBER": "<b><u>21 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 29:6-8&version=KJV\">1 Samuel 29:6-8</a>\n\n<b>LESSON</b>\nPretence of David\n\n<b>VERSE 8</b>\n<i>And David said unto Achish, But what have I done? and what hast thou found in thy servant so long as I have been with thee unto this day, that I may not go fight against the enemies of my lord the king?</i>\n\nImagine David the great pretender! Inwardly he was very pleased with the decision made by the lords. Outwardly, David protested his disappointment at not being allowed to join them in battle. This is so unlike David. As believers, we must always say what we mean and mean what we say.\n\nIn the first place, David had put himself in this potential predicament. He had forsaken the land of Judah where God had placed and protected him [I Samuel 22:5]. By doing so, he put himself in the hands of the Philistines. Hence, he had to pretend a willingness to fight against his own people. He had gotten himself out of the frying pan but was now at risk of falling into the fire.\n\nDavid even had the audacity to ask Achish for the reason after serving him well. He knew Achish was pleased with his service, albeit for a short time only. \"David's answer is subtle and prevaricating; he pretends that his honour has been attacked, when really he had tricked the unsuspecting Achish\" [Pulpit Commentary].\n\nOf course, this was God's provision for David to eventually return to his own people. God was in control all along, providing the means of escape for him. With great irony, David's way out was explained step by step by Achish himself. That shows how well our loving Lord takes care of His children. Our safe-keeping is always secure in God alone. He is always consistent and reliable in every way.\n\n<b>THOUGHT</b>\nA double minded man is unstable in all his ways. - James 1:8\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HAGGAI 1&version=KJV\">HAGGAI 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 5&version=KJV\">LUKE 5</a></b>",
    "22 NOVEMBER": "<b><u>22 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 29:9-11&version=KJV\">1 Samuel 29:9-11</a>\n\n<b>LESSON</b>\n\"An angel of God\"\n\n<b>VERSE 9</b>\n<i>And Achish answered and said to David, I know that thou art good in my sight, as an angel of God: notwithstanding the princes of the Philistines have said, He shall not go up with us to the battle.</i>\n\nSo Achish gave David the reason why he was asked to return from the coming battle. The decision of the princes was prudent. Of course, their first thought was for their own people. Hence, they insisted that David would not be allowed to join them in their battle against Israel.\n\nThese few verses show Achish's loving concern for David's safety. Not only did he appreciate David's service under him, Achish also learnt about David's God. The term 'an angel of God' reveals his knowledge of some of the attributes of God.\n\nAchish recognised and acknowledged David for his great wisdom, graceful behaviour, and inoffensive carriage. Though Achish was a king, he was outnumbered in the vote against David to fight alongside the Philistines. He then instructed David to depart the next day with all his men. This was just as well, in case the Philistine lords should change their minds and force these Israelites to join them in battle.\n\nWe can learn from the kindness of Achish, to see the good in others and do our best to help them when given the opportunity. As disciples of our Lord, we must show a good example to others. David was only a short time with Achish, yet the heathen was impressed by David's behaviour. Let us be consistent in our conduct so that others may realise that we are believers.\n\n<b>THOUGHT</b>\nAs we have therefore opportunity, let us do good unto all men, especially unto them who are of the household of faith. - Galatians 6:10\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=HAGGAI 2&version=KJV\">HAGGAI 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 6&version=KJV\">LUKE 6</a></b>",
    "23 NOVEMBER": "<b><u>23 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 30:1-2&version=KJV\">1 Samuel 30:1-2</a>\n\n<b>LESSON</b>\nCrisis at Ziklag\n\n<b>VERSE 1</b>\n<i>And it came to pass, when David and his men were come to Ziklag on the third day, that the Amalekites had invaded the south, and Ziklag, and smitten Ziklag, and burned it with fire.</i>\n\nDavid was mercifully spared the dilemma of making war against his own people, Israel. However, on arriving back in Ziklag with his men, he faced another crisis. The Amalekites had invaded in their absence and smitten his home base, earlier given him by Achish [1 Samuel 27:6]. Worse still, they had kidnapped all their families. It seemed he had been delivered out of the frying pan and put into the fire.\n\nIn our earthly sojourn, we sometimes feel that way. Different stresses of life pile up and it seems like we narrowly escape one difficult situation only to end up facing another. At times, we even feel indignant that God allows us to encounter so many \"trials of life\". Perhaps we may be tempted to ask, \"Why does God allow bad things to happen to good people (like me)?\" Let us realise we have absolutely no right to feel this way.\n\nSome trials are of our own making, just as how David had almost landed himself in battle with his own people. In the first place, he had chosen to seek refuge in Philistine territory and deceive the Philistines into thinking that he had been making raids on his own former countrymen. Second, we have no right to call ourselves good - \"there is none that doeth good, no, not one\" [Romans 3:12b]. Third, trials may be sent by God to try us and refine us [Job 23:10]. Through them, we learn to encourage ourselves in God and experience what it means for all things to work together for good.\n\n<b>THOUGHT</b>\nWhat is my attitude towards God in times of crisis? Do I flee to Him or flee from Him?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=ZECHARIAH 1&version=KJV\">ZECHARIAH 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 7&version=KJV\">LUKE 7</a></b>",
    "24 NOVEMBER": "<b><u>24 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 30:3-5&version=KJV\">1 Samuel 30:3-5</a>\n\n<b>LESSON</b>\nDiscouragement\n\n<b>VERSE 4</b>\n<i>Then David and the people that were with him lifted up their voice and wept, until they had no more power to weep.</i>\n\nDavid's men were utterly discouraged. After a three-day march back to Ziklag, they found the city raided and ravaged. They had lost everything they held dear - not only were their material possessions looted, even their families had been taken away from them. There was great outpouring of grief. After all their tears were spent, David's people were left directionless.\n\nIt is human to be discouraged when we lose prized possessions or, even worse, when we lose people we hold dear to us. However, after these strong emotions pass, perhaps it is a good time for us to consider if these possessions or loved ones had become distractions in our walk with God. If our loss has caused us to feel discontentment with God, or to begin doubting His goodness, then it may be that they have become idols in our lives. Family is important. However, more important than family is our heavenly Father [Matthew 10:37- 38]. As we process our emotions when dealing with loss, let us remember to humbly submit to His will, and accept that His way is best.\n\nWe must not lose sight that even when it feels as though we have absolutely nothing left in this world, we still have our God. As Christians, we have chosen that good part, which shall not be taken away from us [Luke 10:42]. We may go through difficult seasons of grief. However, as we turn our eyes away from our loss to our Lord Jesus Christ, we will find ourselves being encouraged in Him.\n\n<b>THOUGHT</b>\nAm I overly careful and troubled about many things? - Luke 10:41\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=ZECHARIAH 2&version=KJV\">ZECHARIAH 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 8&version=KJV\">LUKE 8</a></b>",
    "25 NOVEMBER": "<b><u>25 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 30:6&version=KJV\">1 Samuel 30:6</a>\n\n<b>LESSON</b>\nDavid's personal setback\n\n<b>VERSE 6</b>\n<i>And David was greatly distressed; for the people spake of stoning him, because the soul of all the people was grieved, every man for his sons and for his daughters: but David encouraged himself in the LORD his God.</i>\n\nAs leader of his men, David had even more reason to be distressed. Not only had he suffered the personal loss of his wives and possessions, he also bore responsibility for being the one who caused his men to suffer the loss of their families and possessions. As their leader, he had failed in his responsibility to care for his people. In their grief, his men began to think of stoning him. They felt that David's decisions were responsible for their loss, and they blamed him.\n\nWhen David's troops had been prospering in Ziklag, David's decisions seemed wise and good. Yet now that they had experienced a setback, it was all David's fault. In life, we are prone to be like David's men. When life proceeds well and the economy prospers, the dissent expressed over the actions of those in positions of authority over us is rather minimal. Yet, when things take a turn for the worse, more and more complaints come out of the woodwork, even though our leaders have been similarly affected.\n\nAs people who are the salt and light of the Earth, let us consider how we react both in good and bad times. Do we encourage our church leaders and our political leaders or do we add to their grief ? In good times, do we bother to pray for them and send them words of encouragement? Let us remember to show love, for our God is a God of love.\n\n<b>THOUGHT</b>\nWhen was the last time I prayed for my church leaders?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=ZECHARIAH 3&version=KJV\">ZECHARIAH 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 9&version=KJV\">LUKE 9</a></b>",
    "26 NOVEMBER": "<b><u>26 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 30:6&version=KJV\">1 Samuel 30:6</a>\n\n<b>LESSON</b>\nDavid's remedy for discouragement\n\n<b>VERSE 6</b>\n<i>And David was greatly distressed; for the people spake of stoning him, because the soul of all the people was grieved, every man for his sons and for his daughters: but David encouraged himself in the LORD his God.</i>\n\nUnlike his men who resorted to blame and violence when things started to fall apart, David sought encouragement from a different source. He looked away from the material and turned to the eternal God. He reminded himself that Jehovah was his God, and just as He had seen David through all his past difficulties and dangers, and had proven Himself ever faithful, He would see David through this time as well.\n\nThis is a good lesson. First, it reminds us to be thankful in all circumstances. As we recall God's blessings and mercies toward us, we begin to develop a keener sense of how God has been graciously sustaining us throughout our lives. In turn, this greater awareness and recognition of God's hand in our lives serves to encourage our faith that God will continue to see us through our present circumstances.\n\nSecondly, when we look to God, it prevents us from committing sin. David's troops sinned in thought and word as they considered stoning their leader. Perhaps, we too may be tempted to speak rashly, to murmur against God, or even act foolishly during times of crisis. David looked to God and did not sin.\n\nFinally, David's looking to God reminds us not to trust in our own problem-solving abilities, but to rely on God's guidance. When crisis occurs, we often develop a \"fire-fighting\" mindset, rushing headlong into the fire at our own peril, and forgetting God, our great Deliverer.\n\n<b>THOUGHT</b>\nDo I rely on God or do I rely on my own strength?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=ZECHARIAH 4&version=KJV\">ZECHARIAH 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 10&version=KJV\">LUKE 10</a></b>",
    "27 NOVEMBER": "<b><u>27 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 30:7-8&version=KJV\">1 Samuel 30:7-8</a>\n\n<b>LESSON</b>\nDavid's prayer\n\n<b>VERSE 8</b>\n<i>And David enquired at the LORD, saying, Shall I pursue after this troop? shall I overtake them? And He answered him, Pursue: for thou shalt surely overtake them, and without fail recover all.</i>\n\nDavid was greatly distressed. Ziklag had been ransacked and burned, and the populace carried away. He wept, overwhelmed by shock and grief. Adding to his sorrow was the determined effort of his men, who had also lost their loved ones, to stone him. Circumstances were against David, but he turned to God Who had never failed him and from Whom he had for a time departed. Like David, we may say, \"Before I was afflicted, I went astray, but now have I kept Thy Word\" [Psalm 119:67].\n\nStrengthening himself in the LORD his God, he summoned Abiathar the priest to bring the sacred ephod, to inquire God's will by means of the Urim and Thummim. He now sought the mind of the LORD as to what he should do in this dire situation. This very act is actually a mark of restoration. When a man seeks the will of God in prayer, it is evidence of communion.\n\nThe result of the prayer was a promise from the LORD: \"Pursue: for thou shalt surely overtake them, and without fail recover all.\" There was no delay in the answer. Neither was there any reservation or ambiguity. In fact, God's answer was more detailed than what David had asked.\n\nToday we do not have Abiathar or the ephod, but \"we have a great high priest, that is passed into the heavens, Jesus the Son of God\" [Hebrews 4:14]. Because He is our Saviour, we can \"come boldly unto the throne of grace, that we may obtain mercy, and find grace to help in time of need\" [Hebrews 4:16]. We may not get precise answers to our questions, but we will find \"grace to help\", something which we usually need more than answers.\n\n<b>THOUGHT</b>\nThe LORD's very presence is our refuge and strength, our rock and fortress in times of distress. May we learn to encourage ourselves in the LORD like David did.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=ZECHARIAH 5&version=KJV\">ZECHARIAH 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 11&version=KJV\">LUKE 11</a></b>",
    "28 NOVEMBER": "<b><u>28 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 30:9-10&version=KJV\">1 Samuel 30:9-10</a>\n\n<b>LESSON</b>\nDavid's pursuit\n\n<b>VERSE 10</b>\n<i>But David pursued, he and four hundred men: for two hundred abode behind, which were so faint that they could not go over the brook Besor.</i>\n\nIn difficult times, David's communion with God through prayer often fortified his faith and confidence. The power of God fell upon the hearts of his men, entirely subduing their mutiny. Once again, they obeyed and were willing to follow their leader. David did not know in which direction the Amalekites had gone, or how far ahead they were but assured of victory by God, he and his six hundred men, though tired and weak, set out in swift pursuit of the enemy. Indeed as Isaiah 40:31 tells us, \"But they that wait upon the Lord shall renew their strength; they shall mount up with wings as eagles; they shall run, and not be weary; and they shall walk, and not faint.\"\n\nOn reaching the brook Besor, some of his men were too tired to go on. They were so utterly exhausted they could not cross the brook to continue their pursuit so they remained there. God allowed David's men to be reduced by another two hundred, in the same way he had reduced the size of Gideon's band to the point where victory could only be attributed to divine intervention [Judges 7:2]. So, David trusted the LORD and pursued the Amalekites with the remaining four hundred men.\n\nLike David, every Christian though beset with anxiety and distress, may carefully and courageously take up the work assigned to him after he has strengthened himself with prayer and God's Word.\n\n<b>THOUGHT</b>\nCommit thy way unto the Lord; trust also in Him; and He shall bring it to pass. - Psalm 37:5\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=ZECHARIAH 6&version=KJV\">ZECHARIAH 6</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 12&version=KJV\">LUKE 12</a></b>",
    "29 NOVEMBER": "<b><u>29 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 30:11-12&version=KJV\">1 Samuel 30:11-12</a>\n\n<b>LESSON</b>\nGod's provision\n\n<b>VERSE 11</b>\n<i>And they found an Egyptian in the field, and brought him to David, and gave him bread, and he did eat; and they made him drink water.</i>\n\nThe amazing providence of God so clearly displayed on this occasion, provided a guide for David in the person of an Egyptian slave who had fallen sick and heartlessly abandoned by his Amalekite master along the wayside to starve and perish.\n\nThough David and his men were in haste, they extended kindness, mercy and compassion towards him, as our Lord Jesus does to all who come before Him. They generously shared their provisions. They gave him water to drink and bread to eat - part of a cake of pressed figs and two clusters of raisins - for he had been without food and water for three days.\n\nThe Egyptian was nourished and restored before David questioned him. This is a beautiful picture of the refreshing grace of God. Abundance of grace awaits those who know themselves to be in real need. The Lord Jesus Christ has already died for them and risen again. He is \"the Bread of Life\" [John 6:35], available to every hungry heart and starving soul. He is \"the Water of Life\" [Revelation 22:17] freely given to anyone who thirsts after Him. The Spirit of God ministers to us, applying His Word to our hearts so that we realise our need to be cleansed and filled with a new life. To this poor starving and dying man, the figs and raisins represent God's grace abounding beyond our needs. God will provide us with more than what we ask if we seek Him with all our hearts.\n\n<b>THOUGHT</b>\nBut my God shall supply all your need according to His riches in glory by Christ Jesus. - Philippians 4:19\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=ZECHARIAH 7&version=KJV\">ZECHARIAH 7</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 13&version=KJV\">LUKE 13</a></b>",
    "30 NOVEMBER": "<b><u>30 NOVEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 30:13-15&version=KJV\">1 Samuel 30:13-15</a>\n\n<b>LESSON</b>\nDavid's proposal\n\n<b>VERSE 15</b>\n<i>And David said to him, Canst thou bring me down to this company? And he said, Swear unto me by God, that thou wilt neither kill me, nor deliver me into the hands of my master, and I will bring thee down to this company.</i>\n\nThe Egyptian was revived, and David questioned him about his background. He gave an honest straightforward reply: \"I am a young man of Egypt, servant to an Amalekite\" [v. 13]. His Amalekite master had heartlessly abandoned him when he became ill three days ago and had left him there to die.\n\nThen the Egyptian forthrightly confessed his part in the invasion the Amalekites had made in the lands of the Cherethites, the territory belonging to Judah and Caleb, and how they had burnt Ziklag with fire. He knew the movements, the campsites, and perhaps the plans of his erstwhile masters. David then asked if he would guide them to the enemy camp. David also reassured him that he would not kill him, nor deliver him into the hands of his master [v. 15]. The Egyptian brought David to the place where the Amalekites were merry- making, celebrating their victory.\n\nDavid made the Egyptian a promise that he would not kill him. This reminds us how God assures all who trust in the Lord Jesus as Saviour, that they will not perish. With that assurance, our allegiance is with the One Who is faithful and strong. God will never leave us or forsake us. With His promise, not only do we get to live a renewed life, we are also reminded not to go back to the bondage of sin again. \"For sin shall not have dominion over you: for ye are not under the law, but under grace\" [Romans 6:14].\n\n<b>THOUGHT</b>\nFor we are His workmanship, created in Christ Jesus unto good works. - Ephesians 2:10a\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=ZECHARIAH 8&version=KJV\">ZECHARIAH 8</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 14&version=KJV\">LUKE 14</a></b>",
    "1 DECEMBER": "<b><u>1 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 30:16-20&version=KJV\">1 Samuel 30:16-20</a>\n\n<b>LESSON</b>\nRescue and recovery\n\n<b>VERSE 19</b>\n<i>And there was nothing lacking to them, neither small nor great, neither sons nor daughters, neither spoil, nor any thing that they had taken to them: David recovered all.</i>\n\nThe loss of virtually everything had driven David to a total dependence on God. He was then assisted by an Egyptian slave of the Amalekites who had been left to die, but after being revived, was able to direct David to the Amalekite camp. David and his men slaughtered the Amalekites, recovered not only their own people and possessions but also the goods of their enemies. Against all odds, they recovered all and more.\n\nWith their victory, David took the sheep and oxen of the Amalekites. As captain of the band, this was his share of the spoils while the rest of the plunder was divided among his men. David's reason for choosing the sheep and oxen was to present them as gifts to his friends in Judah.\n\nWe may note that while the Amalekites were defeated by David's men and their spoils taken, it was ultimately because of David that God granted them success. But for David's leadership, the group would not have achieved this victory over Amalek. Instead, they would have despaired at their loss as a dispirited band of men. David can be regarded here as a type of our Lord Jesus. Our spiritual battles are won only because of our Lord Jesus Christ as our Leader. Similarly, all good things and blessings we enjoy, come to us through Him.\n\n<b>PRAYER</b>\nHeavenly Father, we thank Thee that our victory is in our Lord Jesus Christ. Just like the band who triumphed over Amalek, our assurance of spiritual triumph is in You. In Jesus' name, Amen.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=ZECHARIAH 9&version=KJV\">ZECHARIAH 9</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 15&version=KJV\">LUKE 15</a></b>",
    "2 DECEMBER": "<b><u>2 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 30:21-22&version=KJV\">1 Samuel 30:21-22</a>\n\n<b>LESSON</b>\nThe wicked men\n\n<b>VERSE 22</b>\n<i>Then answered all the wicked men and men of Belial, of those that went with David, and said, Because they went not with us, we will not give them ought of the spoil that we have recovered, save to every man his wife and his children, that they may lead them away, and depart.</i>\n\nOn returning with their victory spoils, David regrouped with the two hundred weaker men who had remained at the brook. The wicked members among David's returning band, however, now wanted to give those who stayed back only their wives and children, but not a share of the spoils as they had not shared in the fight.\n\nThe scene paints a picture of greed and heartless covetousness. Despite their courage and valiance in fighting with David, these wicked men and men of Belial each spoke for himself - in a spirit of selfishness.\n\nTheir journey no doubt had been an arduous one. It was a forced march for days from Achish to Ziklag, then from Ziglag in hot pursuit of the marauders. They had been possessed by grief and anxiety of their wives and children being taken. These two hundred men were especially faint and struggling, low in spirit and strength, unable to continue at the brook. But they were still a part of David's force. What a poignant picture of the church and our Leader. Even in the Lord's army, there are those who are weak and disheartened at times, but they are still very much a part of God's kingdom and His chosen, and He will never forsake them. Ironically, this describes everyone of us. These faint ones rejoiced to see their captain return. They were not despised. Instead, we read 'when David came near to the people, he saluted them.'\n\nSimilarly, we thank God that we are not despised because of our weakness and frailty.\n\n<b>THOUGHT</b>\nAll that the Father giveth Me shall come to Me; and him that cometh to Me I will in no wise cast out. - John 6:37\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=ZECHARIAH 10&version=KJV\">ZECHARIAH 10</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 16&version=KJV\">LUKE 16</a></b>",
    "3 DECEMBER": "<b><u>3 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 30:23&version=KJV\">1 Samuel 30:23</a>\n\n<b>LESSON</b>\nGod's preservation\n\n<b>VERSE 23</b>\n<i>Then said David, Ye shall not do so, my brethren, with that which the LORD hath given us, Who hath preserved us, and delivered the company that came against us into our hand.</i>\n\nHearing the intention of these wicked selfish men, David's response was kind and calm. He rejected their unjust purposes in an amiable yet firm manner: \" ... the Lord hath given us, Who hath preserved us, and delivered the company that came against us into our hand.\"\n\nGod's protection and preservation have been freely imparted to us - whether we are weak and falling behind or strong and valiantly fighting at the front. Freely we have all received, freely we should give. David's response to his men was Christ-like. We should not unkindly and injuriously withhold from our brethren.\n\nDavid spoke for those who had stayed behind because of their circumstances. Likewise, our Lord Jesus always looks out for the interests of those who have no one to care for them! Besides, David reminded his men and us that it was the Lord's preservation and ultimate deliverance that gave them victory and blessings. It was Jehovah-Nissi - the Lord our Banner - the presence and power of God, under whose Name they fought that brought the enemies to their knees.\n\nMay this be a reminder for us too, fellow believers in our Lord Jesus, that it is by His preservation and grace that the ultimate victory is wrought!\n\n<b>THOUGHT</b>\nHis banner over us is love, Our sword the Word of God; We tread the road the saints before, with shouts of triumph trod. By faith, they like a whirlwind's breath, swept on o'er every field; The faith by which they conquered death, is still our shining shield. - John H Yates\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=ZECHARIAH 11&version=KJV\">ZECHARIAH 11</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 17&version=KJV\">LUKE 17</a></b>",
    "4 DECEMBER": "<b><u>4 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 30:23&version=KJV\">1 Samuel 30:23</a>\n\n<b>LESSON</b>\nYour brethren\n\n<b>VERSE 23</b>\n<i>Then said David, Ye shall not do so, my brethren, with that which the LORD hath given us, Who hath preserved us, and delivered the company that came against us into our hand.</i>\n\nThis verse can certainly teach us much! Not only does it point us to God's ultimate preservation and deliverance in every victory, David's firm yet gentle response is also something we can emulate. He was their leader, vested with authority and power to overrule, yet they were his brethren and comrade-in-arms. Not only were they fellowmen and brethren of the same nation, they were also of the same household of faith. David called for unity among them. It is likened to saying, 'We are all one and God has given the rewards, not to you alone but to us all who are comrade-in-arms. Whether strong or weak, we serve the same Lord, face the same foes and look out for one another.' So it is in the church, the congregation of the disparate faithful. The unity of fellow-believers in the household of faith is a great assurance and consolation to the feeble and weak in heart. We share the same hope and hold on to the same assurance. The prospect of heaven is ours in our Saviour the Lord Jesus. When God has been so good to preserve, bless and deliver us, should we then be unkind to our brethren? If the Lord has freely imparted to us His gracious mercy, ought we then to withhold our kindness to one who may be weaker in the faith? May the Lord forgive and help us.\n\n<b>THOUGHT</b>\nBefore our Father's throne, we pour our ardent prayers; our fears, our hopes, our aims are one, our comforts and our cares. We share our mutual woes, our mutual burdens bear, and often for each other flows, the sympathizing tear. - John Fawcett\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=ZECHARIAH 12&version=KJV\">ZECHARIAH 12</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 18&version=KJV\">LUKE 18</a></b>",
    "5 DECEMBER": "<b><u>5 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 30:24-25&version=KJV\">1 Samuel 30:24-25</a>\n\n<b>LESSON</b>\nEquitable portion\n\n<b>VERSE 24</b>\n<i>For who will hearken unto you in this matter? but as his part is that goeth down to the battle, so shall his part be that tarrieth by the stuff: they shall part alike.</i>\n\nWe read of David's decision to share the spoils of battle with those who stayed behind and how this was carved into Israel law for the generations after. From an initial reading of this passage, our first thoughts may be of equity: \"Ah, David was trying to be fair in treating everyone equally, so he split the loot among all his men.\" But that does not seem to be the case.\n\nIf David was trying to be truly fair, those who had fought in battle should receive a significantly larger proportion compared to those who had stayed behind. The truth of the matter was that the victory and spoils they had gained were a result of God's grace towards them, and David was now acting in accordance with that grace. A Christian receives grace from God on a daily basis and therefore he must show grace towards others in his daily dealings.\n\nWe have been trained so well by the world's system to think that if we work hard, we will be rewarded for our efforts that subconsciously we treat others in like manner. This brother has helped me before, so I will help him this time. This sister gave me a Christmas present, so I should return her the favour. The others have not done anything for me, so I will not bother with them.\n\nJesus washed the feet of all His disciples even though one was going to betray Him. We need to show forth the grace of our Lord Jesus Christ to everyone around us, regardless of their good or evil intentions towards us.\n\n<b>THOUGHT</b>\nDo we prefer some people over others simply because of what they have done for us in the past? Or do we practise showing grace towards all regardless of their deeds?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=ZECHARIAH 13&version=KJV\">ZECHARIAH 13</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 19&version=KJV\">LUKE 19</a></b>",
    "6 DECEMBER": "<b><u>6 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 30:26-31&version=KJV\">1 Samuel 30:26-31</a>\n\n<b>LESSON</b>\nGift from the spoil\n\n<b>VERSE 26</b>\n<i>And when David came to Ziklag, he sent of the spoil unto the elders of Judah, even to his friends, saying, Behold a present for you of the spoil of the enemies of the LORD.</i>\n\nDavid also distributed the battle spoils to the elders of Judah, and he was certainly wise to do so. Material gifts would gain him goodwill and support from the leaders in Judah. David was being prudent and shrewd, and there is nothing unbiblical about his actions.\n\nHow much do we treasure our money and material possessions? As believers, we ought always to think 'long term' and have our eyes fixed towards heaven. We cannot bring what we have earned on earth with us, but we can certainly \"convert\" earthly treasures into heavenly ones by blessing others around us who have need.\n\nWe have an eternal Father who provides for us in every way. The means by which He provides is often a mystery. But if we truly believe this, we will be more liberal with our wealth and use them as a means of helping others and saving souls for God's eternal kingdom. Do we pray often about how God wants us to use the money He has entrusted to us? Or have we always chosen the path of 'practical financial prudence', hoarding an excessive surplus in the bank in order to feel secure and be able to live our lives comfortably on earth. When we hear of someone in need, are we eager and willing to offer assistance? Or do we wait until the person has already received enough from others, and only then offer help to 'show face', though our hearts feel otherwise?\n\n<b>THOUGHT</b>\nAs good stewards, are we willing to seek God's will for the money He has entrusted in our care?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=ZECHARIAH 14&version=KJV\">ZECHARIAH 14</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 20&version=KJV\">LUKE 20</a></b>",
    "7 DECEMBER": "<b><u>7 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 31:1-3&version=KJV\">1 Samuel 31:1-3</a>\n\n<b>LESSON</b>\nSaul's defeat\n\n<b>VERSE 2</b>\n<i>And the Philistines followed hard upon Saul and upon his sons; and the Philistines slew Jonathan, and Abinadab, and Melchishua, Saul's sons.</i>\n\nIf we were reading the book of 1 Samuel like watching a movie, we likely would not give this movie a high rating because of the tragedy that befell Saul and his sons at the end of the book. We understand why Saul was defeated but why of all people must Jonathan die as well? Was he not one of the good guys? Jonathan surrendered his future kingship to David and now he was faithful to sacrifice his life in battle for his father. Is this the reward he deserves?\n\nNo one likes a sad ending, especially not for someone as noble as Jonathan. But Jonathan lived life according to God's will for him. An earthly kingdom did not matter as his eyes were fixed on an eternal one. We will not find out until we get there, but God has probably blessed Jonathan with crown upon crown, with heavenly riches we cannot in our earthly frames imagine. A Christian's life does not stop at death. It continues far beyond that.\n\nWhat are our goals and measures of success in life? Is it money, a big mansion, a stable career, providing for our children until they graduate from university, an early retirement? Or is it something along the lines of faithfulness in service, living according to God's will, full dependence upon the Lord, loving Him daily with all our heart and soul?\n\nJonathan knew and executed God's will for his life. His success cannot be measured by earthly standards. Are we willing to forsake earthly prestige and wealth for the sake of eternal riches like Jonathan?\n\n<b>THOUGHT</b>\nSet your affection on things above, not on things on the earth. - Colossians 3:2\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=MALACHI 1&version=KJV\">MALACHI 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 21&version=KJV\">LUKE 21</a></b>",
    "8 DECEMBER": "<b><u>8 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 31:4-6&version=KJV\">1 Samuel 31:4-6</a>\n\n<b>LESSON</b>\nSaul's death\n\n<b>VERSE 6</b>\n<i>So Saul died, and his three sons, and his armourbearer, and all his men, that same day together.</i>\n\nWe may have been prepared for this moment after reading Samuel's prophecies in 1 Samuel 15:28 and 28:19. Still this event was an unsightly blot on Israel's history. Saul, a king personally chosen by God, chose to die by falling on his own sword. What humiliation!\n\nWhile it was a humiliating defeat, this event reinforces the fact that the LORD Yahweh is a faithful God and all His promises will come to pass. God is faithful to judge Saul for his sin and equally faithful to fulfil all the promises He has made to David. God is faithful to bless as much as He is faithful to judge.\n\nWe learn from this account that everything is within God's control and plan, whether it be Saul's death or David's victory. This should bring us comfort in times of darkness in our lives, when no light seems to shine through, when God appears to be absent and when friends seem not to care about us anymore. To the contrary, God knows exactly what we are going through because He numbers even the hairs on our head. Even the darkness within which we go through is part of God's plan for our lives to serve His purpose.\n\nTrust in the promise of our God Who says He will never leave us nor forsake us. Trust His promise that He will give us grace and provision daily to walk this pilgrim life on earth. Trust in His declaration that He is the Sovereign One and that all things are under His control and within His plan. Trust Him!\n\n<b>THOUGHT</b>\nIn times of trial, temptation and difficulty, cling to God's promises for your life and never let go.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=MALACHI 2&version=KJV\">MALACHI 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 22&version=KJV\">LUKE 22</a></b>",
    "9 DECEMBER": "<b><u>9 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 31:4&version=KJV\">1 Samuel 31:4</a>\n\n<b>LESSON</b>\nSuicide\n\n<b>VERSE 4</b>\n<i>Then said Saul unto his armourbearer, Draw thy sword, and thrust me through therewith; lest these uncircumcised come and thrust me through, and abuse me. But his armourbearer would not; for he was sore afraid. Therefore Saul took a sword, and fell upon it.</i>\n\nIn the final chapter of 1 Samuel, we see the tragic end of Saul's life. The Philistines slew his three sons, Jonathan, Abinadab, and Malchi-shua, and Saul himself was mortally wounded by their archers. Knowing his end was near, Saul sought his armourbearer to kill him but the servant would not. So, Saul took a sword and fell upon it himself. When the servant saw this, he also fell on his own sword and died with Saul.\n\nSaul ended his life by committing suicide. The situation was definitely grim, and there seemed no way out for the king but to kill himself. When God said, \"Thou shalt not kill\" [Exodus 20:13], that included the taking of one's own life. Human life is sacrosanct. Remember what God told Noah, \"Whoso sheddeth man's blood, by man shall his blood be shed: for in the image of God made He man\" [Genesis 9:6]. The point is that man is God's special creation, for he is made in the image of God. Therefore, killing a man and taking a life even one's own, is killing an image-bearer of God.\n\nNo matter how bad the situation is or how hopeless the future may seem to you, remember we have a God Who knows and controls the future. Put your trust and hope in Him for He is the One who will see you to the end. Taking one's own life is to deny God and deny He is in control of one's life.\n\n<b>PRAYER</b>\nLord, forgive me for the times when I turn my eyes from You and look to my own wisdom to deal with the difficulties in my life. Help me to trust You and guide me in all I do, so that I may do what is right and what You have willed for me. Amen.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=MALACHI 3-4&version=KJV\">MALACHI 3-4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 23&version=KJV\">LUKE 23</a></b>",
    "10 DECEMBER": "<b><u>10 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 31:7&version=KJV\">1 Samuel 31:7</a>\n\n<b>LESSON</b>\nDesertion\n\n<b>VERSE 7</b>\n<i>And when the men of Israel that were on the other side of the valley, and they that were on the other side Jordan, saw that the men of Israel fled, and that Saul and his sons were dead, they forsook the cities, and fled; and the Philistines came and dwelt in them.</i>\n\nThe battle was lost when Saul and his sons were killed, and all Israel's army fled before their foe. The Israelites on the other side of the Jordan River saw their army had lost and they too forsook their cities and fled. The Philistines now claimed the cities as their own and dwelt in them.\n\nOne may ask: why did the Israelites desert their cities? Were they so disheartened they lost the will to fight and defend their cities? Were they so dependent on Saul and his army, and were there no more men left in the cities to defend them? Regardless of the reason, they had forgotten that these were cities God had given them for an inheritance, and therefore, they could put their trust in Him and fight, instead of abandoning their charge.\n\nSimilarly, in our lives, realise that all we possess is what God has entrusted to our care. We are only stewards, not owners. It behooves us therefore to make wise decisions concerning their defence and disposal. We do not depend on others as these fainthearted depended on King Saul, because we are ultimately responsible and accountable for the things God has entrusted to us. Look to Him instead for help and for grace, and strength to overcome any difficulties that come our way in our stewardship of His things, that all glory may go to Him!\n\n<b>THOUGHT</b>\nTrust in the LORD with all thine heart; and lean not unto thine own understanding. In all thy ways acknowledge Him, and He shall direct thy paths. - Proverbs 3:5-6\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 1&version=KJV\">REVELATION 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 24&version=KJV\">LUKE 24</a></b>",
    "11 DECEMBER": "<b><u>11 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 31:8-9&version=KJV\">1 Samuel 31:8-9</a>\n\n<b>LESSON</b>\nDesecration\n\n<b>VERSE 9</b>\n<i>And they cut off his head, and stripped off his armour, and sent into the land of the Philistines round about, to publish it in the house of their idols, and among the people.</i>\n\nThe Philistines returned to the battlefield the next day to find the corpses of Saul and his sons on Mount Gilboa. They took Saul's body, cut off his head, stripped his armour and sent it to their own land to display in the temple of Dagon [1 Chronicles 10:10], and show their people. Such was the outcome of Saul's foolish decision to commit suicide. Matthew Henry puts forth two points regarding Saul's action: it led to his armour-bearer also committing suicide, and thus their bodies were left for the enemies to desecrate.\n\nHad Saul not killed himself, he may have escaped despite his injuries. If he had died in battle, his armour-bearer would have spared himself from sinning, and could have done the better thing of carrying the bodies of Saul and his sons back for a proper burial. King Saul sought to avoid his enemy's abuse by killing himself, but in the end his body was desecrated by them. \"He that thinks to save his honour by sin will certainly lose it\" - Matthew Henry.\n\nLikewise, we honour God when we obey Him and do His will. Let us learn a lesson from today's reading and be wise in every decision we make. We cannot depend on our own wisdom. Rather, we can only be wise when we heed God's Word and do His commandments. We can start by walking closer with Him, and reading His Word daily, so that we can know what His will is for us in this life.\n\n<b>THOUGHT</b>\nFor whosoever will save his life shall lose it: and whosoever will lose his life for My sake shall find it. - Matthew 16:25\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 2&version=KJV\">REVELATION 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 1&version=KJV\">JOHN 1</a></b>",
    "12 DECEMBER": "<b><u>12 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 31:11-12&version=KJV\">1 Samuel 31:11-12</a>\n\n<b>LESSON</b>\nMen of Jabesh-Gilead\n\n<b>VERSE 12</b>\n<i>All the valiant men arose, and went all night, and took the body of Saul and the bodies of his sons from the wall of Bethshan, and came to Jabesh, and burnt them there.</i>\n\nWhen the men of Jabesh-Gilead heard what the enemies had done to Saul and his sons, they were enraged and set out to do what Saul's servant should have done. They arose in the night to the enemies' cities and retrieved the bodies from the walls of Bethshan. They brought them back to Jabesh for a proper funeral.\n\nTheir valiant deed recalls the events of 1 Samuel 11. Saul had saved the city of Jabesh-Gilead from an Ammonite siege. When Nahash the Ammonite leader threatened to attack Jabesh-Gilead, the inhabitants sought help from Saul, who gathered his men and defeated these adversaries. Because of their deliverance by Saul, the men of Jabesh-Gilead remembered and now repaid their kindness to the king and his sons at the end of their lives.\n\nThe first lesson for us here is that we should always do our best to help and show kindness to everyone we meet [Galatians 6:9-10]. The second is we should never forget the kindness that has been shown to us. More than that however is that we should show kindness not only to those whom we like, but also to those who are difficult to love. Christ shows us the way, when He said: \"Love your enemies, bless them that curse you, do good to them that hate you, and pray for them which despitefully use you, and persecute you\" [Matthew 5:44]. This can only be possible when we have a heart that aspires after Christlikeness, a heart that forgives and has compassion for all sinners.\n\n<b>THOUGHT</b>\n\"... for He maketh His sun to rise on the evil and on the good, and sendeth rain on the just and on the unjust.\" - Matthew 5:45b\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 3&version=KJV\">REVELATION 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 2&version=KJV\">JOHN 2</a></b>",
    "13 DECEMBER": "<b><u>13 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 31:13&version=KJV\">1 Samuel 31:13</a>\n\n<b>LESSON</b>\nBurning and burial of Saul\n\n<b>VERSE 13</b>\n<i>And they took their bones, and buried them under a tree at Jabesh, and fasted seven days.</i>\n\nHere marks the end of an era in Israel's history. Saul, chosen by God in response to the people's wish to have a king over them, to go before them, and fight their battles [1 Samuel 8:20], had fallen upon his own sword. His body, together with those of his sons, were retrieved by the valiant men of Jabesh, burnt and buried under a tree.\n\nSaul's end was tragic, yet not one that was totally cruel. His body was saved from further humiliation by men who remembered his goodness towards them [1 Samuel 11]. They buried him under 'the oak in Jabesh' [1 Chronicles 10:12] - a tree often associated with the hope of life and resurrection in the Jewish context. Perhaps they had noted Saul's liking for rest under the tree, of which we have record in the Bible [1 Samuel 14:2; 22:6]. The bones would stay there till David gathered and buried them in the sepulchre of Kish, Saul's father [2 Samuel 21:12-14]. We also read that, in honour of Saul, the men of Jabesh fasted for seven days.\n\nLet us remember that this was done in return for Saul's kingly acts in his earlier days. Gradually consumed by pride and jealousy, Saul had strayed further and further from God, until the fateful day when he had fallen by his own folly. God's mercy that was once upon him, had been taken away [2 Samuel 7:15]. His death now serves to usher in the new era of a king who is after God's own heart [1 Samuel 13:14].\n\nMay the life of Saul be a good lesson for us. It is good to be remembered by men - but only if it leads them to the One Whose favour ought to be sought so much the more.\n\n<b>THOUGHT</b>\nThen they that feared the LORD spake often one to another: and the LORD hearkened, and heard it, and a book of remembrance was written before Him for them that feared the LORD, and that thought upon His name. - Malachi 3:16\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 4&version=KJV\">REVELATION 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 3&version=KJV\">JOHN 3</a></b>",
    "14 DECEMBER": "<b><u>14 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:1&version=KJV\">2 Samuel 1:1</a>\n\n<b>LESSON</b>\nIntroduction to 2 Samuel\n\n<b>VERSE 1</b>\n<i>Now it came to pass after the death of Saul, when David was returned from the slaughter of the Amalekites, and David had abode two days in Ziklag.</i>\n\nThe Book of 2 Samuel begins by switching back to the narrative on David - and rightfully so, since David is the main character of this book. In fact, we could even say David is the focus of both books of Samuel in the Bible. The first chapters of 1 Samuel began with the life of Samuel, the servant whom God used to anoint the first two kings of Israel. Subsequently the failure of the first king, Saul, served to usher in the reign of David.\n\nYet David was not a perfect king. We read some of his mistakes in 1 Samuel: his lie to Ahimelech which resulted in the massacre in Nob, and his service to the Philistines when he was fleeing Saul. In 2 Samuel, we will see more of his follies - his sins of adultery and murder [2 Samuel 11-12] being most well-known, despite his desperate attempts to cover it up. 2 Samuel also contains many chapters on the repercussions of David's failure to discipline his son, Absalom. Even as the book ends, God did not spare David the shame of suffering the consequences of proudly numbering His people.\n\nThat said, David is still a man after God's own heart [Acts 13:22]. His 'perfect' heart is used as a standard for kings after him as we see in 1 Kings 11:4. It is this understanding of his close relationship with God that we need to learn from the life of David. Out of this heart will come great works for God. We will see how God humbled him before men, so that he could also be exalted and used for God's glory. At the end of the day, if David were to look at all his achievements, he would see and recognise that they were all made possible not because of his resourcefulness, but despite his failings.\n\n<b>THOUGHT</b>\nBut by the grace of God I am what I am: and His grace which was bestowed upon me was not in vain; but I laboured more abundantly than they all: yet not I, but the grace of God which was with me. - 1 Corinthians 15:10\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 5&version=KJV\">REVELATION 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 4&version=KJV\">JOHN 4</a></b>",
    "15 DECEMBER": "<b><u>15 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:2-3&version=KJV\">2 Samuel 1:2-3</a>\n\n<b>LESSON</b>\nReport of Saul's death\n\n<b>VERSE 3</b>\n<i>And David said unto him, From whence comest thou? And he said unto him, Out of the camp of Israel am I escaped.</i>\n\nTo the Israelites, the death of king Saul was perhaps one of the darkest moments in the young life of the new-found monarchy. For David, it must be most grievous news, for it implied the victory of God's enemies, and more personally the loss of his dearest friend Jonathan. Yet to this other man, a stranger to the history of Israel, it was an opportunity to be exploited.\n\nIt was more than two days now after David had returned to Ziklag, having recovered all their possessions from the Amalekite raiders. We read of this bearer of bad news, who claimed to have escaped from the camp of Israel at Saul's front against the Philistines. As would soon unfold before David, this man came to claim credit for something he had not done. He began by portraying himself as the first to bring the news to Israel's king to be.\n\nMan likes to be the first to know and first to tell - especially the bad news of others - those whom they think will be delighted to receive it. This is even more so in a knowledge-based society like ours today, where knowledge implies power and builds influence. This is why, fake news spreads fast - because people yearn to be the first to get exclusive knowledge, and in turn, be the first to transmit it to others.\n\n\"Thou shalt not raise a false report: put not thine hand with the wicked to be an unrighteous witness. Thou shalt not follow a multitude to do evil; neither shalt thou speak in a cause to decline after many to wrest judgement\" [Exodus 23:1-2]. Instead, let us aspire to be a messenger of good news. Let us be the first to praise and to give thanks.\n\n<b>THOUGHT</b>\nLet no corrupt communication proceed out of your mouth, but that which is good to the use of edifying, that it may minister grace unto the hearers. - Ephesians 4:29\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 6&version=KJV\">REVELATION 6</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 5&version=KJV\">JOHN 5</a></b>",
    "16 DECEMBER": "<b><u>16 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:4-5&version=KJV\">2 Samuel 1:4-5</a>\n\n<b>LESSON</b>\n\"How knowest thou ...?\"\n\n<b>VERSE 5</b>\n<i>And David said unto the young man that told him, How knowest thou that Saul and Jonathan his son be dead?</i>\n\nWith the demise of Saul, David would be the next king. Receiving this news from a stranger's mouth, how would David respond? He reacted wisely - the first thing he did was examine the man and his testimony.\n\nThe man's appearance did command some credibility. His clothes were rent, and earth was upon his head [v. 2]. Falling before David, his tone of voice and body gestures even suggested the tiresome journey taken from Mount Gilboa to Ziklag (some 100 miles), which an average man would take several days to complete. Yet holding back judgement, David inquired about the battle. When the deaths of Saul and Jonathan were reported, David asked, \"How knowest thou ... ?\"\n\nThis question shows David's wisdom. Many a time we are quick to accept any information we receive as truth. We are often hoodwinked by what we see and hear. We are misled by our emotions and fears. Worse still, when blinded by bias, we are even more ready to believe in things we hope to be true.\n\n\"A prudent man foreseeth the evil, and hideth himself; but the simple pass on, and are punished\" [Proverbs 27:12]. As much as we want to give others the benefit of doubt, and to think the best of them, God's Word reminds us to be discerning, especially in the last days, to be wise as serpents, yet harmless as doves [Matthew 10:16].\n\n\"And this I pray, that your love may abound yet more and more in knowledge and in all judgment; That ye may approve things that are excellent; that ye may be sincere and without offence till the day of Christ\" [Philippians 1:9-10].\n\n<b>THOUGHT</b>\nProve all things; hold fast that which is good. - 1 Thessalonians 5:21\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 7&version=KJV\">REVELATION 7</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 6&version=KJV\">JOHN 6</a></b>",
    "17 DECEMBER": "<b><u>17 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:6-8&version=KJV\">2 Samuel 1:6-8</a>\n\n<b>LESSON</b>\nThe Amalekite\n\n<b>VERSE 8</b>\n<i>And he said unto me, Who art thou? And I answered him, I am an Amalekite.</i>\n\nPrudence was not new to David. God had shaped him slowly from young to be what he was in 2 Samuel. Even Saul's servants knew of his prudence [1 Samuel 16:18]. Tending his father's sheep from a tender age, he must have acquainted himself well with the serious consequences of letting his guard down. In fact, he had seen and fought against these perils face to face [1 Samuel 17:37]. Later, while serving a jealous and deranged Saul, he had learnt even more the importance of behaving wisely [1 Samuel 18:5].\n\nHis real-life experiences proved useful again in discovering the deceit of the man before him. Today's verses reveal a fact about this stranger that must have set off alarm bells in David's heart - he was an Amalekite - a people notorious for their cruelty, especially against Israel [Deuteronomy 25:18], and who had just raided David's city of Ziklag [1 Samuel 30].\n\nConsider that David did not do anything to bring this out from the Amalekite's mouth. Perhaps in trying to sound sincere, this man had gone too far with (weaving untrue) details, and in the process unwittingly revealed he was an Amalekite. This marked the beginning of a testimony riddled with holes. Truth has a way of unravelling itself.\n\n\"Even a fool, when he holdeth his peace, is counted wise: and he that shutteth his lips is esteemed a man of understanding\" [Proverbs 17:28]. Sometimes, when trying to discern falsehood from truth, foolishness from wisdom, allow time to do its work. Commit to the LORD and pray for Him to show you the truth.\n\n<b>THOUGHT</b>\nMy son, let not them depart from thine eyes: keep sound wisdom and discretion: So shall they be life unto thy soul, and grace to thy neck. Then shalt thou walk in thy way safely, and thy foot shall not stumble. - Proverbs 3:21-23\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 8&version=KJV\">REVELATION 8</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 7&version=KJV\">JOHN 7</a></b>",
    "18 DECEMBER": "<b><u>18 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:9&version=KJV\">2 Samuel 1:9</a>\n\n<b>LESSON</b>\nSlay me\n\n<b>VERSE 9</b>\n<i>He said unto me again, Stand, I pray thee, upon me, and slay me: for anguish is come upon me, because my life is yet whole in me.</i>\n\nIf the fact of his identity did not affect his testimony, what he said next must certainly arouse doubt in his hearers. The man reported that Saul, after falling on his spear, had not died straightaway, but pleaded with him, an Amalekite, to end his suffering.\n\nIf this is true, it would indeed be the greatest irony, for we know from 1 Samuel 15 that it was the Amalekites whom Saul had been instructed by God to destroy utterly. His failure to obey had resulted directly in the LORD rejecting him as Israel's king [1 Samuel 15:26]. Furthermore, in 1 Samuel 31, Saul had wanted to end his own life so as not to suffer the humiliation of dying in his enemies' hands (the Philistines). Why would he now ask another enemy, an Amalekite no less, to do that to him? Chances are the Amalekite had found Saul and Jonathan dead, then cooked up this false story of rendering final help to the king, expecting it to fetch him some reward.\n\nWith the benefit of God's inspired account in our hands [1 Samuel 31:5-6], we know the Amalekite was telling lies. But there and then, David would have discerned the truth as well. The Amalekite, in trying to fool David, would prove himself the greater fool.\n\nSuch is the pathetic state of a liar. In concocting a story against his conscience, he sets himself on a collision course - a downward spiral of falsehood upon falsehood, needing one lie to cover another, and the longer the story, the more untenable it becomes, until the abomination implodes upon itself, and he suffers ultimate humiliation.\n\n<b>THOUGHT</b>\nLying lips are abomination to the LORD: but they that deal truly are His delight. - Proverbs 12:22\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 9&version=KJV\">REVELATION 9</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 8&version=KJV\">JOHN 8</a></b>",
    "19 DECEMBER": "<b><u>19 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:10&version=KJV\">2 Samuel 1:10</a>\n\n<b>LESSON</b>\nEvidence of murder\n\n<b>VERSE 10</b>\n<i>So I stood upon him, and slew him, because I was sure that he could not live after that he was fallen: and I took the crown that was upon his head, and the bracelet that was on his arm, and have brought them hither unto my lord.</i>\n\nThe Amalekite claimed that he acceded to Saul's plea to kill him because he was sure that Saul could not survive the calamity. Although we know from 1 Samuel 31 that the Amalekite invented the story, his words revealed that he thought nothing about killing the king of Israel and was willing to assume the responsibility when he did not even do it. He thought that his story would earn him a reward when he presented the royal insignia as evidence. Little did he expect his own words and the royal tokens would become incriminating evidence of murder against him.\n\nAlthough David might not know the truth behind Saul's death, God's providence ensured that justice was meted out to the Amalekite for his deceit and heartless intent. The Amalekite intended to manipulate the situation for selfish gain, but God used it to deliver the royal emblems to His anointed king and to exonerate David from any wrongdoing in gaining possession of those royal items.\n\nIn a book characterised by diverse plots of deceit and violence, God issues a stark reminder of His providence and judgement in this first chapter. God sees and exposes. He desires truth in our inward parts [Psalm 51:6]. Is there truth in your inner man? Do you live a life that reflects truth? Jesus reminds us in Luke 12:2 that there is nothing hidden that shall not be revealed. Ultimately all falsehoods shall be brought to light and judged.\n\n<b>THOUGHT</b>\nBe not deceived; God is not mocked: for whatsoever a man soweth, that shall he also reap. - Galatians 6:7\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 10&version=KJV\">REVELATION 10</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 9&version=KJV\">JOHN 9</a></b>",
    "20 DECEMBER": "<b><u>20 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:11-12&version=KJV\">2 Samuel 1:11-12</a>\n\n<b>LESSON</b>\nDavid's lament\n\n<b>VERSE 12</b>\n<i>And they mourned, and wept, and fasted until even, for Saul, and for Jonathan his son, and for the people of the LORD, and for the house of Israel; because they were fallen by the sword.</i>\n\nThe royal insignias of Saul were compelling evidence of Israel's calamity. Upon seeing them, David ripped his clothes, wept, and fasted until evening. It was a sincere outpouring of grief from his heart, not only for his most cherished friend Jonathan, his beloved nation and people, but also for Saul.\n\nIt may seem strange that David should mourn the death of his persistent and mortal enemy. Saul had falsely accused David of conspiring against him and relentlessly pursued David to kill him. Saul's demise would mean the end of David's suffering in exile and pave the way for his ascent to the throne. One would expect David to rejoice or at the very least, be relieved at the news of Saul's death.\n\nGod's presence in David's life caused him to rise above any personal injustice he had suffered. Despite what Saul had done to him, David respected Saul as his king and genuinely felt deep personal grief at his demise. He honoured Saul in his lament, remembering Saul not for his faults and follies, but for his valour and victories.\n\nAre you suffering from injustice or someone's personal grievance? Let bitterness not consume your heart. Look to God and pour out that problem to Him as David did in the Psalms. God may not change your circumstances right away. However, He will grant you the strength and willingness to love and forgive your enemies, even as you experience Christ's tender mercies towards you in bearing your sins on the cross and forgiving you.\n\n<b>THOUGHT</b>\nYour ability to love and forgive your enemies is the evidence of God's presence in your life.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 11&version=KJV\">REVELATION 11</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 10&version=KJV\">JOHN 10</a></b>",
    "21 DECEMBER": "<b><u>21 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:11-12&version=KJV\">2 Samuel 1:11-12</a>\n\n<b>LESSON</b>\nDavid's leadership\n\n<b>VERSE 11</b>\n<i>Then David took hold on his clothes, and rent them; and likewise all the men that were with him:</i>\n\nUpon hearing the news of Saul and Jonathan's death, David mourned greatly and his men followed likewise. How did David get all his men to follow his lead? These men were not supporters of Saul. 1 Samuel 22:2 tells us that they were runaways or rebels who had no goodwill and were even hostile towards Saul. Earlier, when they were hiding in the caves, some had even urged him to kill Saul. David had to restrain them with strong words.\n\nYet, when they heard the terrible news, David's men united with him to grieve for the dead. Their unity reflected an important aspect of David's leadership -- his eyes were fixed upon the LORD. He consistently upheld the sovereignty of God and the sanctity of the LORD's anointed before his men. He did not ask his men to look to him but to look to the LORD together with him.\n\nTrue unity does not come from following any human leader. All human leaders are flawed because of their weak and sinful nature. There is only one True Leader worth following - our Lord Jesus Christ. Good leadership is about focusing on Him, and leading others to follow Him even as we do so ourselves. All of us are leaders in some facet of our lives. Before we ask ourselves how we are faring as a leader, let us first ask how we are faring as a follower of our Lord Jesus Christ.\n\n<b>THOUGHT</b>\nBe ye followers of me, even as I also am of Christ. - 1 Corinthians 11:1\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 12&version=KJV\">REVELATION 12</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 11&version=KJV\">JOHN 11</a></b>",
    "22 DECEMBER": "<b><u>22 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:13-14&version=KJV\">2 Samuel 1:13-14</a>\n\n<b>LESSON</b>\nAre you not afraid?\n\n<b>VERSE 14</b>\n<i>And David said unto him, How wast thou not afraid to stretch forth thine hand to destroy the LORD's anointed?</i>\n\nUpon questioning by David, the Amalekite claimed he was the \"son of a stranger.\" This phrase is used in the Old Testament context to refer to non-Israelites who had chosen to dwell among the Israelites and adopt their customs and religion. So he was not ignorant about the LORD and the sanctity of His anointed. This led David to ask next -- why was he not afraid to stretch forth his hand to destroy the LORD's anointed?\n\nThe Amalekite had justified \"killing\" Saul by presumptuously concluding that Saul could not live after his defeat. He assumed David would desire Saul's death and therefore reward him for assisting Saul to have a more \"dignified\" death. David, however, had profound reverence for the LORD and a sacred respect for Saul as the LORD's anointed. It was inconceivable to him that a person could strike the LORD's anointed and not be afraid.\n\nThe Amalekite had no regard for the sanctity for the LORD's anointed because he had no fear of God. The fear of the LORD is the beginning of wisdom [Proverbs 9:10]. This fear is not a cowering fear; it is a fear that arises from awe and reverence for the majesty of God, the fear of displeasing a Father whom we revere and adore. Godly fear restrains us from giving in to sinful lusts and temptations. It drives us to seek the grace of God so that we may know the perfect love of our Lord Jesus Christ. Is your life controlled by a godly fear grounded in love?\n\n<b>THOUGHT</b>\nWherefore we receiving a kingdom which cannot be moved, let us have grace, whereby we may serve God acceptably with reverence and godly fear: For our God is a consuming fire. - Hebrews 12:28-29\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 13&version=KJV\">REVELATION 13</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 12&version=KJV\">JOHN 12</a></b>",
    "23 DECEMBER": "<b><u>23 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:15-16&version=KJV\">2 Samuel 1:15-16</a>\n\n<b>LESSON</b>\nBlood upon your head\n\n<b>VERSE 16</b>\n<i>And David said unto him, Thy blood be upon thy head; for thy mouth hath testified against thee, saying, I have slain the LORD's anointed.</i>\n\nAfter questioning the Amalekite, David immediately ordered his execution. Was he too hasty in his judgement? Was the punishment too severe since the Amalekite only confessed but did not actually commit the crime?\n\nThe Amalekite received the punishment he deserved. Even though David did not know if he actually killed Saul, David made it clear that the Amalekite brought guilt and condemnation upon himself by his confession to this most abominable crime. David had the highest regard for the sanctity of the LORD's anointed. He refused to kill Saul although he had several opportunities to do so. No one could strike the LORD's anointed and be guiltless [1 Samuel 26:9]. Yet, this Amalekite who belonged to one of Israel's greatest enemies, for the sake of personal gain, brazenly claimed to have killed Saul. As such, his blood was upon his head, meaning that the Amalekite was responsible for his own destruction. No one could accuse David of any wrongdoing in ordering the execution or in the death of Saul.\n\nGod knows our minds and sees our heart. He is the perfect judge. Ultimately judgement will come, and we will be held accountable for all that we think, say, and do. Every sin against our infinite and holy God deserves to be punished by eternal death. Have you repented and believed on the Lord Jesus, the Anointed One of the LORD? If you have, the blood that He shed on the cross for you shall atone for your sins. If not, your blood shall be upon your own head.\n\n<b>THOUGHT</b>\nIf you have believed on the Lord Jesus, do you think, speak, and act like a Christian? Can others tell that you are a Christian from the way you live?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 14&version=KJV\">REVELATION 14</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 13&version=KJV\">JOHN 13</a></b>",
    "24 DECEMBER": "<b><u>24 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:17-27&version=KJV\">2 Samuel 1:17-27</a>\n\n<b>LESSON</b>\nDavid's lamentation\n\n<b>VERSE 17</b>\n<i>And David lamented with this lamentation over Saul and over Jonathan his son.</i>\n\nThe Second Book of Samuel picks up after the death of Israel's first king, Saul. In today's reading, we are surprised by the long poem which David composed, lamenting not only his good friend Jonathan, but also king Saul.\n\n\"David lamented with this lamentation ...\" A lamentation is a dirge - a funeral song. Laments are frequently the subject matter of Old Testament prophecies. The prophets often used this poetic form as a sarcasm, decrying the sin and foretelling the downfall of the nation. Jeremiah's laments dealt with the fall of the nation of God's people [Jeremiah 7:29; 9:20]. David's lament, however, was quite different. It was a personal lament over the death of his friends. Some people say that believers should not grieve because it is a mark of lack of faith. As a result, that grief is compounded by a sense of guilt. Grief is God's gift which allows us to deal with loss in a way so we can go on living without a sense of guilt [John 11:35; 1 Thessalonians 4:13]. David grieved over the deaths of Saul and Jonathan.\n\nIt is understandable why David mourned for Jonathan. They were bosom friends. Jonathan was next in line to be king, but willingly cast his lot with David and truth, over the lies and treachery of his own father [1 Samuel 18:1-4; 19:2].\n\nBut why would David mourn for Saul, his arch- enemy who tried to kill him? David did not take Saul's death as a sign of his vindication; he did not celebrate the permanent removal of his foe. Instead, David grieved over Saul's death. By his words and deeds, David showed himself to be godly, bearing the marks of humility and compassion.\n\n<b>THOUGHT</b>\nBut I say unto you which hear, Love your enemies, do good to them which hate you, bless them that curse you, and pray for them which despitefully use you. - Luke 6:27-28\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 15&version=KJV\">REVELATION 15</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 14&version=KJV\">JOHN 14</a></b>",
    "25 DECEMBER": "<b><u>25 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:17-27&version=KJV\">2 Samuel 1:17-27</a>\n\n<b>LESSON</b>\nThe Book of Jasher\n\n<b>VERSE 18</b>\n<i>(Also he bade them teach the children of Judah the use of the bow: behold, it is written in the book of Jasher.)</i>\n\nThe phrase \"use of the bow\" is a synecdoche, a figure of speech in which a part is used to refer to the whole. Jonathan must have been an expert warrior, adept with weapons, of which the bow was one of the most important. Jonathan's military skills were so legendary they were recorded in the Book of Jasher.\n\nThe Book of Jasher means, literally, the Book of the Righteous [\"that which is right\" Exodus 15:26; \"upright\" Psalm 7:10]. It is also mentioned in Joshua 10:13 when the sun and moon stood still over Gibeon allowing Joshua to defeat the Amorites; that miracle was included in the book. It was a collection of poetry, commemorating outstanding events and exploits of famous personages in Israel's history. These in turn became a reference for later writers of the Bible books. That it was quoted by the writer of Second Samuel implies the Book of Jasher was well-known.\n\nThe book is no longer extant and is not part of the Scriptural canon. Just because a Bible book quotes an extra-biblical source does make that source a part of the Bible [Acts 17:28]. It is God's way of directing readers back to His truth.\n\nThe tenor of the Book of Jasher teaches us the importance of history, which really is God's providence; His working in time through imperfect man. In the course of human history, there have been attempts to eradicate the past and the outcomes are always devastating. In the spiritual realm, the consequences are far worse. In the history of Singapore Bible-Presbyterian Church, there were men who fought for and defended biblical truth. While we do not venerate them, we must not forget what they have done, and rejoice that God has used them for His glory.\n\n<b>THOUGHT</b>\nWe stand tall and see farther because we stand on the shoulders of those who have gone before us. Read Proverbs 22:28.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 16&version=KJV\">REVELATION 16</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 15&version=KJV\">JOHN 15</a></b>",
    "26 DECEMBER": "<b><u>26 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:17-27&version=KJV\">2 Samuel 1:17-27</a>\n\n<b>LESSON</b>\nHow are the mighty fallen?\n\n<b>VERSE 19</b>\n<i>The beauty of Israel is slain upon thy high places: How are the mighty fallen!</i>\n\nThe refrain \"how are the mighty fallen\" is only three words in Hebrew. Two words - \"mighty\" and \"fallen\" - stand out. Ironically, they are antithetical. The \"mighty\" is derived from the verb \"to be strong, to prevail\". The word is used to describe God and man. Jehovah is described as \"God of gods, and Lord of lords, a great God, a mighty, and a terrible, which regardeth not persons\" [Deuteronomy 10:17].\n\n\"Mighty\" is also used to describe a powerful man - one of superior ability as Saul's father was [1 Samuel 9:1]. David surrounded himself with mighty man [2 Samuel 23:9; 1 Chronicles 11:15]. Kings are recognised as mighty warriors. Mighty men therefore, are not ordinary soldiers but the elite. It also means they should not have fallen.\n\nThe word \"fallen\" has shades of meaning from a simple physical fall [1 Samuel 4:18; 2 Samuel 4:4] to defeat and violent death in battle [Judges 5:27; 1 Samuel 14:13; 2 Samuel 11:17]. In the context, \"fallen\" denotes a devastating defeat. That accounts for the exclamation of shock - how could this happen? Alas, how could a mighty warrior end in such humiliation?\n\n\"How are the mighty fallen\" is the chorus in David's lament. But it also serves as a warning to us. There is no man so strong he will not fall. In fact, in 2020, we experienced this firsthand when a microbe paralysed both people and nations. It crippled all without regard to position or power. David warned, \"LORD, make me to know mine end, and the measure of my days, what it is; that I may know how frail I am. Behold, Thou hast made my days as an handbreadth; And mine age is as nothing before Thee: Verily every man at his best state is altogether vanity\" [Psalm 39:4-5].\n\n<b>THOUGHT</b>\nWherefore let him that thinketh he standeth take heed lest he fall. - 1 Corinthians 10:12\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 17&version=KJV\">REVELATION 17</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 16&version=KJV\">JOHN 16</a></b>",
    "27 DECEMBER": "<b><u>27 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:17-27&version=KJV\">2 Samuel 1:17-27</a>\n\n<b>LESSON</b>\nDo not rejoice in failures\n\n<b>VERSE 20</b>\n<i>Tell it not in Gath, publish it not in the streets of Askelon; lest the daughters of the Philistines rejoice, lest the daughters of the uncircumcised triumph.</i>\n\nDavid's lamentation [v. 19-27] is also known as \"the song of the bow\", a funeral song with a refrain - \"How are the mighty fallen!\". Some see this refrain as referring solely to Saul. Others view it as referring only to Jonathan. There is a third view that David is looking further afield; that he was also lamenting the effects of Saul and Jonathan's deaths on the nation of Israel.\n\nDavid begins with a lament on the fading of Israel's beauty. The word \"beauty\" is also translated \"glory\" [Isaiah 24:16; 28:4-5], and David here is referring to King Saul. The \"high places\" of Mount Gilboa [v. 21], and the refrain \"how are the mighty fallen!\" [v. 19, 25, 27] expresses David's indescribable grief.\n\nDavid next wrote that this tragedy ought not to be published in Gath and Ashkelon. These were two of the five major Philistine cities [Joshua 13:3]. Gath was located between Judah and Philistia. It was also the birthplace of Goliath [1 Samuel 17:4]. Ashkelon was on the shore of the Mediterranean. The two cities represented the width of Philistine territory. The Philistines were arch-enemies of Israel. And David did not want the deaths of Saul and Jonathan to be a reproach on Israel.\n\nIsrael's defeat and Saul's death can be compared to the moral failures and spiritual falling away of the Church. When God is not honoured, when Christ is not pre-eminent in the church, when the Gospel is no longer preached, when our spiritual lives show nothing of the power of our Lord Jesus, we become a reproach in the world, which wastes no time in mocking believers. Be strong, therefore, and take a resolute stand for biblical Christianity.\n\n<b>THOUGHT</b>\nThe world rightly has higher expectations of Christians, therefore, \"be blameless and harmless, the sons of God, without rebuke, in the midst of a crooked and perverse nation, among whom ye shine as lights in the world\" [Philippians 2:15].\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 18&version=KJV\">REVELATION 18</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 17&version=KJV\">JOHN 17</a></b>",
    "28 DECEMBER": "<b><u>28 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:17-27&version=KJV\">2 Samuel 1:17-27</a>\n\n<b>LESSON</b>\nDefeat at Gilboa\n\n<b>VERSE 21</b>\n<i>Ye mountains of Gilboa, let there be no dew, Neither let there be rain, upon you, nor fields of offerings: For there the shield of the mighty is vilely cast away, the shield of Saul, as though he had not been anointed with oil.</i>\n\nGilboa was the place of defeat and death for Saul and his sons. David seemed to pronounce a curse upon Gilboa, that it would be arid and barren, with neither rain nor harvest. However, we are not to take David's imprecation literally. The future king of Israel would never curse any part of the land of Israel; rather David was expressing his utter abhorrence of what happened on the mountains of Gilboa.\n\nDavid also expressed disappointment with Saul's actions on the battlefield. Warriors are to stand and fight. It is one thing to have stood one's ground and be defeated; it is another for a soldier to cast away his shield and flee. The phrase \"vilely cast away\" has the idea of a soldier deserting his shield, which is a reproach. It was even more disgraceful because Saul was the Lord's anointed.\n\nIndeed, how are the mighty fallen! If we look back at Saul's life, there was no reason for him to fall. He came with good heritage. His father was a \"mighty man of power\" [1 Samuel 9:1]. Saul himself was \"a choice young man, and a goodly: and there was not among the children of Israel a goodlier person than he: from his shoulders and upward he was higher than any of the people\" [1 Samuel 9:2]. Saul had all the qualities of success, but ended in failure.\n\nSaul's downfall can be attributed to pride, which fueled his jealousy and rage, and his inability to deal with the successes of others. These added up to blind his purpose in life, cripple his kingship, and cause him to fall. Pride is an equal opportunity tormentor. It does not matter what position or power you have. So, beware!\n\n<b>THOUGHT</b>\nPride goeth before destruction [Proverbs 16:18]. Pride has a crippling and rippling effect. Pride brings down the mighty, and humbles the haughty spirit.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 19&version=KJV\">REVELATION 19</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 18&version=KJV\">JOHN 18</a></b>",
    "29 DECEMBER": "<b><u>29 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:17-27&version=KJV\">2 Samuel 1:17-27</a>\n\n<b>LESSON</b>\nThe symptoms of pride [I]\n\n<b>VERSE 21</b>\n<i>Ye mountains of Gilboa, let there be no dew, Neither let there be rain, upon you, nor fields of offerings: For there the shield of the mighty is vilely cast away, the shield of Saul, as though he had not been anointed with oil.</i>\n\nBeware of pride because if pride takes hold of a person's heart, it will be a certain downward slide into destruction [Proverbs 16:18; 29:23; 1 Corinthians 10:12; James 4:6]. David's lamentation carries with it a warning of this insidious sin that can affect everyone.\n\nHow can we detect pride in our lives and avoid going down the same path as Saul? There are key moments in Saul's life we can look back to and pinpoint the symptoms of pride. Everyone of us manifests it to a degree, some - if not all - of these symptoms. If someone declares he does not have a pride issue, that is in fact the very sign of pride. \"If we say that we have no sin, we deceive ourselves, and the truth is not in us\" [1 John 1:8].\n\nTake these symptoms - seven in all - as a spiritual thermometer and use it for your personal assessment. The higher the reading, the stronger the hold pride has on you.\n\nThe first symptom is when we give undue emphasis to externals and are obsessed with what others think of us. This is the foothold of pride in our lives. Saul's mind was consumed with what others thought about him. He was more concerned about being respected by the people than being right with God. That was why even after he had sinned, he asked Samuel, \"Honour me now ... before the elders of my people, and before Israel\" [1 Samuel 15:30].\n\nSecond, an unwillingness to admit mistakes. After being rebuked by Samuel for failing to obey God's explicit command, Saul said, \"I have sinned ...\" [1 Samuel 15:24]. However, it was not so much a confession of sin, as it was a concession to his disobedience being exposed.\n\n<b>THOUGHT</b>\nPride undermines a man's life in the same way termites eat away the foundations of a mansion.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 20&version=KJV\">REVELATION 20</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 19&version=KJV\">JOHN 19</a></b>",
    "30 DECEMBER": "<b><u>30 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:17-27&version=KJV\">2 Samuel 1:17-27</a>\n\n<b>LESSON</b>\nThe symptoms of pride [Il]\n\n<b>VERSE 21</b>\n<i>Ye mountains of Gilboa, let there be no dew, Neither let there be rain, upon you, nor fields of offerings: For there the shield of the mighty is vilely cast away, the shield of Saul, as though he had not been anointed with oil.</i>\n\nThe third symptom of pride is the refusal to heed counsel. Saul would not listen to advice. He became deaf to the counsel of his friends, and that dismissal led to isolation and jealousy of those on the outside. When we do not take the advice of friends, we build walls that shut them out, and isolation breeds bitterness. In the end, Saul had no one to turn to, causing him to seek out the witch of Endor [1 Samuel 28:7ff].\n\nFourthly, the proud are unwilling to share credit and give praise. Saul obstinately refused the help of others because he could not accept there were others better than himself. When Jonathan and his armour-bearer routed the Philistines, Saul declared an untimely fast [1 Samuel 14:24]. Jonathan not knowing about the fast would have suffered the penalty of death if not for the people's intervention. A proud man like Saul is always trying to find a way to make sure his name is first.\n\nFifthly, a proud person always finds excuses for his sin and rationalises his shortcomings. This is most evident in Saul's life. When he presumptuously made offerings to God, it was because Samuel was late, and the people had deserted him [1 Samuel 13:11]. When he spared Agag and the best of the livestock, it was because he wanted to sacrifice to the LORD. And when that excuse did not work, Saul said he feared the people. For Saul, there was always an excuse. He was never wrong. It was always somebody else's fault. Instead of owning his mistakes, Saul always pointed the finger. If we find ourselves always making excuses for our disobedience, the seed of pride has taken root in our hearts.\n\n<b>THOUGHT</b>\nPride is described as the sire of all sin. As long as the seed of pride is alive, it will bear the fruits of other sins.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 21&version=KJV\">REVELATION 21</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 20&version=KJV\">JOHN 20</a></b>",
    "31 DECEMBER": "<b><u>31 DECEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 1:17-27&version=KJV\">2 Samuel 1:17-27</a>\n\n<b>LESSON</b>\nThe symptoms of pride [Ill]\n\n<b>VERSE 21</b>\n<i>Ye mountains of Gilboa, let there be no dew, Neither let there be rain, upon you, nor fields of offerings: For there the shield of the mighty is vilely cast away, The shield of Saul, as though he had not been anointed with oil.</i>\n\nThe sixth symptom is a reluctance of genuine repentance. There are people who are unwilling to admit mistakes [the second symptom] and there are those who are willing to admit wrongdoing but will not repent. Real repentance is a change of mind and attitude; it helps the person reconcile with the fact that God's grace is able to overcome the sorrow and open the door to restoration. When David confronted Saul about his murderous acts, the king confessed, \"I have sinned: return ... I have played the fool, and have erred exceedingly\" [1 Samuel 26:21]. But Saul did not change. There was not a time in Saul's life when he was genuinely repentant. Without genuine repentance, words of apology are empty; they are like open wounds that never heal. Genuine repentance on the other hand, are like scars. Every scar has an ugly story, but is also a testimony of healing.\n\nThe seventh and final symptom of pride is when a person is willing to trade those closest to him for his own benefit. As Goliath taunted Israel, Saul, to save his throne and cover his cowardice, offered his own daughter as a prize to the man who could defeat the Philistine [1 Samuel 17:25]. Saul was willing to give up his daughter if someone could save his neck. Nothing was of value to Saul except his place on the throne, nothing was sacrosanct; every person can be sacrificed, every principle can be manipulated for his own benefit.\n\n2020 is a year in which the whole world is paralysed by an invisible microscopic virus. Superpowers and billionaires were not spared. Look back at the last 12 months - with 20/20 hindsight - and learn the lesson of our own fallenness so that we may began 2021 in humble reliance upon our Saviour.\n\n<b>THOUGHT</b>\nBe clothed with humility: for God resisteth the proud, and giveth grace to the humble. - 1 Peter 5:5b\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=REVELATION 22&version=KJV\">REVELATION 22</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 21&version=KJV\">JOHN 21</a></b>"
}