{
    "31 DECEMBER": {
        "part1": "Romans 16:26-27",
        "part2": "Obedience of faith",
        "part3": "VERSE 26",
        "part4": "But now is made manifest, and by the scriptures of the prophets, according to the commandment of the everlasting God, made known to all nations for the obedience of faith:",
        "part5": "A recent survey conducted on the country's National Service indicated that more than 90% of the population accept the many positive outcomes and influences on society of the compulsory national service for all male citizens in Singapore. But I wonder if the participants of the survey realized that National Service is a national policy which requires utmost obedience of compliance from all male citizens here. When we read Romans 16:25-27, it is obvious a wise and everlasting God has commanded us to live our lives in obedience to His oracles found in the Bible from time past.\n\nGod was manifested as the word and had made known to all nations the Gospel of Jesus Christ. The Gospel truth demands the same acceptance as any other national policy. Christians, chosen and redeemed by God must accept and obey all things pertaining to the Bible because they are citizens of heaven. That is the obedience of faith. Without this obedience, we cannot demonstrate our faith by our works [James 2:18].\n\nAs with the nation's National Service, without obedience to this national policy, its objectives to preserve peace, promote economic development and authority of the government to govern will not be established.\n\nThe obedience of faith is our pledge of allegiance to Christ whose blood has justified us as God's elect. It is through the obedience of faith in every Christian that the Gospel of Christ shines forth to the whole world. And thus to God only wise, will be glory through Jesus Christ for ever. Amen.",
        "part6": "THOUGHT",
        "part7": "The obedience of faith can best be summed up as faith applied daily. \"The Christian is a man who can be certain about the ultimate even when he is most uncertain about the immediate\". - Martyn Lloyd-Jones.",
        "part8": [
            "2 CHRONICLES 36",
            "REVELATION 22"
        ]
    }
}