{
    "17 JULY": {
        "part1": "2 Samuel 14:33",
        "part2": "Pseudo reconciliation",
        "part3": "VERSE 33",
        "part4": "So Joab came to the king, and told him: and when he had called for Absalom, he came to the king, and bowed himself on his face to the ground before the king: and the king kissed Absalom.",
        "part5": "At Absalom's behest, Joab thus becomes the mediator between the prince and his king. A wrongdoer seeking reconciliation is a laudable thing but here many things were wrong. This mediator was a man of deeply flawed character, and this wrongdoer was possessed of an unremorseful and unrepentant heart. This reconciliation was a sham.\n\nTrue reconciliation must be done with a right heart in the right way. There must be recognition of wrongdoing, repentance in the heart and reparation made for it. Only then can real restoration and reconciliation take place. But such could not be said of Absalom. And this is the picture of many an unrepentant sinner.\n\nThanks be to our God the righteous King who so earnestly desires the reconciliation of every sinner; that in His love He provides the only acceptable mediator [1 Timothy 2:5], His own sinless Son, to make the only satisfactory reparation (propitiation) for our sins by His death, thus satisfying the demands of divine justice. This flawless mediator was nothing like the general Joab but the divine captain of our salvation, our Lord Jesus Christ, resurrected Son of God, whose victory over death is the only acceptable way to the King.\n\nAnd what is a right heart? It is a heart that recognises no semblance of good in it, claims no ability to save itself and believes that only the Lord Jesus saves; a heart of true repentance, of sorrow and regret over sin, which is resolved to return to it no more; a broken and contrite heart that God will not despise [Psalm 51:17].\n\nDavid kissed Absalom and father and son were reconciled. But this pseudo-reconciliation and false peace would not last, and the worst was yet to be.",
        "part6": "THOUGHT",
        "part7": "All roads do not lead to heaven. In Christ alone is reconciliation with God a reality. \"Jesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by Me.\" [John 14:6]",
        "part8": [
            "JOSHUA 22",
            "ACTS4"
        ]
    },
    "18 JULY": {
        "part1": "2 Samuel 15:1",
        "part2": "The image of Absalom",
        "part3": "VERSE 1",
        "part4": "And it came to pass after this, that Absalom prepared him chariots and horses, and fifty men to run before him.",
        "part5": "The world is concerned with and impressed by outward appearances. A thing's beauty is often judged by its looks. Hence the worldling devotes much time and attention in enhancing the veneer of its image.\n\nSo, Absalom surrounded himself with a magnificent retinue of chariots and horses. Presently restored by David, he wasted no time in donning the appurtenances of power and prestige to burnish his regal status. This was a surreptitious plan to stand out and impress the citizenry even as he worked silently to undermine his father the king. Absalom's heart was not right even though he was a picture of beauty and grandeur.\n\nThis applies to the Christian in two ways. First, in our judgement of self, what is our greatest concern before men? Are we so absorbed with what can be seen of us and have scant regard for the unseen within us? Man may be impressed and taken by looks but truth will out in the end, if not in another's eye, then certainly in God's judgement. Thus, Peter exhorts \"But let it be the hidden man of the heart, in that which is not corruptible, even the ornament of a meek and quiet spirit, which is in the sight of God of great price\" [1 Peter 3:4].\n\nSecond, how do we judge others? The All-wise God told Samuel, \"Look not on his countenance, or on the height of his stature ... for the LORD seeth not as man seeth; for man looketh on the outward appearance, but the LORD looketh on the heart\" [1 Samuel 16:7]. Judge not a book by its cover or persons by appearance. Rather, \"judge righteous judgment\" [John 7:24] both of others and of self.",
        "part6": "THOUGHT",
        "part7": "Don't fool others and don't fool ourselves. The Lord knows.",
        "part8": [
            "JOSHUA 23",
            "ACTS5"
        ]
    },
    "19 JULY": {
        "part1": "2 Samuel 15:2",
        "part2": "The ambition of Absalom",
        "part3": "VERSE 2",
        "part4": "And Absalom rose up early, and stood beside the way of the gate: and it was so, that when any man that had a controversy came to the king for judgment, then Absalom called unto him, and said, Of what city art thou? And he said, Thy servant is of one of the tribes of Israel.",
        "part5": "The gate of the city was where the king would give audience to his citizens for the purpose of hearing their grievances and administering justice. To stand there in such manner in the absence of the king would do two things for Absalom: first, it would give him exposure to and recognition by the common people; and second, it would give them the impression he was concerned for their welfare, interested in their complaints and approachable with his friendly demeanour.\n\nBut behind this facade of familiarity and friendliness was a burning ambition to be king, and a covetous heart for his father's crown. And Absalom would work to achieve it through subterfuge and craft.\n\nWhat are your consuming ambitions? Are they solely centred on things in the here and now like qualifications, career, success, wealth, power and prestige? Or are your ambitions and desires for the things that have a value transcending the limited years of this life?\n\nThe rich and ambitious man was a fool in God's eyes because he did not prepare for the unseen eternity and did not care about the Kingdom of God [Luke 12:20-21]. His earthly treasures were valueless since he could not bring them with him, and all his worldly accomplishments would count for nothing where he was going. Worse still, life for him would end in a few short hours and he did not even realise it.\n\nLet us have the right view of ambition. \"Seek ye first the kingdom of God and His righteousness\" is our Lord's wise prescription because that is where we will be for all eternity.",
        "part6": "THOUGHT",
        "part7": "Be ambitious for the Lord. \"And seekest thou great things for thyself ? seek them not.\" [Jeremiah 45:5a]",
        "part8": [
            "JOSHUA 24",
            "ACTS 6"
        ]
    },
    "20 JULY": {
        "part1": "2 Samuel 15:3-4",
        "part2": "The undermining of David",
        "part3": "VERSE 4",
        "part4": "Absalom said moreover, Oh that I were made judge in the land, that every man which hath any suit or cause might come unto me, and I would do him justice!",
        "part5": "Absalom's words in verses 3 and 4 are the words of a cunning heart. He agreed with the petitioners in their complaints. He sympathised with the people whose grievances were not listened to. He empathised with them heartily and insinuated they were being neglected by their king. Every word was calculated to undermine the credibility and authority of their monarch, and elevate himself in the people's eyes. The bitterness of being snubbed by his father still smouldered within and fomented hatred and sin in his heart. He would exact his revenge.\n\nThe experience of bitterness is common to all man. The difference for the Christian lies in how we deal with it. The Bible is clear. The root of bitterness defiles our soul and must be pulled out [Hebrews 12:15]. The gall of bitterness enslaves us in a bond of iniquity and wickedness which must be repented of [Acts 8:22-23]. Therefore, God through the apostle instructs that all bitterness, wrath and malice be put away lest we grieve the Holy Spirit [Ephesians 4:30-31].\n\nGod is greatly grieved, and the Spirit's influence quenched when we allow such feelings and emotions to dwell within and control us. Instead, we are to be \"kind one to another, tenderhearted, forgiving one another, even as God for Christ's sake hath forgiven you\" [Ephesians 4:32]. We who have known God's love, experienced His forgiveness, made free from sin's enslavement by His Spirit within us, directing and helping us, are certainly able to do that when we yield wholly to Him. This is well pleasing to our Lord and glorifies His name.",
        "part6": "THOUGHT",
        "part7": "Remember Cain's bitterness towards Abel and its bitter end. Read 1 John 3:12.",
        "part8": [
            "JUDGES 1",
            "ACTS 7"
        ]
    },
    "21 JULY": {
        "part1": "2 Samuel 15:5-6",
        "part2": "Stealing the heart",
        "part3": "VERSE 6",
        "part4": "And on this manner did Absalom to all Israel that came to the king for judgment: so Absalom stole the hearts of the men of Israel.",
        "part5": "Absalom, the third son of David, was born in Hebron to his third wife, Maacah, a heathen princess of Geshur [2 Samuel 3:3]. Being the son of a pagan mother, Absalom had little or no concern for the peace of Israel. He had only been recently restored to his place in court but now coveted his father's throne. Absalom was not content with the honour and privileges he enjoyed as a prince. He wanted to be king. Absalom's perverted greed for his father's throne was synonymous to Satan's desire to usurp God's throne [Isaiah 14:13-14; Ezekiel 28:14-17].\n\nAbsalom cunningly planned the insurrection against his father, first by undermining his authority. He projected artfully that he would be a better king by portraying himself as a god-like figure of greatness and goodness. Accompanied by horses and chariots, he would appear in pomp and magnificence. Every morning, he would be at the palace gate to intercept the people who were going to the palace to seek audience with the King regarding their problems. Absalom received them with false humility and made them believe he empathised with them and would attend to their woes more assiduously than his father. With charm, pretence, and affability, he stole the hearts of the men of Israel.\n\nSimilarly, Satan the Angel of Light, attempts to cause us to rebel against God by stealing our hearts through deception and temptation. We are to submit to God, resist the devil, and he will flee from us [James 4:7]. May God's Word continue to sanctify and strengthen our hearts daily.",
        "part6": "THOUGHT",
        "part7": "Thy Word have I hid in mine heart, that I might not sin against Thee. - Psalm 119:11",
        "part8": [
            "JUDGES 2",
            "ACTS 8"
        ]
    },
    "22 JULY": {
        "part1": "2 Samuel 15:7-9",
        "part2": "The strategy of Absalom - revolt from Hebron",
        "part3": "VERSE 7",
        "part4": "And it came to pass after forty years, that Absalom said unto the king, I pray thee, let me go and pay my vow, which I have vowed unto the LORD, in Hebron.",
        "part5": "Absalom's going to Hebron on the pretext of paying his vows was only to put a veneer of religiosity over his ill intentions - preparation for the revolt from that city. His credulous father was mistakenly pleased in his heart that his murderer son had now returned to the Lord. Controlled by the satanic spirit, Absalom had no qualms about using the name of God to pursue his evil designs.\n\nAbsalom chose Hebron in Judah because firstly, it was his birthplace where his father reigned as king for several years over Judah [2 Samuel 2:4] and over all Israel [2 Samuel 5:3]. As Hebron was the royal city before the throne was moved to Jerusalem, it would be the appropriate place to proclaim himself as the new king.\n\nSecondly, Hebron being on the road to Geshur would provide an easy escape should his plot fail.\n\nThirdly, in Judah, there was much discontent over David's transferring his royal seat to Jerusalem. The tribe of Judah had been the mainstay and bedrock of David's support. Winning Judah over to his side would lead to the collapse of David's kingship.\n\nOur faith in God is founded upon the revealed, inspired, inerrant, infallible, authoritative Word of God - that our Lord Jesus Christ, the Second Person of the Godhead incarnate, by His finished work at Calvary's cross and resurrection, is our Saviour, God and King. The devil seeks to dethrone our Saviour King from our hearts by attacking His Deity, His Word and works - but in vain. \"For ever, O LORD, thy word is settled in heaven\" [Psalm 119:89]. By His grace may we remain faithful till He comes.",
        "part6": "THOUGHT",
        "part7": "The LORD is my rock, and my fortress, and my deliverer; my God, my strength, in whom I will trust; my buckler, and the horn of my salvation, and my high tower. - Psalm 18:2",
        "part8": [
            "JUDGES 3",
            "ACTS 9"
        ]
    },
    "23 JULY": {
        "part1": "2 Samuel 15:10",
        "part2": "The strategy of Absalom - sending spies and preparing the ground",
        "part3": "VERSE 10",
        "part4": "But Absalom sent spies throughout all the tribes of Israel, saying, As soon as ye hear the sound of the trumpet, then ye shall say, Absalom reigneth in Hebron.",
        "part5": "Absalom's thorough and meticulous plans testified to his intense lust for power and his father's throne. Having won the hearts of a large populace in and around Jerusalem, he sought to secure a base farther away from Jerusalem, in Hebron, where he could continue to secretly advance his plot.\n\nHe sent emissaries throughout the land, infiltrating the other tribes. Their modus operandi was to discredit the king through subterfuge, lies and fabrications that he was not competent to rule. This was the same tactic he employed with great success in Jerusalem. The objective was to stir up a groundswell of unhappiness against the king so that when the signal was given, the multitudes would rally to Absalom's flag.\n\nJust as Absalom had sent spies throughout the tribes spreading falsehoods to undermine the king's authority, the apostle Paul warned the Ephesian elders that agents of the Devil would as \"grievous wolves enter in among you, not sparing the flock. Also of your own selves shall men arise, speaking perverse things, to draw away disciples after them\" [Acts 20:29-30]. This would undermine the authority of God's Word and disrupt the church. The leaders of the church were instructed to \"take heed therefore unto yourselves, and to all the flock, over the which the Holy Ghost hath made you overseers, to feed the church of God, which he hath purchased with his own blood\" [Acts 20:28]. Paul then commended the church \"to God, and to the word of His grace\" [Acts 20:32]. May God be merciful to help us to keep the purity and unity of the church.",
        "part6": "THOUGHT",
        "part7": "With all lowliness and meekness, with longsuffering, forbearing one another in love; Endeavouring to keep the unity of the Spirit in the bond of peace. - Ephesians 4:2-3",
        "part8": [
            "JUDGES 4",
            "ACTS 10"
        ]
    },
    "24 JULY": {
        "part1": "2 Samuel 15:11-12",
        "part2": "The strategy of Absalom - buying allegiances",
        "part3": "VERSE 11",
        "part4": "And with Absalom went two hundred men out of Jerusalem, that were called; and they went in their simplicity, and they knew not any thing.",
        "part5": "To further strengthen his position, Absalom sought to buy allegiances among the people - those of power, position, and influence. By his display of magnificence, apparent love and care, he won the hearts of two hundred courtiers who followed him \"in their simplicity\", unaware of his evil designs. The closeness of these men would lend him much credence in the eyes of the masses. At the critical moment, when Absalom demanded their loyalty and support, it would be difficult for them to refuse him.\n\nAbsalom next bought the allegiance of Ahithophel, Bathsheba's grandfather and David's long-trusted counsellor. Ahithophel harboured a secret grudge against David for engineering Uriah's death. Ahithophel seized the opportunity for revenge by joining Absalom. The buying of allegiances has always been the product of a carnal mind and depraved heart. Its primary motivation is to advance one's personal agenda at the expense of another, even to the annihilation of the other party as in the case of Absalom against David.\n\nSaved by the precious blood of our Lord Jesus and called to be God's children, we are to \"walk worthy of the vocation wherewith ye are called\" [Ephesians 4:1]. As ambassadors for our Lord [2 Corinthians 5:20], we are to bear a good testimony for Him always and \"live peaceably with all men\" [Romans 12:18]. As soldiers of our Lord Jesus Christ, we rally under the banner of King Jesus and our allegiance is to Him and Him alone. In our service for Him, there should be no buying of allegiances, factionalism nor divisions. United and faithful, we will stand striving for the Gospel till He comes.",
        "part6": "THOUGHT",
        "part7": "Only let your conversation be as it becometh the Gospel of Christ: that whether I come and see you, or else be absent, I may hear of your affairs, that ye stand fast in one spirit, with one mind striving together for the faith of the Gospel.",
        "part8": [
            "JUDGES 5",
            "ACTS 11"
        ]
    },
    "25 JULY": {
        "part1": "2 Samuel 15:12",
        "part2": "Ahithophel",
        "part3": "VERSE 12",
        "part4": "And Absalom sent for Ahithophel the Gilonite, David's counsellor, from his city, even from Giloh, while he offered sacrifices. And the conspiracy was strong; for the people increased continually with Absalom.",
        "part5": "Ahithophel was King David's private counsellor who had such a reputation for wisdom that his advice \"was as if a man had enquired at the oracle of God\" [2 Samuel 16:23]. Ahithophel was so sharp and shrewd that the counsel he gave King David and later Absalom always hit their target and achieved the desired results. How was Absalom able to entice Ahithophel to switch allegiance? Bible scholars believe Ahithophel was Bathsheba's grandfather who was furious with David for bringing dishonour to his family by his adultery with Bathsheba. Ahithophel may have been enamoured with Absalom, and thought it better to align with Absalom the rising star, rather than David the setting sun. Ahithophel was too smart to join in Absalom's conspiracy without feeling reasonably sure of its success. But though he possessed much worldly wisdom, Ahithophel lacked spiritual discernment. David was God's anointed, chosen to lead God's own nation Israel. By attempting to frustrate the wisdom of God, the wisest man in the land lived up to his name, which translated is \"brother of foolishness\". God's plans can never be thwarted by man's cunning. Absalom's efforts to wrest the throne from David were doomed to fail because by divine design, the throne belonged to another. May we learn that worldly wisdom cannot defeat God's will, nor should it be used to plot ill against others. God will not allow such plans to prosper. Only plans made through prayer in submission to God will be blessed.",
        "part6": "THOUGHT",
        "part7": "The fear of the LORD is the beginning of wisdom: and the knowledge of the holy is understanding. - Proverbs 9:10",
        "part8": [
            "JUDGES 6",
            "ACTS 12"
        ]
    },
    "26 JULY": {
        "part1": "2 Samuel 15:13-14",
        "part2": "The success of Absalom",
        "part3": "VERSE 13",
        "part4": "And there came a messenger to David, saying, The hearts of the men of Israel are after Absalom.",
        "part5": "Absalom enjoyed great success in winning the hearts of the people and they flocked to him in droves. A coup was in progress as Absalom advanced to ascend the throne.\n\nOn hearing the news, David appeared resigned to the fact. There was not so much as a complaint or fret, nor did he put up any resistance. Why not fight to defend his throne? David understood this was part of God's punishment for his adulterous sin. To resist Absalom at this time, would be tantamount to resisting God.\n\nEarlier, David had already felt the effect of his transgression in his own family when the baby born to Bathsheba died and Absalom murdered Amnon. Now the consequences of David's sin would be felt by the whole nation. He wanted to spare the innocent people of Jerusalem pain and suffering which a battle between a father king and his usurper son would cause. What irony that Absalom whom David loved so much, yet was filled with such vicious hate for his father, would be the rod God used to chastise David. He understood that the righteous, all-wise God corrects His children for their good, and trusted God to give him grace to endure this correction. Therefore, David would not resist but humbly submit to God's will. Although David was being chastised for his sins, he knew his sin was forgiven [2 Samuel 12:13] and did not lose sense of God's loving kindness. Although Absalom's rebellion fulfilled Nathan's prophecy, God would also hold Absalom accountable for his wickedness.",
        "part6": "THOUGHT",
        "part7": "\"If ye endure chastening, God dealeth with you as with sons; for what son is he whom the father chasteneth not?\" [Hebrews 12:7]. Let us learn to accept the correction that comes from our holy God.",
        "part8": [
            "JUDGES 7",
            "ACTS 13"
        ]
    },
    "27 JULY": {
        "part1": "2 Samuel 15:15-17",
        "part2": "Pledge of loyalty",
        "part3": "VERSE 15",
        "part4": "And the king's servants said unto the king, Behold, thy servants are ready to do whatsoever my lord the king shall appoint.",
        "part5": "Even as news came that most of Israel had switched sides and now turned against David, his servants pledged loyalty to him. These would have included some government officials, military officers, and palace staff of the royal family. This provided David some comfort in desperate times, yet the danger was great because David's supporters were greatly outnumbered by Absalom's.\n\nThese loyal servants would have seen David and Absalom up close in the palace, even in their unguarded moments, and noticed distinct differences between them. David was a man after God's own heart and communed often with God. The many psalms David wrote reflected the trust and confidence he placed in God even in times of affliction. David humbly acknowledged God's blessings upon him and Israel [2 Samuel 7:18-29] and extolled the goodness of God to the people around him. David often sought God's wisdom and desired to act in obedience to God's will both in times of prosperity and distress.\n\nIn contrast, Absalom was proud, vain, and covetous. There was no god in his life save self, and any religiosity he displayed was pretence. The people who followed him were deceived by his lies and hypocrisy. God granted David's loyal followers the ability to discern that David was a God-fearing and rightful king of divine appointment, whereas Absalom was but a handsome God-rejecting fool. May God also grant us wisdom and discernment to make good judgement and the right choices in life for His glory.",
        "part6": "THOUGHT",
        "part7": "The wicked, through the pride of his countenance, will not seek after God: God is not in all his thoughts. - Psalm 10:4",
        "part8": [
            "JUDGES 8",
            "ACTS 14"
        ]
    },
    "28 JULY": {
        "part1": "2 Samuel 15:18",
        "part2": "Support from foreign forces",
        "part3": "VERSE 18",
        "part4": "And all his servants passed on beside him; and all the Cherethites, and all the Pelethites, and all the Gittites, six hundred men which came after him from Gath, passed on before the king.",
        "part5": "The Cherethites and Pelethites were soldiers led by Beniah, son of Jehoiada. They were loyal to David in the revolts by Absalom and the rebel Benjamite Sheba [2 Samuel 20:7]. They formed the bodyguard at Solomon's anointing after Adonijah's attempt to succeed David as king [1 Kings 1:38]. Bible scholars believe they came from Crete and the land of the Philistines.\n\nThe Gittites were from Gath, a Philistine city where David had sought refuge before while fleeing from Saul. As they possibly followed David when he left Gath then, they now followed him out of Jerusalem. The Cherethites, Pelethites and Gittites proved valuable and valiant in the fighting that followed, ensuring Absalom's forces were defeated.\n\nIt is interesting to note that these foreigners remained true to David while many of David's countrymen abandoned him. Having witnessed his life, obedience, and submission to God's will while on the run from Saul, they would have been impressed with David's love for God and his country. They would have been struck by his God- fearing heart and embraced the Jewish religion through David's example. David's leadership and military skills won them over too. All these warriors wanted David as their leader and supported him wholeheartedly, not least because he was God's anointed. If God was backing David, they would be with David too. Absalom's horses, runners and good looks did not impress them, nor would his promises and flattery move them. May God open our spiritual eyes to differentiate holiness from sin, so we are not led down the wrong path of destruction.",
        "part6": "THOUGHT",
        "part7": "I have hated them that regard lying vanities: but I trust in the LORD ... Be of good courage, and he shall strengthen your heart, all ye that hope in the LORD. - Psalm 31:6, 24",
        "part8": [
            "JUDGES 9",
            "ACTS 15"
        ]
    },
    "29 JULY": {
        "part1": "2 Samuel 15:19-21",
        "part2": "Ittai",
        "part3": "VERSE 21",
        "part4": "And Ittai answered the king, and said, As the LORD liveth and as my lord the king liveth, surely in what place my lord the king shall be, whether in death or life, even there also will thy servant be.",
        "part5": "Ittai was the commander of the Gittites, who together with the Cherethites and Pelethites, were mercenaries serving David as vassals rather than part of his regular army. The Gittites came from Gath and may have been a military group formed during David's time at Gath serving Achish [1 Samuel 27].\n\nBeing a foreigner and non-Israelite [v. 19], Ittai was already in exile from the land of Gath and only recently settled [v. 20] in Jerusalem. David dissuades him from following for he does not want Ittai to endure the hardship of roaming the wilderness. David wishes him well and tells him his service is to whoever is king, resigned to the fact that he has lost the kingship. His farewell blessing expresses the desire that the Lord shows steadfast love and faithfulness to Ittai.\n\nIttai's response exhibits a knowledge of Jehovah, and great loyalty acknowledging David as God's chosen king. Using God's covenant name, he acknowledges that the Almighty God lives and is actively sovereign, preserving David's life. Thus, the true and living God is the basis for his desire to be wherever David is, as he is God's anointed king, and serving him to the end. He was not merely a mercenary whose services were for hire and whose allegiance was changeable, but a foreigner outside God's chosen people now choosing to stay with God's chosen king and trusting the one living and true God.\n\nLikewise, we must serve God because He first loved us [1 John 4:19] and saved us so that we are henceforth inseparable from Him in our Lord Jesus Christ [Romans 8:38-39].",
        "part6": "THOUGHT",
        "part7": "God the Son's love, loyalty and humble obedience to God the Father's will, fulfilled His plan to save us to be His children. Read John 6:38.",
        "part8": [
            "JUDGES 10",
            "ACTS 16"
        ]
    },
    "30 JULY": {
        "part1": "2 Samuel 15:22-23",
        "part2": "David's road of tears",
        "part3": "VERSE 23",
        "part4": "And all the country wept with a loud voice, and all the people passed over: the king also himself passed over the brook Kidron, and all the people passed over, toward the way of the wilderness.",
        "part5": "David, anointed king, one-time shepherd boy, giant slayer, great warrior, king of Israel in the royal city, now has to flee into the wilderness. David was reaping the fruits of sin. It had started with his lust for Bathsheba, leading to the murder of Uriah and his attempted cover up for which God had pronounced \"the sword shall never depart from thine house\" [2 Samuel 12:10a]. Now David's son Absalom was lusting after what was not his, usurping his father's throne. Such is sin. Sin is never alone for oft it comes with companions and then begets even more. The result is tears and sorrow all round.\n\n\"Then when lust hath conceived, it bringeth forth sin: and sin, when it is finished, bringeth forth death\" [James 1:15]. The people who witnessed this departure wept. Did they weep for how the king and his kingdom had fallen? Or perhaps for what they had lost materially and the uncertain times ahead? Were they weeping for the sins which had led to this national tragedy?\n\nDavid crossed the Kidron in tears. In the Kidron valley lies the Garden of Gethsemane where some 1000 years later, the promised seed of David, our Lord Jesus Christ would pray on His way to Calvary to die for our sins. He would shed much tears for our sins. God has revealed how terrible sin is, in its immediate and far-reaching effects both personally and nationally. Knowing this, we must weep for our sins and turn to the only sinless Mediator, the Lord Jesus Christ, to seek forgiveness from God. Turn to Him. He is gracious to forgive.",
        "part6": "THOUGHT",
        "part7": "For the people shall dwell in Zion at Jerusalem: thou shalt weep no more: he will be very gracious unto thee at the voice of thy cry; when he shall hear it, he will answer thee. - Isaiah 30:19",
        "part8": [
            "JUDGES 11",
            "ACTS 17"
        ]
    },
    "31 JULY": {
        "part1": "2 Samuel 15:24",
        "part2": "Zadok",
        "part3": "VERSE 24",
        "part4": "And lo Zadok also, and all the Levites were with him, bearing the ark of the covenant of God: and they set down the ark of God; and Abiathar went up, until all the people had done passing out of the city.",
        "part5": "Zadok was a descendant of Aaron the first high priest of Israel, and a leader of his family of Levites [1 Chronicles 27:17]. He was a priest and son of Ahitub [2 Samuel 8:17]. His lineage goes back through Phinehas to Eleazar, Aaron's third son. He was co-high priest with Abiathar at this point in time. He led the Levites carrying the Ark of the Covenant which represented God's presence with Israel.\n\nHere, Zadok continued to fulfil his role as priest to serve God and His anointed king. In spite of difficult and challenging times, when we fulfil the role God has given us, we display our nature as God's children. We are then living out the truth as His chosen people rather than living a life of our pleasing. Zadok is from a faithful line that traces back to Eleazar. Eleazar's son, Phinehas, was given the high priesthood for being \"zealous for his God and made an atonement for the children of Israel\" [Numbers 25:11-13] during their whoredom in the wilderness. Abiathar however traces back through Eli's evil son Phinehas to Ithamar, Aaron's fourth son. Recall that Nadab and Abihu, Aaron's first two sons were consumed by divine wrath for offering strange fire [Leviticus 10]. Then Eli's wicked sons, Hophni and Phinehas abused their priesthood and God promised the end of Eli's line of priesthood in time [1 Samuel 3:13].\n\nZadok was persistently faithful and later obeyed David in anointing Solomon [1 Kings 1:32-34] contrasting Abiathar who supported Adonijah's attempt to usurp the throne [1 Kings 1:7]. Thus, faithful obedience resulted in Zadok becoming the sole high priest, returning the office to Phinehas' line and fulfilling God's word in Numbers 25.",
        "part6": "THOUGHT",
        "part7": "Be faithful for \"the Lord is faithful, who shall stablish you, and keep you from evil.\" [2 Thessalonians 3:3]",
        "part8": [
            "JUDGES 12",
            "ACTS 18"
        ]
    }
}