{
    "1 OCTOBER": {
        "part1": "Romans 11:25",
        "part2": "The Mystery of Israel's Blindness",
        "part3": "VERSE 25",
        "part4": "For I would not, brethren, that ye should be ignorant of this mystery, lest ye should be wise in your own conceits; that blindness in part is happened to Israel, until the fulness of the Gentiles be come in.",
        "part5": "God has chosen Israel \"to be a special people unto Himself, above all people that are upon the face of the earth\" [Deuteronomy 7:6]. To them \"were committed the oracles of God\" [Romans 3:2]. In spite of their privilege, they forsook God \"the fountain of living waters\" [Jeremiah 2:13]. Their disobedience and unbelief led to spiritual blindness and hardening of their hearts.\n\nThe mystery Paul wrote about in verse 25 was the Gospel reaching the Gentiles. The Old Testament had made it clear that Gentiles would be part of God's salvation plan [Genesis 12:1-3; Psalm 117:1; Isaiah 60:3]. But Jews could not accept that \"the Gentiles should be fellowheirs, and of the same body, and partakers of his promise in Christ by the gospel\" [Ephesians 3:6]. And by their rejecting the Gospel, they also rejected the Christ of the Gospel. They became wise in their own conceit and spiritual blindness set in.\n\nThe Jews were zealous, \"but not according to knowledge\" [Romans 10:2]. Having rejected God's righteousness, they set out to establish their own [Romans 10:3]. Their ignorance and defiance of God would lead to their destruction [Hosea 4:6].\n\nThis same danger faces the church today. There are people who sit under the faithful preaching of the Gospel; they hear God's Word taught week after week, but the Word has no lasting effect on them. God's Word to them is like a passing wind, leaving nothing but a tickling of the ears. If we are not careful, our own arrogance and defiance can also cause us to reject God and His Word, and the end result will be a hardening of our hearts to the things of God.",
        "part6": "THOUGHT",
        "part7": "Our hearts under the ministry of God's word can be like a piece of ice that melts under the sun, or like cement that hardens in its heat.",
        "part8": [
            "1 KINGS 1",
            "EPHESIANS 1"
        ]
    },
    "2 OCTOBER": {
        "part1": "Romans 11:25",
        "part2": "Israel's Blindness in Part",
        "part3": "VERSE 25",
        "part4": "For I would not, brethren, that ye should be ignorant of this mystery, lest ye should be wise in your own conceits; that blindness in part is happened to Israel, until the fulness of the Gentiles be come in.",
        "part5": "The Bible warns against being wise in (our) own conceits\" [Romans 12:16]. This is the cause of spiritual blindness - an ailment that afflicted the children of Israel. In their attempt to keep out Gentiles from God's redemptive plan, they kept themselves from the Promised Messiah.\n\nPaul writes that this \"blindness in part is happened to Israel\". To be sure, the blindness which fell on the Jews was not arbitrary but the result of God's righteous judgment against their willful ignorance of the truth and defiance against Him.\n\nThere are two ways to look at this \"partial\" blindness. The first view is that this blindness of the Jews resulting from their rejection of Christ will be lifted at some future time, and they will finally embrace Jesus and the truth of the Gospel. In other words, this judicial blindness would end when Christ returns. The other view takes it that only a portion of Jews were stricken with this blindness. After all, Paul and the other apostles were Jews, as were many of the early believers in the first-century church.\n\nRegardless of how one views this \"partial blindness\", there is embedded in it the grace of God - grace that is applied both to Jews and Gentiles. Grace to the Gentiles because the Gospel of Christ never excluded believing Gentiles. Grace to the Jews because this blindness is partial and believing Jews would also be brought back into the fold of salvation. All - Jew and Gentile alike - stand equally in need of a Saviour. All are one in Christ.",
        "part6": "THOUGHT",
        "part7": "The gospel of Christ .. is the power of God unto salvation to every one that believeth; to the Jew first, and also to the Greek. - Romans 1:16.",
        "part8": [
            "1 KINGS 2",
            "EPHESIANS 2"
        ]
    },
    "3 OCTOBER": {
        "part1": "Romans 11:25",
        "part2": "Fullness of Gentiles Be Come In",
        "part3": "VERSE 25",
        "part4": "For I would not, brethren, that ye should be ignorant of this mystery, lest ye should be wise in your own conceits; that blindness in part is happened to Israel, until the fulness of the Gentiles be come in.",
        "part5": "In Romans 11:25, the Apostle Paul makes a clear distinction between Israel and the Gentiles. Paul, then declares that a spiritual blindness has fallen judicially upon the children of Israel because of their rejection of Christ and the Gospel. This spiritual blindness, however, is only in part because God has an elect remnant from the nation of Israel.\n\nPaul also states that the judicial hardness upon Jews shall only last until the fullness of the Gentiles (or nations) comes into the visible Church. By bringing the Gentiles to Himself, the veil that had so blinded the Jews would be removed, and they will turn to Christ [2 Corinthians 3:14-16]. They too - like the Gentiles - would be brought to Christ and grafted back into the visible Church.\n\nThere is both a sense of duality and unity. Duality because God has not given up on the Jews and Gentiles are brought into the fold of salvation. And there is unity because Christ \"is our peace, who hath made both one, and hath broken down the middle wall of partition between us (Jews and Gentiles)\" and that the latter are \"fellowheirs [with the Jews],and of the same body, and partakers of his promise in Christ by the gospel\" [Ephesians 2:14; 3:6].\n\nGod is not done with Israel as a nation even though it is God's enemy presently due to its rejection of Christ and the Gospel. Israel is still God's covenantally beloved because of the promises the LORD had made to their fathers. The Psalmist writes: \"My lovingkindness will I not utterly take from him, nor suffer my faithfulness to fail. My covenant will I not break, nor alter the thing that is gone out of my lips. Once have I sworn by my holiness that I will not lie unto David\" [Psalm 89:33-35]. ",
        "part6": "THOUGHT",
        "part7": "For all the promises of God in him are yea, and in him Amen, unto the glory of God by us. - 2 Corinthians 1:20",
        "part8": [
            "1 KINGS 3",
            "EPHESIANS 3"
        ]
    },
    "4 OCTOBER": {
        "part1": "Romans 11:26",
        "part2": "Is God Done with Israel? (Part 1)",
        "part3": "VERSE 26",
        "part4": "And so all Israel shall be saved: as it is written, There shall come out of Sion the Deliverer, and shall turn away ungodliness from Jacob",
        "part5": "The nation of Israel is in the news regularly, largely because of its struggle with its Arab neighbours, especially the Palestinians in the Gaza Strip and the West Bank. God's Word explicitly teaches that ancient Israel was God's chosen nation [Deuteronomy 7:6] and He has a special program and purpose for her to fulfill in history, but the Jews rejected Jesus Christ as their Messiah.\n\nJohn says, \"Jesus came unto his own, and his own received him not\"[John 1:11].\" When a choice was given them as to whom they wanted crucified, the Jews cried out, \"Let him (Jesus) be crucified ... His blood be on us, and on our children [Matthew 27:22-25].\n\nFor this reason, throughout history, Christians have asked - \"Is God finished with Israel?\" There are Christians who believe that God is through with the Jews; that He has abandoned the nation. In Romans 11:1 Paul asks the question, \"Hath God cast away his people?\" [v. 1]. Paul would use three chapters [Romans 9, 10 and 11] to discuss God's dealings with that nation. Paul was concerned that we should not be ignorant of God's dealings with Israel.\n\nTo answer this question, let us consider first who was the Israel Paul was referring to in Romans 11:26. The word \"Israel\" occurs over 70 times in the New Testament. In almost every case, it refers to the old covenant nation or the physical descendants of Abraham through Isaac and Jacob. In Romans 9, 10 and 11, there are 12 references to Israel [Romans 9:4, 6, 27, 31; 10:1, 19, 21; 11:1, 2, 7, 25, 26]. It is also clear that when Paul speaks of Israel in Romans 9, 10, and 11, he is speaking of ethnic Israel. He is speaking of the Jews in distinction from the Gentiles. Israel in Romans 11:26 does not refer to the church.",
        "part6": "THOUGHT",
        "part7": "God is faithful. \"My covenant will I not break, nor alter the thing that is gone out of my lips. Once have I sworn by my holiness that I will not lie unto David\". - Psalm 89:34-35",
        "part8": [
            "1 KINGS 4-5",
            "EPHESIANS 4"
        ]
    },
    "5 OCTOBER": {
        "part1": "Romans 11:26",
        "part2": "Is God Done with Israel? (Part 2)",
        "part3": "VERSE 26",
        "part4": "And so all Israel shall be saved: as it is written, There shall come out of Sion the Deliverer, and shall turn away ungodliness from Jacob",
        "part5": "God's Word certainly distinguishes between Israel and the church. The Apostle Paul describes the church as a mystery [see Ephesians 3:1-10; Colossians 1:24-27]. If that is the case, it begs the question: what does God have in store for Israel in the future?\n\nPaul writes: \"All Israel shall be saved\". The question is who the \"all Israel\" Paul refers to. Does \"all Israel\" refer to every Jew? Does it mean that every Jew will be saved on account of his/her ethnicity? The answer is unquestionably no, just as we do not interpret \"the world\" in John 3:16 or 1 John 2:2, or \"all men unto justification\" [Romans 5:18], or \"every man\" [Hebrews 2:9] as referring to every person in the whole world. Such an interpretation would result in the error of universal salvation. The word \"all\" cannot be interpreted distributively, inclusively, or universally. Rather, \"all\" is to be interpreted restrictively.\n\nThus, when Paul says \"all Israel shall be saved\", the salvation experience he is talking about is the same salvation the Gentiles would have, which is to be delivered from sin, guilt and death by faith in Jesus Christ. To be saved means to be justified through the blood and righteousness of our Lord Jesus Christ. \"All Israel shall be saved\" are all those Paul described as the \"remnant according to the election of grace\" [v. 5].\n\nThere never has been, nor ever will be but one way of salvation. There is only one means of salvation because there is only one Saviour. And He, as Isaiah prophesied and quoted by Paul, \"the Redeemer shall come to Zion, and unto them that turn from transgression in Jacob\". [Isaiah 59:20]",
        "part6": "THOUGHT",
        "part7": "Only one means of salvation. Only one Saviour. \"For there is one God, and one mediator between God and men, the man Christ Jesus;\" - 1 Timothy 2:5",
        "part8": [
            "1 KINGS 6",
            "EPHESIANS 5"
        ]
    },
    "6 OCTOBER": {
        "part1": "Romans 11:26",
        "part2": "All Israel shall be saved",
        "part3": "VERSE 26",
        "part4": "And so all Israel shall be saved: as it is written, There shall come out of Sion the Deliverer, and shall turn away ungodliness from Jacob.",
        "part5": "The second part of Romans 11:26 is a quotation from Isaiah 59:20. \"And the Redeemer shall come to Zion, and unto them that turn from transgression in Jacob, saith the LORD\" [Isaiah 59:20]. In the context of Isaiah, the prophet is saying that the LORD will intervene - the Redeemer shall come to Zion, but even then there was a caveat; not all who claim to be of Zion will be saved; only those who \"shall turn away ungodliness\".\n\nSo \"all Israel\" does not mean every Jew, regardless of whether or not he has confessed Christ as Saviour, will be saved. It also does not mean that every Jew who is living at the return of Christ shall be saved.\n\nThe phrase \"all Israel\" parallels \"the fullness of the Gentiles\" [v. 25]. Paul is making the point that God has been saving, is saving, and will be saving both Jews and Gentiles, but only by and through faith in the atoning work of Jesus Christ. Paul will later allude to the organic unity of the elect. There will be one single good olive tree [v. 24], with the Jews being the \"natural branches\" [v. 21, 24], and the Gentiles being the branches of the wild olive tree [v. 17, 24]. Louis Berkhof comments, \"'All Israel' is to be understood as a designation not of the whole nation but of the whole number of the elect out of the ancient covenant people...and the adverb 'so' cannot mean 'after that,' but only 'in this manner.'\"\n\n\"Hath God cast away his people (the Jews)? God forbid\" [v. 1, 11]. What about Gentiles (you and I)? By faith in Christ, salvation is come to us. Praise the LORD!",
        "part6": "THOUGHT",
        "part7": "All that the Father giveth me shall come to me; and him that cometh to me I will in no wise cast out. - John 6:37.",
        "part8": [
            "1 KINGS 7",
            "EPHESIANS 6"
        ]
    },
    "7 OCTOBER": {
        "part1": "Romans 11:26-27",
        "part2": "God's Covenant with Israel",
        "part3": "VERSES 26-27",
        "part4": "And so all Israel shall be saved: as it is written, There shall come out of Sion the Deliverer, and shall turn away ungodliness from Jacob: For this is my covenant unto them, when I shall take away their sins.",
        "part5": "The phrase - \"it is written\" - one word in Greek is derived from the noun from which we get the English word \"scripture\" [see 2 Timothy 3:16], but the phrase does not simply mean that the words are recorded in some book somewhere, but rather that the words used are inscripturated somewhere else in divinely inspired Scripture.\n\nRomans 11:26 is a quotation from Isaiah 59:20. When Romans 11:26b is juxtaposed with Isaiah 59:20, there is a minor difference. In Romans 11:26b, Paul says the Deliverer \"shall come out of Sion\" [Romans 11:26]. The exact words from Isaiah 59:20 are that the Redeemer \"shall come to Zion\" [Isaiah 59:20]. Paul has by inspiration of the Holy Spirit altered the preposition from \"to\" to \"out of \" Zion. The change came by way of Paul using words from another text of Scripture, namely, Psalm 14:7 - \"Oh that the salvation of Israel were come out of Zion! when the LORD bringeth back the captivity of his people, Jacob shall rejoice, and Israel shall be glad.\" It is not unusual that NT verses are derived from a combination of OT verses; for example, Romans 9:33 is a combination of Isaiah 28:16 and 8:14. But Paul did not simply replace the prepositions, he did so by using Scripture itself. Paul has taken the words and meaning of Zion as found in Psalm 14:7 and combined them with the words from Isaiah 59:20.\n\nPaul's intent is to show that the Redeemer who \"shall come to Zion\" [Isaiah 59:20] is also the Deliverer who \"shall come out of Sion\" [Romans 11:26; Psalm 14:7]. The Gospel according to John reminds us that Jesus came unto His own (Jews), but He was rejected. But \"as many (Jews and Gentiles) as received Him and to believe on His name, they are \"become the sons of God\" [John 1:12]. Believe in Christ as your Redeemer, and you shall be a child of God.",
        "part6": "THOUGHT",
        "part7": "Christ will come in great power to subdue sinful hearts, O Lord, hasten the day.",
        "part8": [
            "1 KINGS 8",
            "PHILIPPIANS 1"
        ]
    },
    "8 OCTOBER": {
        "part1": "Romans 11:28",
        "part2": "Enemies for Your Sake",
        "part3": "VERSE 28",
        "part4": "As concerning the gospel, they are enemies for your sakes: but as touching the election, they are beloved for the fathers' sakes.",
        "part5": "Paul, in Romans 11:28, makes an intriguing point which begs an equally intriguing question - \"Can one person be both an enemy of the gospel and saved?\" Paul's answer is categorically yes! Following the argument from the preceding verses, Paul says that the spiritual blindness and hardened hearts of Jews led to their rejection of the Lord Jesus Christ and the orchestration of the crucifixion of the Promised Messiah.\n\nHowever, their animosity against Jesus worked for the spiritual benefit of Gentiles. In that sense, the Jews who rejected Christ were enemies of the Gospel. Paul told the Corinthians that the preaching of the crucified Christ was to \"the Jews a stumblingblock\" [1 Corinthians 1:23]. Furthermore, the Jews were opposed to the dissemination of the Gospel. Saul of Tarsus was a prime example.\n\nThe persecution of Christians and hostility against the Gospel, however, fueled its growth. Luke records for us that when the Jews turned against Paul and Barnabas [Acts 13:50], they declared that the Jews had judged themselves \"unworthy of everlasting life\" and so they turned to the Gentiles [Acts 13:46]. And when the Gentiles heard the Gospel, \"they were glad, and glorified the word of the Lord: and as many as were ordained to eternal life believed\" [Acts 13:48].\n\nIn spite of the animosity of Jews against Christ and His Gospel, Paul adds \"they are beloved\", meaning that the same Jews who were once enemies of the Gospel had become beloved of God - a great change on account of God's eternal and immutable decree that former enemies (who we were) can become friends (what we are now).",
        "part6": "THOUGHT",
        "part7": "For God commendeth his love toward us, in that, while we were yet sinners, Christ died for us. - Romans 5:8",
        "part8": [
            "1 KINGS 9",
            "PHILIPPIANS 2"
        ]
    },
    "9 OCTOBER": {
        "part1": "Romans 11:28",
        "part2": "Beloved for the Fathers' Sake",
        "part3": "VERSE 28",
        "part4": "As concerning the gospel, they are enemies for your sakes: but as touching the election, they are beloved for the fathers' sakes.",
        "part5": "In his searing indictment against the Jews on Pentecost, Peter said, \"Ye men of Israel .. Jesus of Nazareth, a man approved of God among you by miracles and wonders and signs, which God did by him in the midst of you, as ye yourselves also know: Him .. ye have taken, and by wicked hands have crucified and slain\" [Acts 2:22-23]. Peter did not mince his words. He was saying that the Jews (men of Israel) were, as far as the Gospel is concerned, enemies of Christ.\n\nHowever, as far as election is concerned, they were beloved for the sake of their fathers. In verses 30 and 31, the \"enemies\" and the \"beloved\" ones are the same people, namely, they are God's elect. They were at first hostile to the Gospel, but later, because of the wonderful manifestation of God's mercy, they become friends.\n\nThe same Jews who at one time were enemies of the Gospel had become friends, beloved of God, and fellow believers. This great change will occur because the former enmity and the subsequent friendship had been decreed by God's covenant.\n\nThey were beloved \"for the fathers' sake\". This does not mean that there was some innate goodness or merit pertaining to Abraham, Isaac, and Jacob but solely because of God's promise to the fathers. God told Abraham, \"And I will establish my covenant between me and thee and thy seed after thee in their generations for an everlasting covenant, to be a God unto thee, and to thy seed after thee\" [Genesis 17:7]. Like the Jews, we too are rejected - enemies of God - on account of our disobedience, but we are loved on account of God's grace.",
        "part6": "THOUGHT",
        "part7": "We deserve every ounce of God's righteous wrath because of who we are and what we have done. That we are saved is by God's grace alone.",
        "part8": [
            "1 KINGS 10",
            "PHILIPPIANS 3"
        ]
    },
    "10 OCTOBER": {
        "part1": "Romans 11:29-30",
        "part2": "Gifts and Calling",
        "part3": "VERSES 29-30",
        "part4": "For the gifts and calling of God are without repentance. For as ye in times past have not believed God, yet have now obtained mercy through their unbelief:",
        "part5": "Romans 11:29 must be understood in light of God's covenantal promises to Israel. The \"gifts and calling\" refer to the privileges Israel enjoyed as God's chosen people. They were given the oracles of God [Romans 3:2]. To them were given \"the glory, and the covenants, and the giving of the law, and the service of God, and the promises\" [Romans 9:4]. However, they did not treasure their God-given privileges. Israel had a history of rebellion against God and rejection of His promised Messiah.\n\nBy human judgment, the promises God made to Israel should have been justly abrogated. Israel rightly deserved God's judgment. But this was not so. Romans 11:29 says that the privileges God has given Israel are \"that is repentance\". This is one word in Greek that is used only twice in the New Testament in this verse and in 2 Corinthians 7:10. The phrase simply means \"irrevocable\". Even when they had rejected the Messiah, they themselves were not rejected. \"Hath God cast away his people?\" Paul asked rhetorically. \"God forbid\" (v. 1).\n\nThis is God's faithfulness. God cannot lie [Titus 1:2; Psalm 89:35; Hebrews 6:18]. As Israel settled in the Promised Land, Joshua reminded the people, \"There failed not ought of any good thing which the LORD had spoken unto the house of Israel; all came to pass\" [Joshua 21:45]. God will not abandon His people [Hebrews 13:5]. Our unbelief does not nullify God's promises [Romans 3:3]. \"If we believe not, yet he abideth faithful: he cannot deny himself \". - [2 Timothy 2:13]\n\nThe veracity of God and the truthfulness of His promises is the assurance of God's continued relationship despite our vacillating loyalty.",
        "part6": "THOUGHT",
        "part7": "Our hope in God is not that we hold on to Him but that He holds on to us.",
        "part8": [
            "1 KINGS 11",
            "PHILIPPIANS 4"
        ]
    },
    "11 OCTOBER": {
        "part1": "Romans 11:31-32",
        "part2": "God's Mercy",
        "part3": "VERSES 31-32",
        "part4": "Even so have these also now not believed, that through your mercy they also may obtain mercy. For God hath concluded them all in unbelief, that he might have mercy upon all.",
        "part5": "The history of mankind - Jews and Gentiles alike - can be summed up in one phrase - rebellion against God. \" For all have sinned, and come short of the glory of God\" [Romans 3:23]. The disobeience of the Gentile, however, is somewhat different from the disobedience of Israel.\n\nThe disobedience of Gentiles is marked by godless idolatry. Paul says that Gentiles are \"by nature the children of wrath .. aliens from the commonwealth of Israel, and strangers from the covenants of promise, having no hope, and without God in the world\" [Ephesians 2:3, 12].\n\nIsrael's disobedience is characterized by the rejection of Jesus of Nazareth as the Promised Messiah and the apostolic preaching of His resurrection, which to them was a stumbling block [see 1 Corinthians 1:23]. The Jews were hardened and unbelieving; God chose them to be His own; He gave them the Law; He sent the prophets; He promised them His Son, but they despised them all and spoke \"evil of that Way\" [Acts 19:9].\n\nSinners - Jews or Gentiles - are responsible for their sins. We have lost all claim on God. If we are to be saved, it will not be on account of our own righteousness but on the principle of mercy - God's mercy to the Gentiles came by way of Israel's hardened rejection and disobedience of Christ. The Jews receive mercy by the example of mercy that God has shown to Gentiles.\n\nIn either case, regardless of the nature of disobedience, salvation comes to sinners only because God, in His rich mercy and great love, seeks and calls us to saving faith. Sinners are \"dead in trespasses and sins ... But God, who is rich in mercy, for his great love wherewith he loved us ... hath quickened us together with Christ. [Ephesians 2:15]",
        "part6": "THOUGHT",
        "part7": "God has dealt with us in grace (unearned favor) and He has shown mercy when we have no hope.",
        "part8": [
            "1 KINGS 12",
            "COLOSSIANS 1"
        ]
    },
    "12 OCTOBER": {
        "part1": "Romans 11:33-34",
        "part2": "Depth of God's Riches",
        "part3": "VERSES 33-34",
        "part4": "O the depth of the riches both of the wisdom and knowledge of God! how unsearchable are his judgments, and his ways past finding out! For who hath known the mind of the Lord? or who hath been his counseller?",
        "part5": "When Paul reflects on the mercy of God to Israel and Gentiles, he broke out in exuberant praise of God's wisdom. The last four verses of Romans 11 can rightly be classified as a hymn of praise.\n\nPaul makes a distinction between God's wisdom and knowledge. The biblical concept of knowledge (Gk: gnosis) is more than just an understanding of what is factual and true. It is personal rather than principal, existential rather than philosophical, God-centred rather than man-centred. It is manifested in Christ - the eternal Logos, who is \"full of grace and truth\" [John 1:14; Hebrews 1:1]. Thus, the knowledge of God denotes His omniscience - His divine insight of all things.\n\nThe wisdom of God is His ability to direct all things to His perfect end. God chooses the best means to attain the best goals. It has been described as divine effectiveness. \"All things (will) work together for good to them that love God, to them who are the called according to his purpose\" [Romans 8:28]. Like divine knowledge, God's wisdom is also personified in the Person of Christ.\n\nBecause of the depth of God's wisdom and knowledge, His ways and judgments are beyond human comprehension. His thoughts are not our thoughts, and His ways are higher than our ways [see Isaiah 55:8-9]. What man indeed has the ability to probe the mind of God? And who has the ability to act as the divine counsellor? The finite nature of mankind can never understand the ways of an infinite God. Man cannot trace the ways and judgments of God. So rather than irreverently investigating the unknown, we humbly bow and receive what God has chosen to reveal to us.",
        "part6": "THOUGHT",
        "part7": "The secret things belong unto the LORD our God: but those things which are revealed belong unto us and to our children for ever, that we may do all the words of this law. - Deuteronomy 29:29",
        "part8": [
            "1 KINGS 13",
            "COLOSSIANS 2"
        ]
    },
    "13 OCTOBER": {
        "part1": "Romans 11:35-36",
        "part2": "Of, through, to and are...",
        "part3": "VERSES 35-36",
        "part4": "Or who hath first given to him, and it shall be recompensed unto him again? For of him, and through him, and to him, are all things: to whom be glory for ever. Amen.",
        "part5": "In the closing verses of Romans 11, Paul brings us to the pinnacle of praise as he talks about the mercy of God in bringing together the Jews and Gentiles as one body in Christ. As Paul considers God's mind, ways, and wisdom, as he considers God's eternal decree and counsel, he asks, \"who hath first given to him, and it shall be recompensed unto him again?\" Paul is asking a rhetorical question - is there someone who can give to God in such a way that God becomes indebted to him? The answer is a resounding NO!\n\nThe question is important because this is precisely what some people think who have a quid pro quo attitude in their relationship with God. They seek to make God a debtor - \"If I do this or that, God will owe me His favour.\"\n\nBut God is not a debtor because He is the Creator. All things are of Him, come through Him, and unto Him. We cannot give to God what already belongs to Him. The Psalmist reminds us that \"every beast of the forest is (God's), and the cattle upon a thousand hills\" [Psalm 50:10]. David, when he had given to the building of the temple, said, \"But who am I, and what is my people, that we should be able to offer so willingly after this sort? for all things come of thee, and of thine own have we given thee\" [1 Chronicles 29:14].\n\nGod is also not a debtor to our \"righteousness\". The righteousness of our hands is as filthy rags [Isaiah 64:6]. No amount of good deeds we do can oblige God to save us [Titus 3:5]. Salvation is completely a work of God. God cannot be made a debtor. He owes us nothing but His condemnation.",
        "part6": "THOUGHT",
        "part7": "All of God's judgement upon us is our own doing.\nAll of God's goodness to us is by His grace.",
        "part8": [
            "1 KINGS 14",
            "COLOSSIANS 3"
        ]
    },
    "14 OCTOBER": {
        "part1": "Romans 12:1",
        "part2": "Living sacrifice",
        "part3": "VERSE 1",
        "part4": "I beseech you therefore, brethren, by the mercies of God, that ye present your bodies a living sacrifice, holy, acceptable unto God, which is your reasonable service.",
        "part5": "In the first 11 chapters of Romans, Paul provided his readers and those generations later the most comprehensive and precise statement of the Gospel and doctrines of the church for understanding man's condition, his needs, and God's provision of the answer. In the second part of this letter (chapters 12 to 16), he turns his attention to the practical application of those doctrines and how a Christian should live the righteous life God desires. Knowing the theory, what then were they to do in practice? \"Therefore ... present your bodies a living sacrifice, holy, acceptable unto God\".\n\nThe idea of worship sacrifices was nothing new to the Jews and the Gentiles. The Jews according to the Law offered them in contrition for sin, thankfulness for blessing, acknowledgement of God's divinity, and worship to Jehovah. Gentiles offered sacrifices to appease their deities, seek their blessing, and secure their goodwill.\n\nThe supreme final atoning sacrifice for mankind's sin had been made by Christ. Salvation's work was finished at the cross. Lifeless sacrifices were done with. But those for whom Christ died are now to offer themselves to God in love and obedience to Him, in service and blessing to others as an ambassador for Christ. A living sacrifice is to place our hearts, bodies, our all, even life itself at God's disposal, withholding nothing for His glory. And it is the sanctified and consecrated life in which sins are repented of, walking in God's way, ruled by His Word, which is holy and acceptable to Him.\n\nJust as our heavenly Father has done in giving and accepting the living sacrifice His beloved Son made for us, we are to do likewise to the best of our ability.",
        "part6": "THOUGHT",
        "part7": "He hath shewed thee, O man, what is good; and what doth the LORD require of thee, but to do justly, and to love mercy, and to walk humbly with thy God? - Micah 6:8",
        "part8": [
            "1 KINGS 15",
            "COLOSSIANS 4"
        ]
    },
    "15 OCTOBER": {
        "part1": "Romans 12:1",
        "part2": "Reasonable service",
        "part3": "VERSE 1",
        "part4": "I beseech you therefore, brethren, by the mercies of God, that ye present your bodies a living sacrifice, holy, acceptable unto God, which is your reasonable service.",
        "part5": "The offering of us to God as a living sacrifice is the Christian's \"reasonable service\". What are the meaning and implications of this? The word rendered \"reasonable\" does not hold the meaning we have in usage today. It is not opposed to being \"unreasonable\" as though we who have received such a great salvation have a choice and ought to be persuaded to serve as a quid pro quo, although that certainly should be so.\n\nRather, the word \"reasonable\" pertains to that which emanates from reason. It is rational service and worship informed and guided by God's Word. It is therefore sincere spiritual worship from a renewed heart enlightened with God's Word, not the exercise of empty rituals and external observation of do's and dont's devoid of love for God and concern for man, which the Jews' religion had descended to. Neither is it the senseless idol-worship of the Gentile heathens. So Peter says we are lively stones, built up, an holy priesthood, to offer up sacrifices, acceptable to God [1 Peter 2:5].\n\nOffering worship is not an option but an obligation. We belong to Him who has purchased and delivered us from the tyranny of the devil. In the Apostle's words \"Being then made free from sin, ye became the servants of righteousness\" [Romans 6:18]. We serve Him because we are saved. We become a living sacrifice by worshipping and serving with all our heart, body, and mind. Empty profession is not \"reasonable service\" but vanity and false religion. Our God delights in the Christian's heart worship and devotion, not his lip-service.",
        "part6": "THOUGHT",
        "part7": "Jesus said, \"This people draweth nigh unto me with their mouth, and honoureth me with their lips; but their heart is far from me. But in vain they do worship me, teaching for doctrines the commandments of men.\" - Matthew 15:8-9",
        "part8": [
            "1 KINGS 16",
            "1 THESSALONIANS 1"
        ]
    },
    "16 OCTOBER": {
        "part1": "Romans 12:2",
        "part2": "Be not conformed",
        "part3": "VERSE 2",
        "part4": "And be not conformed to this world: but be ye transformed by the renewing of your mind, that ye may prove what is that good, and acceptable, and perfect, will of God.",
        "part5": "A person takes his identity from what he is most closely associated with. The things most dear and near to his heart often shape the person he becomes. They direct his thoughts, occupy his desires, mold his values, and determine his behaviour. A worldly person naturally identifies with the world and conforms to its principles and practices, methods and means, values and interests, customs and lifestyle, appearance and speech.\n\nWe are born to our earthly parents and take on in many ways after them. We are also born into a world of sin with the sin seed of our first father Adam in us. Jesus told the self-righteous Pharisees, \"Ye are of your father the devil, and the lusts of your father ye will do ...\" [John 8:44].\n\nIt is therefore no wonder that as born sinners we will love the world - the lust of the flesh, the lust of the eyes and the pride of life. [1 John 2:15-16] We take to sin as a fish takes to water.\n\nBut when we receive salvation in Jesus Christ, we are freed from the old life and the old ways. We are to break our conformity with the world and offer ourselves as living sacrifices for God's use. We are to turn our backs on all those things we once held dear that go against God's Word and be conformed to Christ in every possible way. And we are able to do so because the Holy Spirit who enables us now dwells in us. In our own strength, this is an impossibility, but praise be to God for with Him all things are possible, even changing and conforming born-again sinners that we are to the likeness of His Son.",
        "part6": "THOUGHT",
        "part7": "There are two omnipotences with Him: 'With God all things are possible .... All things are possible to him that believeth. - Vance Havner, By The Way: Meditations of a Christian Pilgrim",
        "part8": [
            "1 KINGS 17",
            "1 THESSALONIANS 2"
        ]
    },
    "17 OCTOBER": {
        "part1": "Romans 12:2",
        "part2": "Be transformed",
        "part3": "VERSE 2",
        "part4": "And be not conformed to this world: but be ye transformed by the renewing of your mind, that ye may prove what is that good, and acceptable, and perfect, will of God.",
        "part5": "Jesus told Nicodemus, \"That which is born of the flesh is flesh; and that which is born of the Spirit is spirit. Marvel not that I said unto thee, Ye must be born again\" [John 3:6-7].\n\nSpiritual rebirth is the pre-requisite for eternal life. In our first birth, we were born physically alive, but we were already spiritually dead. When Jesus becomes our personal Lord and Saviour, we are born again; we become a child of God and a citizen of His kingdom. A supernatural act happened. \"Therefore if any man be in Christ, he is a new creature: old things are passed away; behold, all things are become new\" [2 Corinthians 5:17].\n\nThe mark of the new creature in Christ is transformation. He undergoes a total change. The spiritual man is transformed by the renewing of his mind. His thinking, affections and loyalties are now aligned with those of the new King of his life and his new identity. His heart, mind, and will are changed by the knowledge of the Gospel, the enlightenment of God's Word, the power of the Holy Spirit, and by the concerns of the age and kingdom to come. He renounces the habits and likings of his old life. He turns his back on his former ways and preoccupations. The transient treasures and fleeting affections of this life hold no more allure for him. He is able to discern God's sovereign and perfect will and demonstrates this in his living and being. He is in the world but not of this world. This is the miraculous transformation which God has wrought.",
        "part6": "THOUGHT",
        "part7": "If ye then be risen with Christ, seek those things which are above, where Christ sitteth on the right hand of God. Set your affection on things above, not on things on the earth. For ye are dead, and your life is hid with Christ in God. - Colossians 3:1-3.",
        "part8": [
            "1 KINGS 18",
            "1 THESSALONIANS 3"
        ]
    },
    "18 OCTOBER": {
        "part1": "Romans 12:3",
        "part2": "Think soberly",
        "part3": "VERSE 3",
        "part4": "For I say, through the grace given unto me, to every man that is among you, not to think of himself more highly than he ought to think; but to think soberly, according as God hath dealt to every man the measure of faith.",
        "part5": "The natural man thinks more highly of himself than he ought. He looks at others and thinks he is better than them. Then he looks at himself and thinks he is really not so bad after all. This is the root of pride. Pride elevates self. Pride which leads to idolatry - the worship of self.\n\nThe biblical injunction and antidote against pride is to think soberly about ourselves. What does it mean to \"think soberly\"? It is to consider seriously and wisely who and what we are. It is making a realistic and honest judgment of ourselves as God sees us. It is realizing that we were lost in sin before we were found by God, that we were under bondage to Satan before our deliverance in Christ. Our uncleanness was odious before Christ's sinless blood washed us white as snow. We were objects of God's wrath before our adoption as sons and daughters of His divine love.\n\nAnd now that God has wrought such as a great salvation in us, how are we to offer our lives to God as an offering of sweet fragrance? We are to consider the \"measure of faith\" God has endowed us with and think with humility and meekness how we can serve God and man with these gifts. And Paul enumerates these gifts of grace in the following verses.\n\nWe must be mindful of the spirit of Lucifer who, though endowed with wondrous gifts, failed to think soberly, but coveted the place of God. And let us have the mind of Christ who though He was God, humbled Himself as a servant to die for our sakes.",
        "part6": "THOUGHT",
        "part7": "Let nothing be done through strife or vainglory; but in lowliness of mind let each esteem other better than themselves. Look not every man on his own things, but every man also on the things of others. Let this mind be in you, which was also in Christ Jesus. - Philippians 2:3-5",
        "part8": [
            "1 KINGS 19",
            "1 THESSALONIANS 4"
        ]
    },
    "19 OCTOBER": {
        "part1": "Romans 12:4-5",
        "part2": "Many members, one body",
        "part3": "VERSE 4",
        "part4": "So we, being many, are one body in Christ, and every one members one of another.",
        "part5": "Many members, one body! There are three aspects of the human body which is a picture of the church of Christ. Firstly, its beauty. After God completed his creation of man and woman, He saw that it was \"very good\" [Genesis 1:31]. The church of God's redeemed, purchased by Christ's blood, assembled together in worship and service to represent her Lord on earth is beautiful in God's eyes. Every true member of this church is wonderfully created in God's image and therefore should reflect His glorious work by their sanctified lives abounding with the fruit of the Spirit.\n\nSecond, its unity. The human body comprises different organs all functioning differently, yet they interact harmoniously with each other. Likewise, the church functions well when the members do their part with oneness of spirit and mind, each esteeming others better than themselves [Philippians 2:3] striving together for the faith of the Gospel [Philippians 1:27]. Our Lord Jesus prays that \"they all may be one\" [John 17:21].\n\nThirdly, its sanctity. When Jesus returned to His heavenly throne, God despatched the Holy Spirit to dwell in every believer's heart. Thrice Paul reminds the Corinthians that their bodies were the temple of the Holy Spirit [1 Corinthians 6:19, 2 Corinthians 6:16]. The church which is the assembly of individual believers must therefore be a sanctified body. Its mission, activities, and duty must be to do the Master's work according to His will and way.\n\nWhen the church manifests these three characteristics, then she will be the chaste bride of Christ.",
        "part6": "THOUGHT",
        "part7": "That they all may be one; as thou, Father, art in me, and I in thee, that they also may be one in us: that the world may believe that thou hast sent me. - John 17:21",
        "part8": [
            "1 KINGS 20",
            "1 THESSALONIANS 5"
        ]
    },
    "20 OCTOBER": {
        "part1": "Romans 12:6",
        "part2": "Different gifts",
        "part3": "VERSE 6",
        "part4": "Having then gifts differing according to the grace that is given to us, whether prophecy, let us prophesy according to the proportion of faith;",
        "part5": "The body of Christ ought not only to be united, but the Apostle also stresses its diversity. And these two go hand in hand.\n\nUnity is not uniformity or homogeneity. The assembly of believers comprises a mix of people with different qualities, temperaments, characters, and thinking, yet they are united in heart, mind and spirit. Every individual is unique, yet co-exists with others serving the same Lord God, in the power of the same Spirit because they were saved by the same Christ.\n\nThere is strength and safety in diversity. It is strong because different strengths and abilities can be brought to bear in adversity. Each is strengthened by the other and the three-fold cord is stronger still [Ecclesiastes 4:9-12]. It is safe because '\"Where no counsel is, the people fall: but in the multitude of counsellors there is safety [Proverbs 11:14; 15:22].\n\nDiversity is also effective and efficient. It is effective because we serve and witness to a diverse people. Some are better able than others to reach these. It is efficient because the diversity of gifts facilitates the division of labour and distribution of duties. Diversity was God's wise design. He chose His prophets from sundry backgrounds to speak His Word in revelation, prediction and warning. Christ called twelve apostles from different walks of life to build His through the Gospel proclamation. And God's servants were bestowed with diverse gifts by the Holy Spirit. From all peoples and backgrounds, God chooses and uses whom He will. He calls us who are His representatives to serve Him, each with our individual gifts but all working together for His glory.",
        "part6": "THOUGHT",
        "part7": "From whom the whole body fitly joined together and compacted by that which every joint supplieth, according to the effectual working in the measure of every part, maketh increase of the body unto the edifying of itself in love. - Ephesians 4:16.",
        "part8": [
            "1 KINGS 21",
            "2 THESSALONIANS 1"
        ]
    },
    "21 OCTOBER": {
        "part1": "Romans 12:7",
        "part2": "Ministry and teaching",
        "part3": "VERSE 7",
        "part4": "Or ministry, let us wait on our ministering: or he that teacheth, on teaching;",
        "part5": "Ministry is to do the work of a servant or attendant. From Greek word - diakonia - we get \"deacon\". The idea of servanthood goes against human nature because we would rather be served than to serve. A servant waits upon others. A servant takes care of the welfare of others in a low and humble office. It is work without status, often despised, usually without appreciation.\n\nYet this describes exactly what the Son of God did for us in His incarnation, from His lowly birth to His humiliating death. Jesus set the supreme example for our emulation and told His disciples, \"Even as the Son of man came not to be ministered unto, but to minister, and to give his life a ransom for many\" [Matthew 20:28].\n\nHaving the spirit and heart of a servant in our Christian conduct is to be most Christ-like. If Jesus could be a servant to man, then everyone who professes Christ's name can and must be a servant.\n\nTeaching - a teacher is one who instructs or communicates knowledge. He has the responsibility to open up the Scriptures and expound on its doctrines for our understanding and guidance. Those who teach therefore carry a grave responsibility lest they lead others astray or cause some to stumble. And they will be held to greater accountability by the Lord. Therefore, those who aspire to this office have the warning from James 3:1: \"My brethren, be not many masters, knowing that we shall receive the greater condemnation.\" The responsibility and respect of this office carry a price. It is not something to be coveted carelessly without serious consideration of its consequences.",
        "part6": "THOUGHT",
        "part7": "If I then, your Lord and Master, have washed your feet; ye also ought to wash one another's feet. For I have given you an example, that ye should do as I have done to you. - John 13:14-15",
        "part8": [
            "1 KINGS 22",
            "2 THESSALONIANS 2"
        ]
    },
    "22 OCTOBER": {
        "part1": "Romans 12:8",
        "part2": "Exhorting, giving, ruling, showing mercy",
        "part3": "VERSE 8",
        "part4": "Or he that exhorteth, on exhortation: he that giveth, let him do it with simplicity; he that ruleth, with diligence; he that sheweth mercy, with cheerfulness.",
        "part5": "Today's reading continues Paul's admonition by highlighting two things - First, the diversity of gifts we are variously bestowed with, and second, the spirit we must have in exercising them.\n\nGod has given every person one or more gifts to be used in and outside the church as this verse informs. Some have a natural ability to encourage and admonish through practical help and advice, to encourage the feeble brother, and to stir up another to duty. Others are entrusted within the church to deal with finances. There are still others who have been blessed by God with the means to help and support others, financially or otherwise.\n\nRegardless of the ministry, we are to serve with singleness of mind and purity of heart, without ostentation, selfish intentions, or ulterior motives. To be \"simple\" is not to be calculating. Those entrusted with the responsibility of administration are to be conscientious, realising that we serve and answer to our Master, the Lord Jesus.\n\nIf we have the ministry of comforting those in need - the afflicted, distressed and sorrowing - with a kind word or helping hand, do it willingly, cheerfully, and patiently. Covering the exercise of all our gifts must be our prayerfulness. Be generous and spontaneous, not begrudging any expense of time, talents, and treasures for the name of Christ.\n\nWe must also serve with humility and love. Humility, because all we possess are given by the Lord. We are merely stewards and have nothing to boast about. Love because our Lord first loved us and gave Himself freely for us. In turn, we are to love Him and our neighbour by the use of our gifts in obedience to His Word.",
        "part6": "THOUGHT",
        "part7": "Now there are diversities of gifts, but the same Spirit. And there are differences of administrations, but the same Lord. And there are diversities of operations, but it is the same God which worketh all in all. - 1 Corinthians 12:4-6",
        "part8": [
            "2 KINGS 1",
            "2 THESSALONIANS 3"
        ]
    },
    "23 OCTOBER": {
        "part1": "Romans 12:9",
        "part2": "Love Without Dissimulation",
        "part3": "VERSE 9",
        "part4": "Let love be without dissimulation. Abhor that which is evil; cleave to that which is good.",
        "part5": "Our sinful, unbelieving world is marred with much hypocrisy and pretence. People readily put on a mask and a show of affection, but it is often not genuine. Like the seductress of Proverbs 5, whose lips are sweet as honeycomb, and mouth smoother than oil, she entices men with love that is not genuine, and the end of it is bitter as wormwood.\n\nThe Apostle Paul's words in Romans 12:9 are a powerful reminder to us to love our fellowmen, without hypocrisy or dissimulation. We are to show genuine love for our neighbours, love which is sincere and unconditional. Love that does not put on a facade with the hidden motive of personal gain.\n\nHow do we love without dissimulation? We begin by putting ourselves in others' shoes. We empathise with them; we understand the situation they are going through. Once we do this, we will know their needs and can genuinely care for their well-being, seeking their highest good without any personal agenda or ulterior motive.\n\nIn interacting with others, pray that God would search our hearts, and show us how to love our neighbour selflessly and genuinely, putting aside any selfish consideration. Only then, can we be God's channels of blessings, to bring the light of the Gospel to a dark and unbelieving world.",
        "part6": "THOUGHT",
        "part7": "Wherefore putting away lying, speak every man truth with his neighbour: for we are members one of another. - Ephesians 4:25",
        "part8": [
            "2 KINGS 2",
            "1 TIMOTHY 1"
        ]
    },
    "24 OCTOBER": {
        "part1": "Romans 12:10",
        "part2": "Kindly Affectioned",
        "part3": "VERSE 10",
        "part4": "Be kindly affectioned one to another with brotherly love; in honour preferring one another;",
        "part5": "Today's reading exhorts us to be \"kindly affectioned one to another with brotherly love\". In this busy and self-serving world, where material pursuits dominate the thoughts and minds of most people, kindness takes a back seat. Most people, it seems, seek personal gain at the cost of others, and kindness is often ignored. However, Christians are to be different because we are called to a higher standard.\n\nKindness is not an afterthought or something we dispense whenever we have the capacity to do so. It flows from the genuine love that Paul mentions in Romans 12:9 because without a heart filled with selfless, sincere, and unconditional love, it will be difficult for one to show kindness to his fellowmen.\n\nShowing kindness involves putting others before self, and going out of our way to help those in need, to alleviate the suffering of others, often at the expense of our own convenience and comfort.\n\nLet us examine ourselves. Learn from and follow the example of our Lord Jesus who came down from heaven to minister to those who were suffering, healing the sick, showing compassion to the widows and the fatherless, and saving the lost. We must be sensitive to those around us who are in need, and lend a helping hand, extend a listening ear to someone who is hurting, and offer a word of kindness and encouragement to those who are discouraged. May others see Jesus in us, as we show kindness to them.",
        "part6": "THOUGHT",
        "part7": "As we have therefore opportunity, let us do good unto all men, especially unto them who are of the household of faith. - Galatians 6:10",
        "part8": [
            "2 KINGS 3",
            "1 TIMOTHY 2"
        ]
    },
    "25 OCTOBER": {
        "part1": "Romans 12:11",
        "part2": "Not Slothful",
        "part3": "VERSE 11",
        "part4": "Not slothful in business; fervent in spirit; serving the Lord;",
        "part5": "In our busy lives in which we are often surrounded with much earthly cares, it is easy to fall into the trap of slothfulness, especially when it comes to the Lord's work. Slothfulness is not just physical laziness. Paul here refers to our spiritual walk with God and how it affects our effectiveness for Him. Romans 12:11 reminds us of the importance of being diligent in everything we do, especially when doing God's work.\n\nThe Apostle Paul exhorts us not to be slothful in every aspect of our lives. We are to be industrious and conscientious in our daily work and responsibilities. This too is a testimony to our Lord Jesus Christ. God desires that we approach our tasks with earnest dedication and excellence, because ultimately it is work He has ordained for us to do. \"And whatsoever ye do, do it heartily, as to the Lord, and not unto men\" [Colossians 3:23].\n\nLook into our own lives and see if we have been slothful in any aspect of our work, life and spiritual walk. Have we become complacent in service to God? Have we allowed the world to creep in and lessen our commitment to our Lord? Or have we been fervent and zealous for our God, serving Him with the diligence and devotion that He deserves? May the Lord help us to awake from slothful slumber and rekindle in our hearts with the fire and zeal His Kingdom deserves.",
        "part6": "THOUGHT",
        "part7": "Whatsoever thy hand findeth to do, do it with thy might; for there is no work, nor device, nor knowledge, nor wisdom, in the grave, whither thou goest. - Ecclesiastes 9:10",
        "part8": [
            "2 KINGS 4",
            "1 TIMOTHY 3"
        ]
    },
    "26 OCTOBER": {
        "part1": "Romans 12:12",
        "part2": "Rejoicing, Patience and Prayerfulness",
        "part3": "VERSE 12",
        "part4": "Rejoicing in hope; patient in tribulation; continuing instant in prayer;",
        "part5": "Hope is the strength that keeps us going. That is why many in this world are willing to go to great lengths to \"buy\" hope. We had trusted in human wisdom and solutions, thinking these would save us out of some troubles, or set us at peace. Yet we know there is no lasting hope without Christ for our Lord Jesus is the one who has secured the peace that will last for eternity, reconciling us to God, and giving us the sure blessed hope of everlasting life when we trust in Him. For this reason, we can rejoice - even in tough times, for indeed \"all things are for your sakes, that the abundant grace might through the thanksgiving of many redound to the glory of God\" [2 Corinthians 4:15].\n\nYet our struggles in life are also real, especially in these last days when \"we must through much tribulation enter into the kingdom of God\" [Acts 14:22]. But no matter how great the trials we face, realize these will also come to an end, and even if we cannot help but be worried and anxious, may the hope we have cause us to be patient and wait upon the LORD, for everything is under His sovereign control, and He is working all things together for good to them that love Him, to them who are the called according to His purpose [Romans 8:28].\n\nIn times of need, we are not without help. God has granted us His means of grace: prayer. We come before Him, casting everything before His throne of grace - and continue doing that no matter what circumstances we face. We need to pray when we think we need God. And we need to pray even more when we think we do not need Him.",
        "part6": "THOUGHT",
        "part7": "Rejoice evermore. Pray without ceasing. In every thing give thanks: for this is the will of God in Christ Jesus concerning you. - 1 Thessalonians 5:16-18",
        "part8": [
            "2 KINGS 5",
            "1 TIMOTHY 4"
        ]
    },
    "27 OCTOBER": {
        "part1": "Romans 12:13",
        "part2": "Distributing to the Poor",
        "part3": "VERSE 13",
        "part4": "Distributing to the necessity of saints; given hospitality.",
        "part5": "The ability to give is a blessing from God, and interestingly, this is one of the main reasons for our labours. Ephesians 4:28 exhorts us, \"Let him that stole steal no more: but rather let him labour, working with his hands the thing which is good, that he may have to give to him that needeth.\" There is a wonderful transition here from one who needs help and who even resorts to unlawful means to meet their needs, to one who will work and give to others. We work to not only provide for ourselves and our loved ones but also to give and help others.\n\nAmong those whom we give to, we are especially reminded to give for the cause of Christ. \"As we have therefore opportunity, let us do good unto all men, especially unto them who are of the household of faith\" [Galatians 6:10]. It is true that our generosity may touch the hearts of unbelievers and cause them to turn to Christ, but more so we should help a brother in need - for it may be God's will that we are to be a channel of providence to him, perhaps the answer to his prayers - and that in receiving this blessing through our hands, he may give thanks and glory to God.\n\nThe gift of hospitality was especially important during Paul's time because places to live were not readily available, and Christians needed the protection of other brethren against persecution. It is also important in our times to extend the warm hand of fellowship to fellow sojourners in this world. If we keep in mind that we are but stewards of God's manifold blessings, we will give willingly and cheerfully to those who are in need.",
        "part6": "THOUGHT",
        "part7": "I have shewed you all things, how that so labouring ye ought to support the weak, and to remember the words of the Lord Jesus, how he said, It is more blessed to give than to receive. - Acts 20:35",
        "part8": [
            "2 KINGS 6",
            "1 TIMOTHY 5"
        ]
    },
    "28 OCTOBER": {
        "part1": "Romans 12:14",
        "part2": "Bless Your Persecutors",
        "part3": "VERSE 14",
        "part4": "Bless them which persecute you: bless, and curse not.",
        "part5": "To many, the call to bless our persecutors seems a tall order. It is difficult enough for one to not return evil for evil, what more to bless someone who is against you, and against the cause of Christ. But this was how Paul lived his life. Writing to his protege Timothy, he reminded him how \"all that will live godly in Christ Jesus shall suffer persecution\" [2 Timothy 3:12]. The elder shared how he had endured the afflictions, and how out of them all the Lord had delivered him [2 Timothy 3:11]. Indeed, the unfair treatment he received despite his good intentions, though painful, had caused him to turn to God and trust Him for deliverance.\n\nIt should give us great comfort that the Lord Jesus concluded the Beatitudes with these words: \"Blessed are they which are persecuted for righteousness' sake: for theirs' is the kingdom of heaven\" [Matthew 5:10]. This final beatitude is also the only one He further elaborated on: \"Blessed are ye, when men shall revile you, and persecute you, and shall say all manner of evil against you falsely, for my sake. Rejoice, and be exceeding glad: for great is your reward in heaven: for so persecuted they the prophets which were before you\" [Matthew 5:11-12].\n\nFixing our eyes on the glory that shall be revealed in the day of Christ, we are thus able to not only endure but also bless and give thanks, able to pray for ourselves and for our persecutors, that the love of Christ will strengthen us and change them. It is a tall order but it is the high calling of Christ for His followers.",
        "part6": "THOUGHT",
        "part7": "Looking unto Jesus the author and finisher of our faith; who for the joy that was set before him endured the cross, despising the shame, and is set down at the right hand of the throne of God. - Hebrews 12:2",
        "part8": [
            "2 KINGS 7",
            "1 TIMOTHY 6"
        ]
    },
    "29 OCTOBER": {
        "part1": "Romans 12:15",
        "part2": "Empathy",
        "part3": "VERSE 15",
        "part4": "Rejoice with them that do rejoice, and weep with them that weep.",
        "part5": "This verse cites two actions, but the emphasis is on the motivation behind them - empathy that we have with fellow humankind. In rejoicing with those who rejoice and weeping with those who weep, we step out of ourselves, and into the lives of others. Their joy and sorrows become ours.\n\nTo participate in the joy of others is a privilege. How blessed it is to be truly happy for someone else! On the other hand, to understand and feel the sorrows of others is also a blessing, for God has moved you to care for someone other than self who needs comfort and strength. Thus seize all opportunities to be involved in the lives of others: if they are unbelievers, they will see your genuine concern for them and perchance may want to know the Source of your motivation; if of the same household of faith, they will give thanks to God for your presence in that particular time of their life.\n\nYet how much of our time is spent doing otherwise? In our sinful state, we gloat at the misfortune of others; we fold our hands in indifference and even indignation when others triumph, passing judgment whether it was deserved or not. The amount of time and thoughts expended in such malice and resentment can be channelled to better use, for the Bible has told us we should love others as we love ourselves.\n\nIf these actions are not found in your life, then step forward to do them, for in blessing those who rejoice and caring for those who weep, in sharing one another's laughter and tears, we bear one another's burden, and thus are fulfilling the law of Christ. [Galatians 6:2.]",
        "part6": "THOUGHT",
        "part7": "For all the law is fulfilled in one word, even in this; Thou shalt love thy neighbour as thyself. - Galatians 5:14",
        "part8": [
            "2 KINGS 8",
            "2 TIMOTHY 1"
        ]
    },
    "30 OCTOBER": {
        "part1": "Romans 12:16",
        "part2": "Condescendence",
        "part3": "VERSE 16",
        "part4": "Be of the same mind one toward another. Mind not high things, but condescend to men of low estate. Be not wise in your own conceits.",
        "part5": "The vice that we are warned against here is pride - arguably the greatest sin, for it was pride that caused Lucifer to fall [Isaiah 14, Ezekiel 38]. It was pride that led to the fall of Adam and Eve because they wanted to be as gods [Genesis 3:5]. It was the sin that David prayed for God to keep him back from [Psalm 19:13], and it was what caused the Pharisees to want to kill the Lord Jesus [Matthew 23:13].\n\nToday, pride is still the sin that causes strife between people and contentions even within God's church.\n\nPaul in Philippians 2:2-5 is especially pertinent to this matter: \"Fulfil ye my joy, that ye be likeminded, having the same love, being of one accord, of one mind. Let nothing be done through strife or vainglory; but in lowliness of mind let each esteem other better than themselves. Look not every man on his own things, but every man also on the things of others. Let this mind be in you, which was also in Christ Jesus.\"\n\nBeing of the same mind is having the same kingdom of God in our thoughts. In our interaction with others, we seek to edify and encourage. Instead of thinking of ourselves, we are reminded to \"condescend\" to people who are of low estate - be it spiritually, socially, or intellectually. Indeed, it may be difficult if the difference is obvious, but we are reminded how Christ humbled Himself and came to us wretched sinners to die for us.\n\nHow great was that condescension! And in that light, how small are our differences with one another! Be not wise in your own conceits. \"Seest thou a man wise in his own conceit? there is more hope of a fool than of him\" [Proverbs 26:12].",
        "part6": "THOUGHT",
        "part7": "  THOUGHT   But he giveth more grace. Wherefore he saith, God resisteth the proud, but giveth grace unto the humble. - James 4:6",
        "part8": [
            "2 KINGS 9",
            "2 TIMOTHY 2"
        ]
    },
    "31 OCTOBER": {
        "part1": "Romans 12:17",
        "part2": "Revenge Not",
        "part3": "VERSE 17",
        "part4": "Recompense to no man evil for evil. Provide things honest in the sight of all men.",
        "part5": "We live in a world where self is much emphasized. We orientate our lives around ourselves, and fight for our own interests. When we are deprived of what we think should belong to us, we respond by taking from others what rightfully belongs to them. So, when someone does not respect us, we in turn despise them, and this becomes a vicious cycle that grows with each round.\n\nTo break this cycle, we must \"recompense to no man evil for evil\", and God's children are in the best position to do that, for that was exactly what our Lord did. \"He was oppressed, and he was afflicted, yet he opened not his mouth: he is brought as a lamb to the slaughter, and as a sheep before her shearers is dumb, so he openeth not his mouth\" [Isaiah 53:7]. Our Lord could have taken things in His own hands to smite His oppressors, but He did not, for He had set His eyes on the salvation of mankind. For the sake of His Father's kingdom and righteousness, He was willing to sacrifice Himself.\n\nAdditionally, we are commanded to \"provide things honest in the sight of all men.\" \"Honest\" is the word \"kalos\" which is a general term meaning \"right\", \"good\" or \"beautiful\". Paul exhorts us to give to others what they consider to be right, good, and beautiful. In God's common grace, we can see that He does this in giving common blessings to all. Paul thus tells us to hold to what is good, instead of plotting that which is evil.",
        "part6": "THOUGHT",
        "part7": "Finally, brethren, whatsoever things are true, whatsoever things are honest, whatsoever things are just, whatsoever things are pure, whatsoever things are lovely, whatsoever things are of good report; if there be any virtue, and if there be any praise, think on these things. - Philippians 4:8",
        "part8": [
            "2 KINGS 10-11",
            "2 TIMOTHY 3"
        ]
    },
    "1 NOVEMBER": {
        "part1": "Romans 12:18",
        "part2": "Live in Peace",
        "part3": "VERSE 18",
        "part4": "If it be possible, as much as lieth in you, live peaceably with all men.",
        "part5": "Peace is something that characterises a Christian. We are reconciled with God and thus at peace with our Creator. And because the void in our hearts is filled by God, we are at peace with ourselves. With this peace, we can find strength and wisdom to live with one another, and eventually with the rest of creation. It is also with this peace that we can choose not to return evil for evil, and even overcome evil with good.\n\nPaul also recognises that there are times when it may be difficult to live peaceably with others. For one, the world may not want to live peaceably with us by making things difficult for us. In John 15:18-19, our Lord Jesus said, \"If the world hate you, ye know that it hated me before it hated you. If ye were of the world, the world would love his own: but because ye are not of the world, but I have chosen you out of the world, therefore the world hateth you.\"\n\nEven so, we ought to maintain a good testimony of peace for the Lord. And \"sanctify the Lord God in your hearts: and be ready always to give an answer to every man that asketh you a reason of the hope that is in you with meekness and fear: Having a good conscience; that, whereas they speak evil of you, as of evildoers, they may be ashamed that falsely accuse your good conversation in Christ\" [1 Peter 3:15-16].\n\nFor another, there may be times when living peaceably means compromising with the world's values, or even condoning wickedness. At times like these, we have to stand firm, and pray for courage and wisdom to do the right thing for the sake of God's name.",
        "part6": "THOUGHT",
        "part7": "Let your light so shine before men, that they may see your good works, and glorify your Father which is in heaven. - Matthew 5:16",
        "part8": [
            "2 KINGS 12",
            "2 TIMOTHY 4"
        ]
    },
    "2 NOVEMBER": {
        "part1": "Romans 12:19",
        "part2": "Vengeance is the Lord's",
        "part3": "VERSE 19",
        "part4": "Dearly beloved, avenge not yourselves, but rather give place unto wrath: for it is written, Vengeance is mine; I will repay, saith the Lord.",
        "part5": "We have looked previously at some verses about not avenging ourselves. In verse 14, we were told to bless our persecutors. In verse 17, we were exhorted to not recompense evil for evil. We also considered reasons like God blessing those who suffer for His name, breaking the vicious cycle of evil and hate, following the steps of our Lord to do what is right, good, and beautiful. Today, we are given another important reason: Vengeance belongs to the Lord.\n\nGod is sovereign and just. He knows the injustices we have suffered, especially those endured for His name. This should give us peace in times of affliction. Psalm 37:1-5 assures us, \"Fret not thyself because of evildoers, neither be thou envious against the workers of iniquity. For they shall soon be cut down like the grass, and wither as the green herb. Trust in the LORD, and do good; so shalt thou dwell in the land, and verily thou shalt be fed. Delight thyself also in the LORD: and he shall give thee the desires of thine heart. Commit thy way unto the LORD; trust also in him; and he shall bring it to pass.\" We are to trust God, delight in Him, and commit everything in His hands. Hold to what is right and wait upon Him to bring His will to pass.\n\nThink about it: If we were to take things into our own hands, we are losing faith in our God who will exact justice in His own good time. This charge should be a reminder for all who fear the Lord and cause us to leave everything in the good hands of our all-knowing and all-powerful God.",
        "part6": "THOUGHT",
        "part7": "See that none render evil for evil unto any man; but ever follow that which is good, both among yourselves, and to all men. - 1 Thessalonians 5:15",
        "part8": [
            "2 KINGS 13",
            "TITUS 1"
        ]
    },
    "3 NOVEMBER": {
        "part1": "Romans 12:20-21",
        "part2": "Overcome Evil with Good",
        "part3": "VERSES 20-21",
        "part4": "Therefore if thine enemy hunger, feed him; if he thirst, give him drink: for in so doing thou shalt heap coals of fire on his head. Be not overcome of evil, but overcome evil with good.",
        "part5": "Romans 12:17, 18 and 21 tell us three possible responses against evil. Verse 17 reminds us \"the sinner's approach\", which is recompensing evil for evil. This is the reaction deemed natural by the world.\n\nVerse 18 offers \"the passive approach\" of striving to live peaceably with others, choosing to overlook the trespasses of people against us. Verse 21, on the other hand, gives a more positive approach, which can be described as \"the active approach\", which is to overcome evil with good.\n\nOvercoming evil with good does not mean we smile foolishly at people who hit us or give more to those who rob us. Rather, it means when the opportunity comes for us to do good to a person who has previously done us evil, we should choose to do it. From the first two approaches and eventually to the third option, we can see the growth of a Christian as he struggles with evil, and he finally overcomes it, both the evil without and the sin within.\n\nThe effect of this is described as heaping coals of fire on the offender's head. Proverbs 25:21-22 similarly says: \"If thine enemy be hungry, give him bread to eat; and if he be thirsty, give him water to drink: For thou shalt heap coals of fire upon his head, and the LORD shall reward thee.\" This may refer to an Egyptian custom of carrying a pan of burning coals on one's head as a sign of contrition or to bring about a change of heart. Thus, returning good for evil can hasten an offender to repent of his ways. To an unbeliever, to \"overcome evil with good\" characterises a child of God. To a believer, it will help win back a brother from his sinful ways.",
        "part6": "THOUGHT",
        "part7": "For if ye love them which love you, what reward have ye? do not even the publicans the same? - Matthew 5:46",
        "part8": [
            "2 KINGS 14",
            "TITUS 2"
        ]
    },
    "4 NOVEMBER": {
        "part1": "Romans 13:1-2",
        "part2": "Submission to Authorities",
        "part3": "VERSE 1",
        "part4": "Let every soul be subject unto the higher powers. For there is no power but of God: the powers that be are ordained of God.",
        "part5": "Paul says, \"Let every soul be subject unto the higher powers.\" The command is that every person, Christian or not, Jewish or Gentile, should be subject to their governing authorities. This is clearly spelt out in Titus 3:1; \"Subject to principalities and powers, to obey magistrates\".\n\nPeter elaborates on this submission further in 1 Peter 2:13, where one is to be subject \"to every ordinance of man for the Lord's sake: whether it be to the king, as supreme\". Every person is required to be subject to those who are in authority by the will of God.\n\nPaul then reiterates \"For there is no power but of God: the powers that be are ordained of God.\" The reason we submit to the governing authorities is because there is no authority apart from God, and He has instituted the authorities that exist. It is God's will to govern the world through human civil authorities.\n\nWe must submit to the civil authorities, in deed and heart, because without them there can be no order, security, or progress in society. Rebelling against God-ordained authorities constitutes rebellion against God. Such rebels we are told, will be punished by Him. Government exists to preserve law and order, any Christian who opposes His government by force will receive just retribution from the governing authority. If the government is established, and if its decisions are not a manifest violation of God's laws, then we are to submit.",
        "part6": "THOUGHT",
        "part7": "Respect for authority brings glory to God.",
        "part8": [
            "2 KINGS 15",
            "TITUS 3"
        ]
    },
    "5 NOVEMBER": {
        "part1": "Romans 13:3-4",
        "part2": "Function of the Government",
        "part3": "VERSE 4",
        "part4": "For he is the minister of God to thee for good. But if thou do that which is evil, be afraid; for he beareth not the sword in vain: for he is the minister of God, a revenger to execute wrath upon him that doeth evil.",
        "part5": "Civil government according to the teaching of scripture is a divine institution. \"There is no power but of God: the powers that be are ordained of God.\" [v. 1] This is not to be understood as meaning that every individual who is ordained by God is a blessing and an instrument for good. That would make the Divine Being directly responsible for ordaining the tyrants and their evil acts of despotism and oppression. Rather, it means that government is an ordinance of God, and He has ordained or appointed that there should be authority and rulers. And every ruler on his throne has been put into power according to God's sovereign will and purposes [Daniel 2:21].\n\nAccording to Paul, the government was instituted by God to serve two specific functions which are described in Romans 13:3-4. It is designed by God to check evil and promote good. These are the reasons God established government and so long as a government is rewarding moral good and restraining moral evil, it is acting as God's servant and to be obeyed.\n\nIn the latter part of verse 4, Paul gives the grounds for the state's sword-bearing powers. \"For he beareth not the sword in vain.\" God has given the government the power of life and death over her subjects to maintain order. Therefore, one should hold the government's authority in healthy respect or face its consequences.",
        "part6": "THOUGHT",
        "part7": "Submit yourselves to every ordinance for the Lord's sake: whether it be the king as supreme. - 1 Peter 2:13",
        "part8": [
            "2 KINGS 16",
            "PHILEMON"
        ]
    },
    "6 NOVEMBER": {
        "part1": "Romans 13:5-6",
        "part2": "Submit for the right reasons",
        "part3": "VERSE 5",
        "part4": "Wherefore ye must needs be subject, not only for wrath, but also for conscience sake.",
        "part5": "Let every soul be subject unto higher powers. Such is Paul's instruction to Christians living under their heathen government, and he adds in verse 5, that we must \"be subject, not only for wrath, but also for conscience sake\".\n\nThere are two reasons to be in subjection: fear of punishment and conscience before God, who has ordained the government. \"Wrath\" denotes judicial punishment. To defy the government is to invite death or suffer judgment and penalties such as imprisonment. We should be subject to our government not only because we fear punishment but also because we fear God, who knows our hearts.\n\nChristians are to be loyal to the government under which they live. They are to obey the laws and do nothing that would bring the laws into contempt. We must do, not by compulsion but freely, not for fear of the penalties which disobedience might incur but for conscience's sake.\n\nPaying taxes is part of submission. In Romans 13:6-7, we are called to support the government, \"For this cause pay ye tribute also: for they are God's ministers, attending continually upon this very thing.\" The \"very thing\" speaks of the responsibility of ruling, the service of leading people, protecting them, collecting taxes. To defend the country, maintain law and order, and provide service for the citizens, the government has the legitimate right to collect taxes.\n\nLet us pay the taxes required. Have respect for those who collect our taxes because it is right and it pleases God. Instead of grumbling, whisper a prayer of thanksgiving and pray for the government to utilize our tax money appropriately and wisely. Take heart that you are being obedient to God's will.",
        "part6": "PRAYER",
        "part7": " Lord, help us fulfil our responsibility to our government as good citizens.",
        "part8": [
            "2 KINGS 17",
            "HEBREWS 1"
        ]
    },
    "7 NOVEMBER": {
        "part1": "Romans 13:7-8",
        "part2": "Owe Nothing",
        "part3": "VERSE 8",
        "part4": "Owe no man any thing, but to love one another: for he that loveth another hath fulfilled the law.",
        "part5": "Paul instructed the Christians to submit to civil government and those in authority v. 1-5. The authorities are God's servants governing the country and whatever taxes are owed must be paid, so too respect and honour v. 6-7.\n\nApart from taxes that must be paid to the government, Christians also render respect and honour to many categories of people, for example, kings [1 Peter 2:13-17]; church officers [1 Timothy 5:17; Hebrews 13:17]; parents [Exodus 20:12]; older persons [Leviticus 19:32] and most of all, God [1 Timothy 6:16; John 5:22-23] whom we worship and honour.\n\nGod's Word neither forbids borrowing nor lending money [Matthew 5:42], but we are not to be predatory and charge unreasonably high-interest rates when lending to the poor [Exodus 22:25; Psalm 15:5]. The Lord will recompense this kind deed to the poor [Proverbs 19:17]. Even so, Christians are never justified in going into debt unnecessarily. We should exercise godly wisdom in financial planning so that all debts are repaid in full on time so we owe no one anything.\n\nPaul then declares that Christians have another debt to pay. They have a constant obligation to love one another in obedience to the Lord Jesus' command [John 13:34]. It is a perpetual debt that we need to continually pay yet never fully pay up. We thank the Lord that out of the abundance of His richness, love, and grace, He enables us to make this daily payment of love to one another with joy. Truly by loving one another, we fulfil the law.",
        "part6": "THOUGHT",
        "part7": "Then saith he unto them, Render therefore unto Caesar the things which are Caesar's; and unto God the things that are God's. - Matthew 22:21",
        "part8": [
            "2 KINGS 18",
            "HEBREWS 2"
        ]
    },
    "8 NOVEMBER": {
        "part1": "Romans 13:9",
        "part2": "Relevance of the Mosaic Law",
        "part3": "VERSE 9",
        "part4": "For this, Thou shalt not commit adultery, Thou shalt not kill, Thou shalt not steal, Thou shalt not bear false witness, Thou shalt not covet; and if there be any other commandment, it is briefly comprehended in this saying, namely, Thou shalt love thy neighbour as thyself.",
        "part5": "The Mosaic Law was given to the Israelites by God through Moses. The first four consist of commandments in regard to the Israelites' relationship with God, and the following six in regard to their relationship with man.\n\nWhen the Pharisees tempted Jesus, asking Him, \"Which is the great commandment in the Law?\" Jesus answered that the first great commandment was \"Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy mind\" and the second great commandment was \"Thou shalt love thy neighbour as thyself \" [Matthew 22:37-39]. While Jesus spoke of the first table (love for God) and the second table (love for man) Paul here speaks only of the love for fellow men, and in its context how Christians are to act towards one another. If \"you love your neighbour,\" you shall do the following:\n\nYou shall not commit adultery but preserve the sacredness of the marriage-bond just as Joseph resisted the advances of Potiphar's wife [Genesis 39:8-9; Matthew 5:27-28]. You shall not murder nor harm him with thought, word or deed [Matthew 5:21-22] but shall help to keep preserve the life of your neighbour. You shall not steal nor cheat in your dealings with others. You will protect your neighbour's possessions and be content with what you have [1 Timothy 6:6]. You shall not covet but rejoice in the fact that your neighbours' possessions are his [Hebrews 13:5].\n\nSince we love ourselves despite our own faults, we are to love our neighbour too no matter how unlikeable he may be. Hence, \"You shall love your neighbour as yourself.\"",
        "part6": "THOUGHT",
        "part7": "Be ye holy; for I am holy. - 1 Peter 1:16",
        "part8": [
            "2 KINGS 19",
            "HEBREWS 3"
        ]
    },
    "9 NOVEMBER": {
        "part1": "Romans 13:10",
        "part2": "Love is...",
        "part3": "VERSE 10",
        "part4": "Love worketh no ill to his neighbour: therefore love is the fulfilling of the law.",
        "part5": "Love worketh no ill to his neighbour, is a figure of speech called \"litotes\". It is a negative expression that conveys a strong affirmative. The verse is thus interpreted as \"Love greatly benefits the neighbour\". As Paul told the Galatians, \"As we have therefore opportunity, let us do good unto all men, especially unto them who are of the household of faith\" [Galatians 6:10]. The key word in both great commandments is love [Matthew 22:37-39], and only love can fulfil the law.\n\nBecause God is our Creator and Redeemer, the God of love who first loved us, we in return are to love Him and our fellowmen as He commanded. Love is the first named fruit of the Spirit. We are to love with a godly righteous love that is pure and sincere, abhorring evil, cleaving to that which is good, with brotherly affection for one another, honouring and preferring one another [Romans 12:9-10]. Love begins with a heart of compassion and forgiveness [Ephesians 4:32]. It is characterized by humility, gentleness, patience, and forbearance [Ephesians 4:2; 1 Corinthians 13:4-7].\n\nGodly love moves us to live godly lives, bearing a good testimony for the Lord, having compassion for the lost by bringing the Gospel to them and praying for their salvation \"by pureness, by knowledge, by longsuffering, by kindness, by the Holy Ghost, by love unfeigned, By the word of truth, by the power of God, by the armour of righteousness on the right hand and on the left\" [2 Corinthians 6:6-7]. God's Word clearly exhorts us to love our neighbour. Are you obeying His command?",
        "part6": "PRAYER",
        "part7": "Heavenly Father, teach me to love others even as Thou hast first loved me.",
        "part8": [
            "2 KINGS 20",
            "HEBREWS 4"
        ]
    },
    "10 NOVEMBER": {
        "part1": "Romans 13:11",
        "part2": "Salvation is near",
        "part3": "VERSE 11",
        "part4": "And that, knowing the time, that now it is high time to awake out of sleep: for now is our salvation nearer than when we believed.",
        "part5": "This is a wake-up call for us. The Apostle Paul summons us to wake up from our spiritual slumber, to live righteously, to actively repay the debt of loving one another [v. 8], and to love our neighbour as ourselves [v. 9]. He also encourages the brethren to accept those who are weak in faith [Romans 14:1], to be Christ-like, to love others [Romans 15:5], and to be united with one heart to glorify God.\n\nWhy did Paul inject a sense of urgency? The reason is that we do not have much time as the day of Christ's return is imminent. The signs are clearly visible. We witness wars and rumours of wars, threats of nuclear missile attacks, heightened social and geo-political tensions, pandemics, increasing frequency and intensity of earthquakes, floods, and other natural and man-made disasters. These are the signs that judgment day is near and we should be well prepared.\n\nJesus also warns us in Matthew 7:21-23 that not everyone who calls him \"Lord, Lord\" will enter His heavenly kingdom. Only those who do the will of the Father will be recognized by Him and granted entrance there. The will of the Lord is for us to cultivate an intimate relationship with Him, to be obedient in following God's Word, and to love and serve one another.\n\nLet us take heed. Let us live harmoniously and peacefully with one other, live sacrificially for God and live by faith in Christ. Be prepared at all times to witness for our Lord, share the Gospel and lead others to believe in Jesus Christ as their personal saviour.",
        "part6": "PRAYER",
        "part7": "O Lord, may I wake up everyday knowing that thy salvation is near and put on the armour of light to live righteously. I ask that You will give me faith, love and strength in You, to be your witness and live a life that glorifies your name. Amen.",
        "part8": [
            "2 KINGS 21",
            "HEBREWS 5"
        ]
    },
    "11 NOVEMBER": {
        "part1": "Romans 13:12",
        "part2": "Cast out darkness",
        "part3": "VERSE 12",
        "part4": "The night is far spent, the day is at hand: let us therefore cast off the works of darkness, and let us put on the armour of light.",
        "part5": "Verse 12 is even more alarming than the preceding verse. Paul considers that the evil time is almost over. The night refers to this current corrupted age in a wicked and sinful world. The day points to the second coming of Christ, which is almost here. If we are wise and realize the times in which we live, we will do what is necessary and right.\n\nAs God's children, we thank Him for delivering us from the present evil age [Galatians 1:4]. We are part of a world ruled by Satan, full of temptation, deceptions, and disappointments. But we have been redeemed by the precious blood of Jesus Christ, gained the victory through faith in Christ, and we are no longer enslaved to the wicked ways of the world.\n\nPaul explains it well in 1 Corinthians 7:29. Our time is short. He urges us to make the most of it. We should have the sense of urgency to tell others the Good News. Do we use the talents and opportunities given by the Lord to serve others? We must put on our spiritual armour and be careful to live a consecrated life. \"See then that ye walk circumspectly, not as fools, but as wise, redeeming the time, because the days are evil\" [Ephesians 5:15-16]. The world we live in is evil, and we must be vigilant. It is important to stay close to the Lord, arming ourselves with wisdom from above, and protecting ourselves with God's presence so that we can walk the narrow path of righteousness.",
        "part6": "THOUGHT",
        "part7": "What do I need to do in order to be approved when I meet Jesus Christ? Will I hear Jesus saying: \"Well done, good and faithful servant; thou hast been faithful over a few things, I will make thee ruler over many things: enter thou into the joy of thy lord.\" - Matthew 25:23.",
        "part8": [
            "2 KINGS 22",
            "HEBREWS 6"
        ]
    },
    "12 NOVEMBER": {
        "part1": "Romans 13:13",
        "part2": "Walk honestly",
        "part3": "VERSE 13",
        "part4": "Let us walk honestly, as in the day; not in rioting and drunkenness, not in chambering and wantonness, not in strife and envying.",
        "part5": "As children of light, we should not be indulging in sleep and sloth. We are to be sober and watchful, alert, and self-controlled. We are to refrain from sinful acts, from participating in the darkness of wild parties and drunkenness, from living in sexual promiscuity and immorality, or in quarreling and jealousy. We are to put on faith and love as our breastplate, and the hope of salvation as our helmet [1 Thessalonians 5:4-8].\n\nThe moral standards today are in decline. As God's people, we go with the flow and lower our standards; rather we are to live a holy life in accordance with God's Word. We should draw close to the Lord every day through prayer and Bible study. We must devote ourselves to the Lord by denying our own will and not indulging our flesh. By the help of God, we must not give in to temptation which will lead to disastrous outcomes. If we really put God above self, let the Holy Spirit guide our thoughts, words, and actions. If Christ is the Master of our life, we will be filled with God's peace and love. It will overflow to others and show our love for them, instead of strife, jealousy, and hatred.\n\nWhen we arise in the morning, commit to conducting ourselves in a manner that will honour the Lord. Speak, behave, and think like Christ. Walk honestly and properly by involving God in every aspect of our lives. We need to walk in the Spirit, and we will not fulfil the lust of the flesh [read Galatians 5:16-18].",
        "part6": "PRAYER",
        "part7": "And the very God of peace sanctify you wholly; and I pray God your whole spirit and soul and body be preserved blameless unto the coming of our Lord Jesus Christ. - 1 Thessalonians 5:23.",
        "part8": [
            "2 KINGS 23",
            "HEBREWS 7"
        ]
    },
    "13 NOVEMBER": {
        "part1": "Romans 13:14",
        "part2": "No room for the flesh",
        "part3": "VERSE 14",
        "part4": "But put ye on the Lord Jesus Christ, and make not provision for the flesh, to fulfil the lusts thereof.",
        "part5": "The man in his natural state will manifest all manner of sinful attitudes and behaviour like dishonesty, pride, greed, hatred, idolatry, drunkenness, and immorality, to name a few. When a person has come to saving faith, we put on the Lord Jesus Christ because \"he hath clothed me with the garments of salvation, he hath covered me with the robe of righteousness\" [Isaiah 61:10].\n\nPutting on the Lord Jesus also means continuous spiritual growth after conversion. This process of sanctification is the work of the Holy Spirit to transform us to be more and more Christ-like. We desire to obey God and please Him in our thoughts and deeds. While we are in our mortal bodies, the desire to sin surfaces from time to time. If we succumb to that desire, it shows that sin still has a powerful grip on us.\n\nThe Apostle Paul urges us to put down the desire to please ourselves. To \"make not provision for the flesh\" means that we are not to give forethought or plan how we can satisfy and fulfil the desires and lusts of our hearts. The more thought we give to sin, the more space it has to grow, the more it will come to fruition. Instead, we are to fill our minds with the Word of God which leads us toward righteousness and obedience [Psalm 119:9, 11]. Reading, meditating and memorising God's Word will keep us from sinning against God. May He help us to give time and attention to understanding His Word so we can be sanctified and kept from sin.",
        "part6": "THOUGHT",
        "part7": "This I say then, walk in the Spirit, and ye shall not fulfil the lust of the flesh. - Galatians 5:16",
        "part8": [
            "2 KINGS 24",
            "HEBREWS 8"
        ]
    },
    "14 NOVEMBER": {
        "part1": "Romans 14:1",
        "part2": "Take care of the weak",
        "part3": "VERSE 1",
        "part4": "Him that is weak in the faith receive ye, but not to doubtful disputations.",
        "part5": "Here, the Apostle Paul turns his attention to the attitude that Christians should adopt towards one another in matters where God's Word is silent - things that are morally neutral.\n\nStrong believers - those who are more mature in the faith - understand and enjoy freedom in Christ. Weak believers - new believers and those who are spiritually immature - remain constrained by religious or cultural taboos and practices that were ingrained before their salvation.\n\nThe strong believer may view his weaker brother as rigid for binding himself to unnecessary rules. As long as no saving merit is ascribed to such practices, these self-imposed restrictions can be tolerated. The weak believer may regard the strong believer as being ill-disciplined and unwilling to subject his body and mind to the Spirit's control. Such differences in opinions can easily lead to tension among believers.\n\nJust as God receives all believers who place their faith in Jesus to save them, strong and weak Christians must accept one another with the view that all are children of our Lord Jesus. Unity among believers is of greater importance than to debate and disagree over such issues.\n\nPaul exhorts the strong believers to receive the weaker ones with love, patience, and forbearance because the stronger believers are in a better position to help the weak. Not all believers grow to full maturity at the same rate, but Paul does not want to reduce the whole church to the level of the weak. Spiritually weaker believers need the fellowship of the stronger believers to be strengthened in their faith and shielded from harm. May God help us to support one another in our spiritual walk so all may grow in faith and serve God to His glory.",
        "part6": "THOUGHT",
        "part7": "Beloved, if God so loved us, we ought also to love one another. - 1 John 4:11",
        "part8": [
            "2 KINGS 25",
            "HEBREWS 9"
        ]
    },
    "15 NOVEMBER": {
        "part1": "Romans 14:2-3",
        "part2": "Despise not the weak",
        "part3": "VERSE 3",
        "part4": "Let not him that eateth despise him that eateth not; and let not him which eateth not judge him that eateth: for God hath received him.",
        "part5": "God accepts us because the righteousness of our Lord Jesus is imputed onto us through His death on the cross to pay for our sins. To ask for more would be denying the Gospel and operating on the basis of salvation by works. The stronger believer has, by God's grace, gained an insight into the meaning of Christ's death for daily living. Therefore, he is able to eat meat. The weaker brother, with lesser understanding and a tender conscience, eats only vegetables.\n\nPaul said it was wrong for believers to treat one another with contempt on account of their differing opinions. Our Lord Jesus taught that it is not what we eat that defiles us, rather sin comes from the evil in our heart [Mark 7:15-23].\n\nEvery Christian, being God's servant, is answerable to Him alone. Our assessment of other believers does not affect their standing before Him because only God's judgment matters v. 10. Paul assures us that the our Lord Jesus will sustain every one of His servants so they can bring Him honour and glory v. 4. There is no condemnation because we are in Christ, and nothing can separate us from the love of God. [Romans 8:1, 38-39] Therefore, let us not fault one another over insignificant issues but seek God's wisdom to strengthen one another in the faith. The more mature in faith among us should uphold our less mature brethren in prayer, and encourage them to grow closer to God in their spiritual walk.",
        "part6": "THOUGHT",
        "part7": "Wherefore he is able also to save them to the uttermost that come unto God by him, seeing he ever liveth to make intercession for them. - Hebrews 7:25",
        "part8": [
            "1 CHRONICLES 1-2",
            "HEBREWS 10"
        ]
    },
    "16 NOVEMBER": {
        "part1": "Romans 14:5-6",
        "part2": "Judge not the weak",
        "part3": "VERSE 6",
        "part4": "He that regardeth the day, regardeth it unto the Lord; and he that regardeth not the day, to the Lord he doth not regard it. He that eateth, eateth to the Lord, for he giveth God thanks; and he that eateth not, to the Lord he eateth not, and giveth God thanks.",
        "part5": "Some Christians regarded certain days as special while others did not. Some Christians adhered to special diets while others ate all types of food. They had different ideas but the same goal of pleasing God. Some Christians of each persuasion may have thought themselves more spiritual and those belonging to the opposite camp as carnal. Paul sought to rid the believers of such erroneous and divisive notions.\n\nIn matters not expressly spoken of in God's Word, believers should study scripture to extract the biblical principles that will guide their actions. Every believer should be a responsible and thinking Christian who works through these matters themselves so that they come to a deeper understanding of how to please God. This will ensure that our hearts and minds are fully convinced as to how to obey God. We will then be able to follow our conscience which represents what we believe is right. Yet, we should avoid imposing our convictions on other believers lest it causes them to go against their conscience.\n\nBeing \"fully persuaded in his own mind\" implies that we think only of pleasing the Lord in our choices and cast no reflection on others because we know they are also earnestly striving to please God in their choices. In other words, we examine ourselves carefully as we make choices in our daily lives. Are we serving God with our talents and resources in what we do? Do our choices truly glorify God's name? Are we able to enjoy the activity we are engaging in and give thanks unto the Lord for it?",
        "part6": "THOUGHT",
        "part7": "Let no man therefore judge you in meat, or in drink, or in respect of an holyday, or of the new moon, or of the sabbath days: Which are a shadow of things to come; but the body is of Christ. - Colossians 2:16-17",
        "part8": [
            "1 CHRONICLES 3-4",
            "HEBREWS 11"
        ]
    },
    "17 NOVEMBER": {
        "part1": "Romans 14:7-8",
        "part2": "Be fully persuaded",
        "part3": "VERSE 8",
        "part4": "For whether we live, we live unto the Lord; and whether we die, we die unto the Lord: whether we live therefore, or die, we are the Lord's.",
        "part5": "We live unto the Lord. We also die unto the Lord. We are the Lord's. The Lordship of Christ is without doubt one of the great themes of the New Testament. The word \"Lord\" (Gk: kurios), which means \"master,\" appears over 700 times. In Romans 14, kurios is used ten times in five verses v. 6, 8, 9, 11, and 14.\n\nThe Apostle Paul uses the title for Jesus, indicating that our Saviour is also our Lord; that there is no salvation apart from Lordship. The title, however, is not simply a point of doctrine. Our Lord Jesus Himself warns that \"not every one that saith unto me, Lord, Lord, shall enter into the kingdom of heaven; but he that doeth the will of my Father which is in heaven\" [Matthew 7:21].\n\nIn Romans 14:8, Paul is emphasising that Christ is the centre of everything from beginning to end. At the very heart of our coming to Christ is surrendering our lives to Him, and Christcenteredness is a heart issue and an issue of the heart. Paul's reasoning is simple, if we live, is only because God sustains us - it is \"in him we live, and move, and have our being\" [Acts 17:28]. If we are saved, it is because He has redeemed us with His own precious blood [1 Peter 1:18-19]. And when we die, it is Christ calling us home unto Himself.\n\nSo, whether we live or die, we are fully persuaded, that neither death, nor life, nor angels, nor principalities, nor powers, nor things present, nor things to come, nor height, nor depth, nor any other creature, shall be able to separate us from the love of God, which is in Christ Jesus our Lord [Romans 8:38-39].",
        "part6": "PRAYER",
        "part7": "For to me to live is Christ, and to die is gain. - Philippians 1:21",
        "part8": [
            "1 CHRONICLES 5-6",
            "HEBREWS 12"
        ]
    },
    "18 NOVEMBER": {
        "part1": "Romans 14:9-10",
        "part2": "Purpose for the Lord's death",
        "part3": "VERSE 9",
        "part4": "For to this end Christ both died, and rose, and revived, that he might be Lord both of the dead and living.",
        "part5": "The first man, Adam, opened the door of death to his posterity when he ate the forbidden fruit (of death) after his wife Eve was deceived into taking it by the evil one [1 Timothy 2:14]. He could not die for her, but he died with her at that moment. He could not restore her to her unfallen state, but he would go down with her in her fallen state.\n\nThe last Adam [1 Corinthians 15:45] came and opened the door of eternal life to all His beloved ones, His chosen bride. He resisted and overcame the temptations of the Devil. He lived a sinless life and became the perfect sacrifice for His bride by dying for her. His love for her was strong as death. He died that she might live and rose again for her justification.\n\nO beloved child of God, Christ died to take away your sins; He died in your place to save you from eternal damnation, a Christless eternity, where there is utter darkness, weeping and gnashing of teeth. \"Blessed and holy is he that hath part in the first resurrection: on such the second death hath no power\" [Revelation 20:6a].\n\nThe death of Christ was the death of Death, and the hymnwriter succinctly and beautifully captures the wonders of this atoning death of Christ on the cross - \"Who died, eternal life to bring, and lives that death may die.\"  Crown Him the Lord of life, Who triumphed o'er the grave, And rose victorious in the strife For those He came to save; His glories now we sing Who died, and rose on high, Who died, eternal life to bring, And lives that death may die.",
        "part6": "HYMN",
        "part7": "Crown Him the Lord of life\nWho triumphed o'er the grave\nAnd rose victorious in the strife,\nFor those He came to save;\nHis glories now we sing,\nWho died, and rose on high\nWho died, eternal life to bring\nAnd lives that death may die.",
        "part8": [
            "1 CHRONICLES 7-8",
            "HEBREWS 13"
        ]
    },
    "19 NOVEMBER": {
        "part1": "Romans 14:11-12",
        "part2": "Accounting to God",
        "part3": "VERSE 12",
        "part4": "So then every one of us shall give account of himself to God.",
        "part5": "There is a day of reckoning when every one of us shall, inevitably and certainly, stand before God to give account of ourselves to Him. Apostle Paul in his 2nd letter to the Corinthians speaks of the same thing [2 Corinthians 5:10]. The wise king Solomon and Preacher summed up the conclusion of the whole matter: \"Fear God, and keep his commandments: for this is the whole duty of man. For God shall bring every work into judgment, with every secret thing, whether it be good, or whether it be evil\" [Ecclesiastes 12:13-4].\n\nEven our words will be judged. Our Lord said that \"every idle word that men shall speak, they shall give account thereof in the day of judgment. For by thy words thou shalt be justified, and by thy words thou shalt be condemned\" [Matthew 12:36-37].\n\nThe parable in Matthew 25:14-29 gives us a glimpse of how we will be giving account of the talents given to us while we are on earth. God will reward the Christian who is faithful and fruitful. And He will render judgment on the idle and self-centered man.\n\nThis is a sobering thought, and we ought to reflect and repent while there is time and opportunity. Our life, every word, thought and action, will have to be accounted for on judgment day.\n\nThe great Puritan, John Bunyan, gave us his hearty counsel before finally standing at the judgment seat of God \"Thus, every morning and evening, make up thy accounts with the Almighty God, and thy reckonings will be the less at last.\"",
        "part6": "THOUGHT",
        "part7": "The Christian is justified by his faith in Christ and judged by his works for Christ.",
        "part8": [
            "1 CHRONICLES 9-10",
            "JAMES 1"
        ]
    },
    "20 NOVEMBER": {
        "part1": "Romans 14:13",
        "part2": "Stumble not the weak",
        "part3": "VERSE 13",
        "part4": "Let us not therefore judge one another any more: but judge this rather, that no man put a stumblingblock or an occasion to fall in his brother's way.",
        "part5": "The Apostle Paul has in the preceding verse brought believer and unbelievers before the judgment bar of Christ. Every one of us has to give an account of ourselves before the Righteous Judge. With this sobering thought, he now brings them back to the church with instructions to put away the censorious and judgmental spirit that is common among them - a spirit that is contrary to personal holiness and practical godliness, and it is unhealthy for the church.\n\nThe church consists of believers of different maturity, talents, and gifts, serving in different offices and ministries. Theological knowledge is indispensable to Christian growth, but it can puff up a person [1 Corinthians 8:1b]. Superior biblical knowledge can be mistaken for spiritual maturity and can lead one to regard oneself better than others. Thinking that he knows more, he starts to pick on others' weaknesses and passes judgment on those he deems lesser or who disagree with his convictions. It is not uncommon to have believers among us developing such undesirable traits, failing to recognise that the church consists of believers who are all imperfect and still growing spiritually. Paul warns that \"knowledge puffeth up, but charity edifieth. [1 Corinthians 8:1b] We will do well to take to heart the wisdom of the old adage that says: In essentials, unity. In non-essentials, liberty. But in all things, charity.\n\nBe mindful of the weak and young in faith lest by our unguarded zeal, we cause them to stumble. The Lord will not hold us guiltless for He said, \"But whoso shall offend one of these little ones which believe in me, it were better for him that a millstone were hanged about his neck, and that he were drowned in the depth of the sea\" [Matthew 18:6].",
        "part6": "THOUGHT",
        "part7": "An ounce of love is worth a pond of knowledge. - John Wesley.",
        "part8": [
            "1 CHRONICLES 11-12",
            "JAMES 2"
        ]
    },
    "21 NOVEMBER": {
        "part1": "Romans 14:14",
        "part2": "Nothing unclean",
        "part3": "VERSE 14",
        "part4": "I know, and am persuaded by the Lord Jesus, that there is nothing unclean of itself: but to him that esteemeth any thing to be unclean, to him it is unclean.",
        "part5": "The imperfect church on earth can only be perfected in heaven. On this side of eternity, the imperfections of the church will be manifested. Even necessities of life can be an issue to be contended upon. Paul now addresses that part of Christian practice which is issues-oriented. He makes explicitly clear that there is nothing unclean of itself, for every creature of God is good, and nothing to be refused, if it be received with thanksgiving: for it is sanctified by the word of God and prayer [1 Timothy 4:4]. Yet Paul did not impose his apostolic authority; instead he urged tolerance with brotherly love. \"The servant of the Lord must not strive; but be gentle unto all men, apt to teach, patient\" [2 Timothy 2:24].\n\nNotwithstanding, the food that is offered in sacrifice unto idols, we are to abstain though an idol is nothing in the world. And if the Gentiles made it known that the food had been offered to idols, believers must certainly abstain [1 Corinthians 10:28].\n\nMatthew Henry puts it this way, \"Those who are strict in restraining their own liberty yet ought not to impose those restraints upon the liberty of others, nor to judge of them accordingly. We must not make ourselves the standard to measure others by. A good man will deny himself that liberty which he will not deny another.\"\n\nThe key lesson here is to preserve the unity of the Spirit, maintain peace and harmony within the church. If we differ in things non-essential, we must learn to agree to disagree and live peaceably among ourselves, for how good and how pleasant it is for the brethren to dwell together in unity.",
        "part6": "PRAYER",
        "part7": "That they all may be one; as thou, Father, art in me, and I in thee, that they also may be one in us: that the world may believe that thou hast sent me. - John 17:21.",
        "part8": [
            "1 CHRONICLES 13-14",
            "JAMES 3"
        ]
    },
    "22 NOVEMBER": {
        "part1": "Romans 14:16",
        "part2": "Be not evil spoken of",
        "part3": "VERSE 16",
        "part4": "Let not then your good be evil spoken of:",
        "part5": "Christians are no longer under the Old Covenant and the need to distinguish between unclean and clean foods or circumcision and uncircumcision. All things are lawful [1 Corinthians 10:23]. While Christians are freed from ceremonial law [Galatians 3:23-25], some may have difficulty living with such freedom.\n\nFor Paul's audience, some Jewish Christians weaker in faith still observed old Jewish dietary laws. Other Christians stronger in faith embraced Christian liberty and ate any food they pleased. Paul warns stronger Christians not to flaunt their Christian liberty in a way that reflects badly on Christianity. Our freedom is good - but we should not abuse our freedom in Christ to risk stumbling a weaker brother who still believes some things are wrong.\n\nPaul's warning is also to weaker Christians and a reminder they ought not to criticise those who feel that they are free to eat anything. In relation to foods, dress, rites, and ceremonies in the church, we may feel that our personal convictions are the only right ones. Obstinate adherence to these may nevertheless give rise to slanderous talk, contention, bitter discussions, and evil reports. Such conduct contradicts Christ's love.\n\nWhether in exercising Christian liberty or in how we think we ought to live, let us do all things in a manner, spirit, and time that is productive of the greatest good. May we put aside private, unimportant personal indulgences and prize the good of peace with our brothers and sisters in Christ.",
        "part6": "HYMN",
        "part7": "Blest be the tie that bind\nour hearts in Christian love;\nthe fellowship of kindred minds\nis like to that above.",
        "part8": [
            "1 CHRONICLES 15",
            "JAMES 4"
        ]
    },
    "23 NOVEMBER": {
        "part1": "Romans 14:17-18",
        "part2": "Kingdom of God",
        "part3": "VERSES 17-18",
        "part4": "For the kingdom of God is not meat and drink; but righteousness, and peace, and joy in the Holy Ghost. For he that in these things serveth Christ is acceptable to God, and approved of men.",
        "part5": "The kingdom of God is not found in meticulously eating and drinking the right things. It is also not found in indulging ourselves to eat and drink every and anything we like. God's kingdom is neither following a set of religious observances. Nor is it throwing away all order and simply living as we please.\n\nThe kingdom of God is the realm of God's rule, which is present and seen in whatever God does in the lives of Christians and their relationships with God and others. It comprises three great attributes which are in essence unselfish.\n\nThere is righteousness, found in those who by God's grace open their hearts to receive Christ and are justified by the merit of His death. Because of our new standing before God, we are to be righteous in our dealings with God and men.\n\nThere is peace with God because our relationship with Him is right. Because we have peace with Him, we are to pursue peace with others.\n\nThere is the overflowing joy of being reconciled with God. Because of this joy, we are to share our joy with others too. Paul tells us that the kingdom of God is being in a right relationship with God and with others. Serving Christ by focusing on righteousness, peace, and joy in the Holy Spirit is pleasing to God. Instead of speaking ill of us, the world will acknowledge that we are genuine.",
        "part6": "HYMN",
        "part7": "Living for Jesus, a life that is true,\nStriving to please Him in all that I do;\nYielding allegiance, glad-hearted and free,\nThis is the pathway of blessing for me.",
        "part8": [
            "1 CHRONICLES 16",
            "JAMES 5"
        ]
    },
    "24 NOVEMBER": {
        "part1": "Romans 14:19",
        "part2": "Make way for peace",
        "part3": "VERSE 19",
        "part4": "Let us therefore follow after the things which make for peace, and things wherewith one may edify another.",
        "part5": "Paul exhorts the church at Rome to lay aside their contentions and channel their time and energy to things that build harmony and love within the body of Christ. We too should do everything we can to build up fellow Christians by what we say or do and not discourage them.\n\nTo make way for peace we must first put aside things that create strife. Be careful especially of the words we say, which may have far-reaching consequences [James 3:5], and resist the urge for slander and gossip. Be swift to hear, slow to speak, and slow to wrath [James 1:19]. Consider carefully whether what we say is corrupting or helpful in building others up and appropriate for the occasion [Ephesians 4:29].\n\nWhether strong or weak, we are to diligently keep the unity of the Spirit in the bond of peace [Ephesians 4:3]. Keeping the peace is not simply being silent and agreeable. Building up others requires us to be present and genuine, or else we become like those whom Jeremiah described as saying peace, peace, when there is no peace [Jeremiah 6:14].\n\nWe then ought to edify and help each other along the spiritual road we are travelling. Building each other up requires the participation of all members of the church - encouraging each other and holding one another accountable helps each of us become more Christ-like.",
        "part6": "THOUGHT",
        "part7": "What are you doing to build up the body of Christ today?",
        "part8": [
            "1 CHRONICLES 17",
            "1 PETER 1"
        ]
    },
    "25 NOVEMBER": {
        "part1": "Romans 14:20-21",
        "part2": "Meat does not destroy",
        "part3": "VERSES 20-21",
        "part4": "For meat destroy not the work of God. All things indeed are pure; but it is evil for that man who eateth with offence. It is good neither to eat flesh, nor to drink wine, nor any thing whereby thy brother stumbleth, or is offended, or is made weak.",
        "part5": "Paul is likely addressing the strong Christian when he says what we eat does not destroy the work of God. Paul also assures the strong Christian that there is nothing impure in food itself. However, Paul emphasises that the strong who have no convictions against eating such food fall into sin when others stumble and fall away from Christ upon observing how they behave. It is tragic to think that by our obstinate attachment to our own opinions, we may lead a brother to confusion and sin.\n\nEven if all things are lawful, not everything is expedient and not everything builds others up [1 Corinthians 10:23-24]. Our freedom in Christ should never mean we celebrate it at the expense of others.\n\nIt is not good for us to do anything that causes a brother in Christ to be confused, or to feel so lacking that he is tempted to drop his profession of faith or become shaken in his spiritual walk. We may be rightly entitled to exercise our Christian liberty but if we confuse or cause our brothers to stumble over trivial matters out of a desire to indulge ourselves because we are indifferent to their spiritual state, we are not acting in love [Romans 13:10]. What we do and say can prompt a person to be led closer to Christ or drive them away. We should be aware of what we do, because others are watching us [Matthew 5:16].",
        "part6": "HYMN",
        "part7": "Let me be a little meeker,\nWith the brother that is weaker.\nLet me think more of my neighbor,\nAnd a little less of me.",
        "part8": [
            "1 CHRONICLES 18",
            "1 PETER 2"
        ]
    },
    "26 NOVEMBER": {
        "part1": "Romans 14:22",
        "part2": "No self-condemnation",
        "part3": "VERSE 22",
        "part4": "Hast thou faith? have it to thyself before God. Happy is he that condemneth not himself in that thing which he alloweth.",
        "part5": "Are you fully persuaded in your mind that something you are doing is right? Perhaps we think that something should be done a certain way. Or we may think that Christian liberty means there is no right or wrong way for certain things to be done.\n\nPaul implies that while we need not surrender our convictions just because others are convicted otherwise, we should keep our convictions between ourselves and God, instead of raising them to dictate how others should live. Paul tells us we are happy indeed if we have a clear conscience in our opinions and conduct. We are blessed if we have strong faith and our consciences are not enslaved by laws and rules which concern matters of lesser importance, such as what we eat or drink.\n\nConversely, some of us may indulge in practices that our consciences condemn, or we are privately uneasy about. The way to be happy is to have a clear conscience in what we do. If we have doubts about a course of conduct, we should at once abandon it, but if our heart condemns us not, we have confidence toward God [1 John 3:21]. Ultimately, each of us are accountable to God [v. 10-12].\n\nMay we have a clear conscience before God so we may boldly approach His throne and find grace [Hebrews 4:16].",
        "part6": "THOUGHT",
        "part7": "Are my convictions pleasing to God, and edifying to my brother? Is there anything in my life that I do not have a clear conscience about and why am I continuing to do it?",
        "part8": [
            "1 CHRONICLES 19-20",
            "1 PETER 3"
        ]
    },
    "27 NOVEMBER": {
        "part1": "Romans 14:23",
        "part2": "Not faith is sin?",
        "part3": "VERSE 23",
        "part4": "And he that doubteth is damned if he eat, because he eateth not of faith: for whatsoever is not of faith is sin.",
        "part5": "In contrast to the Christian who acts from conviction is the weak Christian who has doubts. The doubts arise from the fact they do not have a faith strong enough to believe they can now dispense with the ritual elements of the OT law. These doubters, Paul says, are condemned when they eat. This is not simply a subjective self-condemnation; as the reference to sin later in the verse makes clear when Paul refers to God's disapproval of such an act. Condemnation comes not because of the eating itself, but what earns God's condemnation is eating when one does not have the faith to believe it is right to do so.\n\nFaith here is the conviction stemming from one's faith in Christ. Paul is not claiming that any act that does not arise out of a basic trust and dependency on Christ is sinful, true as that may be. What he here labels as sin is any act that does not match our sincerely held convictions about what our Christian faith allows us to do or not do. For the Christian, not a single decision and action can be good which he does not think he can justify on the grounds of his Christian conviction and his liberty before God in Christ.\n\nFor Paul, then, sin is not only a matter of outward behaviours, but also inward motives. A weak conscience with weak faith would be healthier if it were strong, but such maturation must come by persuasion regarding what is God's will, not by simply changing behaviour without regard for motives. By appealing to the larger principle that anything not from faith is sin, Paul also returns to his emphasis on faith as a relationship with God in contrast to mere rules and regulations.",
        "part6": "PRAYER",
        "part7": "Dear God, please bring my conscience in line with the Word of God and into conformity to the mind of Christ.",
        "part8": [
            "1 CHRONICLES 21",
            "1 PETER 4"
        ]
    },
    "28 NOVEMBER": {
        "part1": "Romans 15:1",
        "part2": "Bearing infirmities",
        "part3": "VERSE 1",
        "part4": "We then that are strong ought to bear the infirmities of the weak, and not to please ourselves.",
        "part5": "We are not individuals in isolation. We live in community; we live in relationships with other Christians in the brotherhood of the church. We are called to weep with those who weep, laugh with those who laugh, rejoice with those who rejoice and so on. The character of the Christian life is not one of selfishness or self-centeredness. We are to think about others and be concerned about them. Christians are called, in a spirit of charity, to be longsuffering and patient toward their fellowmen.\n\nThose who pride themselves on their strength are obliged to use that to bear the weaknesses of those who are without strength in that matter. Paul is not urging us to bear with, just tolerate or put up with the weak but to sympathetically and empathetically enter into their circumstances, refrain from criticizing and judging them, and do what love toward them would require. Love requires the strong to willingly and lovingly assume for themselves the burden that their weaker brethren are carrying.\n\nIn the choice between enjoying our Christian liberty or forgoing it to avoid stumbling a fellow brother or sister, we are to choose the latter. It is with this mindset that others may be won more easily to a fuller faith, by surrounding them with an atmosphere of love rather than attacking them with a battery of criticism.",
        "part6": "THOUGHT",
        "part7": "May we parallel our Lord Jesus Christ in serving others and not with the priority of being served [Mark 10:45].",
        "part8": [
            "1 CHRONICLES 22",
            "1 PETER5"
        ]
    },
    "29 NOVEMBER": {
        "part1": "Romans 15:2-3",
        "part2": "Bearing good for edification",
        "part3": "VERSE 2",
        "part4": "Let every one of us please his neighbour for his good to edification.",
        "part5": "The purpose of pleasing others is to seek the good of the weaker believer: his or her spiritual profit, in contrast to the spiritual harm that insensitive and selfish behaviour of the strong may cause. Paul defines this good more specifically in a second clause: edification or building up. This word takes us out of the narrowly individualistic realm. The spiritual profit to the weaker brother also profits the Christian community as a whole because their edification unifies the church. Building each other up in maturation of the faith ultimately brings brethren together in praise and in service. Therefore, our priority should be to help others instead of pleasing ourselves.\n\nChrist offered the example of this readiness to forgo pleasing himself. Jesus stood between hostile parties as a mediator and absorbed unthinkable insult, slander and vicious attacks in doing so. None of the things Jesus was accused of were legitimate. He was without sin. Every time Jesus was criticized, every time Jesus was attacked, he was attacked unjustly. No one was ever justified in insulting Jesus. But he absorbed their hostility, anger and insults, offering a model of laying down one's desires to serve others.\n\nBy considering others before ourselves, we emulate our Lord and reflect more of His character. In this world where men are lovers of themselves, God calls us to love one another and to please others before self.",
        "part6": "THOUGHT",
        "part7": "Wherefore comfort yourselves together, and edify one another, even as also ye do. - 1 Thessalonians 5:11.",
        "part8": [
            "1 CHRONICLES 23",
            "2 PETER 1"
        ]
    },
    "30 NOVEMBER": {
        "part1": "Romans 15:4",
        "part2": "Old Testament Lessons",
        "part3": "VERSE 4",
        "part4": "For whatsoever things were written aforetime were written for our learning, that we through patience and comfort of the scriptures might have hope.",
        "part5": "Sometimes we struggle to be disciplined in studying Scripture deeply. Although every Christian knows that studying God's Word is a must and our obligation to do, sometimes doing things that are our duty and obligation are not enjoyable. We would rather do things that help and benefit us directly. Yet God has given us the Bible not to be put on the shelf or to burden us but to teach us for our good!\n\nThe Old Testament, though no longer a source of direct moral imperative, continues to play a central role in helping Christians to have hope. In reading it and seeing its fulfilment in Christ and the church, the believer's hope is built up. And although Scripture demonstrates that God's way is never an easy way, in the end it is the only way to everything that makes life worthwhile in time and in eternity.\n\nSecondly, Scripture gives us the great and precious promises of God. Because God is true and faithful in each and every promise to date, we can rest assured that God will remain faithful to the very end. Just as a child puts a candy in the mouth and savours it, so must the Christian dwell on the promises of God to enjoy it. In this way, Scripture gives to those who study it comfort in their sorrow and encouragement in their struggles.",
        "part6": "THOUGHT",
        "part7": "Thou art my hiding place and my shield: I hope in thy word. - Psalm 119:114.",
        "part8": [
            "1 CHRONICLES 24-25",
            "2 PETER 2"
        ]
    },
    "1 DECEMBER": {
        "part1": "Romans 15:5-6",
        "part2": "One-mindedness",
        "part3": "VERSE 6",
        "part4": "That ye may with one mind and one mouth glorify God, even the Father of our Lord Jesus Christ.",
        "part5": "Paul offers a prayer and the recording of this prayer serves to exhort to its readers. Paul impresses unity upon them by using the second person plural (ye) to address the entire community. In this prayer, Paul urges Christians to think with a spirit of unity for the same thing; however, he is not praying these Christians all come to the same convictions about permissible foods. Rather, Paul is asking God to grant that they may remain united in their devotion and service to the Lord Jesus Christ.\n\nIn any community, there will be differences of opinion, and in any church there will be arguments and debate; but Christians who live in harmony have solved the problem of living together. They realize that the Christ who unites them is greater by far than the differences that may divide them. Divisions in the church over non-essential issues divert precious time and energy from her primary mission - the proclamation of the Gospel and the glorifying of God.\n\nTo achieve this goal of unity, we have to \"be clothed with humility\" [1 Peter 5:5]. Humility is the virtue everyone knows they need, but nobody wants. And when we think we have humility, it is a sure indication that we have lost it. Let us always look to Jesus, the greatest example of humility, who condescended to man and lived a life of obedience to the cross so that through Him we might be saved.",
        "part6": "PRAYER",
        "part7": "Dear God, humble me to serve others rather than myself, and that together we may glorify you with our mouths and our hands as your church. Amen.",
        "part8": [
            "1 CHRONICLES 26-27",
            "2 PETER 3"
        ]
    },
    "2 DECEMBER": {
        "part1": "Romans 15:7",
        "part2": "Receive one another",
        "part3": "VERSE 7",
        "part4": "Wherefore receive ye one another, as Christ also received us to the glory of God.",
        "part5": "To receive someone is to welcome them. It implies an active personal and willing acceptance of the person. There is certainly no animosity, no disinterest nor apathy such that we ignore the other. Merely surrendering to the notion of unity is insufficient. More than passively receiving, the idea conveyed is to \"take to one's self \". It is a command by God. It must be a taking to one's self of the other person because we are of one mouth and one mind [v. 6] There are no differences spiritually because we are united and like-minded in our Lord Jesus Christ.\n\nThe pattern of taking into friendship and allowing access to one's life is the Lord Jesus Christ Himself. \"And the Pharisees and scribes murmured, saying, This man receiveth sinners, and eateth with them.\" [Luke 15:2] \"Take heed that ye despise not one of these little ones; for I say unto you, That in heaven their angels do always behold the face of my Father which is in heaven. For the Son of man is come to save that which was lost.\" [Matthew 18:10-11]\n\nIt is God who has given in order for the children of God to receive another into fellowship. God saves in Christ, converting sinners into saints, and then He brings them together, thereby adding them into a community of believers.\n\nChrist the Lord and Saviour is our pattern by how He welcomed us into His saving arms. As the Lord has saved sinners and taken them to be His own, they too are to warmly accept each other to the glory of God the Father.",
        "part6": "THOUGHT",
        "part7": "A new commandment I give unto you, That ye love one another; as I have loved you, that ye also love one another. - John 13:34",
        "part8": [
            "1 CHRONICLES 28",
            "1 JOHN 1"
        ]
    },
    "3 DECEMBER": {
        "part1": "Romans 15:8-9",
        "part2": "Minister to Jews and Gentiles",
        "part3": "VERSE 8",
        "part4": "Now I say that Jesus Christ was a minister of the circumcision for the truth of God, to confirm the promises made unto the fathers:",
        "part5": "The Lord Jesus being a minister was a servant of God the Father, doing His will. He came to those of the circumcision (the Jews) and in so doing, established that all God had said is true. It confirmed that God is true and does not lie. It confirmed that God Himself is Truth, the objective standard by which all things are measured to be true or false. God made the promise to Abraham, the father of the nation of Israel:\n\n\"And I will make of thee a great nation, and I will bless thee, and make thy name great; and thou shalt be a blessing: And I will bless them that bless thee, and curse him that curseth thee: and in thee shall all families of the earth be blessed.\" [Genesis 12:2-3]\n\nThe blessing to all the families of the Earth through Abraham's line was the incarnation of the Lord Jesus Christ [John 1:14] was to the Jews first. \"Unto you first God, having raised up his Son Jesus, sent him to bless you, in turning away every one of you from his iniquities\" [Acts 3:26].\n\nHowever, God did not stop there. The salvation of Gentiles was in His plan of redemption [Psalm 18:49], as the Lord Jesus said to the Jews: \"And other sheep I have, which are not of this fold: them also I must bring, and they shall hear my voice; and there shall be one fold, and one shepherd.\" [John 10:16]",
        "part6": "THOUGHT",
        "part7": "Christ hath redeemed us from the curse of the law, being made a curse for us: for it is written, Cursed is every one that hangeth on a tree: That the blessing of Abraham might come on the Gentiles through Jesus Christ; that we might receive the promise of the Spirit through faith. - Galatians 3:13-14",
        "part8": [
            "1 CHRONICLES 29",
            "1 JOHN 2"
        ]
    },
    "4 DECEMBER": {
        "part1": "Romans 15:10-11",
        "part2": "Gentiles - rejoice and praise",
        "part3": "VERSE 11",
        "part4": "And again, Praise the Lord, all ye Gentiles; and laud him all ye people.",
        "part5": "The Gentiles will give praise and glory to God for His mercy is not limited to those of the house of Israel. God's mercy promised and shown to Israel is given to them too.\n\nPaul attests this from Scriptures:\n\"Rejoice, O ye nations, with his people: for he will avenge the blood of his servants, and will render vengeance to his adversaries, and will be merciful unto his land, and to his people.\" [Deuteronomy 32:43]\n\n\"O praise the LORD, all ye nations: praise him, all ye people. For his merciful kindness is great toward us: and the truth of the LORD endureth for ever. Praise ye the LORD.\" [Psalm 117:1-2]\n\nThese cited from the Law and Writings (2 of the 3 sections of the Old Testament Hebrew Bible) tell us it was always in God's plan to save all nations to Himself, not only Israel.\n\nHis chosen servant to bless all nations coming through the line of Abraham, Isaac and Jacob is clear but the blessings would not be restricted to the physical blood line of Abraham. Realizing this, those outside Israel must be moved to gladness and joy. Their tongues cannot stay silent for, it is only natural that praise comes forth extolling the lovingkindness of God. By the coming of Jesus Christ, Gentiles will give honour and glory to God for His grace in including them in His covenantal love first promised to Israel.",
        "part6": "THOUGHT",
        "part7": "He hath remembered his mercy and his truth toward the house of Israel: all the ends of the earth have seen the salvation of our God. - Psalm 98:3",
        "part8": [
            "2 CHRONICLES 1-2",
            "1 JOHN 3"
        ]
    },
    "5 DECEMBER": {
        "part1": "Romans 15:12",
        "part2": "Root of Jesse",
        "part3": "VERSE 12",
        "part4": "And again, Esaias saith, There shall be a root of Jesse, and he that shall rise to reign over the Gentiles; in him shall the Gentiles trust.",
        "part5": "Paul cites Isaiah, from the section of the the Old Testament. Paul is establishing that there is unanimity in the Scriptures concerning God's intention for Gentiles to join the Jews in seeking Him:\n\n\"And in that day there shall be a root of Jesse, which shall stand for an ensign of the people; to it shall the Gentiles seek: and his rest shall be glorious.\" [Isaiah 11:10]\n\nJesse was the father of King David, [1 Samuel 16:1] the greatest king of the Israelite nation. The Lord Jesus is called the Root of Jesse to denote His coming from the line of David and His humble origins. After the Babylonian captivity in 586 BC, the Davidic dynasty was practically decimated. The remnant of the Israelite nation was but a stump, nothing much to look at, unimpressive, and to which no human would have placed any hope for greatness. However, God in His sovereign wisdom had other plans:\n\n\"And there shall come forth a rod out of the stem of Jesse, and a Branch shall grow out of his roots: And the spirit of the LORD shall rest upon him, the spirit of wisdom and understanding, the spirit of counsel and might, the spirit of knowledge and of the fear of the LORD\" [Isaiah 11:1-2]\n\nThe Messiah from the Davidic line fulfilled God's promise [2 Samuel 7:12-16], proving Christ's humanity so that Jews and Gentiles will have saving hope, joy and confidence in Him and His kingship.",
        "part6": "THOUGHT",
        "part7": "I Jesus have sent mine angel to testify unto you these things in the churches. I am the Root and the offspring of David, and the bright and morning Star. - Revelation 22:16",
        "part8": [
            "2 CHRONICLES 3-4",
            "1 JOHN 4"
        ]
    },
    "6 DECEMBER": {
        "part1": "Romans 15:13",
        "part2": "Joy and Peace in believing",
        "part3": "VERSE 13",
        "part4": "Now the God of hope fill you with all joy and peace in believing, that ye may abound in hope, through the power of the Holy Ghost.",
        "part5": "Almighty God Himself is a God of hope. He is its source and fills us with joy and peace when we believe. It is not man-made joy and peace. Our believing is not only good for the future when our Lord Jesus returns for our glorification. It is God's plan and desire that we experience joy and peace in the here and now as a result of believing in His Son, Jesus Christ.\n\nGod desires that we have exceeding and abundant hope. What actually is this hope? \"Which hope we have as an anchor of the soul, both sure and stedfast, and which entereth into that within the veil\". [Hebrews 6:19]\n\nThis hope is not wishful thinking but based on God's revealed character through His Word and fulfilment in Jesus Christ. He is the High Priest who died for our sins, rose from the grave, ascended up and now seated on His throne in Heaven, a secure and firm anchor for us. This is the believer's blessed hope.\n\nNeither is hope merely cold factual head knowledge. It is experienced in our hearts as reality because of the Holy Ghost working in us. God is the source of our hope.He is also the centre and object of our hope. God gives and produces this hope in our hearts based on His work. Thus, our hope is assured by Him. We have joyful and confident expectation of eternal salvation because God has told us in His Word, appeared to us in His Son and now works in us by His Holy Spirit.",
        "part6": "PRAYER",
        "part7": "But sanctify the Lord God in your hearts: and be ready always to give an answer to every man that asketh you a reason of the hope that is in you with meekness and fear. - 1 Peter 3:15",
        "part8": [
            "2 CHRONICLES 5",
            "1 JOHN 5"
        ]
    },
    "7 DECEMBER": {
        "part1": "Romans 15:14",
        "part2": "Persuaded!",
        "part3": "VERSE 14",
        "part4": "And I myself also am persuaded of you, my brethren, that ye also are full of goodness, filled with all knowledge, able also to admonish one another.",
        "part5": "The apostle Paul was persuaded that the brethren in Rome was \"full of goodness\". Goodness in what sense? Recall that this letter began with the apostle acknowledging their faith. Romans 1:8 - \"First, I thank my God through Jesus Christ for you all, that your faith is spoken of throughout the whole world.\" The Roman believers were faithful to the Lord. They derived their faith from knowing God's Word and practicing it in two ways. One, by good works of love and compassion to the needy, caring for those who were hurting and burdened. Two, by admonishing and instructing one another with the knowledge they had gained from God's Word, to build up the church in spiritual maturity. That is why Paul could say with confidence he was persuaded of the goodness of the believers in Rome. The same applies to us today. When we by faith in Christ build our church on the foundation of God's Word there will be fruits of righteousness and good works.\n\nWe must never think \"we have arrived\" especially when we see an increase in our numbers at the Lord's Day worship services. Let us not be deceived by thinking that good attendance equals spiritual blessings and congratulate ourselves for doing well. Rather we must continue to trust God and obey His Word. Only then can we be assured of being blessed by the Lord to bear much fruit through His enabling grace.",
        "part6": "THOUGHT",
        "part7": "Being confident of this very thing, that he which hath begun a good work in you will perform it until the day of Jesus Christ. - Philippians 1:6",
        "part8": [
            "2 CHRONICLES 6",
            "2 JOHN"
        ]
    },
    "8 DECEMBER": {
        "part1": "Romans 15:15-16",
        "part2": "Minister to the Gentiles",
        "part3": "VERSE 16",
        "part4": "That I should be the minister of Jesus Christ to the Gentiles, ministering the gospel of God, that the offering up of the Gentiles might be acceptable, being sanctified by the Holy Ghost.",
        "part5": "Apostle Paul's ministry to the Gentiles (non-Jews) was in fulfillment of the Lord's message that \"he is a chosen vessel unto me, to bear my name before the Gentiles, and kings, and the children of Israel\" [Acts 9:15b]. Paul could testify in Ephesians 3:1 and verse 8 \"For this cause I Paul, the prisoner of Jesus Christ for you Gentiles ... Unto me, who am less than the least of all saints, is this grace given, that I should preach among the Gentiles the unsearchable riches of Christ.\" Paul emphasized in Romans 15:15b to verse 16a that it was \"because of the grace that is given to me of God .. that I should be the minister of Jesus Christ to the Gentiles\".\n\nThat was what Paul did. The truth that salvation is by grace through faith in Jesus Christ was preached to the Jews first and then to the Gentiles. Paul ministered to the Gentiles by offering them to God as a priest would make an offering to God. Through the apostle giving them the Gospel, God will convict and save them by their repentance of sins and make them a people acceptable and sanctified unto Him. Today, we thank God the Gospel came to us by God's grace. Having therefore received so great a salvation, we continue to give our lives to God through our spiritual growth in sanctification. With gratitude and joy, we worship the Lord and study to obey His Word. Constrained by the love of God, we follow the example of Paul to minister to others, proclaiming the Gospel to the saving of souls. May the Lord strengthen us by His Spirit.",
        "part6": "THOUGHT",
        "part7": "And other sheep I have, which are not of this fold: them also I must bring, and they shall hear my voice; and there shall be one fold, and one shepherd. - John 10:16",
        "part8": [
            "2 CHRONICLES 7",
            "3 JOHN"
        ]
    },
    "9 DECEMBER": {
        "part1": "Romans 15:17-19",
        "part2": "Fully preached the Gospel of Christ",
        "part3": "VERSE 19",
        "part4": "Through mighty signs and wonders, by the power of the Spirit of God; so that from Jerusalem, and round about unto Illyricum, I have fully preached the gospel of Christ.",
        "part5": "Convicted of his calling by God to bring the Gospel to the Gentiles, Paul embarked on his three missionary journeys preaching the message from the Scriptures that Jesus Christ is the Messiah of the Jews and Saviour of the world [Acts 9:20,22; 18:28]. Authenticated by signs and wonders as an apostle of Jesus Christ and by the power of the Holy Spirit, Paul led many Gentiles to salvation in Christ and obedience to God's Word. Indeed, Paul could testify that \"from Jerusalem, and round about unto Illyricum, I have fully preached the Gospel of Christ.\" Describing his ministry in geographical terms, Paul travelled from Jerusalem to Illyricum, or Dalmatia, a region northwest of Macedonia, which includes part of modern-day Croatia.\n\nExplaining how he could travel that distance and achieve so much, Paul wrote in verse 18 - \"For I will not dare to speak of any of those things which Christ hath not wrought by me, to make the Gentiles obedient, by word and deed\". Paul was careful to give God the glory and not take any credit for the transformation of the Gentiles to Christ which was God's doing. He was only His instrument carrying out His will.\n\nSimilarly, God has called us to proclaim the Gospel to the ends of the world. The work of saving souls was not entrusted to angels but to men and women saved by grace. Given this high privilege, our response must be to obey and carry out the Lord's Great Commission to us in Mark 16:15 \"Go ye into all the world, and preach the Gospel to every creature.\" God sends. We go. He accomplishes His purpose for His Glory.",
        "part6": "THOUGHT",
        "part7": "For whosoever shall call upon the name of the Lord shall be saved. - Romans 10:13",
        "part8": [
            "2 CHRONICLES 8",
            "JUDE"
        ]
    },
    "10 DECEMBER": {
        "part1": "Romans 15:20-21",
        "part2": "Strived to preach the Gospel",
        "part3": "VERSE 20",
        "part4": "Yea, so have I strived to preach the gospel, not where Christ was named, lest I should build upon another man's foundation:",
        "part5": "To \"strive\" is to \"earnestly desire\" or \"aim for something\". It can also be translated as \"ambition\". The apostle's only ambition was to preach and spread the Gospel to people who had never heard of Christ. He was simply following the Lord's example who told His disciples in Luke 4:43 \"I must preach the kingdom of God to other cities also: for therefore am I sent.\" Those who have not heard the Gospel could be our family members, non-Christian friends, the younger generation who are unfamiliar with the Bible, or the inhabitants in another country who have little access to the preaching of the Gospel. How many are these unreached people in the world today? We do not know. What we do know is the need to pray for workers in the harvest fields and then go in response to our prayers.\n\nThe late Reverend Dan Ebert III brought his wife and children to Palawan (the Philippines) in the late 1950s to bring the Gospel to the natives. As a result, many believers, zealous to learn more about the Lord Jesus, were added to the church. One of the questions they asked Pastor Ebert moved him to tears. \"Since Jesus came almost two thousand years ago, why did it take so long for us to hear the Gospel?\" Hearing these words should move us with a renewed love for Christ and zeal to spread the Gospel to new frontiers through missions work. Just as Paul took the Gospel to those places, leaving churches with faithful believers to continue the work of faith, we must obey our Lord's leading to go wherever He sends.",
        "part6": "THOUGHT",
        "part7": "And other sheep I have, which are not of this fold: them also I must bring, and they shall hear my voice; and there shall be one fold, and one shepherd. - John 10:16",
        "part8": [
            "2 CHRONICLES 9",
            "REVELATION 1"
        ]
    },
    "11 DECEMBER": {
        "part1": "Romans 15:22-24",
        "part2": "Paul's pastoral desire",
        "part3": "VERSES 23b-24",
        "part4": "... and having a great desire these many years to come unto you; ... I will come to you: for I trust to see you in my journey, and to be brought on my way thitherward by you, if first I be somewhat filled with your company.",
        "part5": "Pastoral care through visitation has always been the way believers are spiritually edified and their needs met at the individual and family levels. God raised the apostle Paul to instruct believers by meeting with them where they were. This, however, could not always be done because of unforeseen hindrances such as when Paul was imprisoned for his faith. But that did not stop him from thinking and praying for the brethren in the local churches. He even planned to be with the brethren in Rome enroute to Spain when that was possible. We feel such anticipation in Paul's writing to the believers in Rome - \"Making request, if by any means now at length I might have a prosperous journey by the will of God to come unto you. For I long to see you, that I may impart unto you some spiritual gift, to the end ye may be established; That is, that I may be comforted together with you by the mutual faith both of you and me\" [Romans 1:10-12]. To the Philippians in chapter 1:3-4, Paul wrote \"I thank my God upon every remembrance of you, Always in every prayer of mine for you all making request with joy.\"\n\nThe pastoral ministry in the body of Christ is a responsibility we share together. Not all of us are pastors but all of us should have a pastoral heart to reach out to others caringly. It means availing ourselves to them for mutual encouragement and strengthening of the faith. May the Lord give us wisdom, a heart like His to touch the lives of not only our brethren here but also those in the household of faith in faraway mission fields.",
        "part6": "THOUGHT",
        "part7": "And he answering said, Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy strength, and with all thy mind; and thy neighbour as thyself. - Luke 10:27",
        "part8": [
            "2 CHRONICLES 10",
            "REVELATION 2"
        ]
    },
    "12 DECEMBER": {
        "part1": "Romans 15:25-26",
        "part2": "Contribution from Macedonia",
        "part3": "VERSE 26",
        "part4": "For it hath pleased them of Macedonia and Achaia to make a certain contribution for the poor saints which are at Jerusalem.",
        "part5": "The love for the believers prompted the apostle to raise funds for the poor and needy Jewish Christians in Jerusalem. These contributions were collected as Paul travelled and ministered to the churches in Macedonia and Achaia during his third missionary journey. The believers in these churches were mostly Gentiles. Paul reported that these Gentile Christians were willing to give materially to Jewish Christians. Were they rich and had plenty to spare? Not so. Paul wrote in 2 Corinthians 8:2-5 that even though they were deep in poverty, they gave willingly and joyfully beyond their means, earnestly insisting that their contributions be received as tokens of their love and fellowship in ministering to the saints. Why were they so willing to give?\n\nThe answer is found in 2 Corinthians 8:5 \"And this they did, not as we hoped, but first gave their own selves to the Lord, and unto us by the will of God.\" They gave themselves first to the Lord, discerning that it was His will for them to help their brethren in the faith. It is God's will to use His people in local churches to minister to one another for the furtherance of the Gospel. Giving includes caring for the needy and sick, sustaining the preaching, teaching and Bible college ministries, providing for workers in the missions fields. The Macedonian giving reminds us that all can give meaningfully with joy if we will first give of ourselves to the Lord. Remember, God loves a cheerful giver.",
        "part6": "THOUGHT",
        "part7": "For ye know the grace of our Lord Jesus Christ, that, though he was rich, yet for your sakes he became poor, that ye through his poverty might be rich - 2 Corinthians 8:9",
        "part8": [
            "2 CHRONICLES 11-12",
            "REVELATION 3"
        ]
    },
    "13 DECEMBER": {
        "part1": "Romans 15:27",
        "part2": "Privilege and duty",
        "part3": "VERSE 27",
        "part4": "It hath pleased them verily; and their debtors they are. For if the Gentiles have been made partakers of their spiritual things, their duty is also to minister unto them in carnal things.",
        "part5": "The Christians at Macedonia and Achaia had a love gift for their Jewish brethren in Jerusalem. It was an expression of their gratitude for it was through Israel they had been blessed spiritually. Paul reminded earlier in Romans 11 that Israel is the olive tree and we Gentiles are wild branches that have been grafted into it. We have partaken of the root and fatness of the good olive tree. These \"spiritual things\" as Paul puts it, include the precious Gospel and God's Word, the Bible.\n\nChristians in affluent societies like Singapore must have the same spirit of indebtedness. Not only has God blessed us materially, He has also blessed us 'geographically' so that this country has not encountered conflicts, upheaval and serious natural disasters like droughts, earthquakes and typhoons which afflict many other parts of the world. Whenever we see our brethren in these countries in need, we must show our love and give freely to help them; because by this shall all men know that we are His disciples, if we have love one to another. [John 13:35]\n\nThe Lord has also blessed us with good education and proficiency in languages. This puts us in a privileged position to bring the precious Gospel to other countries where millions have yet to hear it. God expects and requires us to be faithful stewards. When Jesus returns, which may be soon, everyone will have to give an account. So let us be up and about serving the Lord while we are able to.",
        "part6": "THOUGHT",
        "part7": "God prospers me not to raise my standard of living, but to raise my standard of giving. - Randy Alcorn",
        "part8": [
            "2 CHRONICLES 13",
            "REVELATION 4"
        ]
    },
    "14 DECEMBER": {
        "part1": "Romans 15:28-29",
        "part2": "Blessing of the Gospel of Christ",
        "part3": "VERSE 29",
        "part4": "And I am sure that, when I come unto you, I shall come in the fulness of the blessing of the gospel of Christ.",
        "part5": "Paul promised to visit the Roman brethren once he had completed the task of delivering the love gift from the Macedonian and Achaian Christians to the needy Jews in Jerusalem. He is confident that he would go to them \"in the fulness of the blessing of the gospel of Christ.\" Some commentators think that the words \"the gospel of \" should be omitted, meaning his visit will be a blessing to them, that he will come with the blessing of Christ. However, leaving out mention of the Gospel does not fit well with a few points that Paul made earlier in the epistle as well as what finally took place when Paul arrived in Rome as recorded in the final chapter of the Book of Acts.\n\nAt the beginning of this epistle, Paul stated his aim for going to Rome was to \"impart unto you some spiritual gift, to the end ye may be established\" [Romans 1:11]. Obviously, he wanted to expound the Gospel message to them. And then in Roman 10:15, he quoted these words from the prophet Isaiah; \"How beautiful are the feet of them that preach the gospel of peace, and bring glad tidings of good things!\" This means that the coming of anyone who brings the Gospel fills the bosom of the anxious sinner with peace. They and their \"good tidings of great joy\" [Luke 2:10], will be warmly received as sent by God.\n\nIn the end, Paul did make it to Rome, albeit in chains, and spent two years \"preaching the kingdom of God, and teaching those things which concern the Lord Jesus Christ\" [Acts 28:31].",
        "part6": "THOUGHT",
        "part7": "Are you willing to go where the Lord wants to send you \"in the fulness of the blessing of the gospel of Christ\"?",
        "part8": [
            "2 CHRONICLES 14-15",
            "REVELATION 5"
        ]
    },
    "15 DECEMBER": {
        "part1": "Romans 15:30-31",
        "part2": "Praying with and for Paul",
        "part3": "VERSE 30",
        "part4": "Now I beseech you, brethren, for the Lord Jesus Christ's sake, and for the love of the Spirit, that ye strive together with me in your prayers to God for me;",
        "part5": "The Apostle Paul asks his readers to join in his missionary endeavour by praying with him and for him. This collaboration between the missionary and the sending church is essential for the work of missions. John Piper explains it in this way in his book, Let the Nations Be Glad.\n\n\"The connection between prayer and missions can be seen in a passage that doesn't use warfare words but deals with the same reality, namely, John 15:16. Jesus said, \"You did not choose me, but I chose you and appointed you that you should go and bear fruit and that your fruit should abide, so that whatever you ask the Father in my name, he may give it to you.\"\n\nThe reason the Father gives the disciples the instrument of prayer is because Jesus has given them a mission, and Jesus wants them to use the power of prayer to bear fruit. Missions is warfare, and prayer is a wartime walkie-talkie for the mission of the church as it advances against the powers of darkness and unbelief. God designed it and gave it to us for use on a mission.\"\n\nIt has been said that only some can go to the mission field, and many can give toward the work of missions, but all can pray. Yet it is a sad fact the majority of our church members do not attend prayer meetings on a regular basis. If you are part of this group, may today's message provoke you to join in this war; and use the weapon that God has graciously placed in your hands to strive together with fellow believers at our prayer meetings.",
        "part6": "THOUGHT",
        "part7": "Prayer is always necessary for it is always profitable. But we often restrain prayer, and this is sinful. It dishonours God and hurts ourselves. - James Smith, Daily Remembrancer",
        "part8": [
            "2 CHRONICLES 16-17",
            "REVELATION 6"
        ]
    },
    "16 DECEMBER": {
        "part1": "Romans 16:1",
        "part2": "Phebe",
        "part3": "VERSE 1",
        "part4": "I commend unto you Phebe our sister, which is a servant of the church which is at Cenchrea.",
        "part5": "Paul made his final visit to Corinth at the beginning of AD 57. It was during his threemonth stay there that he wrote his magnum opus - the Epistle to the Romans. This is one of the most important books of the Bible in that it has been studied and preached on by countless preachers and is loved by and has impacted the lives of millions of Christians through the ages. Yet we learn here that Paul entrusted the epistle to an unknown lady whose name is mentioned only once in the Bible. She was probably responsible for delivering it to the Roman Christians. So, it is worth our time to find out more about this mysterious lady.\n\nFrom Paul's introduction we learn that Phebe, also spelt Phoebe, was a fellow believer in the church at Cenchrea. Cenchrea was one of two port cities that supported the major metropolis of Corinth in the southern tip of Greece. Paul referred to her as diakonos (Greek) which means \"one who serves in ministry\", or \"servant\" or \"deacon.\" She was a faithful member of the church and had supported Paul in his ministry [Romans 16:2].\n\nAn important lesson that we can learn from Phebe is that we should be zealous in supporting the work of those whom God has appointed to be leaders in our church. For one, we should not be \"trouble-makers\" who cause them unnecessary headaches. We should be ready to carry out seemingly unimportant and lowly tasks for we never know when the Almighty God can use our labour to achieve something in His eternal plan for mankind.",
        "part6": "THOUGHT",
        "part7": "...who knoweth whether thou art come to the kingdom for such a time as this? - Esther 4:14b",
        "part8": [
            "2 CHRONICLES 18",
            "REVELATION 7"
        ]
    },
    "17 DECEMBER": {
        "part1": "Romans 16:2",
        "part2": "Succourer",
        "part3": "VERSE 2",
        "part4": "That ye receive her in the Lord, as becometh saints, and that ye assist her in whatsoever business she hath need of you: for she hath been a succourer of many, and of myself also.",
        "part5": "Paul, brilliant, gifted and totally committed, was the greatest missionary the world has ever known. But he could not have achieved all he did by himself. He co-laboured with other faithful men like Barnabas and Silas. Together they \"turned the world upside down\" and brought the Gospel to the uttermost parts of the known world of their day. They preached, planted churches, and nurtured church leaders wherever they went. Still, these men faithful as they were, could not have done it without the prayers and support of ordinary Christians of the churches.\n\nOne of these ordinary Christians was Phoebe. In verse 2, Paul says \"she hath been a succourer of many, and of myself also\". The word \"succourer\" means \"helper.\" It could also signify a patroness. That means she had probably shown great kindness in various ways to the apostle and other Christians perhaps by receiving them into her house. Now Paul asks the Romans to extend the same in assistance and hospitality to her \"in the Lord\", acknowledging she was a fellow servant of Christ their Lord.\n\nThis is a good reminder to us as Christians to support our leaders and help fellow Christians whom we may not know personally especially those who are from foreign lands. These could be visiting missionaries or foreign students studying at our Bible college here. This is the way God expects us to have a part in His work.",
        "part6": "THOUGHT",
        "part7": "So likewise ye, when ye shall have done all those things which are commanded you, say, We are unprofitable servants: we have done that which was our duty to do. - Luke 17:10",
        "part8": [
            "2 CHRONICLES 19-20",
            "REVELATION 8"
        ]
    },
    "18 DECEMBER": {
        "part1": "Romans 16:3-4",
        "part2": "Priscilla and Aquila",
        "part3": "VERSE 3",
        "part4": "Greet Priscilla and Aquila my helpers in Christ Jesus:",
        "part5": "The next two people Paul wanted the Roman Christians to greet were Priscilla and Aquila. Like Phoebe, they were his helpers. But unlike her and the others that follow, Priscilla and Aquila are named in a number of places in the Bible.\n\nPaul first met the couple in Corinth during his second missionary journey. Aquila being a Jew had been expelled from Rome by Emperor Claudius. Paul lived and worked with them in their common occupation of tent-making while founding the Corinthian church. After a year and a half, Paul left for Ephesus and took Aquila and Priscilla with him. The couple stayed on in Ephesus when Paul left and established a church in their home [1 Corinthians 16:19]. Then an eloquent preacher named Apollos came through Ephesus. Apollos was mighty in the Scriptures, but he only knew the baptism of John. Aquila and Priscilla then told him about Jesus Christ and the coming of the Holy Spirit, thereby leading him to a deeper knowledge of Christ.\n\nThere is much we can learn from this godly couple. They set for us an example in hospitality by opening their home to Paul and using their house as a meeting place for the church [v. 5]. They were well-versed in the Scriptures seeing they were able to help Apollos gain a better understanding of God's Word and assist Paul in the teaching ministry. Another interesting point is that whenever Aquila and Priscilla are mentioned in scripture, they are always mentioned together. This suggests that they were united not only in the flesh but also in the service of their Master.",
        "part6": "THOUGHT",
        "part7": "God's work done in God's way will never lack God's supply. - Hudson Taylor",
        "part8": [
            "2 CHRONICLES 21",
            "REVELATION 9"
        ]
    },
    "19 DECEMBER": {
        "part1": "Romans 16:3-4",
        "part2": "Necks on the line",
        "part3": "VERSE 4",
        "part4": "Who have for my life laid down their own necks: unto whom not only I give thanks, but also all the churches of the Gentiles.",
        "part5": "Today, the metaphor \"to put your neck on the line\" means to expose oneself to some kind of risk; not necessarily physical. However, in the case of Priscilla and Aquila, it probably meant they had exposed themselves to imminent danger in order to save the life of Paul. From events described in the Book of Acts, we know there were numerous occasions when Paul was assaulted physically and even attempts on his life made. No doubt, being close associates, Priscilla and Aquila too were exposed to mortal danger. Paul was thankful, and so were his followers from the churches he had started. One is reminded by the tearful scene on the shores of Miletus when Paul bade final farewell to the elders of Ephesus. How dearly this man of God was loved by his followers.\n\nThere are many examples of brave men and women who similarly \"laid down their own necks\" for God's servants such as Rahab in Jericho, the Hebrew midwives of Egypt during the birth of Moses, and Esther who approached the king unsummoned. Do not think that such acts of bravery are not needed in this present generation. In many parts of the world, Christians suffer severe persecution. There are many situations where God's people will be challenged to emulate the examples of people like Priscilla and Aquila. May the Holy Spirit grant them courage to \"fear not them which kill the body, but are not able to kill the soul: but rather fear him which is able to destroy both soul and body in hell.\" [Matthew 10:28]",
        "part6": "THOUGHT",
        "part7": "And they overcame him by the blood of the Lamb, and by the word of their testimony; and they loved not their lives unto the death. - Revelation 12:11",
        "part8": [
            "2 CHRONICLES 22-23",
            "REVELATION 10"
        ]
    },
    "20 DECEMBER": {
        "part1": "Romans 16:5-7",
        "part2": "Salutations",
        "part3": "VERSE 5",
        "part4": "Likewise greet the church that is in their house. Salute my wellbeloved Epaenetus, who is the firstfruits of Achaia unto Christ.",
        "part5": "In this passage, Apostle Paul greeted and thanked those who served the Risen Saviour with him. Paul would be aware that many of these saints went into hiding during the time he was persecuting them. They may have shared with Paul their hardship and how by God's grace they had found safe refuge. Paul himself experienced great challenges during his travels to preach the Gospel and teach God's Word in the many churches spread over Asia Minor. He endured heat, cold, and harsh conditions. He would not know if he could get food and water or a place to rest for the night. It was also not uncommon to encounter robbers on these long and deserted roads. There was zero level of comfort compared to travelling today. As such, Paul treasured and appreciated the help of those who served with him. Grateful for their partnership, Paul conveyed his salutation to each one by name though he was in Corinth when he wrote this letter.\n\nPaul mentioned Andronicus and Junia who became Christians before Paul did. They were in prison with him for preaching the Gospel. Their testimonies and sacrifice for Christ were tremendous encouragement to Paul and God records it in the Bible to serve as encouragement for us who live in the modern era. They preached without fear in obedience to His command to \"Go ye therefore, and teach all nations, baptizing them in the name of the Father, and of the Son, and of the Holy Ghost\" [Matthew 28:19]. We are afraid that we would be ridiculed for speaking about the Gospel; these people would go to prison for doing the same.",
        "part6": "THOUGHT",
        "part7": "Only fear the LORD, and serve him in truth with all your heart: for consider how great things he hath done for you. - 1 Samuel 12:24",
        "part8": [
            "2 CHRONICLES 24",
            "REVELATION 11"
        ]
    },
    "21 DECEMBER": {
        "part1": "Romans 16:8-10",
        "part2": "Salutations",
        "part3": "VERSE 10",
        "part4": "Salute Apelles approved in Christ. Salute them which are of Aristobulus' household.",
        "part5": "In continuation of Paul's salutation, he mentioned Aristobulus and his family. It is encouraging to see a whole family serving in church. There is work for every age in service. We need to teach our children to serve together with their parents and it is never too young to begin. As the human heart will naturally go astray, nurturing a young life takes effort and patience. Parenting is a great responsibility. First, our children have to be grounded in God's Word. Next, they will learn by the example we set. God records failures as well as successes for us to learn from and to be encouraged. Some did not do well like Cain, son of Adam and Eve, whom God spoke with; or the sons of Eli and Samuel though both were high priests. Timothy was a good example as he was taught well by his mother and grandmother. Here Paul mentions Aristobulus.\n\nOne common excuse is that it is challenging to bring up God-fearing children in this modern age. However, the Bible teaches about raising children. This is not a new issue. We are to bring up our children well from young [Proverbs 22:6, Ephesians 6:4]. God knew this from the time He created Adam, and He has clear instructions for us to obey. The question is whether we are obedient in following the way of God. Godly children are a good testimony for God's glory. Pray that we do not neglect this responsibility of raising faithful children.",
        "part6": "THOUGHT",
        "part7": "And if it seem evil unto you to serve the LORD, choose you this day whom ye will serve; whether the gods which your fathers served that were on the other side of the flood, or the gods of the Amorites, in whose land ye dwell: but as for me and my house, we will serve the LORD. - Joshua 24:15",
        "part8": [
            "2 CHRONICLES 25",
            "REVELATION 12"
        ]
    },
    "22 DECEMBER": {
        "part1": "Romans 16:11-13",
        "part2": "Salutations",
        "part3": "VERSE 12",
        "part4": "Salute Tryphena and Tryphosa, who labour in the Lord. Salute the beloved Persis, which laboured much in the Lord.",
        "part5": "The apostle also mentions those who worked hard. Remember it is God Himself we serve. We are to be faithful and sincere. We are to be persevering and diligent. We can put up a convincing show to impress the leaders of the church and others. We may also think of personal gains and benefits in our serving. People may look at the externals and be fooled by appearances but God looks into our hearts. He cannot be deceived or mocked.\n\nConsider that Jesus died on our behalf to give us eternal life. It is impossible for us to repay whatever we do. Therefore, we serve out of gratitude for the eternal life we have received and in response to God's love for us. We do our best for Him from our heart. There is nothing too low or too small when we serve Him. Just thank God for giving us the ability to serve. \"For whosoever shall give you a cup of water to drink in my name, because ye belong to Christ, verily I say unto you, he shall not lose his reward.\" [Mark 9:41]\n\nWhy does the Bible record individual names? These names may seem insignificant to us. We certainly do not remember many of them. But God does! Nothing is too trivial for Him. He remembers each name who acknowledges Jesus as Saviour and these are recorded in the Book of Life. Thank God that He remembers each of us by name too. The question is - Is your name written in that book?",
        "part6": "THOUGHT",
        "part7": "Only fear the LORD, and serve him in truth with all your heart: for consider how great things he hath done for you. - 1 Samuel 12:24",
        "part8": [
            "2 CHRONICLES 26",
            "REVELATION 13"
        ]
    },
    "23 DECEMBER": {
        "part1": "Romans 16:14-16",
        "part2": "Salutations",
        "part3": "VERSE 16",
        "part4": "Salute one another with an holy kiss. The churches of Christ salute you.",
        "part5": "Little is known about the 10 names listed in verses 14-15, but commentators offer two points of note. First, Paul was familiar with so many saints in the Roman church even though he never had the privilege to visit them. JamiesonFausset-Brown further supposes that the names listed are names of Roman Christians who actively hosted Christian missionaries and Gospel meetings. Second, commentators also point out that it was unlikely apostle Peter was in Rome during this period of time, despite what the Roman Catholic church claims, as Peter would then have been mentioned in Paul's salutations. Finally, Paul ends this section on salutations by exhorting the church to greet one another with a holy kiss. This is meant to emphasise the extent of love and care that Christians are called to show one another.\n\nEven though Paul had never been in Rome physically up to this point in time, he was well acquainted with the Gospel work there and knew the names of many labourers probably because he often prayed for them. Similarly, we may not have the opportunity to meet some of the people mentioned in the various sections of the prayer list (for example those in the mission fields, the sick), but we become familiar with them as we pray for them and see how they are doing through updates on the prayer list.\n\nLet us remember that Christians are called to show one another hospitality and care even if they are from different churches. This is part of being a disciple of Christ.",
        "part6": "THOUGHT",
        "part7": "By this shall all men know that ye are my disciples, if ye have love one to another. - John 13:35",
        "part8": [
            "2 CHRONICLES 27-28",
            "REVELATION 14"
        ]
    },
    "24 DECEMBER": {
        "part1": "Romans 16:17-18",
        "part2": "Mark Them!",
        "part3": "VERSE 17",
        "part4": "Now I beseech you, brethren, mark them which cause divisions and offences contrary to the doctrine which ye have learned; and avoid them.",
        "part5": "Paul cautions the Roman Christians to take careful notice of those within the church who cause divisions and offences. This refers to a range of different people. At one extreme were the legalists who could cause division by insisting on adherence to the law of Moses and other religious rites, when these were made unnecessary by Christ's work on the cross. At the other end were liberalists who lived in such a careless manner that they could stumble fellow believers and cause them to sin.\n\nSuch groups still exist in the church today. We may be familiar with overly enthusiastic Christian brethren who are generous in dispensing unsolicited advice on their convictions which we ought to agree with. Similarly, we also hear of Christians who enjoy the things of the world so much and actively encourage others to do so in the name of Christian liberty.\n\nIf we are honest, it is often easier to call out religious \"legalists\" simply because we are more likely to keep company with those \"liberalists\". Paul reminds us to reflect on the people we associate with. Think about the company we are drawn to in church. Are we often provoked to love and good works, or are we constantly toeing the line of sin together with our Christian friends?\n\nFinally, are we guilty of being in one of these two groups as well? Do we stumble others with our legalistic criticisms, or do we encourage them to love the world by our worldly habits?",
        "part6": "THOUGHT",
        "part7": "Thou hypocrite, first cast out the beam out of thine own eye; and then shalt thou see clearly to cast out the mote out of thy brother's eye. - Matthew 7:5",
        "part8": [
            "2 CHRONICLES 29",
            "REVELATION 15"
        ]
    },
    "25 DECEMBER": {
        "part1": "Romans 16:17-18",
        "part2": "Avoid Them",
        "part3": "VERSE 17",
        "part4": "Now I beseech you, brethren, mark them which cause divisions and offences contrary to the doctrine which ye have learned; and avoid them.",
        "part5": "Yesterday we considered two groups of people within the local church - those who are legalistic and quick to cause division by insisting on additional laws that are extra-biblical, and those who, provoke others to worldly living and sin, in the name of Christian liberty. Often, we are poor discerners of both groups - anyone who calls us to live in a more holy manner we promptly classify as \"legalistic\", while we have too high a tolerance for the shenanigans of the more \"liberal\" church members.\n\nThe reason Paul tells the Roman Christians to take note of such people within the church is to avoid being influenced by them and falling into sin or strife with one another. Today, we are probably keen to avoid \"legalistic\" brethren. Naturally, we have the inclination to flee when we see a concerned elder who tells us to watch our manner of dress, our sobriety, or our testimony. Yet, this same sense of caution ought also to be present when we see the \"liberal\" Christian friend engaging us. How do we react when friends tell an inappropriate joke or suggest unedifying activities? Do we encourage them to continue along this wrongful path through our continued presence and (possibly) uncomfortable fellowship with him? Paul reminds us to be aware of the influence that these people have in our lives, and to avoid them lest they stumble us in our Christian walk.",
        "part6": "THOUGHT",
        "part7": "Enter not into the path of the wicked, and go not in the way of evil men. - Proverbs 4:14",
        "part8": [
            "2 CHRONICLES 30",
            "REVELATION 16"
        ]
    },
    "26 DECEMBER": {
        "part1": "Romans 16:19",
        "part2": "Simple Concerning Evil",
        "part3": "VERSE 19",
        "part4": "For your obedience is come abroad unto all men. I am glad therefore on your behalf: but yet I would have you wise unto that which is good, and simple concerning evil.",
        "part5": "Paul has just warned the church in Rome against false teachers who used flattery and sweet talk to deceive the hearts of the \"simple\". Then, in what seems like an ironic twist, Paul reminds them to be wise about what is good, and \"simple\" concerning evil. The word \"simple\" is translated from different Greek words in both verses. In verse 18, Paul cautions them not to be naive and guileless (Gk: akakos) when it comes to false teachings. They must be aware of the nature of false teachers and guard against falsehoods so that they will not be led astray. In verse 19, Paul is not talking about knowledge and discernment but how they should conduct their lives. To be wise is to make choices in life that are good in God's eyes; to be simple concerning evil is to live a life that is innocent and pure (Gk: akeraios), not mixed up with anything that is evil in God's sight. The same concept is found in what Jesus said: \"Be ye therefore wise as serpents, and harmless as doves\".\n\nIn today's context, how can we be wise about good and simple concerning evil? Do we define good and evil by our own standards, by the world's standard, or by God's standard? Let us be discerning, always measuring all things against the standard of God's Word, and be resolute and steadfast in shunning evil and doing only what is good and right in His eyes.",
        "part6": "THOUGHT",
        "part7": "That ye may be blameless and harmless, the sons of God, without rebuke, in the midst of a crooked and perverse nation, among whom ye shine as lights in the world. - Philippians 2:15",
        "part8": [
            "2 CHRONICLES 31",
            "REVELATION 17"
        ]
    },
    "27 DECEMBER": {
        "part1": "Romans 16:20",
        "part2": "Satan Bruised",
        "part3": "VERSE 20",
        "part4": "And the God of peace shall bruise Satan under your feet shortly. The grace of our Lord Jesus Christ be with you. Amen.",
        "part5": "The bruising of Satan is a reference to God's promise concerning the defeat of Satan in Genesis 3:15. Satan, in the form of a serpent, had deceived Eve into eating the fruit from the tree of the knowledge of good and evil against God's explicit prohibition. In the midst of pronouncing judgment upon the serpent, God promised that \"it (the seed of the woman) shall bruise thy (the serpent's) head, and thou shalt bruise his heel\" [Genesis 3:15]. In other words, the Lord Jesus Christ, who is the promised seed of the woman, though dying on the cross (bruise his heel) would crush Satan (bruise the serpent's head) by His resurrection.\n\nWhy does Paul say that Satan will be bruised under our feet? Just as we speak of salvation as a past, present, and future reality, there is a past, present, and future aspect to the defeat of Satan. Satan has been defeated by the Lord Jesus Christ through His finished work of redemption on the cross. Sin no longer has power over those who are in Christ. There is also a future aspect to Satan's defeat. Upon Christ's second coming, Satan and his angels will be totally destroyed. This is the great and final victory. Between these two victories by Christ is an ongoing victory of the saints over Satan. By the regenerating power of His Spirit, God works in and through us to crush Satan. When we choose to live by the truth of God's word, embrace what is good and right, and shun evil, Satan is bruised under our feet.",
        "part6": "THOUGHT",
        "part7": "And they overcame him by the blood of the Lamb, and by the word of their testimony; and they loved not their lives unto the death. - Revelation 12:11",
        "part8": [
            "2 CHRONICLES 32",
            "REVELATION 18"
        ]
    },
    "28 DECEMBER": {
        "part1": "Romans 16:21-23",
        "part2": "Co-labourers",
        "part3": "VERSE 21",
        "part4": "Timotheus my workfellow, and Lucius, and Jason, and Sosipater, my kinsmen, salute you.",
        "part5": "Verses 21-23 give a list of Christians who were with Paul in Corinth when he wrote this epistle. First was Timothy, Paul's young protege who co-laboured with him to build up the Gentile churches Paul had founded earlier. Next were Lucius, Jason, and Sosipater whom Paul addressed as his kinsmen. There were two with prominent backgrounds. One was Gaius, a wealthy man who hosted Paul and opened his home for the congregation at Corinth to worship. The other was Erastus, a public official. Tertius and Quartus (Latin words for \"three\" and \"four\") were probably slaves of Gaius as such names were frequently given to slaves in prominent Roman households. Tertius served as Paul's amanuensis, or secretary, writing down what Paul dictated. Paul warmly addressed Quartus as a brother. Together, they sent their greetings to the brethren in Rome as co-labourers in Christ.\n\nFrom this list, we get a glimpse of Christian life and fellowship in the early church. People of different backgrounds - master and slave, Jew and Gentile, rich and poor - put aside their differences and came together in love and fellowship as one body in Christ, serving one another according to their gifts and calling, and sending their love to unknown brethren in another place. When there is love and unity in diversity, when lives have been transformed by the Gospel, the church will be a testimony to unbelievers and be effective in reaching out to those in places where the Gospel is not heard.",
        "part6": "THOUGHT",
        "part7": "For as the body is one, and hath many members, and all the members of that one body, being many, are one body: so also is Christ. - 1 Corinthians 12:12",
        "part8": [
            "2 CHRONICLES 33",
            "REVELATION 19"
        ]
    },
    "29 DECEMBER": {
        "part1": "Romans 16:21-23",
        "part2": "Next Generation Leaders",
        "part3": "VERSE 21",
        "part4": "Timotheus my workfellow, and Lucius, and Jason, and Sosipater, my kinsmen, salute you.",
        "part5": "Although Paul did not give any details of his co-labourers in verse 21, we can make inferences about their identity through the book of Acts and Paul's other epistles. Timothy is frequently mentioned as his \"son in the faith\" and co-labourer in the Gospel. The identities of the next three, Lucius, Jason and Sosipater are less certain. By calling them \"kinsmen\", a word Paul used earlier in verse 7, it is likely they were fellow Jews rather than relatives. Sosipater could have been Sopater (a variation of the same name) of Berea mentioned in Acts 20:4. Jason could be the one who received Paul in his house in Thessalonica [Acts 17:5-9]. The name Lucius is found only one other time in the Bible in reference to a leader of the Antioch church [Acts 13:1]. There is, however, no reason to connect these two men.\n\nAll four men were likely part of the team accompanying Paul back to Jerusalem with the offering from the Gentile churches [Acts 20:4]. Each may have represented the church that sent them and were part of the next generation of leaders to take over the churches started by Paul.\n\nGod has equipped His church with faithful men to care for His church. The next generation too, has a responsibility to respond to God's call to serve as future leaders of the church so that she may continue to flourish, and the faith passed down through the generations.",
        "part6": "THOUGHT",
        "part7": "And the things that thou hast heard of me among many witnesses, the same commit thou to faithful men, who shall be able to teach others also. - 2 Timothy 2:2",
        "part8": [
            "2 CHRONICLES 34",
            "REVELATION 20"
        ]
    },
    "30 DECEMBER": {
        "part1": "Romans 16:24-25",
        "part2": "Benediction",
        "part3": "VERSE 25",
        "part4": "Now to him that is of power to stablish you according to my gospel, and the preaching of Jesus Christ, according to the revelation of the mystery, which was kept secret since the world began,",
        "part5": "Paul makes a significant expression of the Gospel in this benediction. He calls it 'my' Gospel. Paul is not claiming it as his Gospel, but he is stating it to be the true Gospel of Jesus Christ preached and lived out by him, servant of the Lord, \"called to be an apostle, separated unto the Gospel of God\" [Romans 1:1]. The Gospel tells us what God has accomplished for us through the work of Jesus Christ which means the Gospel is not human in its origin. It is God's work accomplished by God with God's own goals and objectives.\n\nThe benediction sums up that the Gospel starts and ends with Christ. Christ is revealed who was a mystery and secret when the world began. All things are centred in Him in creation and in Him in the Gospel.\n\nThis truth should be claimed as 'mine' by every Christian. The Gospel of Christ should be claimed daily as my truth, my conviction, and my life by Christians. We cannot forget that grace is the predominant attribute of God and grace is enthroned in heaven because of the accomplished work of our Lord on the cross. We seek the throne of grace boldly because of the Gospel we believe in. True doxology begins with accepting the Gospel as second to none. Charles Spurgeon said this with regards to the Gospel of Christ, \"A Bible that's falling apart usually belongs to someone who isn't.\" \"Visit many good books, but live in the Bible.\"\n\nIt is in the Gospel, the good news from God, that when man with a contrite heart cries out in his depravity, \"How can it be?\" God answers, \"Yes it can be\".",
        "part6": "THOUGHT",
        "part7": "How can it be that Thou my God shouldst die for me? Amazing Love! - Charles Wesley.",
        "part8": [
            "2 CHRONICLES 35",
            "REVELATION 21"
        ]
    },
    "31 DECEMBER": {
        "part1": "Romans 16:26-27",
        "part2": "Obedience of faith",
        "part3": "VERSE 26",
        "part4": "But now is made manifest, and by the scriptures of the prophets, according to the commandment of the everlasting God, made known to all nations for the obedience of faith:",
        "part5": "A recent survey conducted on the country's National Service indicated that more than 90% of the population accept the many positive outcomes and influences on society of the compulsory national service for all male citizens in Singapore. But I wonder if the participants of the survey realized that National Service is a national policy which requires utmost obedience of compliance from all male citizens here. When we read Romans 16:25-27, it is obvious a wise and everlasting God has commanded us to live our lives in obedience to His oracles found in the Bible from time past.\n\nGod was manifested as the word and had made known to all nations the Gospel of Jesus Christ. The Gospel truth demands the same acceptance as any other national policy. Christians, chosen and redeemed by God must accept and obey all things pertaining to the Bible because they are citizens of heaven. That is the obedience of faith. Without this obedience, we cannot demonstrate our faith by our works [James 2:18].\n\nAs with the nation's National Service, without obedience to this national policy, its objectives to preserve peace, promote economic development and authority of the government to govern will not be established.\n\nThe obedience of faith is our pledge of allegiance to Christ whose blood has justified us as God's elect. It is through the obedience of faith in every Christian that the Gospel of Christ shines forth to the whole world. And thus to God only wise, will be glory through Jesus Christ for ever. Amen.",
        "part6": "THOUGHT",
        "part7": "The obedience of faith can best be summed up as faith applied daily. \"The Christian is a man who can be certain about the ultimate even when he is most uncertain about the immediate\". - Martyn Lloyd-Jones.",
        "part8": [
            "2 CHRONICLES 36",
            "REVELATION 22"
        ]
    }
}