{
    "18 SEPTEMBER": "<b><u>18 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:18&version=KJV\">1 Samuel 23:18</a>\n\n<b>LESSON</b>\nJonathan's covenant with David\n\n<b>VERSE 18</b>\n<i>And they two made a covenant before the LORD: and David abode in the wood, and Jonathan went to his house.</i>\n\nA covenant is essentially a legal contract between two or more parties with prescribed terms and conditions. The objective of a covenant is to establish and regulate a relationship between persons. In the Bible, there are covenants made between individuals [Genesis 21:27, 31; 31:44] and nations [1 Kings 5:12; Obadiah 7], Israel and God [Exodus 20].\n\nIn the covenant between Jonathan and David, there was neither enumeration of conditions nor stipulation of penalties if conditions were not met; there was neither eyewitnesses nor ratification rituals. It was just two friends binding themselves by a covenant - one motivated by Jonathan who realised that though he was the son of a king, he was not called to be king. And Jonathan cheerfully submitted to the expressed will of God and served Him by serving David, inspiring his friend with courage and encouraging his heart in the midst of trials.\n\nAfter the covenant, the two friends parted. They took different routes - Jonathan to his palace, and David his wilderness cave. Their days would be different, but their mission in life would be the same. Their hearts would beat as one. They would fight side by side against the enemies of Israel, re- establish the worship of Jehovah, and restore the honour of His name. The success of David would be the success of Jonathan. Between these two friends, there was not that spirit of jealousy that darkened the heart and warped the mind of Saul.\n\nSuch must be the magnanimity of heart and generosity of spirit that Christians must have for \"one another to provoke unto love and to good works\" [Hebrews 10:24].\n\n<b>CHALLENGE</b>\nBe a Jonathan to inspire faith and hope in your friend by fervent prayers, words of encouragement, and whole-hearted cooperation in the Gospel work.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 44&version=KJV\">EZEKIEL 44</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 PETER 4&version=KJV\">1 PETER 4</a></b>",
    "19 SEPTEMBER": "<b><u>19 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:18&version=KJV\">1 Samuel 23:18</a>\n\n<b>LESSON</b>\nThe parting of friends\n\n<b>VERSE 18</b>\n<i>And they two made a covenant before the LORD: and David abode in the wood, and Jonathan went to his house.</i>\n\nAfter the covenant, Jonathan and David parted. I am sure they hoped to meet again in better times and certainly not in stealth. However, what they proposed, God disposed otherwise. The two friends would never meet again. The next time David hears of Jonathan would be his friend's death at the hands of the Philistines. Death ended their earthly friendship. One cannot read David's lament over Jonathan's death - \"How are the mighty fallen in the midst of the battle! O Jonathan, thou wast slain in thine high places. I am distressed for thee, my brother Jonathan: Very pleasant hast thou been unto me: Thy love to me was wonderful, passing the love of women\" [2 Samuel 1:25-26] - without being moved by the depth of their friendship. David's success was stained by his tears of sorrow.\n\nThere is one Friend - only one - from whom death cannot sever. Paul wrote, \"For I am persuaded, that neither death, nor life, nor angels, nor principalities, nor powers, nor things present, nor things to come, nor height, nor depth, nor any other creature, shall be able to separate us from the love of God, which is in Christ Jesus our Lord\" [Romans 8:38-39]. Times of trial, seasons of sorrow, not even death will break the friendship or separate us from the love of Christ. In fact, in death that union is bound eternally.\n\n\"What a Friend we have in Jesus\" is a familiar hymn but there is a fourth stanza seldom sung. It reads: \"Blessed Savior, Thou hast promised Thou wilt all our burdens bear; May we ever, Lord, be bringing all to Thee in earnest prayer. Soon in glory bright, unclouded, There will be no need for prayer-- Rapture, praise, and endless worship, will be our sweet portion there.\"\n\n<b>THOUGHT</b>\nTruly, what a Friend we have in Jesus.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 45&version=KJV\">EZEKIEL 45</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 PETER 5&version=KJV\">1 PETER 5</a></b>",
    "20 SEPTEMBER": "<b><u>20 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:19-23&version=KJV\">1 Samuel 23:19-23</a>\n\n<b>LESSON</b>\nThe treachery of the Ziphites\n\n<b>VERSE 20</b>\n<i>Now therefore, O king, come down according to all the desire of thy soul to come down; and our part shall be to deliver him into the king's hand.</i>\n\nLike the men of Keilah, the Ziphites chose to betray David for the king's favour. They told Saul that David was hiding in the \"strong holds in the wood, in the hill of Hachilah, which is on the south of Jeshimon\".\n\nHachilah is a hill in the Judean desert. The Bible record says that Hachilah was on the south of Jeshimon, a term often used as a common noun in referring to the Sinai desert [Deuteronomy 32:10; Psalm 78:40; 106:14; Isaiah 43:19]. The region is arid and sterile, its soil saturated with salt, making farming impossible. This was David's hideout, a land as parched as his soul.\n\nThe Ziphites assured Saul that with their knowledge of the region, they would be able to apprehend David for Saul. The Ziphites seemed to have a personal stake in David's capture. Their treachery was made worse by the fact that David and the Ziphites were from the same tribe of Judah. David was from that tribe as was Caleb [Numbers 13:6], who was related to Ziph [1 Chronicles 2:42].\n\nWhat were the reasons underlying the Ziphites' treachery? Simply, it is human depravity manifesting itself first in moral indifference; they had no sympathy for the needy and unjustly persecuted. Second, in immoral greed; like Balaam, they were willing to injure the innocent for the favour of the rich and powerful. Third, in wicked godlessness. In Psalm 54 (note its title), David describes the Ziphites as \"strangers ... oppressors seek after my soul: They have not set God before them\" [Psalm 54:3].\n\nWhat a difference it makes in our lives who/ what we set before us.\n\n<b>THOUGHT</b>\nHe hath shewed thee, O man, what is good; And what doth the LORD require of thee, but to do justly, and to love mercy, and to walk humbly with thy God? - Micah 6:8\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 46&version=KJV\">EZEKIEL 46</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 PETER 1&version=KJV\">2 PETER 1</a></b>",
    "21 SEPTEMBER": "<b><u>21 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:20-23&version=KJV\">1 Samuel 23:20-23</a>\n\n<b>LESSON</b>\nThe treachery of Saul\n\n<b>VERSE 21</b>\n<i>And Saul said, Blessed be ye of the LORD; for ye have compassion on me.</i>\n\n\"Blessed be ye of the LORD; for ye have compassion on me.\" The meaning of these words depends on the person who speaks them. These words could well have come from David, and they would be truthful. However, coming from Saul, the same words betray a false piety as much as evoke pity.\n\nFalse piety because behind those words was concealed deep hatred and evil intent. Jeremiah wrote that the \"tongue is as an arrow shot out; it speaketh deceit: One speaketh peaceably to his neighbour with his mouth, but in heart he layeth his wait\" [Jeremiah 9:8]. But lest we point an accusing finger at others, we must confess we are just as likely to speak so piously but know deep in our hearts that our words carry no such intent. As Jeremiah said, \"The heart is deceitful above all things, and desperately wicked: who can know it?\" [Jeremiah 17:9]\n\n\"Ye have compassion on me.\" There is something pitiable in Saul's answer. He knew he had been rejected by God. He knew God had chosen David to replace him. However, Saul convinced himself and others that he was the person who had been wronged, and David was the wicked conspirator plotting to overthrow him. And the tighter he grasped the throne against the expressed will of God, the more depressed Saul became. As he continued to brood over what he had lost, Saul made himself a prey of abject misery - a misery that would end tragically; as Paul said, the covetous man will pierce himself with many sorrows [1 Timothy 6:10].\n\n<b>THOUGHT</b>\nAnd they lay wait for their own blood; they lurk privily for their own lives. So are the ways of every one that is greedy of gain; which taketh away the life of the owners thereof. - Proverbs 1:18-19\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 47&version=KJV\">EZEKIEL 47</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 PETER 2&version=KJV\">2 PETER 2</a></b>",
    "22 SEPTEMBER": "<b><u>22 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:24-26&version=KJV\">1 Samuel 23:24-26</a>\n\n<b>LESSON</b>\nMaking haste\n\n<b>VERSE 26</b>\n<i>And Saul went on this side of the mountain, and David and his men on that side of the mountain: and David made haste to get away for fear of Saul; for Saul and his men compassed David and his men round about to take them.</i>\n\nAs Saul plotted with the Ziphites to capture David, he moved to the wilderness of Maon. David would have been justified in retaliating against Saul, and yet in the account, it seemed that David strived to avoid conflict with Saul. As Saul and his men moved to one side of the mountain, David and his men moved to the other.\n\nComparing the account here and David's recollection of this situation in Psalm 54, we learn an important life lesson. In the Psalm, David prayed for deliverance, \"Save me, O God, by Thy name, and judge me by Thy strength. Hear my prayer, O God; Give ear to the words of my mouth ... Behold, God is mine helper: The Lord is with them that uphold my soul\" [Psalm 54:1-2, 4]. Yet, David also \"made haste to get away\" from Saul. David trusted God because his life is in God's hand. At the same time, he spared no effort to escape as though everything depended on his skill and discretion. This is the Christian exercising his personal responsibility and submission to God.\n\nOne of the lessons I learnt from the COVID-19 pandemic is that faith in God does not exempt us from exercising personal responsibility; neither should it embolden us to have a brazen callous attitude toward life. Rather, faith in God empowers us to live in the unseen spiritual sphere of God's sovereignty, but concurrently exert our human wisdom and prudence in this visible material world.\n\nIn our daily living, whether it is work or ministry, dealing with adversity or temptation, we must do so with all fervency; yet also with faith in the need and certainty of God's help.\n\n<b>THOUGHT</b>\n\"Pray as if everything depended on God, and work as if everything depended on you.\" - Martin Luther\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 48&version=KJV\">EZEKIEL 48</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 PETER 3&version=KJV\">2 PETER 3</a></b>",
    "23 SEPTEMBER": "<b><u>23 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:27-29&version=KJV\">1 Samuel 23:27-29</a>\n\n<b>LESSON</b>\n'Help' from the Philistines\n\n<b>VERSE 27</b>\n<i>But there came a messenger unto Saul, saying, Haste thee, and come; for the Philistines have invaded the land.</i>\n\nAs David fled into the wilderness of Maon, he soon found himself surrounded by Saul and his army. It was at this critical juncture that the Philistines invaded the land of Judah, and Saul was forced to pull back his forces to deal with the urgent matter.\n\nGod delivered David at the right time. There are several lessons to learn concerning God's dealing with His people. First, God puts us in the worst situation - when we are utterly helpless, and beyond our own ability to save ourselves - so that we may cry out to Him. God delivers at the point of our greatest peril and weakness. Micah wrote: \"When I fall, I shall arise; When I sit in darkness, the LORD shall be a light unto me\" [Micah 7:8b].\n\nSecond, God will never allow His people to suffer without help. Paul reminds us that \"there hath no temptation (testing) taken you but such as is common to man: but God is faithful, who will not suffer you to be tempted above that ye are able; but will with the temptation also make a way to escape, that ye may be able to bear it\" [1 Corinthians 10:13]. When the children of Israel were caught between the raging sea and the advancing chariots, Moses said, \"Fear ye not, stand still, and see the salvation of the LORD\" [Exodus 14:13].\n\nThird, God uses the most unexpected means for our deliverance. The world's forces are at His disposal. In the case of David, the Lord used the invasion of the Philistines to halt Saul's pursuit. He dispatched the enemy of Israel to deliver His beloved. God rules and overrules for His own glory and for our good.\n\n<b></b>\nBe patient in trial because \"the Lord knoweth how to deliver the godly out of temptations, and to reserve the unjust unto the day of judgment to be punished\" [2 Peter 2:9].\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 1&version=KJV\">DANIEL 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 JOHN 1&version=KJV\">1 JOHN 1</a></b>",
    "24 SEPTEMBER": "<b><u>24 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:1-2&version=KJV\">1 Samuel 24:1-2</a>\n\n<b>LESSON</b>\n3000 to chase 1\n\n<b>VERSE 2</b>\n<i>Then Saul took three thousand chosen men out of all Israel, and went to seek David and his men upon the rocks of the wild goats.</i>\n\nDavid had moved to the wilderness of Engedi. This was a place of extraordinary terrain. With sharp and craggy rock formations, the only inhabitants that loved to be there were mountain goats which were skilful in leaping from one rock to another, often standing at the edge of impossible precipices.\n\nGiven a choice, David and his men would not have chosen to be in Engedi, but they were hapless fugitives. Saul, on the other hand, had the choice to leave David alone in the harsh land of Engedi and get on with living his life as king. But Saul was determined to pursue David. David was the thorn in his flesh, and he had set his heart on removing it at all cost. Hardly resting after a battle with the Philistines, Saul chose 3000 men, his best ones, to pursue David and his men upon the rocks of the wild goats.\n\nSuch is the miserable condition of one blinded by obsession. He could not see beyond the thing that possessed his heart and mind. He was willing to give up anything to gratify his desire. And the sad thing is, without God's grace, he could not be freed of the bondage of his obsession.\n\nThanks be to God Who has saved us from the bondage of sin, that by the blood of our Lord Jesus Christ, we are a new creature. God has opened our eyes. We can see our sinful nature and recognise our foolish preoccupations. We realise the truth that we are created for a higher purpose, not to indulge in vanity, like foolish goats.\n\n<b>THOUGHT</b>\nCreate in me a clean heart, O God; and renew a right spirit within me. - Psalm 51:10\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 2&version=KJV\">DANIEL 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 JOHN 2&version=KJV\">1 JOHN 2</a></b>",
    "25 SEPTEMBER": "<b><u>25 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:3-4&version=KJV\">1 Samuel 24:3-4</a>\n\n<b>LESSON</b>\nOpportunity for David\n\n<b>VERSE 4</b>\n<i>And the men of David said unto him, Behold the day of which the LORD said unto thee, Behold, I will deliver thine enemy into thine hand, that thou mayest do to him as it shall seem good unto thee. Then David arose, and cut off the skirt of Saul's robe privily.</i>\n\nIn the previous chapter when Saul learnt that David was in the town of Keilah, he deemed it a God-given opportunity to attack him. He interpreted that turn of events as God delivering David into his hands [1 Samuel 23:7]. In today's verses, we have a similar situation. But this time, it was David's turn to be presented that chance, and the difference in David's response showed us why he was indeed a man after God's own heart.\n\nOn the way to Engedi, Saul entered a cave to relieve himself. Little did he realise that cave was already occupied - David and his men were hiding there. Saul was alone and completely vulnerable, and David's men interpreted the situation exactly the way Saul had done before. They told David, \"Today is the day of which the Lord said to you, 'Behold, I will give your enemy into your hand, and you shall do to him as it shall seem good to you.'\"\n\nDavid's men did not hear anything from God. They were just following their carnal and worldly- wise instincts and using God's name in vain by telling David, \"This is the day God is telling you to follow your heart's desire.\"\n\nDavid, however, was not so tempted. He had something else in mind. He moved toward Saul and secretly cut off a corner of Saul's robe. A little action, yet even this would later cause him to be greatly conscience-stricken.\n\n<b></b>\nThe secret of the LORD is with them that fear Him; and He will shew them His covenant. - Psalm 25:14\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 3&version=KJV\">DANIEL 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 JOHN 3&version=KJV\">1 JOHN 3</a></b>",
    "26 SEPTEMBER": "<b><u>26 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:5&version=KJV\">1 Samuel 24:5</a>\n\n<b>LESSON</b>\nDavid's conscience\n\n<b>VERSE 5</b>\n<i>And it came to pass afterward, that David's heart smote him, because he had cut off Saul's skirt.</i>\n\nDavid had just cut off a corner of Saul's robe. Saul was still relieving himself, oblivious to what was happening. Meanwhile David's men were standing by, ready to kill Saul at their leader's command. Clearly, in the eyes of David's men, this was a God-given opportunity.\n\nIt was at this crucial juncture, when David could easily have slain the adversary who was relentlessly pursuing him that his heart \"smote\" him. This means David's conscience was stricken, not by mere unease over a misdemeanour but by stark apprehension and horror at the sinfulness of what he had just done. Commentators have various opinions as to David's intention in cutting off the corner of Saul's robe and the gravity of this sin. Nevertheless, it is clear from his subsequent words and actions, that David had a tender conscience, one that was sensitive to the prompting of the Holy Spirit, one that was informed and ruled by God, and one that had deep reverence for God's sovereignty and judgement. David did not try to suppress his conscience but allowed his conscience to lead him to do right in God's eyes.\n\nGod has given each of us a conscience too. How is its condition? Is it informed and governed by God's Word? Is it sensitive to the prompting of the Spirit? Do you heed it and exercise it so that God is always honoured and holiness upheld in our lives? May the Lord help us cultivate a healthy conscience that is captive to His will!\n\n<b></b>\nAnd herein do I exercise myself, to have always a conscience void of offence toward God, and toward men. - Acts 24:16\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 4&version=KJV\">DANIEL 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 JOHN 4&version=KJV\">1 JOHN 4</a></b>",
    "27 SEPTEMBER": "<b><u>27 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:6&version=KJV\">1 Samuel 24:6</a>\n\n<b>LESSON</b>\nThe LORD's anointed\n\n<b>VERSE 6</b>\n<i>And he said unto his men, The LORD forbid that I should do this thing unto my master, the LORD's anointed, to stretch forth mine hand against him, seeing he is the anointed of the LORD.</i>\n\nIf there is one quality that characterises David, it is his profound reverence for God. So deep was his reverence that it extended even to those whom the LORD had anointed. And this was why he refused to harm Saul--because Saul was the \"LORD's anointed\".\n\nWhat is the significance of anointing? Under the old covenant, the act of anointing with oil signified that God had set apart that person and given him authority for his office. Submission to the authority of the LORD's anointed therefore signified one's submission to the Lord Himself; reverence for the LORD's anointing indicates one's reverence for that which is sacred and holy. Although Saul had drifted from God, even seeking to kill David, David revered the LORD behind Saul's throne and continued to give Saul utmost respect.\n\nToday, individuals are no longer anointed to the Old Testament offices because our Lord Jesus Christ, the Anointed One, has perfectly fulfilled all those roles. Nevertheless, God continues to ordain faithful men to lead His church and His work. How much respect do we show our leaders? Do we bear a critical and judgemental attitude towards them, question their decisions, doubt their competence, or criticise their preaching? How easy it is for us to lose sight of the LORD behind the man! While it does not mean we should have an unquestioning servile attitude towards the leadership, it does mean we must accord respect to the office and love for the Lord's ministers. Revere the LORD and wait patiently to see what He will achieve through His ordained servants.\n\n<b>THOUGHT</b>\nLet every soul be subject unto the higher powers. For there is no power but of God: the powers that be are ordained of God. - Romans 13:1\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 5&version=KJV\">DANIEL 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 JOHN 5&version=KJV\">1 JOHN 5</a></b>",
    "28 SEPTEMBER": "<b><u>28 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:7-8&version=KJV\">1 Samuel 24:7-8</a>\n\n<b>LESSON</b>\nLove your enemies\n\n<b>VERSE 8</b>\n<i>David also arose afterward, and went out of the cave, and cried after Saul, saying, My lord the king. And when Saul looked behind him, David stooped with his face to the earth, and bowed himself.</i>\n\nDavid not only refused to take advantage of the situation to kill Saul, he also \"stayed\" his men from doing so. The Hebrew word for \"stayed\" means to tear apart an animal. It is an unusual word to use in this context, but it reflects his radical obedience that stems from a profound reverence for God. Instead of \"tearing apart\" their enemy, David \"tore apart\" their murderous intent to lay hands on the LORD's anointed.\n\nDavid did not stop at sparing his pursuer's life, he went out of the way to assure Saul of his continued allegiance. David waited until Saul was safely out of the cave before calling out to him. He addressed Saul with a term of utmost respect and bowed humbly before him.\n\nDavid's treatment of Saul illustrates what it means to love our enemies, as our Lord Jesus has taught us in Matthew 5:44. Even though Saul sought to kill him, David did not retaliate in kind but overcame evil with good [Romans 12:21]. He was able to do so because he trusted God to accomplish His purpose in his life.\n\nUltimately, David points us to our Lord Jesus. As sinners, we are all enemies of the Holy God. \"But God commendeth His love toward us, in that, while we were yet sinners, Christ died for us\" [Romans 5:8]. Is there anyone you find hard to forgive? Pray and ask God to help you love and forgive your enemies, just as you have been loved and forgiven.\n\n<b>THOUGHT</b>\nDo you bless and pray for your enemy, as our Lord commanded? Do it and experience how God will use your prayers to transform your heart and enable you to love your enemy.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 6&version=KJV\">DANIEL 6</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 JOHN&version=KJV\">2 JOHN</a></b>",
    "29 SEPTEMBER": "<b><u>29 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:9-11&version=KJV\">1 Samuel 24:9-11</a>\n\n<b>LESSON</b>\nDavid's Integrity\n\n<b>VERSE 11</b>\n<i>Moreover, my father, see, yea, see the skirt of thy robe in my hand: for in that I cut off the skirt of thy robe, and killed thee not, know thou and see that there is neither evil nor transgression in mine hand, and I have not sinned against thee; yet thou huntest my soul to take it.</i>\n\nHaving demonstrated his allegiance through his actions, David now defended his integrity through his words. He declared that when providence brought Saul into the cave and some of his men urged him to kill Saul, he refused. Holding up the piece of Saul's robe as proof of his integrity, David declared that he bore no evil in his heart. He had neither transgressed against the Lord nor sinned against Saul; it was Saul who wanted to kill him.\n\nThis passage contrasts David's integrity against Saul's lack thereof. Given the opportunity, David did not use providence or his men's urgings as excuses to take a life. Instead he stood firm doing what he knew was right - giving reverence to the LORD and His anointed. In contrast, Saul was not so much misled by his men's lies, as by the harbouring of evil in his heart because he was jealous of David. Using his men's lies as an excuse, he relentlessly pursued David to kill him. So strong was his evil desire that he diverted three thousand of his best soldiers in the midst of the war with the Philistines to hunt David [v. 2].\n\nOur Lord Jesus taught us that obeying God begins with the heart [Matthew 5:21-32]. Do your actions reflect the integrity of your heart or do you find excuses to cover up your motives? May the Lord help us to walk close to Him with integrity of heart.\n\n<b></b>\nSearch me, O God, and know my heart: try me, and know my thoughts: And see if there be any wicked way in me, and lead me in the way everlasting. - Psalm 139:23-24\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 7&version=KJV\">DANIEL 7</a>\n<a href=\"https://www.biblegateway.com/passage/?search=3 JOHN&version=KJV\">3 JOHN</a></b>",
    "30 SEPTEMBER": "<b><u>30 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:12-15&version=KJV\">1 Samuel 24:12-15</a>\n\n<b>LESSON</b>\nThe LORD be the Judge\n\n<b>VERSE 15</b>\n<i>The LORD therefore be judge, and judge between me and thee, and see, and plead my cause, and deliver me out of thine hand.</i>\n\nIn the face of Saul's false allegations and murderous intent, David did not seek to avenge himself; he called upon the LORD to be the judge. In defence he quoted a proverb to assert his righteousness, demonstrated by his refusal to take Saul's life, unlike Saul who actively sought David's death. David called himself a dead dog and a flea--a contemptible and worthless being too insignificant for a king to bother with.\n\nWhy was David able to wait upon the LORD to judge and avenge him? Because of his faith, reverence, obedience, and humility. As we have seen, David had profound reverence for the LORD and faith in Him to accomplish His purposes in his life. David was also resolute in obeying the LORD and refused to give in to temptation and take things in his own hands. Lastly, he was humble. He had a deep sense of his own insignificance, unworthiness and sinfulness and deferred to the LORD to take up his cause.\n\nYou may think you do not measure up to David, especially in your times of suffering and anguish. But we can and should look to the LORD to be our judge, not because of how good we are, but because of who He is. He is the perfectly just and merciful judge. The wicked will not go unpunished; nor can we escape His judgement. Yet by His mercies through His Son our Saviour, those who repent and put their faith in the Lord Jesus Christ will not be consumed by God's wrath but saved unto eternal life. His compassions fail not; great is His faithfulness.\n\n<b>THOUGHT</b>\nDearly beloved, avenge not yourselves, but rather give place unto wrath: for it is written, Vengeance is mine; I will repay, saith the Lord. - Romans 12:19\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 8&version=KJV\">DANIEL 8</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JUDE&version=KJV\">JUDE</a></b>"
}