{
    "1 JULY": "<b><u>1 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:12, 14&version=KJV\">1 Samuel 17:12, 14</a>\n\n<b>LESSON</b>\nDavid the Ephrathite\n\n<b>VERSE 12</b>\n<i>Now David was the son of that Exphrathite of Bethlehemjudah, whose name was Jesse, and he had eight sons: and the man went among men for an old man in the days of Saul.</i>\n\nEarlier, David had been hand-picked by God to succeed king Saul. The One Who is all- knowing and all-seeing cannot be wrong in His choice. He knows the thoughts and heart of every man. On the other hand, the venerable prophet Samuel made a big mistake when he eyed the strongest looking as the most likely candidate for the royal position.\n\nDavid lived with his father Jesse and his seven brothers in Bethlehem [1 Samuel 16:1, 4]. They are described as Ephrathites. They are descendants of Ephrath, who lived in or around the city of Bethlehem [Genesis 48:7]. The people from Ephrath (or Ephrathah) were usually associated with Bethlehem which lies just south of Jerusalem. One person who is also linked to this place was Ruth the Moabitess who became an Ephrathite.\n\nBut the most important connection of all is the famous prophecy concerning the coming Messiah's birthplace recorded in Micah 5:2, \"But thou, Bethlehem Ephratah, though thou be little among the thousands of Judah, yet out of thee shall he come forth unto me that is to be ruler in Israel; whose goings forth have been from of old, from everlasting.\" The Messiah would be born among the Ephrathites in Bethlehem and so the Lord Jesus Christ was born in Bethlehem fulfilling this prophecy [Luke 2:4-7].\n\nIt is a humbling thought that the anointed Son of God came in such lowly fashion for the sole purpose of redeeming His people from the tyranny of the devil. But upon accomplishing His earthly mission, He ascended to be highly exalted and seated at His Father's right hand!\n\n<b>PRAYER</b>\nAlmighty God, help me and use me, a weak vessel for Your glory and honour, so that others may know who You really are. Amen.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 22&version=KJV\">JEREMIAH 22</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 CORINTHIANS 1&version=KJV\">2 CORINTHIANS 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "2 JULY": "<b><u>2 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:12-13&version=KJV\">1 Samuel 17:12-13</a>\n\n<b>LESSON</b>\nDavid's brothers\n\n<b>VERSE 13</b>\n<i>And the three eldest sons of Jesse went and followed Saul to the battle: and the names of his three sons that went to the battle were Ekab the ferstborn, and next unto him Abinadab, and the third Shammah.</i>\n\nBy this time, Jesse was already an old man. He had brought up eight sons. He was ready to avail them for the king's service when the need arose, even if it meant going to the frontlines of battle. Three of his sons were now sent to the battlefield to face Israel's enemies, the Philistines. Being the three oldest, they would have had more experience and could be trained in the military. They were also fittest for service in terms of physique and skills.\n\nAs they filed past Samuel, they were indeed impressive to look upon. Initially Samuel thought to himself, this must be the next king, \"And it came to pass, when they were come, that he looked on Eliab, and said, Surely the LORD'S anointed is before him\" [1 Samuel 16:6]. However, God has a different view. \"But the LORD said unto Samuel, Look not on his countenance, or on the height of his stature; because I have refused him: for the LORD seeth not as man seeth; for man looketh on the outward appearance, but the LORD looketh on the heart\" [1 Samuel 16:7].\n\nWhile men look for the fittest, strongest and smartest for their business, God looks for the holiest and humblest for His. God does not despise the smallest and the weakest but will make for Himself the best through them. Realise that only God can see the heart of a man and we must submit to His way.\n\n<b>THOUGHT</b>\nFor My thoughts are not your thoughts, neither are your ways My ways, saith the LORD. - Isaiah 55:8\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 23&version=KJV\">JEREMIAH 23</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 CORINTHIANS 2&version=KJV\">2 CORINTHIANS 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "3 JULY": "<b><u>3 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:14-15&version=KJV\">1 Samuel 17:14-15</a>\n\n<b>LESSON</b>\nDavid's work\n\n<b>VERSE 15</b>\n<i>But David went and returned from Saul to feed his father's sheep at Bethlehem.</i>\n\nDavid having fulfilled his service to Saul by soothing his mental unrest through music, returned home to Jesse. He would now spend his time with the sheep of his father's flock. However, he would learn more in the fields with the sheep than in the courtroom with the courtiers. He would prefer the quiet and obscure life where he could meditate on the laws of the Lord than indulge in the luxuries of the palace. There, the attention was always upon men's wisdom. Here in the fields, he would learn the more important lessons of life.\n\nBeing the youngest, David would tend to his father's sheep. While his older brothers were serving in the king's army, David would be performing the manual and lowly work which his father had assigned him. He was too young to be drafted.\n\nDavid began life as a shepherd boy in the fields of Bethlehem. Here he could see God at work with him. Here he could demonstrate his trust in God and his courage and faithfulness in meeting the responsibilities and challenges of life. One time, he was empowered to kill a lion. Another time he killed a bear that had attacked his flock. Here was his training ground and in God's time, he would be raised to the pinnacle of his life.\n\nHumble beginnings usually bring out one's resilience and diligence. If one can succeed then, he will be able to succeed anywhere else. This is frequently God's way of moulding a man for His service later.\n\n<b>THOUGHT</b>\nIf therefore ye have not been faithful in the unrighteous mammon, who will commit to your trust the true riches? - Luke 16:11\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 24&version=KJV\">JEREMIAH 24</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 CORINTHIANS 3&version=KJV\">2 CORINTHIANS 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "4 JULY": "<b><u>4 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:17-18,20, 22&version=KJV\">1 Samuel 17:17-18,20, 22</a>\n\n<b>LESSON</b>\nDavid's errand\n\n<b>VERSE 20</b>\n<i>And David rose up early in the morning, and left the sheep with a Reeper, and took, and went, as Jesse had commanded him; and he came to the trench, as the host was going forth to the fight, and shouted for the battle.</i>\n\nIt is every boy's dream to see soldiers in uniforms and in action. The day came when David got his chance to visit the camp of Saul's army. He must be excited about this opportunity to be at the frontlines to see what life for a soldier is like especially when war is imminent.\n\nHis father intended simply for someone to run an errand. He never expected anything extraordinary to transpire that day, yet God's providence directed David to a higher end. Jesse may have wondered whether his soldier sons were under hardship, and therefore sought to provide some relief and inquire about their welfare. And while there were other sons at home with him, by divine direction, he had David called from the fields to attend to this simple errand.\n\nIt may be that David himself was not at first so concerned with the battle but went only to Israel's camp out of necessity and under instruction. Yet even in this, we see the special hand of God's providence made visible as He prepares the circumstances for the exaltation of David. We can see from David's life, that from his humble and lowly beginnings, he would be made deliverer of his people, and later their king.\n\nWe should never doubt the good hand of the Lord upon our lives. Even if it may seem harsh and unkind, He will yet make all things well to the glory of His Name and for the good of our souls.\n\n<b>PRAYER</b>\nLord, teach me to humbly and simply submit to Your wise counsel in every aspect of my life, because You desire only the best for me. Amen.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 25&version=KJV\">JEREMIAH 25</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 CORINTHIANS 4&version=KJV\">2 CORINTHIANS 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "5 JULY": "<b><u>5 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:19, 21&version=KJV\">1 Samuel 17:19, 21</a>\n\n<b>LESSON</b>\nThe Valley of Elah\n\n<b>VERSE 19</b>\n<i>Now Saul, and they, and all the men of Israel, were in the valley of Elah, fighting with the Philistines.</i>\n\nThe Philistines had lost control of the hill country but now tried to go up the Valley of Elah to gain access once again. The valley offered a backdoor to the hill country via Bethlehem and they had to be stopped. The Philistine army was camped on the south side of the valley facing King Saul's army on the strategic hill to the north. We can observe two giant cliffs in Israel's valley of Elah today, and it is purported to be the very site of this important battle.\n\nDavid came to the valley of Elah that day, twelve miles from Bethlehem. His father had instructed the young lad to check on the welfare of his brothers. But on arrival, he witnessed not only Israel's army scared stiff, but also the taunting of the Philistine giant named Goliath. He was moved to answer the challenge no one else dared, which was to fight the giant.\n\nFor David, that day was meant to be just another ordinary day in this ordinary valley. But his life would be changed forever. He did not go there to be a national hero but God opened a door he could not close. Sometimes, the Lord does not ask us to do anything extraordinary, but just to be faithful in the ordinary tasks He has called us to do. In His sovereign will and time, He may turn simple faithfulness into something great.\n\n<b>THOUGHT</b>\nHe that is faithful in that which is least is faithful also in much. - Luke 16:10\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 26&version=KJV\">JEREMIAH 26</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 CORINTHIANS 5&version=KJV\">2 CORINTHIANS 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "6 JULY": "<b><u>6 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:16, 23&version=KJV\">1 Samuel 17:16, 23</a>\n\n<b>LESSON</b>\nThe Philistine\n\n<b>VERSE 23</b>\n<i>And as he talked with them, behold, there came up the champion, the Philistine of Gath, Gokath by name, out of the armies of the Philistines, and spake according to the same words: and David heard them.</i>\n\nIt is likely the Philistines had heard about the mental state of Saul and thought it an opportune time to avenge themselves on Israel. They had been defeated on a few occasions by Saul and his son Jonathan. Now they gathered purposefully their dispersed troops to execute a decisive push into Israel's territory.\n\nThis time they put forward their champion Goliath. Well over nine feet tall, with armour and spear weighing over 150 pounds, Goliath was an invincible and formidable foe by all human reckoning. And he came out daily to taunt and mock the army of Israel and blaspheme the name of their God. Would anyone in Saul's army dare face this giant?\n\nIt so happened that David heard the blasphemy of this Philistine and his spirit was kindled within his heart. He could not bear that an uncircumcised pagan would dare heap such scorn on the armies of the living God. A holy soul filled with holy zeal could not bear to see God's holy name and His cause so downtrodden, without rising to its vindication. Thus, David with complete trust in the Almighty God, went forth to face this foe with five stones and a sling.\n\nThe apostle Paul wrote, \"For God hath not given us the spirit of fear; but of power, and of love, and of a sound mind\" [2 Timothy 1:7]. Fear will paralyse and incapacitate us, but faith will energise and propel us in the service of the Lord.\n\n<b>PRAYER</b>\nHoly Father, put Your fear in our hearts so that nothing in this world will cause us to be ashamed of Your Name and be fearful. Amen\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 27&version=KJV\">JEREMIAH 27</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 CORINTHIANS 6&version=KJV\">2 CORINTHIANS 6</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "7 JULY": "<b><u>7 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:24-25&version=KJV\">1 Samuel 17:24-25</a>\n\n<b>LESSON</b>\nThe fear of the men of Israel\n\n<b>VERSE 24</b>\n<i>And all the men of Israel, when they saw the man, fled from him, and were sore afraid.</i>\n\nThe battle between Israel and the Philistines had not even started. However, psychological warfare was effectively employed by the Philistines. They sent their champion - Goliath to challenge the Israelites. Forty days without fail, he taunted the Israelites and mocked Israel's God with his words and frame. The sight and sound were too much for the entire army of King Saul. This time round was the last straw, and when \"they saw the man\", they fled in great fear.\n\nKing Saul's extreme offer of riches, the hand of his daughter and freehold land for anyone to kill Goliath tempted none. Fear is an emotional response to danger. If we focus on danger and death by feeding on today's global news about the destructive power of Covid-19 we can easily be overcome by panic. But if we pause, take a deep breath, look to the Lord with eyes of faith, and trust Him Who is with us in a special way, He will calm our fears. The situation may remain unchanged, but by simply accepting our Lord's promise that He is Controller over all things, it will help us rest in His peace during the storm.\n\nThe Lord Jesus is our Good Shepherd. He will never, never leave us nor forsake us [Hebrews 13:5]. Therefore, have faith in Him. He will take care of our fears. \"Yea, though I walk through the valley of the shadow of death, I will fear no evil: for Thou art with me; Thy rod and Thy staff they comfort me. Thou preparest a table before me in the presence of mine enemies: Thou anointest my head with oil; my cup runneth over\" [Psalm 23:4- 5].\n\n<b>THOUGHT</b>\nThe fear of man bringeth a snare: but whoso putteth his trust in the LORD shall be safe. - Proverbs 29:25\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 28&version=KJV\">JEREMIAH 28</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 CORINTHIANS 7&version=KJV\">2 CORINTHIANS 7</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "8 JULY": "<b><u>8 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:26-27&version=KJV\">1 Samuel 17:26-27</a>\n\n<b>LESSON</b>\nWho is he that defies God?\n\n<b>VERSE 26</b>\n<i>Alnd David spake to the men that stood by him, saying, What shall be done to the man that killeth this Philstine, and taketh away the reproach from Israel? for who ts this uncircumcised Philistine, that he should defy the armies of the tiwing God?</i>\n\nWhen David heard the reward being offered for anyone who would stand up to Goliath, his first reaction was - how dare anyone defy the armies of the living God? David was not thinking of himself. The glory of God and the welfare of Israel was at stake. David could not stand still and do nothing. His personal relationship with God moved him to rise to the occasion. This was reflected in his prayer in Psalm 69:9 - \"For the zeal of Thine house hath eaten me up; and the reproaches of them that reproached Thee are fallen upon me.\" There, David noted on a separate occasion, it was because of his zeal for God in putting Him first that he was pursued by his enemies. Nonetheless, David took courage knowing that those who fought against God would be destroyed.\n\nDavid's question about anyone daring to defy the living God is a voice of faith. Owing to unbelief Israel trembled with fear. Now David's words would turn the gloom of darkness into a glimmer of light. God's presence and power was exactly what Israel needed desperately. God will never allow anyone to defy Him and get away with it.\n\nToo often we forget that our God is alive, and our Lord Jesus is our risen Saviour. We live by sight instead of faith. As a result, we give in to fear and mar our testimony for Christ. \"For1 God hath not given us the spirit of fear; but of power, and of love, and of a sound mind\" [2 Timothy 1:7]. The Lord has given us faith by His Spirit [Galatians 5:22]. Therefore, let us be strong in challenging times.\n\n<b>THOUGHT</b>\nThe LORD is on my side; I will not fear: what can man do unto me? - Psalm 118:6\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 29&version=KJV\">JEREMIAH 29</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 CORINTHIANS 8&version=KJV\">2 CORINTHIANS 8</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "9 JULY": "<b><u>9 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:28&version=KJV\">1 Samuel 17:28</a>\n\n<b>LESSON</b>\nHindrance to service (I)\n\n<b>VERSE 28</b>\n<i>And Eab his eldest brother heard when he spake unto the men; and Elab's anger was kindled against David, and he said, Why camest thou down hither? and with whom hast thou left those few sheep in the wilderness? I know thy pride, and the naughtiness of thine heart; for thou art come down that thou mightest see the battle.</i>\n\nThese words recount how Eliab was angry and sought to reprove David for his stand against Goliath. One reason is that David was the youngest. Secondly Eliab was jealous for he had been rejected by Samuel who anointed David instead [1 Samuel 16:6-7]. Thirdly, Eliab, now a soldier, was shamed by David's boldness which exposed his cowardice. With contemptuous words, Eliab insinuated that David was irresponsible, audacious and pleasure- seeking.\n\nGod has saved us to serve Him as His witnesses. In the family, David was the youngest. But that did not mean he had to wait his turn or for his age in order to begin serving God. David's anointing by prophet Samuel in the presence of his family showed his readiness to be prepared for service.\n\nThe starting point in Christian service is not age but faith in God. Hear a testimony of a young child encouraging her troubled parents with what she learned from Sunday School. She said \"Daddy, mummy, let us pray to Jesus. Only He can help us.\" The Lord used her sincere child-like faith to revive the family. As parents and spiritual leaders we should never hinder anyone with simple faith from serving the Lord. Spiritual wisdom tells us that there is potential and we should offer guidance, not discouragement.\n\nWe see evidence of David's faith in his \"can- do\" spirit to trust, obey and serve God. There were no grounds for Eliab's charges against David. May the Lord use us to lead our children to Him and bless us with wisdom to train them to serve Him early in life.\n\n<b>THOUGHT</b>\nAnd, ye fathers, provoke not your children to wrath: but bring them up in the nurture and admonition of the Lord. - Ephesians 6:4\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 30&version=KJV\">JEREMIAH 30</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 CORINTHIANS 9&version=KJV\">2 CORINTHIANS 9</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "10 JULY": "<b><u>10 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 29 time. But the real test comes in times of affliction</b>\n<i>And David said and war. Are we still as fervent and faithful? May it What have I now done? be by the power and grace of God. Is there not a cause? Likewise, the on-going battle against this viral pandemic is a cause and reason for us to trust the Lord to work mightily on our behalf. Applying Isaiah 40:30-31 we may be assured that God works when we worship and wait upon Him in prayer. In times of anxiety, worry and weariness, we shall soar with wings as eagles. We shall walk and not faint for the LORD is with us strengthening us within and without. In God's Word, the main cause for which we must trust God today is His Truth that is at stake. We must ensure that the whole counsel of Holy Scripture is not adulterated or compromised with untruth. Our Lord Jesus warns that false teachers shall arise to decetve many, even the elect [Matthew 24:24]. The writings of apostles Paul, Peter, John likewise forewarned us of false teachers who will appear in the last days. How then can we consistently To CompLete THE BIBLE trust God in this battle and also propagate His IN 2 YEARS, READ Word without fear and favour? Only with God's JEREMIAH 31 help -- be faithful to contend earnestly for the faith 2 CORINTHIANS 10 which was once delivered unto the saints [Jude 3]. THOUGHT And the things that thou hast heard of me among many witnesses, the same commit thou to faithful men, who shall be able to teach others also. -- 2 Timothy 2:2</i>\n\nThe battle line was drawn between Israel and the Philistines. David's reply to his brother served as a rallying point to challenge Israel to put their trust in the living God whose army is able to destroy those who defy Him. God's Holy Name and His honour cannot be called into question. The sacred responsibility of every believer is to uphold God's Truth - His Word. We do it in peace time. But the real test comes in times of affliction and war. Are we still as fervent and faithful? May it be by the power and grace of God.\n\nLikewise, the on-going battle against this viral pandemic is a cause and reason for us to trust the Lord to work mightily on our behalf. Applying Isaiah 40:30-31 we may be assured that God works when we worship and wait upon Him in prayer. In times of anxiety, worry and weariness, we shall soar with wings as eagles. We shall walk and not faint for the LORD is with us strengthening us within and without.\n\nIn God's Word, the main cause for which we must trust God today is His Truth that is at stake. We must ensure that the whole counsel of Holy Scripture is not adulterated or compromised with untruth. Our Lord Jesus warns that false teachers shall arise to deceive many, even the elect [Matthew 24:24]. The writings of apostles Paul, Peter, John likewise forewarned us of false teachers who will appear in the last days. How then can we consistently trust God in this battle and also propagate His Word without fear and favour? Only with God's help - be faithful to contend earnestly for the faith which was once delivered unto the saints [Jude 3].\n\n<b></b>\nAnd the things that thou hast heard of me among many witnesses, the same commit thou to faithful men, who shall be able to teach others also. - 2 Timothy 2:2\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "11 JULY": "<b><u>11 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:31-32&version=KJV\">1 Samuel 17:31-32</a>\n\n<b>LESSON</b>\nLet no man's heart fail\n\n<b>VERSE 32</b>\n<i>And David said to Saul, Let no man's heart fail because of him; thy servant will go and fight with this Philistine.</i>\n\nWith the standoff at the front, it took great gumption for David to assure King Saul and his men that there was no reason to fear. If anyone should have courage to confront the giant, it should be Saul. But Saul's inaction opened the way for David to show what true faith in God can do. Faith has the power to allay fear. Faith opens our spiritual eyes to behold our Heavenly Father - The All-present, All-knowing, All-powerful God Who is with us in Christ. \"So that we may boldly say, The Lord is my helper, and I will not fear what man shall do unto me\" [Hebrews 13:6].\n\nFear is real. Nevertheless, God is greater than our fear and He takes over when we call. He gives us His peace which passeth all understanding and keeps our hearts and minds through Christ Jesus [Philippians 4:7]. Fear torments. But the peace of God not only overcomes fear, it also strengthens us, like it did David, to face up to the challenge. David did not know how the Lord was going to use him to smite Goliath, but empowered by God's presence through faith, David volunteered his life for service to God and country. He instilled bravery in Saul and his men by his example of faith in the Almighty.\n\nIn times of danger we are prone to panic. But before we act rashly, it is important to pause and remember God's Word - \"Be still, and know that I am God\" [Psalm 46:10a]. May we take heart in the refuge of His everlasting arms.\n\n<b>THOUGHT</b>\nWhen I fear my faith will fail, Christ can hold me fast! When the tempter would prevail, He can hold me fast! He'll not let my soul be lost, Christ will hold me fast! Bought by Him at such a cost, He will hold me fast! - Ada R. Habershon\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 32&version=KJV\">JEREMIAH 32</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 CORINTHIANS 11:1-15&version=KJV\">2 CORINTHIANS 11:1-15</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "12 JULY": "<b><u>12 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:33&version=KJV\">1 Samuel 17:33</a>\n\n<b>LESSON</b>\nHindrance to service (Il)\n\n<b>VERSE 33</b>\n<i>And Saul said to David, Thou art not able to go against this Philistine to fight with him: for thou art but a youth, and he a man of war from his youth.</i>\n\nKing Saul disapproved of David's offer to fight Goliath for obvious reasons. David was too young and without battle experience. From the standpoint of soldiering, that was certainly true. He had no place among battle-hardened soldiers. Yet it pleased God to use David and work in him to undertake this \"mission impossible\" by faith.\n\nDavid had been anointed as a young lad by Samuel to be Israel's next king. But it would requrie the hard knocks of life to prepare him to ascend the throne in God's time. Along the way he would be hindered by man and this is nothing unusual. In the service of God there will always be hindrances and discouragements..\n\nIn the late 1700s, William Carey, a newly- ordained minister, was speaking at a leaders' meeting about the value of overseas missions when he was abruptly interrupted. An older minister said, \"Young man, sit down! You are an enthusiast. When God pleases to convert the heathen, he'll do it without consulting you or me.\" Undaunted, Carey carried on his work and later became known as the father of modern Protestant missions.\n\nToday if you are called to serve the Lord, whether in full-time capacity or in the ministries of the church, the Lord will open a way for you. If He does not remove the opposition, he will supply your needs from unexpected sources. The key is prayer and remembering:\n\n\"I know the Lord will make a way for me,\n\nI know the Lord will make a way for me.\n\nIf I look to Him in prayer\n\ndarkest night will turn to day,\n\nI know the Lord will make a way for me.\"\n\n<b>THOUGHT</b>\nExpect great things from God; attempt great things for God. - William Carey\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 33&version=KJV\">JEREMIAH 33</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 CORINTHIANS 11:16-33&version=KJV\">2 CORINTHIANS 11:16-33</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "13 JULY": "<b><u>13 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 37a went out after him, and smote him, and delivered it</b>\n<i>1 Samuel 17:34-37a David said moreover out of his mouth: and when he arose against me, I The LORD that delivered me caught him by his beard, and smote him, and slew out of the paw of the lion, him\" [v. 35]. No ward in his care would be lost. and out of the paw of the But lest the glory should be claimed by the bear, he will deliver me out of servant, we read immediately that it was \"The Lord the hand of this Philistine ... that delivered me.\" What a blessed testimony of one who knew the Lord to be his very present help in danger. What confidence of a man who has personally experienced the deliverance that comes only from his Lord. Against the ferocity of the lion and the might of the bear, man is but a helpless thing. But our Lord is the great shepherd of His sheep and with Him all things are possible. The impossible comes to pass and a young lad who had never before ever experienced battle would overcome the monarchs of the beasts and reclaim the prize. May we claim this truth as ours too-- Our Lord ts able to save. He is able to do exceeding abundantly To Comptete THE BIBLE above all we ask or think. But like David, we must IN 2 Years, READ have courage in taking that first step of faith. JEREMIAH 34 2 CORINTHIANS 12 THOUGHT David knew the greater Shepherd and mighty Deliverer so he was dauntless against both man and beast. \"And I give unto them eternal life; and they shall never perish, neither shall any man pluck them out of My hand.\" -- John 10:28</i>\n\nDavid was the keeper of his father's sheep. Their safety and well-being were his responsibility. But out in the wilds, the perils were present and great. The fearsome lion was walking about seeking whom he may devour, and a helpless lamb was a welcome morsel for a ravenous bear. But between the predator and the prey stood the shepherd of the sheep. And this was David's recollection, \"I went out after him, and smote him, and delivered it out of his mouth: and when he arose against me, I caught him by his beard, and smote him, and slew him\" [v. 35]. No ward in his care would be lost. But lest the glory should be claimed by the servant, we read immediately that it was \"The Lord that delivered me.\" What a blessed testimony of one who knew the Lord to be his very present help in danger. What confidence of a man who has personally experienced the deliverance that comes only from his Lord. Against the ferocity of the lion and the might of the bear, man is but a helpless thing. But our Lord is the great shepherd of His sheep and with Him all things are possible. The impossible comes to pass and a young lad who had never before ever experienced battle would overcome the monarchs of the beasts and reclaim the prize. May we claim this truth as ours too - Our Lord is able to save. He is able to do exceeding abundantly above all we ask or think. But like David, we must have courage in taking that first step of faith.\n\n<b></b>\nDavid knew the greater Shepherd and mighty Deliverer so he was dauntless against both man and beast. \"And I give unto them eternal life; and they shall never perish, neither shall any man pluck them out of My hand.\" - John 10:28\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "14 JULY": "<b><u>14 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:36&version=KJV\">1 Samuel 17:36</a>\n\n<b>LESSON</b>\nThe Living God\n\n<b>VERSE 36</b>\n<i>Thy servant slew both the lon and the bear: and this uncircumcised Philistine shall be as one of them, seeing he hath defied the armies of the living God.</i>\n\nClearly David knew his history and the books of Moses well. He knew Jehovah was the God of their fathers. He knew Israel was chosen by Jehovah to be His special people and the eternal covenant He made with them. David knew that his Lord was the commander-in-chief of the heavenly host. And David was confident that even as God was there at the beginning of creation, so was He now in the Valley of Elah as the two armies faced off. To know God is to fear Him but this pagan Philistine knew no better. His arrogance and contempt towards Israel's army was defiance against the living God but He would vindicate His own name. In the eyes of the Lord omnipotent, the fearsome beasts were nothing, much less this scorner. Such was David's experience, for the Lord had delivered the lion and the bear into his hands.\n\nThe true and living God is the same yesterday, today and forever. What He did for David, He will do for you. But far greater is our privilege than David's for we have the complete Canon of Scripture. Though not of Israel, we are God's covenant people through our Lord Jesus Christ and Calvary. And today, while Christ dwells with the Father above interceding for us, the Holy Spirit lives in our heart.\n\nLet our faith be strengthened by the knowledge of what the living God has done for His people through ages past, by His trustworthy and unchanging promises we own today, and by our personal experience of His dealings with us in life. Then like fearless David, we shall face all challenges in the strength of our living God.\n\n<b>THOUGHT</b>\nGoliath did not know that \"it is a fearful thing to fall into the hands of the living God\" [Hebrews 10:31]. But we do and because God knows, all is well.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 35&version=KJV\">JEREMIAH 35</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 CORINTHIANS 13&version=KJV\">2 CORINTHIANS 13</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "15 JULY": "<b><u>15 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:37b-39&version=KJV\">1 Samuel 17:37b-39</a>\n\n<b>LESSON</b>\nHindrance to service (Ill)\n\n<b>VERSE 38</b>\n<i>And Saul armed David with his armour, and he put an helmet of brass upon his head; also he armed him with a coat of mail.</i>\n\nHindrances to our Christian walk, our testimony and our service for the Lord come in many guises. Some are violent assaults intended to destroy and demolish our faith. Some are less direct but no less insidious, serving to discourage and distract us and dilute our efforts and enthusiasm. Yet others are disguised and deceitful so as to subvert the believer's testimony and work. Today, we see a fourth which ironically is borne out of well-meaning and good intentions.\n\nUpon seeing David's resolve to take on Goliath, Saul handed David his personal accoutrements of war. No doubt the king's equipment would be of the best metals and quality fit for a king. But instead of being a help, they were a hindrance. They were untested by the slender youth and wearing them, he was greatly hampered.\n\nThis is a wonderful lesson regarding discernment and dependence.\n\nDiscernment. We must have discernment regarding man's help, however well-intentioned it may be. There are times when man's suggestion and aid must be refused in order for God's work to be carried out.\n\nDependence. At all times, we must look not to man and worldly wisdom for direction, but our absolute dependence must be on God for success in His enterprise. It is the Lord's promise that wherever He leads, He will provide and whatever He begins, He will complete. We are just the means to God's ends. And we must simply trust Him and follow His leading and prompting without reserve and hesitation.\n\nThis demands a simple yet great faith, like David's.\n\n<b>THOUGHT</b>\nBeing confident of this very thing, that He which hath begun a good work in you will perform it until the day of Jesus Christ. - Philippians 1:6\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 36&version=KJV\">JEREMIAH 36</a>\n<a href=\"https://www.biblegateway.com/passage/?search=GALATIANS 1&version=KJV\">GALATIANS 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "16 JULY": "<b><u>16 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 40 But we are reminded that God's ways are</b>\n<i>And he took his staff in not man's ways, and His thoughts are not man's his hand, and chose him five thoughts. His plans and His methods to accomplish smooth stones out of the His purposes are so beyond our comprehension brook, and put them in a just as the heavens above the earth are a mystery shepherd's bag which he had, to man and beyond his understanding. Paul would even in a scrip; and his sling later testify -- \"the foolishness of God is wiser than was in his hand: and men and the weakness of God is stronger than he drew near to the Philistine. men. But God hath chosen the foolish things of the world to confound the wise; and God hath chosen the weak things of the world to confound the things which are mighty; And base things of the world, and things which are despised, hath God chosen, yea, and things which are not, to bring to nought things that are: That no flesh should glory in His presence\" [1 Corinthians 1:25, 27-29]. God has not changed. David's only weapon was five stones and a sling, but there that day, the weak and despised thing SUE EERE stood against the might of evil, as representative To Comptete THE BIBLE of the Lord of hosts, faithful, fearless and spitit- IN 2 Years, READ empowered. JEREMIAH 37 David availed himself for the Lord. This looked GALATIANS 2 like an impossible task doomed to failure, but one thing he knew -- God never fails. We too can count on that. THOUGHT This is the word of the LORD unto Zerubbabel, saying, Not by might, nor by power, but by My spirit, saith the LORD of hosts. -- Zechariah 4:6b</i>\n\nThe staff and the sling were the tools of the shepherd to defend his sheep and drive away predators. Compared to the implements of war, these would seem as nothing. Against the giant's formidable armour and spear with a staff like a weaver's beam and an iron spear head weighing six hundred shekels, five small stones and a sling appeared even more absurd, a laughable thing in the world's eyes.\n\nBut we are reminded that God's ways are not man's ways, and His thoughts are not man's thoughts. His plans and His methods to accomplish His purposes are so beyond our comprehension just as the heavens above the earth are a mystery to man and beyond his understanding. Paul would later testify - \"the foolishness of God is wiser than men and the weakness of God is stronger than men. But God hath chosen the foolish things of the world to confound the wise; and God hath chosen the weak things of the world to confound the things which are mighty; And base things of the world, and things which are despised, hath God chosen, yea, and things which are not, to bring to nought things that are: That no flesh should glory in His presence\" [1 Corinthians 1:25, 27-29]. God has not changed.\n\nDavid's only weapon was five stones and a sling, but there that day, the weak and despised thing stood against the might of evil, as representative of the Lord of hosts, faithful, fearless and spirit- empowered.\n\nDavid availed himself for the Lord. This looked like an impossible task doomed to failure, but one thing he knew - God never fails. We too can count on that.\n\n<b></b>\nThis is the word of the LORD unto Zerubbabel, saying, Not by might, nor by power, but by My spirit, saith the LORD of hosts. - Zechariah 4:6b\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "17 JULY": "<b><u>17 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:41-44&version=KJV\">1 Samuel 17:41-44</a>\n\n<b>LESSON</b>\nGoliath\n\n<b>VERSE 42</b>\n<i>And when the Philistine looked about, and saw David, he disdained him: for he was but a youth, and rudd), and of a fair countenance.</i>\n\nGoliath was a giant of a man, standing ten feet tall, a battle-seasoned warrior, the best of the best among the Philistines. Even King Saul who stood head and shoulders above all the men of Israel [1 Samuel 10:23] was dwarfed by this giant. Little wonder then that the sound of Goliath's challenge sent shivers through Saul and Israel's army and that he despised this young thing standing before him.\n\nGoliath represents the obstacles, the opposition and the opportunities that confront us at every turn of our Christian walk. Goliath is the obstacle that comes into our way when we are required to make difficult decisions that honour our Lord but may be costly to us. It is the obstacle when we set out to do God's work and ministry, and there are many hurdles to overcome and much sacrifice to make. Goliath is the opposition when we are hated for resisting and rejecting the norms and values of the times we live in, and speaking out against them. It is the opposition from those who disagree and disdain our witness and work for our Lord. It is the enmity of society, authorities, friends and family who insult, criticise, even persecute us for fearing God rather than man.\n\nBut Goliath is also the opportunity given us to test our faith and prove the faithfulness of the Almighty God. It is the privilege to wait upon Him, to stand still and see the salvation of the Lord.\n\nGoliath represents all these because they loom big and frightening before us. David faced Goliath, but his eyes were opened to the presence of God Who is infinitely greater. May we learn to have such spiritual vision and discernment too.\n\n<b>THOUGHT</b>\nAnd Elisha prayed, and said, LORD, I pray thee, open his eyes, that he may see. And the LORD opened the eyes of the young man; and he saw: and, behold, the mountain was full of horses and chariots of fire round about Elisha. - 2 Kings 6:17\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 38&version=KJV\">JEREMIAH 38</a>\n<a href=\"https://www.biblegateway.com/passage/?search=GALATIANS 3&version=KJV\">GALATIANS 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "18 JULY": "<b><u>18 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:45-46&version=KJV\">1 Samuel 17:45-46</a>\n\n<b>LESSON</b>\nDavid's weapons\n\n<b>VERSE 45</b>\n<i>Then said David to the Philistine, Thou comest to me with a sword, and with a spear, and with a shield: but I come to thee in the name of the LORD of hosts, the God of the armies of Israel, whom thou hast defied.</i>\n\nThe defiance and mockery of the \"uncircumcised Philistine\" stirred in David's heart a burning patriotism for his nation and fierce desire to defend Jehovah's name. To David, Goliath was the archetype of all God's enemies throughout the ages, and to be destroyed at all costs. David, a man after God's own heart [1 Samuel 13:14] courageously stepped forward to fight him, defend Israel and uphold the name of the Lord. Goliath, fully armoured with shield, sword and spear was confident of victory. The youthful shepherd, having declined Saul's armour, readied himself for battle clad only in shepherd's clothing, putting his trust in his sling and stones and the Lord of hosts [Psalm 44:6-7]. Was David foolhardy?\n\nThe battle is a spiritual one fought between the forces of evil personified by Goliath and the righteousness of the Lord Jehovah represented by David. Goliath's weapons were carnal which God would render useless in the ensuing battle. Instead, a small stone flying out of David's sling, guided by the hand of God would find its mark in Goliath's head. \"But God hath chosen the foolish things of the world to confound the wise; and God hath chosen the weak things of the world to confound the things which are mighty\" [1 Corinthians 1:27] just as He had done in the conquest of Jericho [Joshua 6:1-27] and Shamgar's slaughter of the Philistines with an ox goad [Judges 3:31].\n\nThe soldiers of the Lord extend His kingdom on earth not by wielding the sword or firing the gun but with Bible in their hands and prayer in their hearts, proclaiming the Gospel with their lips, calling all to repentance and salvation.\n\n<b>THOUGHT</b>\nFor the weapons of our warfare are not carnal, but mighty through God to the pulling down of strong holds. - 2 Corinthians 10:4\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 39&version=KJV\">JEREMIAH 39</a>\n<a href=\"https://www.biblegateway.com/passage/?search=GALATIANS 4&version=KJV\">GALATIANS 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "19 JULY": "<b><u>19 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:45&version=KJV\">1 Samuel 17:45</a>\n\n<b>LESSON</b>\nThe name of the LORD of hosts\n\n<b>VERSE 45</b>\n<i>Then said David to the Philistine, Thou comest to me with a sword, and with a spear, and with a shield: but I come to thee in the name of the LORD of hosts, the God of the armies of Israel, whom thou hast defied.</i>\n\nDavid, not of his own volition, but by God's providence was led to this conflict [v. 17-20]. Goliath continued his daily taunts against Israel and the Lord Jehovah. David, bestowed with God's Spirit [1 Samuel 16:13], was incensed that the name of the Lord was being blasphemed. His heart burned with passion to vindicate the Lord's name. The Lord of hosts if He wills, has at His disposal countless angels in heaven to vanquish His foes. But here on earth, His army - the armies of Israel and their king- were petrified. So, the Lord moved the heart of David to take up His cause.\n\nUnlike proud Goliath, David was humble [Psalm 131:1, James 4:6] and conscious of his unworthiness before God. David saw Goliath's armour and weapons and declared \"I come in the name of the Lord of hosts.\" It was a holy commission, vesting David with divine power. He did not look at man or his circumstances but to God above. He did not consider this a battle between him and Goliath but between God and Goliath. His motives were pure. He did not fight for personal fame and recognition but for the honour and glory of God's name. He fought courageously and prevailed so \"that all the earth may know that there is a God in Israel\" [v. 46b] - the one True and Living God.\n\nMay we, like David, be ever jealous for our Lord's name, serving with humility and a pure heart, fervent in spirit, fighting the good fight of faith till our Lord Jesus returns.\n\n<b>THOUGHT</b>\nAnd whatsoever ye do in word or deed, do all in the name of the Lord Jesus, giving thanks to God and the Father by Him. - Colossians 3:17\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 40&version=KJV\">JEREMIAH 40</a>\n<a href=\"https://www.biblegateway.com/passage/?search=GALATIANS 5&version=KJV\">GALATIANS 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "20 JULY": "<b><u>20 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:47-49&version=KJV\">1 Samuel 17:47-49</a>\n\n<b>LESSON</b>\nDavid's confidence\n\n<b>VERSE 47</b>\n<i>And all this assembly shall know that the LORD saveth not with sword and spear: for the battle 1s the LORD'S, and He will give you into our hands.</i>\n\nGoliath trusted in his strength, stature, suit and spear. Carnal man and sadly, Christians often put their confidence in things seen and temporal - physical strength, material wealth and worldly influence. They believe the race is won by the swift and the battle by the strong.\n\nHowever, David's faith and confidence was in the true and living God, founded upon the grace and promise of the covenantal relationship between God and His people Israel. David would have recalled the goodness and faithfulness of God as He empowered past heroes of his nation - Abraham who put enemies to flight, Moses who led Israel across the Red Sea, Gideon, Barak, Samson and Jephthah, who \"through faith subdued kingdoms and obtained promises\" [Hebrews 11:32,33]. In his own experience, God had helped him kill the lion and bear with his own hands [v. 34-35]. David could say with confidence, \"The LORD that delivered me out of the paw of the lion, and out of the paw of the bear, he will deliver me out of the hand of this Philistine\" [v. 37]. David's confidence in the Lord was founded upon the immutability and faithfulness of God. With God on his side, David ran forward to the fight, confident of victory. \"If God be for us, who can be against us?\" [Romans 8:31b]\n\nHow we thank God, that our loving heavenly Father is forever gracious, merciful, faithful, and unchanging. May we always be grateful, remembering His tender mercies upon us as we serve Him faithfully for His glory and honour, in full confidence of His enabling power.\n\n<b>THOUGHT</b>\nThe LORD is my rock, and my fortress, and my deliverer; my God, my strength, in whom I will trust; my buckler, and the horn of my salvation, and my high tower. I will call upon the LORD, who is worthy to be praised: so shall I be saved from mine enemies. - Psalm 18:2-3\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 41&version=KJV\">JEREMIAH 41</a>\n<a href=\"https://www.biblegateway.com/passage/?search=GALATIANS 6&version=KJV\">GALATIANS 6</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "21 JULY": "<b><u>21 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 51 The Commander of God's Army is none other</b>\n<i>Therefore David ran, than the Captain of our Salvation, our Lord Jesus and stood upon the Philistine, Christ. He has supplied us His weapons -- the whole and took. his sword, armout of God [Ephesians 6:13]. His order to us 1s and drew it out of the sheath to stand [Ephesians 6:14] and hold fast to the faith thereof, and slew him, [Hebrews 10:23]. He has given us strength [Exodus and cut off his head therewith. 15:2] and taught our hands to war [Psalm 144:1] And when the Philistines with His means of grace -- faith, prayer, truth, love, saw their champion was dead, and patience. Our victory is sure because of our they fled. Lord the Christ, so we may rejoice, \"Now thanks be unto God, which always causeth us to trtumph in Christ\" [2 Corinthians 2:14]. A thousand years after David beheaded Goliath with the giant's sword, a Greater David would arise to fulfil the prophecy of Genesis 3:15, that the seed of the woman will bruise the serpent's head. Our Saviour and Lord Jesus will use Satan's own weapon of death to vanquish him, and by His resurrection conquer sin and death on our behalf, once and for all. Just as David had brought Goliath's head to To Compete THE BIBLE Jerusalem in trtumph, the Greater David, our Lord IN 2 YEARS, READ Jesus, ascended triumphantly into heaven, bearing JEREMIAH 42 trophies of His own, highly exalted above every EPHESIANS 1 name [Philippians 2:9]. THOUGHT But thanks be to God, which giveth us the victory through our Lord Jesus Christ. Therefore, my beloved brethren, be ye stedfast, unmoveable, always abounding in the work of the Lord, forasmuch as ye know that your labour is not in vain in the Lord. -- 1 Corinthians 15:57-58</i>\n\nThe war between Israel and the Philistines was a holy war between the Kingdom of Light and the kingdom of darkness. This battle rages on even today between the armies of God, His redeemed children, and the forces of evil. \"For we wrestle not against flesh and blood, but against principalities, against powers, against the rulers of the darkness of this world, against spiritual wickedness in high places.\" [Ephesians 6:12]\n\nThe Commander of God's Army is none other than the Captain of our Salvation, our Lord Jesus Christ. He has supplied us His weapons - the whole armour of God [Ephesians 6:13]. His order to us is to stand [Ephesians 6:14] and hold fast to the faith [Hebrews 10:23]. He has given us strength [Exodus 15:2] and taught our hands to war [Psalm 144:1] with His means of grace - faith, prayer, truth, love, and patience. Our victory is sure because of our Lord the Christ, so we may rejoice, \"Now thanks be unto God, which always causeth us to triumph in Christ\" [2 Corinthians 2:14].\n\nA thousand years after David beheaded Goliath with the giant's sword, a Greater David would arise to fulfil the prophecy of Genesis 3:15, that the seed of the woman will bruise the serpent's head. Our Saviour and Lord Jesus will use Satan's own weapon of death to vanquish him, and by His resurrection conquer sin and death on our behalf, once and for all. Just as David had brought Goliath's head to Jerusalem in triumph, the Greater David, our Lord Jesus, ascended triumphantly into heaven, bearing trophies of His own, highly exalted above every name [Philippians 2:9].\n\n<b></b>\nBut thanks be to God, which giveth us the victory through our Lord Jesus Christ. Therefore, my beloved brethren, be ye stedfast, unmoveable, always abounding in the work of the Lord, forasmuch as ye know that your labour is not in vain in the Lord. - 1 Corinthians 15:57-58\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "22 JULY": "<b><u>22 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:52-54&version=KJV\">1 Samuel 17:52-54</a>\n\n<b>LESSON</b>\nVictory's friends\n\n<b>VERSE 52</b>\n<i>Alnd the men of Israel and of Judah arose, and shouted, and pursued the Philistines, until thou come to the valley, and to the gates of Exkron. And the wounded of the Philistines fell down by the way to Shaaraim, even unto Gath, and unto Ekron.</i>\n\nDavid's victory ignited the confidence of the Jews to fight. Earlier, Goliath had cowed them into fear and trembling. Their faith and confidence in the Almighty God had evaporated. They conceded defeat because they saw Goliath's size (the giant was above three meters tall). They looked only at themselves and the little strength they had. David looked and saw his God who is infinitely greater than Goliath. He trusted God to undertake for the Israelites, to give them victory over the Philistines. Indeed, God delivered a huge Goliath into David's small hands. The Jews regained their confidence and strength to pursue the enemy upon witnessing what God did through David.\n\nThe disciples went into hiding during our Lord Jesus' trial. They were afraid. Peter even denied the Lord three times. When our Lord arose from the grave, the disciples found confidence and courage to witness and preach the Gospel. Our Lord Jesus had delivered victory over death. After His ascension, the disciples fully committed themselves to following the Lord. They affirmed that Jesus would carry out everything He said, for He had conquered death by His resurrection. As He lives today, we too, who believe in Him, will be resurrected to eternal life. What a victory! All Glory to God.\n\nThe Israelites then were bold to fight the Philistines because they knew God had given David, and would also give them victory too. We too must be bold to fight this spiritual war. God is on our side and victory is already won in our Lord Jesus Christ. Death has no more hold over us. Therefore, we should confidently preach the Gospel.\n\n<b>THOUGHT</b>\nBut thanks be to God, which giveth us the victory through our Lord Jesus Christ. - 1 Corinthians 15:57\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 43&version=KJV\">JEREMIAH 43</a>\n<a href=\"https://www.biblegateway.com/passage/?search=EPHESIANS 2&version=KJV\">EPHESIANS 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "23 JULY": "<b><u>23 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 56 expected that David was from some notable family.</b>\n<i>And the king said, Our Lord Jesus had an earthly father who was Enquire thou insignificant in society. Joseph was a carpenter from the insignificant town of Nazareth. In fact, Nathaniel went as far as to remark that he did not expect anything good to come out of Nazareth [John 1:46]. To man, heritage and background are important. The world measures success by material possessions and social status. David was a nobody by man's standards, but he was successful and victorious because he was fighting for God's honour. He was a child of God. Our Lord Jesus has given us victory over death. He graciously confers to all who confess Him, the honour of becoming sons and daughters of God. So we can go to Him and call Him Father. \"And because ye ate sons, God hath sent forth the Spirit of his Son into your hearts, crying, Abba, Father\" [Galatians 4:6]. To Comptete THE BIBLE It is vital to be a child of God. As His own, we IN 2 YEARS, READ possess the richest inheritance and eternal life. Are whose son the stripling ts. JEREMIAH 44 you honoured to have such a God whom you can EPHESIANS 3 call Abba? This is real victory, true success and ereatest wealth. THOUGHT And if children, then heirs; heirs of God, and joint-heirs with Christ; if so be that we suffer with Him, that we may be also glorified together. -- Romans 8:17</i>\n\nDavid had delivered provisions to his three brothers at the battle front against the Philistines. They were not prominent because their father Jesse was only a shepherd, neither influential nor wealthy. The king might have thought David was foolhardy to take on Goliath while other battle-hardened soldiers feared to. Now people took interest in him because he had defeated Goliath. King Saul certainly did, and he might have expected that David was from some notable family.\n\nOur Lord Jesus had an earthly father who was insignificant in society. Joseph was a carpenter from the insignificant town of Nazareth. In fact, Nathaniel went as far as to remark that he did not expect anything good to come out of Nazareth [John 1:46].\n\nTo man, heritage and background are important. The world measures success by material possessions and social status. David was a nobody by man's standards, but he was successful and victorious because he was fighting for God's honour. He was a child of God.\n\nOur Lord Jesus has given us victory over death. He graciously confers to all who confess Him, the honour of becoming sons and daughters of God. So we can go to Him and call Him Father. \"And because ye are sons, God hath sent forth the Spirit of his Son into your hearts, crying, Abba, Father\" [Galatians 4:6].\n\nIt is vital to be a child of God. As His own, we possess the richest inheritance and eternal life. Are you honoured to have such a God whom you can call Abba? This is real victory, true success and greatest wealth.\n\n<b></b>\nAnd if children, then heirs; heirs of God, and joint-heirs with Christ; if so be that we suffer with Him, that we may be also glorified together. - Romans 8:17\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "24 JULY": "<b><u>24 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 17:58&version=KJV\">1 Samuel 17:58</a>\n\n<b>LESSON</b>\nDavid's humility\n\n<b>VERSE 58</b>\n<i>And Saul said to him, Whose son art thou, thou young man? And David answered, I am the son of thy servant Jesse the Bethlehemite.</i>\n\nDavid could have sought recognition. Instead, he quietly took Goliath's armour back to his tent. The Israelites pursued the Philistines, but Saul now enquired about this unassuming young hero. David knew he did not slay Goliath in his own strength. God had delivered the victory and Goliath into his hands, so in honesty he could not claim the glory for himself.\n\nWe too must realise that we can do nothing without God. Some like to broadcast what they have done for God. They are proud of their achievements thinking the results are due to their efforts. Some repeat the word \"humble\" (referring to themselves) so often and we hear statements such as \"I must be humble too ... \" or \"This is my humble opinion ... \" and so on, when in fact they are the least humble. The Apostle Paul wrote many books of the Bible, yet he declared he was the least of the apostles [1 Corinthians 15:9] and denied being spent himself for our Lord Jesus Christ. This is true humility.\n\nThe Lord Jesus Christ is God. He came in humility as a man to die on our behalf because He loves us. Our Lord Jesus did not boast about what He had come to do. His mission is to redeem sinners so that those who believe in Him will have eternal life and be in Heaven with Him forever. Leaving heaven's glory to come into this world, He lived and died in obedience and humility. Are you humble and obedient enough to be His servant and give Him all the glory?\n\n<b>THOUGHT</b>\nAnd being found in fashion as a man, He (Jesus Christ) humbled Himself, and became obedient unto death, even the death of the cross. - Philippians 2:8\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 45&version=KJV\">JEREMIAH 45</a>\n<a href=\"https://www.biblegateway.com/passage/?search=EPHESIANS 4:1-16&version=KJV\">EPHESIANS 4:1-16</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "25 JULY": "<b><u>25 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 3 upon affectionate love for each other, a solemn</b>\n<i>Then Jonathan and David agreement to maintain mutual concern and care made a covenant, because he for each other's interests in life, even after death loved him as his own soul. claimed one of them. That hearty love was swiftly and firmly expressed by Jonathan's unselfish bestowing on David his royal gifts, making him one like himself, not only a soldier, but a prince. A sweet mercy of God to David to have such a fast, intimate friend in court to accompany him and advise him on all occasions. Love is generous and sacrificial, willing to part with anything. The Lord Jesus Christ sealed up His great love for His elect by bestowing Himself and all His benefits upon them and called them His friends. Human friendship is a shadow of divine love. The greatest and best Friend we can have is out Lord. Happy is every one who can say from the heart, \"This is my beloved, and this is my friend\" [Song of Solomon 5:16]. What a Friend we To CompLete THE BIBLE have in Jesus! Such divine friendship ought to be IN 2 Years, READ reciprocated by our whole-hearted love. JEREMIAH 46 EPHESIANS 4:17-32 THOUGHT Friendship produces an entire sameness; it is one soul in two bodies: a friend is another self. -- Adam Clarke</i>\n\nThe first meeting between David and Jonathan made a deep and tremendous impression on both. There were, perhaps, striking resemblances in their disposition of mind and their innate virtues that so attracted them to each other that they became as one soul and one entity united in friendship. Immediately their hearts welded, and a lasting bond was formed which they further strengthened by a covenant. It was a covenant built upon affectionate love for each other, a solemn agreement to maintain mutual concern and care for each other's interests in life, even after death claimed one of them.\n\nThat hearty love was swiftly and firmly expressed by Jonathan's unselfish bestowing on David his royal gifts, making him one like himself, not only a soldier, but a prince. A sweet mercy of God to David to have such a fast, intimate friend in court to accompany him and advise him on all occasions.\n\nLove is generous and sacrificial, willing to part with anything. The Lord Jesus Christ sealed up His great love for His elect by bestowing Himself and all His benefits upon them and called them His friends. Human friendship is a shadow of divine love. The greatest and best Friend we can have is our Lord. Happy is every one who can say from the heart, \"This is my beloved, and this is my friend\" [Song of Solomon 5:16]. What a Friend we have in Jesus! Such divine friendship ought to be reciprocated by our whole-hearted love.\n\n<b></b>\nFriendship produces an entire sameness; it is one soul in two bodies: a friend is another self. - Adam Clarke\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "26 JULY": "<b><u>26 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 18:5&version=KJV\">1 Samuel 18:5</a>\n\n<b>LESSON</b>\nDavid's wisdom\n\n<b>VERSE 5</b>\n<i>And David went out whithersoever Saul sent him, and behaved himself wisely: and Saul set him over the men of war, and he was accepted in the sight of all the people, and also in the sight of Sauls servants.</i>\n\nThe shepherd-youth, who was ruddy, and withal of a beautiful countenance, and good looking, began to prove himself worthy of the warriorhood given to him [1 Samuel 16:12]. His anointing, his unwavering faith in the God of Israel, his youthful valor, his spectacular triumph over giant Goliath, more than qualify him to be one.\n\nSaul himself, highly pleased with David, entrusted him with the management of various state affairs. Charged with diverse expeditions, even in military undertakings, he managed them with great prudence, courage, and discretion. He was prosperous and successful in whatsoever he engaged in, for the Lord was with him and blessed him. Saul promoted him to a distinguished rank among the officers of his army, of which Abner was the general.\n\nHis demeanor was pure, peaceable, gentle, easy to be entreated, full of mercy and good fruits, without partiality, without hypocrisy [James 3:17] so that he found favour in the sight of all the people, as well as the king's servants, and the courtiers, who are commonly envious, especially of those who have newly found favour with the king.\n\nLet us walk with God, abiding in Him, subjecting our thoughts and plans to Him, communing about all things with Him, talking over our lives with Him before we go out to live them in the presence of our fellows. Then we too shall have this gracious wisdom, which is more moral than intellectual, the product of God's grace rather than human culture. \"So shall the knowledge of wisdom be unto thy soul: when thou hast found it, then there shall be a reward, and thy expectation shall not be cut off \" [Proverbs 24:14].\n\n<b>THOUGHT</b>\nVirtue is very amiable and attractive. - John Trapp\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 47&version=KJV\">JEREMIAH 47</a>\n<a href=\"https://www.biblegateway.com/passage/?search=EPHESIANS 5:1-21&version=KJV\">EPHESIANS 5:1-21</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "27 JULY": "<b><u>27 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 6 had David held in high esteem and gratefulness as</b>\n<i>And it came to pass as their national deliverer. The heart of the king, and they came, when David was that of the army, turned towards the heroic youth returned from the slaughter of with a common feeling of gratitude and love. They the Philistine, that the women were captivated by his gallantry and discretion, as well as his faith in their God. Both in martial skill came out of all cities of Israel, S et and civil administration he excelled and surpassed singing and dancing, to meet king Saul, with tabrets, all the men of his country and was fast becoming a with joy, and with instruments popular idol. . . . of musick. While we recognise the operation of overruling and divine providence in the method of David's elevation, yet it may be regarded as a general social law that men who possess abilities fitting them for prominent and powerful positions among. their fellows, sooner or later find their way to those positions. The generality of men can discern and are willing to acknowledge true greatness in their fellow men, and a man who is worthy of honour will, as a rule, be honoured. To some, God gives special grace to manage To Compete THE BIBLE greater responsibilities so they can fulfil their IN 2 Years, READ calling in the seat of honour. While we all have JEREMIAH 48 different callings, let us walk worthy of the vocation EPHESIANS 5:22-33 wherewith we are called. THOUGHT For promotion cometh neither from the east, nor from the west, nor from the south. But God is the Judge: He putteth down one, and setteth up another. -- Psalm 75:6-7</i>\n\nThis is a characteristic trait of societal manners. On the return of their victorious soldiers' long absence, fighting their battles, defending country, bands of women and children issue from the towns and villages to form triumphal processions celebrating their victory. As they go along, they gratify the return of the soldiers with joyful dancing, instrumental music, and exuberant song.\n\nThe glorious victory over the mighty Philistines had David held in high esteem and gratefulness as their national deliverer. The heart of the king, and that of the army, turned towards the heroic youth with a common feeling of gratitude and love. They were captivated by his gallantry and discretion, as well as his faith in their God. Both in martial skill and civil administration he excelled and surpassed all the men of his country and was fast becoming a popular idol.\n\nWhile we recognise the operation of overruling and divine providence in the method of David's elevation, yet it may be regarded as a general social law that men who possess abilities fitting them for prominent and powerful positions among their fellows, sooner or later find their way to those positions. The generality of men can discern and are willing to acknowledge true greatness in their fellow men, and a man who is worthy of honour will, as a rule, be honoured.\n\nTo some, God gives special grace to manage greater responsibilities so they can fulfil their calling in the seat of honour. While we all have different callings, let us walk worthy of the vocation wherewith we are called.\n\n<b></b>\nFor promotion cometh neither from the east, nor from the west, nor from the south. But God is the Judge: He putteth down one, and setteth up another. - Psalm 75:6-7\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "28 JULY": "<b><u>28 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 18:8-9&version=KJV\">1 Samuel 18:8-9</a>\n\n<b>LESSON</b>\nSaul's envy\n\n<b>VERSE 8</b>\n<i>And Saul was very wroth, and the saying displeased him; and he said, They have ascribed unto David ten thousands, and to me they have ascribed but thousands: and what can he have more but the kingdom?</i>\n\nThe multitudes were quick to recognise the fact that David was the hero of the day. Their instincts led them to honour above the king the man who proved to be better than the king, but they committed a great indiscretion by praising a subject at the expense of their sovereign. This incited envy in Saul. They did not give him the royal title, calling him plain Saul and not king Saul. By his own observance thus - the prudent behaviour of David, his favour with God and men, the commendations of the women, the prophecy of Samuel would soon be fulfilled that the kingdom would be rent from him and given to his neighbour who is better than he.\n\nHow much of hell is there in the temper of an envious man! The happiness of another is his misery; the good of another is his affliction. He looks upon the virtue of another with an evil eye, and is as sorry at the praise of another as if that praise was taken away from himself. Envy makes him a hater of his neighbour, and his own tormentor (Nathaniel Vincent, A Discourse Concerning Love).\n\nMurderous envy! Joseph's brothers wanted to kill him out of envy if not for Rueben's intervention. The chief priests and the Elders in their day sought to kill the Lord Jesus Christ out of envy. Put off any thought of envy, for \"envyings, murders, drunkenness, revellings, and such like: of the which I tell you before, as I have also told you in time past, that they which do such things shall not inherit the kingdom of God\" [Galatians 5:21].\n\n<b>THOUGHT</b>\nEnvy is unjust and unreasonable. \"The cure for the sin of envy and jealousy is to find our contentment in God\" (Jerry Bridges).\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 49&version=KJV\">JEREMIAH 49</a>\n<a href=\"https://www.biblegateway.com/passage/?search=EPHESIANS 6&version=KJV\">EPHESIANS 6</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "29 JULY": "<b><u>29 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 18:10&version=KJV\">1 Samuel 18:10</a>\n\n<b>LESSON</b>\nThe evil spirit from God\n\n<b>VERSE 10</b>\n<i>Alnd it came to pass on the morrow, that the evil spirit from God came upon Saul, and he prophesied in the midst of the house: and David played with his hand, as at other times: and there was a javelin in Sauls hand.</i>\n\nThe seeds of jealousy, envy, and hatred were sown in the heart of Saul. He eyed David not with favour as before but with dislike. In open defiance against God (regarding the prophecy of Samuel), he sought to prevent it from happening and looked upon David as a successor and dangerous rival.\n\nNow the king is consumed with a murderous jealousy under the control of a power higher than himself. He had broken off all communion with God and thus left his soul defenseless and prepared for the presence of the evil spirit. The evil spirit was permitted by God to seize him again [1 Samuel 16:14]. There is an old proverb, \"Satan delights to fish in troubled waters\" and Saul's state of mind gave him many advantages.\n\nWhile God is absolutely sovereign and in full rulership over all the affairs of man and spirit beings, He nevertheless often wills not to have a direct command or control over them, but permits events or providence to work out their own purposes according to His own secret will and divine counsels. A good example is that of Joseph. His brothers treated him wickedly and sold him to Egypt, but it turned out for good, as their household was saved from the famine. Joseph had later looked upon their past evil plot as God sending him before them to preserve them [Genesis 50:20].\n\nAlienation from God brings the devil closer. For what God fills not, the devil will. \"In so far as we indulge in any envy, we lay ourselves open to the evil spirit's influence. Such is the fruit of envy and uncharitableness\" (Wesley).\n\n<b>THOUGHT</b>\nWinning against Satan is not a question of claiming some kind of imagined authority over him; we simply need to pursue righteousness, avoid sin, and stand firm in the truth [1 Timothy 1:18-19; James 4:7; 1 Peter 5:9]. - John MacArthur\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 50&version=KJV\">JEREMIAH 50</a>\n<a href=\"https://www.biblegateway.com/passage/?search=PHILIPPIANS 1&version=KJV\">PHILIPPIANS 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "30 JULY": "<b><u>30 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 18:11-12&version=KJV\">1 Samuel 18:11-12</a>\n\n<b>LESSON</b>\nSaul's first attempt to kill David\n\n<b>VERSE 11</b>\n<i>And Saul cast the javelin; for he said, I will smite David even to the wall with tt. And David avoided out of his presence tnice.</i>\n\nAt his coronation, Saul seemed humble, even shy and fearful to be in the limelight, but now he could not bear the thought of another receiving more praise than he. Saul's jealousy and envy against David eventually boiled over into hatred which led in turn to an open display of hostility against him.\n\nThe same thought process wrought in the heart of Cain. When Cain saw his offering rejected by God while Abel's was accepted, he harboured jealous thoughts. This soon gave way to hatred and God warned him, \"if thou doest not well, sin lieth at the door\" [Genesis 4:7]. Instead of heeding God's warning and repenting of his sin of jealousy, Cain's hatred for Abel led to the act of murder.\n\nThe scribes and Pharisees were also envious of our Lord Jesus. His teaching and miracles drew great crowds, and multitudes followed Him wherever He went because \"He taught them as one having authority, and not as the scribes\" [Matthew 7:29]. Many believed our Lord Jesus so the Pharisees plotted against Him [John 11:47, 53]. Even Pilate saw that the Chief Priests delivered our Lord Jesus to be crucified out of envy [Mark 15:10].\n\nTruly when we indulge in envy, it translates into greater sin. If we harden our hearts and refuse to repent, our harbouring of such feelings of rivalry will lead to hatred of the rival and finally murderous thoughts set in. Let us learn to be humble and gracious to acknowledge the good work others perform at school, at home or in church.\n\n<b>THOUGHT</b>\nFor where envying and strife is, there is confusion and every evil work. - James 3:16\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 51&version=KJV\">JEREMIAH 51</a>\n<a href=\"https://www.biblegateway.com/passage/?search=PHILIPPIANS 2&version=KJV\">PHILIPPIANS 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "31 JULY": "<b><u>31 JULY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 18:13-16&version=KJV\">1 Samuel 18:13-16</a>\n\n<b>LESSON</b>\nDavid's wise conduct\n\n<b>VERSE 14</b>\n<i>And David behaved himself wisely in all his ways; and the LORD was nith him.</i>\n\nSaul banished David from his court and made him a military commander, hoping to sideline him. Yet David \"behaved himself wisely\" and \"the Lord was with him\".\n\nHere is the contrast between Saul and David. Saul, who sought the praise of man, relied on his self-worshipping and self-serving motives to guide his actions. David on the other hand was focused on obeying God and glorifying His name.\n\nAs a young shepherd boy watching over his father's flock, David learned to trust God for daily protection and provision. David walked close to God and trusted God to guide, protect and deliver him from his enemies who sought to kill him [Psalm 31:3-4; 15-16]. David submitted himself to God's will unquestioningly. Saul had been chosen by God to be Israel's king. Even when Saul wanted to kill David, he would not lift his finger against Saul to secure his own safety despite having the opportunity to do so [1 Samuel 26:9- 11]. David by now was anointed to be king after Saul but he would not try to hasten the process. He believed God would preserve him and put him on the throne according to His timing. God granted David wisdom to behave in a manner that pleased Him and glorified His name. This further exposed Saul's godlessness.\n\nWhen we feel oppressed or face difficulties in our relationship with others, let us trust God and submit to His leading. When we obey God, He will protect and guide our steps and our actions will reveal that God is with us.\n\n<b>THOUGHT</b>\nThe LORD is my strength and my shield; my heart trusted in Him, and I am helped: therefore my heart greatly rejoiceth; and with my song will I praise Him. - Psalm 28:7\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=JEREMIAH 52&version=KJV\">JEREMIAH 52</a>\n<a href=\"https://www.biblegateway.com/passage/?search=PHILIPPIANS 3&version=KJV\">PHILIPPIANS 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "1 AUGUST": "<b><u>1 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 18:17-19&version=KJV\">1 Samuel 18:17-19</a>\n\n<b>LESSON</b>\nSaul's proposal\n\n<b>VERSE 17</b>\n<i>And Saul said to David, Behold my elder daughter Merab, her will I give thee to wife: only be thou vahant for me, and fight the LORD'S battles. For Saul said, Let not mine hand be upon him, but let the hand of the Philistines be upon him.</i>\n\nInstead of killing David himself, Saul would send David into battle to be killed by the enemy. Saul's envy and hatred led him to deeper sins - deception and cheating. He never intended for David to marry his daughter but wanted to lure him into a trap. He hoped David would desire so badly the honour of being the king's son-in-law that he would take foolish risks in battle and get himself killed. David, being humble and guileless, counted himself unworthy of such honour and did not fall for Saul's deception. David went into battle to win glory for God's name, not to win the king's daughter in marriage. He just wanted to serve God with his abilities and not curry the king's favour.\n\nSaul ought to have given Merab to be David's wife after his slaying of Goliath [1 Samuel 17:25] but added new conditions now. Finally, Saul reneged on his promise and gave Merab's hand to Adriel instead. Saul hoped to provoke David to discontent and mutiny so that public opinion would turn against him, giving Saul justification to punish him. Yet again, David behaved wisely and waited patiently on the Lord. He was not angered by Saul's dishonesty as he was confident he would receive what God willed for him according to His timing.\n\nWe may encounter people who deviously lay traps in our path, hoping we will stumble and sin against God. May God grant us wisdom to stay clear of these traps by remaining obedient to Him and seeking His glory.\n\n<b>THOUGHT</b>\nBut as for me, my feet were almost gone; my steps had well nigh slipped ... My flesh and my heart faileth: but God is the strength of my heart, and my portion for ever. - Psalm 73:2, 26\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=LAMENTATIONS 1&version=KJV\">LAMENTATIONS 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=PHILIPPIANS 4&version=KJV\">PHILIPPIANS 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "2 AUGUST": "<b><u>2 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 18:20-21&version=KJV\">1 Samuel 18:20-21</a>\n\n<b>LESSON</b>\nSaul's tool -- Michal\n\n<b>VERSE 21</b>\n<i>And Saul said, I will give him her, that she may be a snare to him, and that the hand of the Philistines may be against him. Wherefore Saul said to David, Thou shalt this day be my son in law in the one of the twain.</i>\n\nAll of Israel and Judah loved David as they could discern that he was obedient to God and lived a godly life. Even though Saul hated and feared him, Saul's children, Jonathan and Michal loved David. They acknowledged David's pure love for God, his desire to honour God's name, his patriotism, courage and willingness to fight for the Lord. David's love for his friends must have been evident despite Saul's mistreatment. David would not hurt Jonathan or Michal just to hit back at Saul, despite Saul's malicious acts against him as that would bring shame to God's name.\n\nNow Saul plotted to use Michal's love for David to his advantage. He would let David marry Michal, ostensibly to make up for the earlier lost opportunity to be his son-in-law. This was yet another devious proposal designed to cause David harm. Indeed, none of Saul's proposals was innocent or meant for David's benefit. Perhaps Saul had hoped that Michal would aid him in a future plan to dispose of David. It was only by God's preservation and mercies that Saul's plans came to nought and David prospered instead. Michal would later help David escape Saul's attempt on his life [1 Samuel 19:11- 17] though she had to resort to lies to achieve that.\n\nWe thank God for the reassurance from His Word that He will protect us from the designs of the Evil One if we seek to do His will and honour His name. May we be like David and trust God for His protection.\n\n<b>THOUGHT</b>\nLet them be ashamed and confounded that seek after my soul: let them be turned backward, and put to confusion, that desire my hurt ... Let all those that seek Thee rejoice and be glad in Thee: and let such as love Thy salvation say continually, Let God be magnified. - Psalm 70:2, 4\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=LAMENTATIONS 2&version=KJV\">LAMENTATIONS 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=COLOSSIANS 1&version=KJV\">COLOSSIANS 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "3 AUGUST": "<b><u>3 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 18:22-24&version=KJV\">1 Samuel 18:22-24</a>\n\n<b>LESSON</b>\nSaul's plot\n\n<b>VERSE 22</b>\n<i>And Saul commanded his servants, saying, Commune with David secretly, and say, Behold, the king hath delight in thee, and all his servants love thee: now therefore be the Ring's son in law.</i>\n\nKing Saul instructed his servants to communicate with David saying that he took great pleasure in David and wished to betroth his daughter to him. This was a deceitful lie for in verses 8 and 9 we read that Saul eyed David cynically and suspiciously, out of wrath and envy. Saul meant to hurt David but did not say so outwardly. He used his courtiers as his conduit to communicate his lies. Saul's envy led to deceit and deviousness, and then to attempted murder. We see how one sin begins and soon leads to a whole cluster of other sins, as had happened with Adam and Eve in the Garden.\n\n\"But every man is tempted, when he is drawn away of his own lust, and enticed. Then when lust hath conceived, it bringeth forth sin: and sin, when it is finished, bringeth forth death\" [James 1:14-15]. \"For whosoever shall keep the whole law, and yet offend in one point, he is guilty of all\" [James 2:10].\n\nDavid's discreet and guileless reply revealed the humility and simplicity of his heart. He recognized that becoming the king's son-in-law was no trifling matter. This king was one specially anointed by God and therefore David held him and his office in high esteem. Furthermore, David acknowledged his own poverty and inability to give a dowry for the bride as was the custom of the time. His humility thus kept him from being presumptuous in thinking that he could be worthy of becoming the king's son-in-law.\n\nMark these character traits of David - humility, guilelessness and simplicity of heart. These are traits of the child of God.\n\n<b>THOUGHT</b>\nIt is only in humility, knowing our helpless estate as sinners that we are able to take hold of God's grace of salvation through faith.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=LAMENTATIONS 3&version=KJV\">LAMENTATIONS 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=COLOSSIANS 2&version=KJV\">COLOSSIANS 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "4 AUGUST": "<b><u>4 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 18:25-27&version=KJV\">1 Samuel 18:25-27</a>\n\n<b>LESSON</b>\nNo dowry needed, but...\n\n<b>VERSE 25</b>\n<i>And Saul said, Thus shall ye say to David, The Ring desireth not any dowry, but an hundred foreskins of the Philistines, to be avenged of the Ring' enemies. But Saul thought to make David fall by the hand of the Philistines.</i>\n\nWe see Saul's ulterior motive. His offer of his daughter's hand to David was with the knowledge he would be unable to afford the customary dowry and so he provided an alternative. A hundred enemy foreskins instead would suffice, but Saul in his heart intended for David to be killed in carrying out this impossible endeavour. He wanted David dead but hoped someone else would do it for him so he would not dirty his hands.\n\nYet, David found Saul's proposal acceptable, not because he was bloodthirsty and spoiling for a fight, but because he desired to marry King Saul's daughter [v. 26]. Was David naive in desiring this and taking on such odds? \"The king's heart is in the hand of the LORD, as the rivers of water: He turneth it whithersoever He will\" [Proverbs 21:1]. \"The preparations of the heart in man, and the answer of the tongue, is from the LORD. All the ways of a man are clean in his own eyes; but the LORD weigheth the spirits\" [Proverbs 16:1-2].\n\nKing Saul was devious and deceitful in his wicked plot but the sovereign God is in control of all processes and outcomes including Saul's devices and David's response. He will judge sin and work all things for His children's good and His own glory in spite of man's sinful schemes. David embarked on the mission speedily and returned successfully. He even exceeded the seemingly impossible task by a hundred percent.\n\n<b>THOUGHT</b>\nShew Thy marvellous lovingkindness, O Thou that savest by Thy right hand them which put their trust in Thee from those that rise up against them. - Psalm 17:7\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=LAMENTATIONS 4&version=KJV\">LAMENTATIONS 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=COLOSSIANS 3&version=KJV\">COLOSSIANS 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "5 AUGUST": "<b><u>5 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 18:28-30&version=KJV\">1 Samuel 18:28-30</a>\n\n<b>LESSON</b>\nThe LORD was with David\n\n<b>VERSE 28</b>\n<i>And Saul saw and knew that the LORD was with David, and that Michal Sauls daughter loved him.</i>\n\nDavid was successful in obtaining the prize because the LORD was with him. Saul's plan for David to die in combat had failed for it was directly opposed to the will of the living and true God. David was unharmed and up to the task because the great I AM was guiding his footsteps and actions. This was so obvious even King Saul could see it and feared.\n\n\"There is no wisdom nor understanding nor counsel against the LORD. The horse is prepared against the day of battle: but safety is of the LORD\" [Proverbs 21:30-31]. David's feat was no one-time fluke. We read that David behaved himself more wisely than all the servants of Saul [v. 30]. Endowed with divine wisdom for all to see, David achieved unsurpassed military success against the Philistines. The royal court and even his foes regarded him highly.\n\n\"The LORD\" is God's covenant name revealed to His people meaning \"I Am\" [Exodus 3:14-15] - the Self-existent One. \"The LORD was with\" had been recorded at various times in Scripture for Isaac, Joseph, Joshua, the tribe of Judah, the house of Joseph, the judges raised by God and Samuel. Each time, it described God empowering and blessing His chosen person(s) to obey and carry out His commission. It demonstrates that God is a faithful, covenant-keeping God who raises up His servants, and blesses their service. He is faithful to save His people in His redemption plan and blesses their work, all to His own glory. Because He is the great I AM, we His people are what we are.\n\n<b>THOUGHT</b>\nBut by the grace of God I am what I am. - 1 Corinthians 15:10a\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=LAMENTATIONS 5&version=KJV\">LAMENTATIONS 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=COLOSSIANS 4&version=KJV\">COLOSSIANS 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "6 AUGUST": "<b><u>6 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 1 others did who highly esteemed him? He did. He</b>\n<i>And Saul spake saw what God was doing in David's life and hated to Jonathan his son, it. Why was Saul fearful of David, and harbouring and to all his servants, all these murderous thoughts? that they should kill Davia. \"The wicked, through the pride of his countenance, will not seek after God: God is not in all his thoughts\" [Psalm 10:4]. Saul's sinful pride blinded him. Pride is self-exaltation and opposes the Sovereign God Who exalts whom He will. In going his own way and following his heart, Saul sought the death of another. In seeing God's favour on another, even one who fought for him against his enemies with great success, Saul was jealous and resented God's chosen. Saul opposed David as God's servant because his own heart was not right with God. Scripture repeatedly records rebellious people opposing God's people because their hearts are rebelling against God Himself (Exodus 16:8; 1 Samuel 8:7; Luke 10:16). Ultimately, all opposition to God will fail for To Compete THE BIBLE He is sovereign. The ways of the wicked are self- IN 2 YEARS, READ defeating and lead to death. Only God's way ts true, EZEKIEL 1 life-gtving and always prevails. 1 THESSALONIANS 1 THOUGHT Every knee shall bow to God [Romans 14:11], be it in grateful, humble adoration as a saved sinnet, or as a crushed rebel who rejected the Lord Jesus in this lifetime [Luke 20:17].</i>\n\nSaul feared David all the more and was continually at enmity with him [1 Samuel 18:29]. Instead of meditating on God or His Word, Saul was meditating on murder. He could conceal it no longer for all his schemes had been thwarted by the sovereign providence of God. He explicitly told his servants and even his son to kill David. Saul did not turn to God in repentance but continually brooded in envy and hatred. Did Saul not see David as others did who highly esteemed him? He did. He saw what God was doing in David's life and hated it. Why was Saul fearful of David, and harbouring all these murderous thoughts?\n\n\"The wicked, through the pride of his countenance, will not seek after God: God is not in all his thoughts\" [Psalm 10:4]. Saul's sinful pride blinded him. Pride is self-exaltation and opposes the Sovereign God Who exalts whom He will. In going his own way and following his heart, Saul sought the death of another. In seeing God's favour on another, even one who fought for him against his enemies with great success, Saul was jealous and resented God's chosen. Saul opposed David as God's servant because his own heart was not right with God. Scripture repeatedly records rebellious people opposing God's people because their hearts are rebelling against God Himself (Exodus 16:8; 1 Samuel 8:7; Luke 10:16).\n\nUltimately, all opposition to God will fail for He is sovereign. The ways of the wicked are self- defeating and lead to death. Only God's way is true, life-giving and always prevails.\n\n<b></b>\nEvery knee shall bow to God [Romans 14:11], be it in grateful, humble adoration as a saved sinner, or as a crushed rebel who rejected the Lord Jesus in this lifetime [Luke 20:17].\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "7 AUGUST": "<b><u>7 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 19:4-5&version=KJV\">1 Samuel 19:4-5</a>\n\n<b>LESSON</b>\nEvil for good\n\n<b>VERSE 4</b>\n<i>And Jonathan spake good of David unto Saul his father, and said unto him, Let not the Ring sin against his servant, against David; because he hath not sinned against thee, and because his works have been to thee-ward very good.</i>\n\nUpon hearing King Saul's plan to kill David, Jonathan warned his friend and told him to hide while he tried to persuade his father not to \"do so wickedly.\" First, he reasoned that David had not sinned against him. In fact, his actions towards the King had been \"very good\". Hence to repay David's goodness with evil was sin. Second, he reminded Saul of David's contribution to the nation in slaying the Philistine giant, Goliath; an act through which \"the Lord wrought great salvation for all Israel\". Saul had witnessed it and rejoiced at that time. But Satan had filled Saul's mind with envy and jealousy, causing him to suspect that David had done everything in order to gain popularity and usurp his throne. Again Jonathan warned his father not to \"sin against innocent blood, to slay David without a cause\" [v. 5].\n\nScripture warns against the kind of sin that Saul was about to commit. \"Whoso rewardeth evil for good, evil shall not depart from his house\" [Proverbs 17:13]. In fact, the Lord teaches us to \"Love your enemies, bless them that curse you, do good to them that hate you, and pray for them which despitefully use you, and persecute you\" [Matthew 5:44].\n\nWe can also learn from Jonathan's brave and selfless actions. As heir to the throne, he had much to gain with David out of the way. But this spirit- filled young man knew that \"To him that knoweth to do good, and doeth it not, to him it is sin\" [James 4:17].\n\n<b>THOUGHT</b>\nSin is always lurking \"at the door\" to destroy you. Beware!\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 2&version=KJV\">EZEKIEL 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 THESSALONIANS 2&version=KJV\">1 THESSALONIANS 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "8 AUGUST": "<b><u>8 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 19:6-7&version=KJV\">1 Samuel 19:6-7</a>\n\n<b>LESSON</b>\nJonathan's decision\n\n<b>VERSE 7</b>\n<i>And Jonathan called David, and Jonathan shewed him all those things. And Jonathan brought David to Saul, and he was in his presence, as in times past.</i>\n\nResponding to Jonathan's forceful arguments, Saul was convinced of his unreasonable enmity towards David. He then swore not to kill David. How happy and relieved Jonathan must have been, and he made haste to report the good news to his friend and bring him back to Saul, and David returned to his former duties. What a happy ending - that is if Saul was serious about his vow, and had truly turned away from his sin of jealousy and envy. But that was not the case as we shall learn later.\n\nThe question we would ask is: Was it wise for Jonathan to bring David back to the palace based simply on his father's vow? In so doing, he had endangered his friend's life and brought much misery to them both. Did Jonathan consult the Lord to seek His will as he did before his attack on the Philistine garrison at Michmash recorded in 1 Samuel 14:1-13? It was not recorded that he had consulted the Lord in this latest decision.\n\nLet us not be too quick to judge Jonathan. In his eagerness to believe his father, and desire to be reunited with his best friend, he probably trusted only his conscience and judgement. Is this not something all of us are guilty of every day? The lesson for believers is that we should seek God's direction in all our decisions, big or small; and trust that He is faithful to direct our paths [Proverbs 3:5- 6].\n\n<b>THOUGHT</b>\nIf any of you lack wisdom, let him ask of God, that giveth to all men liberally, and upbraideth not; and it shall be given him. - James 1:5\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 3&version=KJV\">EZEKIEL 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 THESSALONIANS 3&version=KJV\">1 THESSALONIANS 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "9 AUGUST": "<b><u>9 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 19:8-10&version=KJV\">1 Samuel 19:8-10</a>\n\n<b>LESSON</b>\nSaul's second attempt to kill David\n\n<b>VERSE 10</b>\n<i>And Saul sought to smite David even to the wall with the javelin; but he slipped away out of Sauls presence, and he smote the Javelin into the wall: and David fled, and escaped that night.</i>\n\nOnce again war erupted between Israel and the Philistines and David went out to fight them, winning another great victory and killing many of them. Again, David's success aroused jealousy and hatred in Saul's troubled heart and he attempted to kill him. This second attempt also failed, and David escaped and fled that night back to his home. But Saul did not stop there. He sent his henchmen to seek him and finish the job in the morning.\n\nJealousy and pride are frightening sins. They lead to rage and murder. The same \"evil spirit\" drove Cain to murder his brother Abel. God's warning then to Cain, that sin lies at the door, should be something everyone of us should heed. How we ought to guard our hearts because it is from this heart that springs forth evil thoughts, murders, and all sorts of wickedness [Matthew 15:19]. The best antidote to such a jealous spirit is humility. When we put our trust wholly in Christ and let His Holy Spirit take up residence in our heart, humility will be one of the fruits.\n\nThe Lord Himself was the supreme example of humility. \"Who, being in the form of God, thought it not robbery to be equal with God: But made Himself of no reputation, and took upon Him the form of a servant, and was made in the likeness of men: And being found in fashion as a man, He humbled Himself, and became obedient unto death, even the death of the cross\" [Philippians 2:6-8].\n\n<b>THOUGHT</b>\nTake My yoke upon you, and learn of Me; for I am meek and lowly in heart: and ye shall find rest unto your souls. - Matthew 11:29\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 4&version=KJV\">EZEKIEL 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 THESSALONIANS 4&version=KJV\">1 THESSALONIANS 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "10 AUGUST": "<b><u>10 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 12 tactic bought David precious time. But her trick did</b>\n<i>So Michal let David down not fool her father, and when he angrily confronted through a window: and he her, she lied, saying that David had threatened her went, and fled, and escaped life if she did not cooperate. There are many lessons that we can learn from this episode, such as a wife's loyalty to her husband over her father, and Saul's failure to see God's hand at work and thus turn back from his evil ways. But the most important lesson we can learn is David's faith in time of grave danger. Having to flee a second time from a powerful and determined enemy, David turned to his God in prayer. Psalm 59 recorded David's prayer \"when Saul sent, and they watched the house to kill him'. In it, he pleaded his innocence before God. He trusted God and was confident that God would deliver him. That a man in such a precarious situation could utter such a beautiful prayer in praise of his God 1s truly a powerful testimony and a great encouragement to all God's servants through the ages. To CompLete THE BIBLE</i>\n\nIn verse 12, we read the same words as yesterday - that David \"fled and escaped\". Obviously, God was protecting His servant. This time, He did it through another of Saul's children, David's wife Michal. She advised him to flee or he would be dead by morning. She helped him to escape under cover of darkness and then tricked Saul's men into believing that David was sick in bed. This delay tactic bought David precious time. But her trick did not fool her father, and when he angrily confronted her, she lied, saying that David had threatened her life if she did not cooperate.\n\nThere are many lessons that we can learn from this episode, such as a wife's loyalty to her husband over her father, and Saul's failure to see God's hand at work and thus turn back from his evil ways. But the most important lesson we can learn is David's faith in time of grave danger. Having to flee a second time from a powerful and determined enemy, David turned to his God in prayer.\n\nPsalm 59 recorded David's prayer \"when Saul sent, and they watched the house to kill him\". In it, he pleaded his innocence before God. He trusted God and was confident that God would deliver him. That a man in such a precarious situation could utter such a beautiful prayer in praise of his God is truly a powerful testimony and a great encouragement to all God's servants through the ages.\n\n<b></b>\nUnto thee, O my strength, will I sing: for God is my defence, and the God of my mercy. - Psalm 59:17\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 5&version=KJV\">EZEKIEL 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 THESSALONIANS 5&version=KJV\">1 THESSALONIANS 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=THOUGHT Unto thee, O my strength, will I sing: for God is&version=KJV\">THOUGHT Unto thee, O my strength, will I sing: for God is</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=my defence, and the God of my mercy.&version=KJV\">my defence, and the God of my mercy.</a>\n<a href=\"https://www.biblegateway.com/passage/?search=-- Psalm 59:17&version=KJV\">-- Psalm 59:17</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "11 AUGUST": "<b><u>11 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 19:18-20&version=KJV\">1 Samuel 19:18-20</a>\n\n<b>LESSON</b>\nDavid's flight to Ramah\n\n<b>VERSE 20</b>\n<i>And Saul sent messengers to take David: and when they saw the company of the prophets prophesying, and Samuel standing as appointed over them, the Spirit of God was upon the messengers of Saul, and they also prophesied.</i>\n\nIn verse 18 we read for the third time that David \"fled and escaped\". But to where can one flee from the most powerful man in the country? David could only think of Samuel at Ramah. So there he went \"and told him all that Saul had done to him\". He must have pleaded his innocence as Jonathan did for him to Saul in verses 4 and 5, but the king had returned evil for good. He must have recounted his narrow escape and that even as they spoke, Saul's assassins were in pursuit. He desperately needed Samuel's protection. What Samuel did then was interesting. He brought David to a meeting with a group of prophets at Naioth. These men were prophesying, and Samuel was leading and teaching them. They were reading the Scriptures, singing hymns, and praising God, under the inspiration and leading of the Holy Spirit.\n\nWhen the assassins burst onto the scene, the Spirit of God came upon them, and there was simply no way they could continue with their murderous mission. Instead they joined in the \"prayer meeting\". Their experience reminds one of the violent, demon-possessed man that our Lord Jesus healed in Gadarenes. His whole demeanour was changed, and he sat peacefully at the feet of our Lord [Mark 5:15].\n\nIn this journey of life, we will encounter many dangers, both spiritual and physical. The best place to turn for help and protection is the prayer meeting. Here, together with God's people, led by the Holy Spirit, intercession on each other's behalf is made before the heavenly throne of grace.\n\n<b>THOUGHT</b>\n\"In seasons of distress and grief, my soul has often found relief. And oft escaped the tempter's snare, by thy return, sweet hour of prayer!\" - William W. Walford\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 6&version=KJV\">EZEKIEL 6</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 THESSALONIANS 1&version=KJV\">2 THESSALONIANS 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "12 AUGUST": "<b><u>12 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 19:21-24&version=KJV\">1 Samuel 19:21-24</a>\n\n<b>LESSON</b>\nSaul's pretence\n\n<b>VERSE 24</b>\n<i>And he stripped off his clothes also, and prophesied before Samuel in like manner, and lay down naked all that day and all that night. Wherefore they say, Is Saul also among the prophets?</i>\n\nWhen Saul heard that David was with Samuel at Ramah, he sent his men to capture him. Samuel and David were staying at Naioth in Ramah, where the school of prophets was. But the Spirit of God came upon Saul's men and they started prophesying, joining the congregation in worshipping and praising God. When Saul's men did not return, he sent a second group. God's Spirit came upon these men too and they also prophesied. Saul sent a third group, and amazingly, they also started to worship the Lord. Saul decided to go to Ramah himself to hunt down David. Jealousy and pride blinded him. He was so obsessed with killing David; he did not believe that David was under the Lord's special protection.\n\nThen, the Spirit of God came also upon Saul, and he walked along prophesying until he arrived at Naioth. He even shed his royal robes to prophesy in Samuel's presence. He forgot about killing David. He joined the prophets in prayers, singing praises throughout that day and the night.\n\nHow could the Holy Spirit come upon Saul even as he was contemplating and committing his evil acts? This was God's sovereign providence in using His Divine influence to temporarily control the person. In the Old Testament, we read that the Spirit came even upon unbelievers to enable them to do unusual tasks [Numbers 24:2, 2 Chronicles 36:22]. Saul was not worshipping God with his own heart. God had interjected to prevent Saul and his people from harming David.\n\n<b>THOUGHT</b>\nSing praises to our Almighty God for repeatedly protecting His people. The Lord is my refuge and my fortress: my God; in Him will I trust. Read Psalm 91.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 7&version=KJV\">EZEKIEL 7</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 THESSALONIANS 2&version=KJV\">2 THESSALONIANS 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "13 AUGUST": "<b><u>13 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 20:1&version=KJV\">1 Samuel 20:1</a>\n\n<b>LESSON</b>\nDavid's perplexity\n\n<b>VERSE 1</b>\n<i>And David fled from Naioth in Ramah, and came and said before Jonathan, What have I done? what 1s mine iniquity? and what ts my sin before thy father, that he seeketh my life?</i>\n\nIn the previous chapter, we saw how God protected David from the painful sword of Saul multiple times. It was clear to David that Saul was hostile. However, David was perplexed by Saul's murderous intent towards him. So, David sought Jonathan, Saul's son, to ask what he had done wrong. He was not sure why Saul wanted so badly to take his life.\n\nDavid confided in Jonathan his distress and perplexity. Despite the fact that Saul had tried to kill him, David still held great respect for the king and great love for Jonathan, his faithful friend. David reverenced Saul for he was God's anointed king for Israel. David knew he would be the next king but he was content to wait for God's timing. He harboured no intention to harm Saul nor snatch his throne but had faithfully served him. He was so distraught with Saul's malicious designs that he penned many psalms to pour out his fears. He waited patiently for the Lord and turned to Him for hope and comfort, knowing that God alone is the true source of healing and protection.\n\nWhenever we are confused or troubled, look up to the Lord for He will not neglect us. When we face trials, God's faithful help and love for us will quieten our hearts and give us confidence. Sing praise to the Lord for His everlasting love and eternal salvation for us. Pray for His deliverance. Wait upon the Lord, be strong and trust Him always.\n\n<b>THOUGHT</b>\nThe Lord is my light and my salvation; whom shall I fear? - Psalm 27:1a\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 8&version=KJV\">EZEKIEL 8</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 THESSALONIANS 3&version=KJV\">2 THESSALONIANS 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "14 AUGUST": "<b><u>14 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 20:2-3&version=KJV\">1 Samuel 20:2-3</a>\n\n<b>LESSON</b>\nJonathan's commitment\n\n<b>VERSE 2</b>\n<i>And he said unto him, God forbid; thou shalt not de: behold, my father will do nothing either great or small, but that he will shew it me: and why should my father hide this thing from me? it 1s not so.</i>\n\nJonathan was not convinced that his father wanted to take David's life. He believed his father would let him in on his moves and not hide anything from him nor do any harm to David.\n\nDavid however reasoned that his closeness to Jonathan would be the reason Saul would not divulge all to his son. So, David made an oath with Jonathan to let him see for himself and reveal Saul's malevolent intentions. In David's perception, death was only a step away, and inevitable. But in this moment of fear and uncertainty, David knew he could count on Jonathan's help; and Jonathan committed himself to David. Jonathan had earlier covenanted with David [1 Samuel 18:3]. The covenant between these two good friends was not just between two men but also before God and would not be broken easily by adversity. It encompassed a steadfast love, compassion, faithfulness, and loyalty, just as God had covenanted with His people.\n\nThe text here extends its comfort to God's people. In confusion and trouble, we can depend on Him Who has made a covenant with us to be our protector and comforter in times of need. God will never forsake those who seek him. Take time to read and meditate upon God's Word, never stop praying and asking the Lord to renew our spirit.\n\n<b>THOUGHT</b>\nIn times of uncertainty and anxiety, seek God's Word to fill us with peace. Rest securely in His refuge and savour the joy of His salvation. Enjoy the certainty of the Lord's presence and goodness. Be still and know that He is God.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 9&version=KJV\">EZEKIEL 9</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 TIMOTHY 1&version=KJV\">1 TIMOTHY 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "15 AUGUST": "<b><u>15 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 4 to help in any way as David desired.</b>\n<i>Then said What do we desire? How do our desires fit with Jonathan unto David, God's will? As fallen people living in a fallen world, Whatsoever thy soul desireth, we know what it is to have desires. We experience I nill even do it for thee. physical pain, witness injustice, suffer trials and ache with loneliness and grief. Even when all is well, our minds imagine how wonderful it would be if we just had a bit more. Most people desire good things: job, spouse, healing, children, friends, ministry, and rest. The challenge we face daily is not whether we have desires, but to be able to discern when our desires change from hopeful longings to covetous cravings. God is the ultimate human desire because God alone can satisfy our longings. The life of faith means nurturing the desire to seek God and His ways through His Word and fellowship with Him. And the life of faith also means turning away from carnal desires, that is, the desire for selfish gain and vain pursuits. To CompLete THE BIBLE</i>\n\nDavid affirmed that his life was in danger. Jonathan realised how serious David was. He could see that David was distressed and fearful. Sanctified friendships are God's helping hand and His means of guidance. Such lead us always to Him and never away from Him. Jonathan reassured David, bringing encouragement and an offer of help to one greatly discouraged. Jonathan knew David's heart was in the right place, and he offered to help in any way as David desired. What do we desire? How do our desires fit with God's will? As fallen people living in a fallen world, we know what it is to have desires. We experience physical pain, witness injustice, suffer trials and ache with loneliness and grief. Even when all is well, our minds imagine how wonderful it would be if we just had a bit more. Most people desire good things: job, spouse, healing, children, friends, ministry, and rest. The challenge we face daily is not whether we have desires, but to be able to discern when our desires change from hopeful longings to covetous cravings. God is the ultimate human desire because God alone can satisfy our longings. The life of faith means nurturing the desire to seek God and His ways through His Word and fellowship with Him. And the life of faith also means turning away from carnal desires, that is, the desire for selfish gain and vain pursuits.\n\n<b></b>\nA true Christian desires to be free from sin, not sin freely.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 10&version=KJV\">EZEKIEL 10</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 TIMOTHY 2&version=KJV\">1 TIMOTHY 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=THOUGHT A true Christian desires to be free from sin, not&version=KJV\">THOUGHT A true Christian desires to be free from sin, not</a>\n<a href=\"https://www.biblegateway.com/passage/?search=sin freely.&version=KJV\">sin freely.</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "16 AUGUST": "<b><u>16 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 20:5-8&version=KJV\">1 Samuel 20:5-8</a>\n\n<b>LESSON</b>\nDavid's request\n\n<b>VERSE 6</b>\n<i>Tf thy father at all miss me, then say, David earnestly asked leave of me that he might run to Bethlehem his city: for there ts a yearly sacrifice there for all the famuly.</i>\n\nDespite Jonathan's assurances, David feared for his life and out of that fear sprang his first lie! David pushed Jonathan into a position of compromise by fabricating a story about his absence from the New Moon Festival, in order to observe Saul's reaction to David's absence at the important feast. How would Saul react? Would he accept the reason, or would he take offence at David's absence? What drove David to make such a request?\n\nDavid should not have feared, but he did. Neither should we fear, but we do. When circumstances turn against us, we too can lose perspective and succumb to fear. The circumstances of life become far more real and threatening to us than the abiding presence of God.\n\nIt is so easy to fall back on our own resources or rely on past experiences. Instead of looking up to God, we look around at our situation and our heart fills with fear, and we sin. Instead of pausing to consult with God for a solution, David moved to enlist Jonathan into sin. What causes you to panic? Has your relationship with God grown cold? When we are thrust into uncertainties and problems of life, is our faith overcome by fear? When God examines our heart, does He see a heart that relies on Him or one that puts faith in our own inadequate resources? How is your relationship with our Lord Jesus?\n\nIf God has put you in some dark place and allowed some trial upon you, it is not to drive you into sin but to deliver you, by bringing you to surrender self and commit to His will.\n\n<b>THOUGHT</b>\nFear is always the enemy of faith.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 11&version=KJV\">EZEKIEL 11</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 TIMOTHY 3&version=KJV\">1 TIMOTHY 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "17 AUGUST": "<b><u>17 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 20:9-10&version=KJV\">1 Samuel 20:9-10</a>\n\n<b>LESSON</b>\nJonathan's promise\n\n<b>VERSE 9</b>\n<i>And Jonathan said, Far be it from thee: for if I knew certainly that evil were determined by my father to come upon thee, then would not I tell wt thee?</i>\n\nJonathan promised to tell David if Saul reacted angrily as David expected he would. Jonathan would be faithful to their covenant friendship. He would get word to his bosom friend without fail.\n\nJonathan showed us the values and qualities of true friendship. He knew the sanctity of the covenant and the vitalness of keeping promises made. Proverbs 18:24 tells us that Christians ought to be the best friends anyone can have.\n\nWhat is important to you in a covenant of friendship? What gifts do you bring to this friendship? Jonathan understood the importance of the covenant relationship. Likewise, the covenant is vital to our relationship with God because the Bible tells us that He is a God of the covenant. God always keeps His Word, and His Word is unchanging. People change their minds, reinterpret their words, and forget their commitments when it is expedient to do so. God is not so. He wants us to remember that He always keeps His commitments--so we can trust Him always!\n\nBase your life on God's unchanging Word. Seek to be a person who keeps your word and is faithful in your relationship with God and with others. Let our promises be true. Let us never lose sight of our Redeemer as we walk toward Him, one imperfect step after another.\n\n<b>THOUGHT</b>\nKnow therefore that the LORD thy God, He is God, the faithful God, which keepeth covenant and mercy with them that love Him and keep His commandments to a thousand generations. - Deuteronomy 7:9\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 12&version=KJV\">EZEKIEL 12</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 TIMOTHY 4&version=KJV\">1 TIMOTHY 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "18 AUGUST": "<b><u>18 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 20:11-13&version=KJV\">1 Samuel 20:11-13</a>\n\n<b>LESSON</b>\nJonathan's prayer\n\n<b>VERSE 13</b>\n<i>The Lord do so and much more to Jonathan: but if it please my father to do thee evil, then I will shew it thee, and send thee away, that thou mayest go in peace: and the Lord be with thee, as he hath been with my father.</i>\n\nThe friendship of Jonathan and David was not just something they chose. God made them friends, so that David could become Israel's king. That was why Jonathan prayed, asking God to be his witness with David, to support him and ensure his safety. Jonathan regarded himself responsible to God. His heart was characterised by love, loyalty, and accountability.\n\nRomans 14:12 tells us that God holds us accountable and 1 Corinthians 12:12-14 reminds us that Christians are many members in one body. This underlines the importance of accountability among believers. Accountability reminds that it is natural to be in constant need of God's grace. Accountability is a gentle coming alongside our brethren, praying, knowing, and being concerned about them. Ultimately, accountability is a means by which God draws us, through the friendship and fellowship of others, to Himself. Sharing and caring about others will teach us how to cast our cares on God. It is a vital aspect of the Christian's walk with the Lord.\n\nAll around us are people who need encouragement. A timely word, a phone call, a prayer can bolster their faith in Jesus. We can come alongside others and be there for one another.\n\nAre you accountable? Do you have a friend to whom you can go? Will that person hold you accountable in your spiritual walk? Are you a person whom others can come to when they seek accountability? Can we be such a friend?\n\n<b>THOUGHT</b>\nBrethren, if a man be overtaken in a fault, ye which are spiritual, restore such an one in the spirit of meekness; considering thyself, lest thou also be tempted. - Galatians 6:1\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 13&version=KJV\">EZEKIEL 13</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 TIMOTHY 5&version=KJV\">1 TIMOTHY 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "19 AUGUST": "<b><u>19 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 20:14-15&version=KJV\">1 Samuel 20:14-15</a>\n\n<b>LESSON</b>\nJonathan's request\n\n<b>VERSE 15</b>\n<i>But also thou shalt not cut off thy kindness from my house for ever: no, not when the LORD hath cut off the enemies of David every one from the face of the earth.</i>\n\nJonathan was a man with many gifts. He was the crown prince, he feared God, and he was a brave warrior and leader. Yet despite all these, he was not puffed up with arrogance. He believed God would bring His will to pass, and that David would ultimately become the next king of Israel. Unlike his father, he would not attempt to thwart the Lord's will by harming David. He kept his covenant friendship with David [1 Samuel 18:3] and agreed to intercede with Saul on David's behalf.\n\nAt the same time, we also see Jonathan's faith in the omnipotent God. No matter the odds against David, Jonathan was certain that God would put him on the throne. Notice his language when asking David to remember his house - it was not a matter of \"if \", but \"when\". He spoke with such assurance of God's work, it must have encouraged David during this troubling time as well.\n\nSimilarly for Christians today, God has assured us that all things work together for good to them that love God [Romans 8:28]. This is an oft-quoted verse that God's people use to encourage one another. Yet, we may have noticed at times it does not seem to comfort those who need it. When we encourage others in the Lord, do we truly believe what we say? If we are merely doling out platitudes without genuine faith conviction, then that comfort we provide is scarce comfort indeed.\n\n<b>THOUGHT</b>\nHow can I show God's faithfulness to others during the times when all they see is darkness?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 14&version=KJV\">EZEKIEL 14</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 TIMOTHY 6&version=KJV\">1 TIMOTHY 6</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "20 AUGUST": "<b><u>20 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 20:16-17&version=KJV\">1 Samuel 20:16-17</a>\n\n<b>LESSON</b>\nCovenant between friends\n\n<b>VERSE 17</b>\n<i>And Jonathan caused David to swear again, because he loved him: for he loved him as he loved his own soul.</i>\n\nThe world today is filled with contracts. These serve a multitude of purposes - from the movement of goods to ensuring peace and stability between nations. Yet one commonality exists across all secular contracts - self-interest. No secular man will enter willingly into a legal and binding contract which brings him no benefit.\n\nIn contrast, we see how God continually makes \"contracts\" with man that benefit only sinful men, to the extent of giving the greatest blessing of all - God in our Lord Jesus Christ paying the price of sin on behalf of sinners to bring us out of darkness into His marvellous light. We can see the difference between agreements made by the world and the covenants contained in Scripture.\n\nIn today's verses, it is recorded that Jonathan made a covenant with David. There seems to be some practical \"benefits\" to this covenant since Jonathan obtained a promise from David that his household would be cared for when David was king. Yet, the Holy Spirit, Who knows the heart of man, has seen fit to reveal the deeper reason why Jonathan desired this covenant - because Jonathan loved David, and desired that their friendship may continue to their future generations.\n\nWhat a contrast with the contracts made by the world. Worldly contracts appear to be seeking something that benefits mutually, but really each party is filled only with self-love, self-service and self-interest. Here, Jonathan appeared to seek an agreement that benefits his posterity, but in fact he did so out of a true love for David.\n\n<b>THOUGHT</b>\nDo I love my neighbour as myself ?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 15&version=KJV\">EZEKIEL 15</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 TIMOTHY 1&version=KJV\">2 TIMOTHY 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "21 AUGUST": "<b><u>21 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 39 well that his father was out to kill David, Jonathan</b>\n<i>But the lad knew not was nonetheless resolved in going all out to help anything: only Jonathan and David. This is a friend who sticks closer than a David knew the matter. brother [Proverbs 18:24]. \"True friendship rests on a firm basis, and 1s able to silence ambition, self-love, and undue regard for others. But who can fully understand the love of Jesus, who gave himself as a sacrifice for rebellious, polluted sinners! How great then ought to be the force and effects of our love to him, to his cause, and his people!' -- Matthew Henry The words of our Lord should be our guiding light. If we claim to be Christ's disciple, we must walk as He walked on earth and speak as He spoke. In other words, we must \"walk the talk'. That is what Jonathan's selfless love for David is. He took good care of David every step of the way. Later on we see that David would be true to his promise concerning Jonathan's posterity. Let us be that kind of friend who sticks closer than a brother. To Complete THE BIBLE</i>\n\nWe read of a very unusual friendship between friends. What makes it unique is the fact that one is royalty, the other a fugitive. The mutual trust between David and Jonathan surpassed even family ties. Jonathan was not jealous that David would be king after his father.\n\nDavid's safety was planned out in detail by Jonathan. What a wonderful example of selfless, thoughtful lovingkindness in a friend. Knowing full well that his father was out to kill David, Jonathan was nonetheless resolved in going all out to help David. This is a friend who sticks closer than a brother [Proverbs 18:24].\n\n\"True friendship rests on a firm basis, and is able to silence ambition, self-love, and undue regard for others. But who can fully understand the love of Jesus, who gave himself as a sacrifice for rebellious, polluted sinners! How great then ought to be the force and effects of our love to him, to his cause, and his people!\" - Matthew Henry\n\nThe words of our Lord should be our guiding light. If we claim to be Christ's disciple, we must walk as He walked on earth and speak as He spoke. In other words, we must \"walk the talk\". That is what Jonathan's selfless love for David is. He took good care of David every step of the way. Later on we see that David would be true to his promise concerning Jonathan's posterity. Let us be that kind of friend who sticks closer than a brother.\n\n<b></b>\nA man that hath friends must shew himself friendly: and there is a friend that sticketh closer than a brother. - Proverbs 18:24\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 16&version=KJV\">EZEKIEL 16</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 TIMOTHY 2&version=KJV\">2 TIMOTHY 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=THOUGHT A man that hath friends must shew himself&version=KJV\">THOUGHT A man that hath friends must shew himself</a>\n<a href=\"https://www.biblegateway.com/passage/?search=friendly: and there is a friend that sticketh closer&version=KJV\">friendly: and there is a friend that sticketh closer</a>\n<a href=\"https://www.biblegateway.com/passage/?search=than a brother. -- Proverbs 18:24&version=KJV\">than a brother. -- Proverbs 18:24</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "22 AUGUST": "<b><u>22 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 20:23&version=KJV\">1 Samuel 20:23</a>\n\n<b>LESSON</b>\nThe Lord be between thee and me\n\n<b>VERSE 23</b>\n<i>And as touching the matter which thou and I have spoken of, behold, the LORD be between thee and me forever.</i>\n\nContinuing with this special friendship of David and Jonathan, we read today the latter emphasising the eternal bond between them. Not only was the covenant made between two individuals, it would encompass their families as well. And as usual, Jonathan parted from David with caring words.\n\nThe Lord was the witness to their covenant. God is also the revenger of those who break their covenants. The conversation which took place in the field was a poignant one. Both were men of faith putting their trust in Jehovah and hence their mutual affection. Jonathan also was deeply conscious of David's destiny as the Lord's anointed. Such friendship was a supernatural bond between David and Jonathan. And this was in stark contrast to Saul's depraved heart which made him willing even to harm his own son.\n\nSo Jonathan caused David to make a covenant with him, for he loved him as he loved his own soul. Sad to say, Jonathan had to taste his father's anger. Vicious were Saul's words to his own son, and in wrath he threw a spear at him.\n\nHow this illustrates Satan's hatred, both against our Lord and those who are one with Him, as David and Jonathan were one. In your life, do you have a faithful and trustworthy friend? If so, thank God for such friendship. If not, is it because of your wishy-washy attitude? Pray and ask the Lord to help us to be like Him, selfless in our relationship with othets.\n\n<b>THOUGHT</b>\nAre you a trustworthy or a fair-weather friend?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 17&version=KJV\">EZEKIEL 17</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 TIMOTHY 3&version=KJV\">2 TIMOTHY 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "23 AUGUST": "<b><u>23 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 20:24-29&version=KJV\">1 Samuel 20:24-29</a>\n\n<b>LESSON</b>\nFriendship tested\n\n<b>VERSE 28</b>\n<i>And Jonathan answered Saul, David earnestly asked leave of me to go to Bethlehem:</i>\n\n\"Blood is thicker than water\" is the conventional wisdom of the world. Many today, Christians and non-Christians alike, will agree that family is one of the highest priorities in life. Here, however, we read about a conflict between family and friend. Jonathan was caught in such a dilemma, having to choose between loyalty to his father or his friend. He had to choose between risking his father's wrath and saving David's life.\n\nThere was also the struggle between what he stood to gain or lose. In helping David, Jonathan would be giving up the opportunity to secure his position as heir to the throne. Yet, Jonathan chose David over family and personal benefit. He chose to do what was right. He had interceded on behalf of David once in the past [1 Samuel 19:1-7], and was willing to do so again, even though he would incur the wrath of the king.\n\nThis is the kind of friendship that Christians ought to have with one another. When we acknowledge God as our Heavenly Father, we are inducted into a new family - one that is not bound by kinship, but by the common bond of love for God which manifests itself also in how we love one another. When we behave thus, we obey Christ's command in John 13:35: \"By this shall all men know that ye are My disciples, if ye have love one to another.\"\n\nThis also serves as a testimony to unbelievers. While some will take offence at how Christians prioritise fellow brethren over family, others will see that there is something special about the God we worship, and how He unites His people.\n\n<b>THOUGHT</b>\nHow have I shown love to others in Christ's family?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 18&version=KJV\">EZEKIEL 18</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 TIMOTHY 4&version=KJV\">2 TIMOTHY 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "24 AUGUST": "<b><u>24 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 20:30-33&version=KJV\">1 Samuel 20:30-33</a>\n\n<b>LESSON</b>\nIs blood thicker?\n\n<b>VERSE 31</b>\n<i>For as long as the son of Jesse liveth upon the ground, thou shalt not be established, nor thy kingdom. Wherefore now send and fetch him unto me, for he shall surely dhe.</i>\n\nSaul declared that he sought David's life because he saw him as a threat to his family's dynasty as rulers of Israel. He persuaded Jonathan regarding the necessity of eliminating this \"threat\" with a reasoning that can be understood by any worldly person. However, despite Saul's emphasis on \"family ties\", Jonathan was unmoved for two reasons. First, Jonathan knew it was unjust for Saul to seek David's life - \"what hath he done?\" [v. 32]. Second, Jonathan knew it was God's will that David would be king and not himself [1 Samuel 23:17]. In accord with that will of God and the righteousness of the law, Jonathan stood up to his father and advocated for David, incurring his father's anger.\n\nThis is a great example for us to follow. Being in a conservative Asian society, family harmony is highly valued. At times, this may put Christians in difficult situations when they have to choose between honouring their parents or spouse or wishes of the extended family and honouring God. Worse still, the Christians may be seen as betraying their family when God is chosen above the family. Let us remember that putting God first is the right thing to do.\n\nOur Lord says in Luke 14:26, \"If any man come to me, and hate not his father, and mother, and wife, and children, and brethren, and sisters, yea, and his own life also, he cannot be My disciple.\" We are to love God more than our family.\n\n<b>THOUGHT</b>\nHas family become an idol in my walk with God?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 19&version=KJV\">EZEKIEL 19</a>\n<a href=\"https://www.biblegateway.com/passage/?search=TITUS 1&version=KJV\">TITUS 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "25 AUGUST": "<b><u>25 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 20:34&version=KJV\">1 Samuel 20:34</a>\n\n<b>LESSON</b>\nRighteous anger and genuine grief\n\n<b>VERSE 34</b>\n<i>So Jonathan arose from the table in fierce anger, and did eat no meat the second day of the month: for he was grieved for David, because his father had done him shame.</i>\n\nAnger is an emotion that no one enjoys. Christians tend to associate anger with sin and a lack of temperateness. Yet, we have examples of righteous anger in the Bible - Christ was angry when He cleansed the temple [Mark 11:15-17]. Today, we see another example of godly, righteous anger. Jonathan was angry with Saul for disobeying the Word of God, and for his refusal to listen to reason. Let us examine a few notable characteristics of \"righteous\" anger.\n\nEven though Jonathan was angry, he did not sin. He could have displayed his displeasure by giving Saul a scathing reply, instead he removed himself from the situation. Jonathan did not allow his anger to translate into sinful action. It is not sinful to feel angry. However, we must be careful that our anger does not result in sinful actions [Ephesians 4:26]. Instead, we can learn from Jonathan and remove ourselves from the situation until we regain our composure and control.\n\nNext, we see that righteous anger is accompanied by righteous grief. Jonathan was grieved because David had been wronged by his father. Surely, Jonathan would also have been grieved by his father's refusal to obey God. This is another indication that what we feel is righteous anger. Is it accompanied by a holy grief ? If our anger stems from reasons that allude to ourselves, then it is selfish pride and sinful. If indignation stems from a sense that God has been offended, then perhaps it is closer to righteous anger.\n\n<b>THOUGHT</b>\nAm I angry because I have been offended, or because God has been wronged?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 20&version=KJV\">EZEKIEL 20</a>\n<a href=\"https://www.biblegateway.com/passage/?search=TITUS 2&version=KJV\">TITUS 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "26 AUGUST": "<b><u>26 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 20:41-42&version=KJV\">1 Samuel 20:41-42</a>\n\n<b>LESSON</b>\nJonathan's benediction\n\n<b>VERSE 42</b>\n<i>And Jonathan said to David, Go in peace, forasmuch as we have sworn both of us in the name of the LORD, sayzng, The LORD be between me and thee, and between my seed and thy seed for ever. And he arose and departed: and Jonathan went into the city.</i>\n\nAt this meeting, Jonathan and David did not know when they would next see each other. The times ahead would be especially difficult for David, and Jonathan did not know how David would be. Yet we see that Jonathan knew physical concerns were not the principal thing. He bid David to go on his journey in peace, reminding him of God's abiding presence. More than that, he reminded David to have faith in God. Even though the road ahead seemed dark, dangerous and unknown, Jonathan proclaimed a benediction with a confidence that David would survive this time of tribulation, and his descendants would prevail. This was great spiritual encouragement for his friend.\n\nWhat do we focus on when we encourage others? Often, it is easy for us to become caught up in the worries that everyone has - concerns about physical provision, place to stay, or job opportunity. However, let us be reminded that we have a great God who can meet all these needs and more. He has promised that He will take care of all our needs on earth [Matthew 6:25-31].\n\nRather than focusing on these, we should encourage others to be more concerned about their spiritual state [Matthew 6:33]. Oftentimes, as we expend ourselves trying to meet all our physical needs, we end up giving spiritual matters a lower or no priority. Let us remember that God should come first.\n\n<b>THOUGHT</b>\nBut seek ye first the kingdom of God, and His righteousness; and all these things shall be added unto you. - Matthew 6:33\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 21&version=KJV\">EZEKIEL 21</a>\n<a href=\"https://www.biblegateway.com/passage/?search=TITUS 3&version=KJV\">TITUS 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "27 AUGUST": "<b><u>27 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 21:1-2&version=KJV\">1 Samuel 21:1-2</a>\n\n<b>LESSON</b>\nDavid's lie\n\n<b>VERSE 2</b>\n<i>And David said unto Abimelech the priest, The king hath commanded me a business, and hath said unto me, Let no man know any thing of the business whereabout I send thee, and what I have commanded thee: and I have appointed my servants to such and such a place. To COMPLETE THE BIBLE</i>\n\nDavid, now being pursued by the intensely jealous and irrational king, and a fugitive, famished and unarmed, fled for his life to Nob, the city of the priests, situated north of Jerusalem. After Shiloh was destroyed by the Philistines, the Tabernacle had been moved to Nob, even though the ark still remained at Kirjath-jearim [1 Samuel 7:2; 2 Samuel 6:23]. When Samuel withdrew as Saul's priest and prophet, Ahimelech had taken over the role of spiritual advisor. He was the great grandson of Eli [1 Samuel 14:3; 22:9]. David sought to receive help and divine guidance from Ahimelech who resided there.\n\nDavid's sudden appearance without military escort frightened Ahimelech greatly. When asked why he was travelling alone, David lied. He claimed he was on a secret mission for the king, and his men would meet him later at another place. This lie, seeming to serve the need of the present situation, would result eventually in a terrible tragedy for the priests. David's lie was pathetic and showed his desperation. Perhaps this was the feeling Abraham had when he lied to Pharaoh about Sarah [Genesis 12:13].\n\nScripture commands us to tell the truth and warns about the consequences of lying. The Lord Jesus is our example: He \"did no sin, neither was guile found in His mouth\" [1 Peter 2:22]. We must always speak the truth in love [Ephesians 4:15]. \"Though ingenious falsehood may seem to promote present security, yet they secure future disgrace\" (AW Pink).\n\n<b>THOUGHT</b>\nLying lips are abomination to the Lord: but they that deal truly are his delight. - Proverbs 12:22\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 22&version=KJV\">EZEKIEL 22</a>\n<a href=\"https://www.biblegateway.com/passage/?search=PHILEMON&version=KJV\">PHILEMON</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "28 AUGUST": "<b><u>28 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 21:3-6&version=KJV\">1 Samuel 21:3-6</a>\n\n<b>LESSON</b>\nNo common bread\n\n<b>VERSE 4</b>\n<i>Alnd the priest answered David, and said, There 1s no common bread under mine hand, but there ts hallowed bread; if the young men have Rept themselves at least from women.</i>\n\nDavid, in his plea of necessity, asked Ahimelech for five loaves of bread for himself and his men, desperate with hunger. The pitiful and destitute condition of the priesthood was evidenced by the fact that there was no common bread available, only \"hallowed\" bread kept on the table of shewbread in the Tabernacle. Twelve freshly-baked loaves were placed there each sabbath by the priests. The old bread was not removed until the new bread was ready [v. 6]. According to the ceremonial law, the week-old loaves of bread were removed on the Sabbath to be eaten by the priests [Leviticus 25:5-7]. This was a remarkable provision for those who ministered before God.\n\nAhimelech, influenced by David's character and position, persuaded by compassion for his need, and as well as loyalty to the king, was moved to give the hallowed loaves to David on condition the men accompanying him on this supposed mission were ceremonially clean. David assured the priest that they had kept themselves from women three days since they came out, so his men were in that respect, pure [v. 4].\n\nThis incident of David eating the priests' shewbread would be vindicated later by the Lord Jesus Christ in Matthew 12:1-13 when He used it to counter the arguments of the Pharisees who charged Him for breaking the sabbath law. Our Lord used it to rebuke the Pharisees for their legalism.\n\n<b>THOUGHT</b>\nThat every one of you should know how to possess his vessel in sanctification and honour. - 1 Thessalonians 4:4\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 23&version=KJV\">EZEKIEL 23</a>\n<a href=\"https://www.biblegateway.com/passage/?search=HEBREWS 1&version=KJV\">HEBREWS 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "29 AUGUST": "<b><u>29 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 21:7&version=KJV\">1 Samuel 21:7</a>\n\n<b>LESSON</b>\nDoeg\n\n<b>VERSE 7</b>\n<i>Now a certain man of the servants of Saul was there that day, detained before the Lord; and his name was Doeg, an E.domute, the chiefest of the herdmen that belonged to Saul.</i>\n\nDoeg the Edomite, an influential man, \"the chiefest of the herdmen that belonged to Saul\", probably came over to Saul, in his war with Edom [1 Samuel 14:47]. That day he was at the tabernacle in Nob \"detained before the LORD\" for some religious reason perhaps for a period of purification, discipline or fulfilment of a vow to be completed. In that sacred sanctuary, he was like a wolf in sheep's clothing, and unfortunately, he witnessed Ahimelech providing David with the shewbread and handing him Goliath's sword which was kept there.\n\nIn the following chapter, Doeg would report to Saul that Ahimelech had petitioned God for David, even providing provisions and a weapon. David, the man after God's own heart, was betrayed by Doeg, a man after Saul's own heart. Ahimelech was summoned immediately. Even though the priest had not known that David had fallen out with Saul, the king demanded their death for conspiring against him in not reporting David's whereabouts [1 Samuel 22:6-8].\n\nWhen the soldiers refused to kill the LORD's anointed priests on Saul's command, Doeg acted with demonic lunacy and killed 85 priests, as well as all the people and animals in Nob [1 Samuel 22:18- 19].\n\nFor Doeg, the favour of Saul and what he might gain by it, was more important than the lives of God's servants, the innocent priests and their households. Today, few will commit murder and take innocent lives; however, many still delight in spreading rumours that ruin reputations. These fail to consider that in many ways, a man's good name is his life.\n\n<b>THOUGHT</b>\nAbstain from all appearance of evil. - 1 Thessalonians 5:22\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 24&version=KJV\">EZEKIEL 24</a>\n<a href=\"https://www.biblegateway.com/passage/?search=HEBREWS 2&version=KJV\">HEBREWS 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "30 AUGUST": "<b><u>30 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 21:8-9&version=KJV\">1 Samuel 21:8-9</a>\n\n<b>LESSON</b>\nThe sword of Goliath\n\n<b>VERSE 9</b>\n<i>Alnd the priest said, The sword of Golath the Philistine, whom thou slewest in the valley of Elah, behold, it 1s here wrapped in a cloth behind the ephod: if thou wilt take that, take i: for there ws no other save that here. And David said, There ts none like that; give it me. To COMPLETE THE BIBLE</i>\n\nDavid asked Ahimelech, \"Is there not here under thine hand spear or sword?\" He was alleging that his hasty departure had prevented him from bringing his own weapons.\n\nOutside the army, swords were not commonly found in Israel and there was none in the tabernacle except the sword of Goliath, the godless Philistine giant whom David had famously slew in the valley of Elah. Now his sword was carefully preserved in a place of honour behind the sacred ephod, as a memorial of the LORD's goodness to His people but Ahimelech acceded to David's request for it. David remarked, \"There is none like that; give it me\" [v. 9b]. If Goliath's sword is precious and wonderful, how much more true and valuable is the sword of the Spirit - God's Word. We should be even quicker in saying \"There is none like that; give it me\"!\n\nThat sword was to David a reminder of his great achievement, a token of the fearless deed he had carried out in singleness of heart, a testimony of God's certain help in answer to faith and a memory of His grace received in a time of grave danger. But now he was taking the weapon of the wicked to fight the LORD's battles. In desperation, David would place reliance on Goliath's sword. David had forsaken the land of Israel, armed himself with the enemy's sword and fled to the hostile territory of Gath in Philistia, the sworn enemies of Israel and of God.\n\nLet us daily pray with great earnestness, \"Lead us not into temptation, but deliver us from evil.\"\n\n<b>THOUGHT</b>\nIn our spiritual warfare, the sword of the Spirit is infinitely more powerful than the sword of steel. \"And take the helmet of salvation, and the sword of the Spirit, which is the Word of God.\" - Ephesians 6:17\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 25&version=KJV\">EZEKIEL 25</a>\n<a href=\"https://www.biblegateway.com/passage/?search=HEBREWS 3&version=KJV\">HEBREWS 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "31 AUGUST": "<b><u>31 AUGUST</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 21:10-12&version=KJV\">1 Samuel 21:10-12</a>\n\n<b>LESSON</b>\nDavid's flight to Achish\n\n<b>VERSE 10</b>\n<i>And David arose and fled that day for fear of Saul, and went to Achish the king of Gath. To COMPLETE THE BIBLE</i>\n\nFrom Nob, David fled to the Philistine city of Gath. There he met Achish, a Philistine lord, also called Abimelech [his official title] in Psalm 34. While David hoped that the Philistines would welcome him as a deserter from Israel's army and give him refuge, the Philistines had yet to hear of his break with Saul. They only knew David as the infamous warrior who was victorious in killing thousands of their own Philistine people. Fearing for his own life, David acted quickly by pretending to be insane.\n\nWhat a desperate situation it is when the person anointed to be king is now exiled and forced to flee his own country! God's work upon His people seems to run counter to His promises sometimes. But this is the trial of faith, which eventually leads to the glorifying of His name through the accomplishment of His wise counsels. This is despite all the difficulties which seem to lie along the way to the ultimate consummation of all things.\n\nBeing recognised as the slayer of Goliath and now right in their very midst, David was understandably fearful of Achish. Nevertheless, it is God's overruling superintendence and goodness which will deliver David from the snares.\n\nConsider the 34th and 56th Psalm David penned during this bleak period which recorded the restored confidence David had in God's presence and favour.\n\n<b>THOUGHT</b>\nWhat time I am afraid, I will trust in Thee. In God I will praise His Word, in God I have put my trust; I will not fear what flesh can do unto me. - Psalm 56:3-4\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 26&version=KJV\">EZEKIEL 26</a>\n<a href=\"https://www.biblegateway.com/passage/?search=HEBREWS 4&version=KJV\">HEBREWS 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "1 SEPTEMBER": "<b><u>1 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 21:13-15&version=KJV\">1 Samuel 21:13-15</a>\n\n<b>LESSON</b>\nDavid's pretense to be mad\n\n<b>VERSE 13</b>\n<i>And he changed his behaviour before them, and feigned himself mad in their hands, and scrabbled on the doors of the gate, and let his spittle fall down upon his beard.</i>\n\nConfronted with grave danger amidst his enemies, David feigned madness in order that he might escape their suspicion and retribution. Displaying such abnormal behaviour with spittle running down upon his beard, it was no wonder that Achish and his men supposed David to be insane. \"... Lo, ye see the man is mad: wherefore then have ye brought him to me? Have I need of mad men, that ye have brought this fellow to play the mad man in my presence? Shall this fellow come into my house?\" What service or threat could Achish expect from a mad man?\n\nDavid might be the valiant warrior who had killed tens of thousands before, yet was there any harm that he could do to Achish in his madness? What Achish needed were wise and valiant men in his service, not such a fool or madman as he perceived the man before him. In fact, the presence of such a person in his court would have brought disgrace and shame.\n\nThe entire 34th Psalm bears record to the deep disturbance in David's spirit and the remarkable behaviour he was brought down to. Nevertheless, David's deliverance must ultimately be ascribed to the wise and powerful providence of God in answer to David's prayer as recorded in Psalms 34 and 61.\n\nAs with David's deliverance from Achish, God has done likewise for many others in similar affliction and trial. He will deliver His people as His Word has promised. We may not understand His ways, but we can trust Him.\n\n<b>THOUGHT</b>\nThe righteous cry, and the Lord heareth, and delivereth them out of all their troubles. The Lord is nigh unto them that are of a broken heart; and saveth such as be of a contrite spirit. Many are the afflictions of the righteous: but the Lord delivereth him out of them all. - Psalm 34:17-19\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 27&version=KJV\">EZEKIEL 27</a>\n<a href=\"https://www.biblegateway.com/passage/?search=HEBREWS 5&version=KJV\">HEBREWS 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "2 SEPTEMBER": "<b><u>2 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 22:1-2&version=KJV\">1 Samuel 22:1-2</a>\n\n<b>LESSON</b>\nDavid's band\n\n<b>VERSE 2</b>\n<i>And every one that was in distress, and every one that was in debt, and every one that was discontented, gathered themselves unto him; and he became a captain over them: and there were with him about four hundred men.</i>\n\nDavid found a hiding place in the barren region of Adullam. Soon a group of some 400 men mostly outlaws and discontents came to join David, and he would forge them into a strong fighting band. David was also united with his family, who had fled to escape Saul's vengeance. Knowing this harsh life would be too much for his aged parents, David would leave them in the care of the king of Moab.\n\nHere, situated in the Elah valley with many rock caves, David chose one of these natural havens as a temporary home for him and his followers. Interestingly, there was ample room in the cave even for the 400 who gathered under his leadership. In fact, not only was this evidence of David's natural genius and leadership, but such testings also afforded him opportunity to train and sharpen his skills.\n\nThe people joining David's band also implied something terribly amiss with Saul's government. Were Saul's kingship just and upright, David would not have any followers. While the Israelites had Saul as their desired king, never did they expect to end up with such a tyrant.\n\nMoreover, while David was receiving the distressed souls and outcasts of Israel, we also witness the weak instruments God was using to bring about His own purposes. From this ragtag bunch would emerge the mighty warriors and heroes alongside David in the days to come [1 Chronicles 11:15, 12:8-15].\n\n<b>THOUGHT</b>\nBut God hath chosen the foolish things of the world to confound the wise; and God hath chosen the weak things of the world to confound the things which are mighty. - 1 Corinthians 1:27\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 28&version=KJV\">EZEKIEL 28</a>\n<a href=\"https://www.biblegateway.com/passage/?search=HEBREWS 6&version=KJV\">HEBREWS 6</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "3 SEPTEMBER": "<b><u>3 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 22:3-4&version=KJV\">1 Samuel 22:3-4</a>\n\n<b>LESSON</b>\nDavid's concern\n\n<b>VERSE 3</b>\n<i>And David went thence to Mixpeh of Moab: and he said unto the king of Moab, Let my father and my mother, I pray thee, come forth, and be with you, till | know what God will do for me.</i>\n\nKnowing the life of constant hiding and fighting against Saul and his army would be too much for his aged parents, David made arrangements to leave them in the care of the king of Moab. It is likely the fact that his great-grandmother Ruth was a Moabitess that allowed for this connection and also induced David to choose that location as a refuge for his parents.\n\nDespite being in great jeopardy himself, we note the tender concern of David for his parents. The first thing David did was to find them a safe haven. Let this be for us to emulate in honouring our parents. Let us be concerned with their ease and satisfaction in all things. \"Honour thy father and thy mother: that thy days may be long upon the land which the Lord thy God giveth thee\" [Exodus 20:12]. While we may not experience the perils that David encountered, whatever our situation, no matter what our occupation or how highly esteemed we may be by men, let us not forget and overlook our aged parents.\n\n\"... till I know what God will do for me\" [v. 3c]. Herein lies another lesson from this passage as we see David's wholehearted submission to God. He expressed his hopes, as one who had cast himself entirely upon God, and committed his way to Him. The steps of a good man are ordered by the Lord, and the Lord will preserve His people for their appointed work, no matter how difficult the task or how exposed they may be.\n\n<b>THOUGHT</b>\nThe steps of a good man are ordered by the LORD: and he delighteth in His way. Though he fall, he shall not be utterly cast down: for the LORD upholdeth him with His hand. - Psalm 37:23-24\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 29&version=KJV\">EZEKIEL 29</a>\n<a href=\"https://www.biblegateway.com/passage/?search=HEBREWS 7&version=KJV\">HEBREWS 7</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "4 SEPTEMBER": "<b><u>4 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 22:3,5&version=KJV\">1 Samuel 22:3,5</a>\n\n<b>LESSON</b>\nKnowing God's will\n\n<b>VERSE 3</b>\n<i>And David went thence to Mixpeh of Moab: and he said unto the king of Moab, Let my father and my mother, I pray thee, come forth, and be with you, till | know what God will do for me.</i>\n\nIn this season of his life, David was living in a state of fear and anxiety, not knowing what may happen next. Notwithstanding this, he chose to heed and listen to the right source - God Himself. After God provided refuge for David's parents in Moab, He guided David to his next safe location.\n\nSometimes fear and uncertainty in life may cause our knees to bend. We seek God's will for our lives because there seems to be no other option left in our arsenal. But is this true faith or just human nature? The non-believer may also cry out to God in his moment of helplessness but what is it that makes a Christian different?\n\nDavid was a man who sought God's will in all seasons of life. He sought the Lord during his times on the spiritual 'mountain peaks' and more so when he was down in life's deep 'valleys', fleeing for his life. David's desire to seek the Lord in all situations is something we too must emulate. God is not some genie in a lamp that we pull out only in sticky situations and desperate times. He is the Almighty Father Who yearns to fellowship and commune with us daily. And as we read His Word and pray fervently daily, we grow more into what He desires us to be.\n\nBeloved, learn from David and choose to seek after God every day, and you will discover His wondrous plan for your life!\n\n<b>THOUGHT</b>\nDo we genuinely seek God daily in reading His Word and prayer? Or is this only reserved for times of crisis?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 30&version=KJV\">EZEKIEL 30</a>\n<a href=\"https://www.biblegateway.com/passage/?search=HEBREWS 8&version=KJV\">HEBREWS 8</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "5 SEPTEMBER": "<b><u>5 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 22:6-8&version=KJV\">1 Samuel 22:6-8</a>\n\n<b>LESSON</b>\nSaul's bitterness\n\n<b>VERSE 8</b>\n<i>That all of you have conspired against me, and there 1s none that sheweth me that my son hath made a league with the son of Jesse, and there 1s none of you that is sorry for me, or sheweth unto me that my son hath stirred up my servant against me, to le in wait, as at this day?</i>\n\nThese three short verses reek of the stench of bitterness. Saul was sitting under a tree holding a spear even though he was guarded by his soldiers. We are reminded of 1 Samuel 18:11 when Saul threw a javelin at David. Saul then pointed a finger and accused his men of conspiring against him in not telling him that his son had made a covenant with David. Saul was wallowing in self-pity as he called out his servants: \"there is none of you that is sorry for me\". All the symptoms Saul displayed point to a deep-rooted vengefulness against David.\n\nWe may be disgusted with what Saul had become. How can God's erstwhile anointed entertain thoughts of killing another of God's anointed? How could he sink to such depths of depravity and self-pity? And as we ponder Saul's behaviour, it ought to strike our hearts that we too are not much different.\n\nSaul was jealous of David. We are jealous of our contemporaries who have better careers and bigger salaries than us. Saul wanted to murder David. We may entertain the wish that our bosses and colleagues who treat us unfairly will face an \"unfortunate accident\".\n\nSaul's behaviour was described in graphic detail so that we can recognise ourselves in our own particular situation. Do we have deep rooted bitterness as a result of unconfessed sin? Pray for God to help us discern this in our life and surrender ourselves to Him so that we can be reconciled with both God and man.\n\n<b>THOUGHT</b>\nCan we detect the signs of bitterness and self-pity in our lives? Are we taking these to the Lord in prayer? Are we seeking reconciliation with people we have wronged and those who have wronged us?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 31&version=KJV\">EZEKIEL 31</a>\n<a href=\"https://www.biblegateway.com/passage/?search=HEBREWS 9&version=KJV\">HEBREWS 9</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "6 SEPTEMBER": "<b><u>6 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 22:9-16&version=KJV\">1 Samuel 22:9-16</a>\n\n<b>LESSON</b>\nDoeg's treachery\n\n<b>VERSE 9</b>\n<i>Then answered Doeg the Edomite, which was set over the servants of Saul, and said, I saw the son of Jesse coming to Nob, to Abhimelech the son of Abitub.</i>\n\nAs we saw from yesterday's devotion, Saul was certainly not in the right state of mind, and Doeg knew exactly how to take advantage of that to gain favour with Saul.\n\nWe live in a fallen world. Whether we like it or not, all of us have a little 'Doeg' in us and he appears in various stages of our lives. In school, have we ever gotten off scot-free because we told a lie and pushed the blame for our naughty actions to someone else? Perhaps that student already had a mischievous reputation, thus shifting the blame to him was easy. Doeg appears. At work, as we climbed the corporate ladder, we have encountered peer reviews or our bosses may have asked our opinion about our colleagues. Did we give a true report or were our words twisted so as to gain momentum for ourselves to climb that ladder? There is Doeg.\n\nIn church ministry, are we looking to give God all the glory and care for His people or are we looking to further our personal agendas so that our ideas and suggestions are chosen and we can feel good about ourselves? Are we offended when people do not accept our suggestions? This is the spirit of Doeg!\n\nDoeg the Edomite is shown in a negative light to be a warning for us. We are not to be like him, seeking only favour and gain for self and not for God and His people.\n\n<b>THOUGHT</b>\nMatthew 6:33 says: \"But seek ye first the kingdom of God, and His righteousness; and all these things shall be added unto you.\" Are we seeking God's will first or is the priority to seek gain for ourselves?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 32&version=KJV\">EZEKIEL 32</a>\n<a href=\"https://www.biblegateway.com/passage/?search=HEBREWS 10&version=KJV\">HEBREWS 10</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "7 SEPTEMBER": "<b><u>7 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 22:17-19&version=KJV\">1 Samuel 22:17-19</a>\n\n<b>LESSON</b>\nDoeg's rampage and God's sovereignty\n\n<b>VERSE 18</b>\n<i>And the king said to Doeg, Turn thou, and fall upon the priests. And Doeg the Edomite turned, and he fell upon the priests, and slew on that day fourscore and five persons that did wear a linen ephod.</i>\n\nVerse 17 reiterates twice that the men Doeg murdered were priests of Yahweh. Saul's soldiers had some sense that their king was not in his right state of mind when he gave this command and so they refused to obey; but Doeg with one foot already in the door, followed through on this brutal deed.\n\nIn reading today's three verses, nothing but carnage and sadness fills our hearts. Is not our God good? Why did He not do something? Why does God allow this horrendous evil to befall those who serve Him? If we recall the prophecy in 1 Samuel 2:30-36 concerning Eli's line being cut off (of which Ahimelech and Abiathar were), we will realise that this tragedy is also a part of God being faithful to his Word. He is faithful to bless and equally faithful to judge. Our sadness for the priests' deaths may now be tempered by the realisation that Saul and Doeg, while attempting to further their own positions in life, would be fulfilling God's will. Our God is sovereign and everything is under His control. In times of uncertainty, when Doegs around us make a move on us or our loved ones, our first response must be to go on our knees in prayer; praying that our Sovereign God will intervene on our behalf.\n\nAre we troubled today about something or someone? God says, \"Be still, and know that I am God.\" He who commands the universe is our Lord.\n\n<b>THOUGHT</b>\nGiven a choice, do we trust God or would we rather take matters into our own hands?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 33&version=KJV\">EZEKIEL 33</a>\n<a href=\"https://www.biblegateway.com/passage/?search=HEBREWS 11&version=KJV\">HEBREWS 11</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "8 SEPTEMBER": "<b><u>8 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 22:20-23&version=KJV\">1 Samuel 22:20-23</a>\n\n<b>LESSON</b>\nAbiathar\n\n<b>VERSE 23</b>\n<i>Abide thou with me, fear not: for he that seeketh my life seeketh thy hfe: but with me thou shalt be in safeguarea.</i>\n\nIn the midst of the slaughter of the house of Ahimelech and the priests, and despite Saul's efforts to decimate Nob, the city of priests, one person managed to escape the carnage and flee to David.\n\nBy the grace of God, Abiathar, a son of Ahimelech, escaped. He told David what Saul had done. David instantly recognising his part in it, and remorseful that his presence in the city had led to this massacre, asked Abiathar to follow him, and he would be protected. Abiathar would be key to David's campaign, and he would serve David as the priest to whom David was able to enquire of the Lord before battle.\n\nWe thank God that He is faithful and gracious to save a remnant of His faithful people just like Abiathar. And like Abiathar, we are also saved from the destruction of sin, when we flee to our Lord Jesus, the greater David. Indeed, the parallel goes even deeper in that he who sought our Lord Jesus' life (Satan) is also now seeking ours to destroy. The devil is ever trying to seek and devour whom he may find. But if we abide in the Lord, we shall be safeguarded because His blood was shed for our salvation. And like Abiathar, we who are saved will now serve Him in whom we have placed our lives and our trust.\n\n\"Blessed be the God and Father of our Lord Jesus Christ, which according to His abundant mercy hath begotten us again unto a lively hope by the resurrection of Jesus Christ from the dead; To an inheritance incorruptible, and undefiled, and that fadeth not away, reserved in heaven for you, Who are kept by the power of God through faith unto salvation ready to be revealed in the last time.\" - 1 Peter 1:3-5\n\n<b>THOUGHT</b>\nTruly my soul waiteth upon God: from Him cometh my salvation. - Psalm 62:1\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 34&version=KJV\">EZEKIEL 34</a>\n<a href=\"https://www.biblegateway.com/passage/?search=HEBREWS 12&version=KJV\">HEBREWS 12</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "9 SEPTEMBER": "<b><u>9 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:1-5&version=KJV\">1 Samuel 23:1-5</a>\n\n<b>LESSON</b>\nDavid's escapade\n\n<b>VERSE 5</b>\n<i>So David and his men went to Keilah, and fought with the Philistines, and brought away their cattle, and smote them with a great slaughter. So David saved the inhabitants of Keilah.</i>\n\nThough he was on the run from Saul, David continued to uphold the people of the land against their enemies. The Philistines had encroached into the town of Keilah and robbed their threshing floors. The people approached David for help. David enquired of the LORD and was given the go-ahead to smite the Philistines. David's men were fearful, because they were already hard at war with Saul, and they were afraid they would be overwhelmed by the Philistines. David enquired of the LORD once again and was assured by the LORD of victory. David and his men proceeded to fight the Philistines and prevailed.\n\nWe see in these passages how badly Saul ruled the country. In his hatred against David, Saul directed all his resources to capture David, but neglected to care for the land, and thus allowed the enemy to gain entry into Keilah. Hatred and anger are sins that consume the sinner so much that he neglects his duties. They cause the sinner to lower his guard and allow others to take advantage of his weakness. In the end, the sinner loses whatever he has worked hard to achieve.\n\nWe should be like David instead. While David was fleeing Saul, he did not fail to notice when the people around him needed help, and he did not hesitate to render it, even though he knew it was Saul's responsibility as king of Israel to fight the Philistines. Let us not forget our responsibilities to our neighbours, no matter what difficulties we may be facing in our own lives.\n\n<b>THOUGHT</b>\nYield not to temptation, for yielding is sin, Each vict'ry will help you, some other to win, Fight manfully onward, dark passions subdue, Look ever to Jesus, He'll carry you through. - Al Green\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 35&version=KJV\">EZEKIEL 35</a>\n<a href=\"https://www.biblegateway.com/passage/?search=HEBREWS 13&version=KJV\">HEBREWS 13</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "10 SEPTEMBER": "<b><u>10 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:2,4&version=KJV\">1 Samuel 23:2,4</a>\n\n<b>LESSON</b>\nDavid enquired of the LORD\n\n<b>VERSE 2</b>\n<i>Therefore David enquired of the LORD, saying, Shall I 20 and smite these Philistines? And the LORD said unto David, Go, and smite the Philistines, and save Keilah.</i>\n\nIt was God's providence that Abiathar was spared in the massacre at Nob. He joined David and became instrumental to David, as the priest of God. David was then able to commune with God and enquire of Him through the priestly ministry. This was David's approach in nearly all his pursuits: he would enquire of the LORD before taking any course of action, as the commander of his small band of warriors.\n\nWhen David was moved to help the people of Keilah, he knew better than to act impulsively. David first enquired of the LORD to see if it was His will that he should fight the Philistines. David knew that without the LORD's blessing, their efforts and confidence would amount to nothing. Similarly, we should never be over-confident, because success comes not by our own ability. Ultimately God is the One Who determines it, according to His holy purposes.\n\nWhen David's men were fearful, David enquired again of the LORD. And God gave him assurance to proceed. God told him that He would deliver the Philistines into David's hand. Our God is a faithful God, Who never fails to keep His promises. Therefore, when we are fearful, when we do not know what lies ahead of us, let us look to God and cling to His promises. God's Word holds all of God's promises for His children, and we should look to His Word for assurance and guidance even though the situation looks dire and uncertain.\n\n<b>THOUGHT</b>\nNever give up, never give up, Never give up to thy sorrows, Jesus will bid them depart, Trust in the LORD, trust in the LORD, Sing when your trials are greatest Trust in the LORD and take heart. - Fanny Crosby\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 36&version=KJV\">EZEKIEL 36</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JAMES 1&version=KJV\">JAMES 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "11 SEPTEMBER": "<b><u>11 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:3-4&version=KJV\">1 Samuel 23:3-4</a>\n\n<b>LESSON</b>\nGod's answer\n\n<b>VERSE 4</b>\n<i>Then David enquired of the Lord yet again. And the Lord answered him and said, Arise, g0 down to Kedah, for I will dehver the Philistines into thine hand.</i>\n\nDavid wanted to smite the Philistines and deliver Keilah. Perhaps he thought it was the right thing to do. Maybe he knew in his heart he would regret it if he did nothing. He had enquired of the Lord and received His answer which likely he had hoped for [v. 2]. But his men were apprehensive, and their apprehension was rational. There they were, being pursued by Saul, very much in fear, hardly able to save themselves, so how could they possibly save Keilah?\n\nLike many of God's humble servants, David was prudent. Though he trusted in God's promise, he would not trust his own heart as much. The Lord had promised to deliver the Philistines into his hand, but at what expense? Might it be that God grants him his desire to fight and save Keilah, but result in many of his men killed? As their leader, he needed to regard the welfare of his men. Thus, he asked God again [v. 4]. And God's answer was again affirmative. God called for them to arise and go. This was the confirmation David needed.\n\nThere are two lessons we can learn here. First, even when what lies ahead seems to be the right course to take, do not be overly hasty in acting, especially if it involves the interests of others. Take time to lift it up to God in prayer. Do not trust our own deceitful hearts. Second, God knows our struggles and is patient with us. We can go to His throne of grace and commit our concerns and worries to Him again and again. He will allay our fears and show us the good and right way.\n\n<b>THOUGHT</b>\nTrust in the Lord with all thine heart; and lean not unto thine own understanding. In all thy ways acknowledge Him, and He shall direct thy paths. - Proverbs 3:5-6\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 37&version=KJV\">EZEKIEL 37</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JAMES 2&version=KJV\">JAMES 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "12 SEPTEMBER": "<b><u>12 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:5-6&version=KJV\">1 Samuel 23:5-6</a>\n\n<b>LESSON</b>\nDavid at Keilah\n\n<b>VERSE 5</b>\n<i>So David and his men went to Keilah, and fought with the Philistines, and brought away their cattle, and smote them with a great slaughter. So David saved the inhabitants of Keilah.</i>\n\nDavid saw a need. He prayed, and God answered. David's men had reservations. He prayed, and God answered again. This is the formula for success - not as how men see or wish, but as how God wills and directs. With God's approval, David and his men proceeded to save the inhabitants of Keilah from the Philistines.\n\nBut the story did not end here. Soon, David would see how things unfold and what sort of people the inhabitants of Keilah really were. As far as he was concerned, he had done what was right - he had delivered his brethren from the hands of their enemy. This should be so with us too. We may not be able to see what lies far ahead; but what we need do is simply obey God one step at a time, doing what is pleasing in His sight, and leave the rest to Him.\n\nThe truth is, everything has its timing and purpose, and for those who love God, He will work all things together for good. Note that shortly, Abiathar the son of Ahimelech would come to Keilah. We read in the previous chapter that he was the sole survivor of the massacre in Nob. God would move in such a way that David would know clearly what his next step should be, through the ephod Abiathar brought with him.\n\nBefore David even started planning for the future, God had laid out the resources for him to do so. Such is God's providence.\n\n<b>THOUGHT</b>\nAnd we know that all things work together for good to them that love God, to them who are the called according to His purpose. - Romans 8:28\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 38&version=KJV\">EZEKIEL 38</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JAMES 3&version=KJV\">JAMES 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "13 SEPTEMBER": "<b><u>13 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:7-8&version=KJV\">1 Samuel 23:7-8</a>\n\n<b>LESSON</b>\nSaul's persistence to do evil\n\n<b>VERSE 8</b>\n<i>And Saul called all the people together to war, to go down to Ketlah, to besiege David and his men.</i>\n\nIn today's reading, we see one more reason David and his men were initially hesitant about helping Keilah. By helping their brethren, they would reveal their location to Saul and endanger themselves. True enough, Saul would soon lunge at them with full force, calling \"all the people together to war\" to besiege Keilah, a town that ironically had been freed from Israel's enemies, and was inhabited by Saul's fellow Israelites.\n\nWe can imagine Saul doing that almost instinctively. He had been searching for David all this while and when he saw this golden opportunity, he pounced on it like a wolf upon a defenseless lamb, for David and his men were shut in, confined by the walls of Keilah. And it is interesting how Saul regarded this turn of events for he said, \"God hath delivered him into mine hand.\"\n\nSeeing how events transpire in one's personal life as 'acts of God' is not only the privilege of believers. People of the world often use the name of God carelessly without believing in Him. Such is the case with Saul. Blinded by his sin and hardened in his heart, he could not see why and how he was wrong but would even read this turn of events as something presented to him by the God Whom he had repeatedly disobeyed.\n\nPerhaps it might be clearer to Saul if he had gone before the Lord and prayed before making any decisions. If he is able to articulate his intentions and plans, and seek God's help before he does anything, he would soon see things from God's perspective and recognise his faults.\n\n<b>THOUGHT</b>\nTake time today to commit all your plans to God.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 39&version=KJV\">EZEKIEL 39</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JAMES 4&version=KJV\">JAMES 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "14 SEPTEMBER": "<b><u>14 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:9-13&version=KJV\">1 Samuel 23:9-13</a>\n\n<b>LESSON</b>\nKeilah's betrayal\n\n<b>VERSE 12</b>\n<i>Then said David, Will the men of Ketlah dehver me and my men into the hand of Saul? And the LORD said, They will deliver thee up.</i>\n\nDavid heard that Saul was planning to attack Keilah on his account. Through Abiathar's ephod, he asked two questions of the Lord: (1) Will Saul really come to Keilah? (2) Will the people of Keilah surrender him to Saul? The answers to both questions were affirmative.\n\nThere are some lessons we can learn here. Firstly, the betrayal by Keilah revealed the nature of humankind. David had just saved Keilah. In return, they would turn their backs on their saviour and betray him to Saul. Perhaps we cannot fault them too much as Saul was still their king and the ultimate object of their allegiance; and surrendering David would save many lives in Keilah. It was a rational decision, but the ugly reality of human nature is still spine-chilling.\n\nSecondly, we also learn about an attribute of God here. He is the Omniscient God whose knowledge of all things is infinite - not only events that happened, but also what will happen and what could happen. In verse 13, David upon hearing God's answer, left the town of Keilah, and Saul upon learning of David's departure, changed his plan of going to Keilah. In other words, what God revealed to David were two possible realities: one, if David had stayed in Keilah, Saul would come for him; two, had Saul come to Keilah, the people would betray David.\n\nOur omniscient God not only knows the past and present, he ordains and knows the future. He knows all possibilities and their outcomes even before and whether they actually happen. He knows what we will do and what is going to happen if and when we do it.\n\n<b>THOUGHT</b>\nO LORD, Thou hast searched me, and known me. Thou knowest my downsitting and mine uprising, Thou understandest my thought afar off. - Psalm 139:1-2\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 40&version=KJV\">EZEKIEL 40</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JAMES 5&version=KJV\">JAMES 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "15 SEPTEMBER": "<b><u>15 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:13-15&version=KJV\">1 Samuel 23:13-15</a>\n\n<b>LESSON</b>\nStrongholds in the wilderness\n\n<b>VERSE 14</b>\n<i>And David abode in the wilderness in strong holds, and remained in a mountain in the wilderness of Liph. And Saul sought him every day, but God delivered him not into his hand.</i>\n\nThere is a saying that \"Success has many fathers, but failure is an orphan\". When David returned after defeating Goliath, there was a victory parade for him. Now that he was a fugitive, he became the convenient target of betrayal. In the preceding verses, the inhabitants of Keilah, whom David had protected from the Philistines, would have turned their backs and betrayed him to Saul.\n\nDavid, thus, was forced to flee. He came to the wilderness of Ziph, a small town in the hill country of Judah, southeast of Hebron. Verse 14 says \"David abode in the wilderness in strong holds ... And Saul sought him every day, but God delivered him not into his hand\" .\n\nAs a result of COVID-19, the world has experienced a time of isolation - a period akin to David's time in the wilderness. He was alone. He could not move freely. He was always on the alert for enemies. Yet through this period when his faith was tried, David experienced the wonderful grace of God. His prior experience with the people of Keilah, when the LORD answered his prayers in very specific ways, no doubt gave David confidence that he was indeed God's chosen servant.\n\nGod provided strongholds in the wilderness of Ziph for David. These were natural caves found there, and not fortifications built by men. Despite Saul's relentless efforts, the Lord preserved David. As we look back to our time of isolation, we too must praise God for the strongholds He has provided. Like David, we must look at our time in the \"wilderness\" as evidence of God's love for us, and the means to hone our spirituality and equip us for the ministry.\n\n<b>PRAYER</b>\nLord, help me to rejoice in Thy love, abide in Thy peace, and prepare me for Thy work.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 41&version=KJV\">EZEKIEL 41</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 PETER 1&version=KJV\">1 PETER 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "16 SEPTEMBER": "<b><u>16 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:16&version=KJV\">1 Samuel 23:16</a>\n\n<b>LESSON</b>\nJonathan's strengthening of David\n\n<b>VERSE 16</b>\n<i>And Jonathan Sauls son arose, and went to David into the wood, and strengthened his hand in God.</i>\n\nMan is created by God with multiple needs. God told Adam, \"Of every tree of the garden thou mayest freely eat\" [Genesis 2:16]. God provided for Adam's physical needs. God communed with Adam in the Garden of Eden, providing for his spiritual needs. God also said, \"It is not good that the man should be alone; I will make him an help meet for him\" [Genesis 2:18]. And God made Eve to provide for his social and emotional needs.\n\nIn the wilderness of Ziph, the LORD's providence for David covered all these aspects as well. There were strongholds to keep David physically safe. There was constant communion between God and David to keep him spiritually vibrant. And God sent Jonathan to strengthen David. The word \"strengthen\" refers to physical or martial strength. In Judges 7:11, Gideon was \"strengthened\" to overcome the Midianites. The word is also translated \"encourage\". Moses was charged to \"encourage\" Joshua [Deuteronomy 1:38; 3:28]. At Ziklag, when his men threatened to stone him, David \"encouraged himself in the LORD his God\" [1 Samuel 30:6].\n\nGod never removes a blessing from us without also providing the grace to help us ride over the trial. When ordinary springs of comfort were obstructed, God comforted David by sending the presence and love of his earthly friend. Likewise, when our health deteriorates, when earthly treasures disappear, when our loved ones depart, we can turn our hearts toward God who never fails [Zephaniah 3:5], never forsakes [Hebrew 13:5], and whose promises \"fadeth not away\" [1 Peter 1:4].\n\n<b>THOUGHT</b>\nO fear the LORD, ye His saints: For there is no want to them that fear Him. The young lions do lack, and suffer hunger: But they that seek the LORD shall not want any good thing. - Psalm 34:9-10\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 42&version=KJV\">EZEKIEL 42</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 PETER 2&version=KJV\">1 PETER 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "17 SEPTEMBER": "<b><u>17 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:17&version=KJV\">1 Samuel 23:17</a>\n\n<b>LESSON</b>\nStanding next to thee\n\n<b>VERSE 17</b>\n<i>And he said unto him, Fear not: for the hand of Saul my father shall not find thee, and thou shalt be Ring over Israel, and I shall be next unto thee; and that also Saul my father knoweth.</i>\n\nIt is said that blood is thicker than water, meaning that kinship is held by many to be stronger than even biblical truth. Therefore, when Jonathan - the king's son - chose to stand with and for David against his own father, his was an act of unusual courage. Jonathan assured David, \"I shall be next unto thee\" - next to him, not over him, and certainly not in place of him. So doing, Jonathan stood to jeopardise his relationship with his father, his stake on his father's throne, as well as his claim on his inheritance. Jonathan stood to lose a great deal, but he lived out the principles of justice, retained the conscience of truth, and gained the favour of God.\n\nJonathan assured David, \"Thou shalt be king over Israel.\" As a man of God, Jonathan recognised the will of God by regarding David as his superior and relegating himself to play second fiddle. There could only be one king, but the nation was run by a multitude of counsellors. For one David, there was a host of valiant men. For one Paul, there was an unknown number of co-labourers.\n\nThere will be times in our lives when we are called to forego self so that God's work may advance. The Gospel work is done by the totality of servants of different talents, from the highest to the lowest, first to last. If you are the front-person in the Gospel ministry, remember that its success is owed to unnamed helpers and untraceable prayers. If you are not the front-person, do not be discouraged; it is not till we come before the Master that we will see the full bearing of our role in the great work of the Gospel.\n\n<b>THOUGHT</b>\n[Christ] must increase, but I must decrease. - John 3:30\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 43&version=KJV\">EZEKIEL 43</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 PETER 3&version=KJV\">1 PETER 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "18 SEPTEMBER": "<b><u>18 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:18&version=KJV\">1 Samuel 23:18</a>\n\n<b>LESSON</b>\nJonathan's covenant with David\n\n<b>VERSE 18</b>\n<i>And they two made a covenant before the LORD: and David abode in the wood, and Jonathan went to his house.</i>\n\nAcovenant is essentially a legal contract between two or more parties with prescribed terms and conditions. The objective of a covenant is to establish and regulate a relationship between persons. In the Bible, there are covenants made between individuals [Genesis 21:27, 31; 31:44] and nations [1 Kings 5:12; Obadiah 7], Israel and God [Exodus 20].\n\nIn the covenant between Jonathan and David, there was neither enumeration of conditions nor stipulation of penalties if conditions were not met; there was neither eyewitnesses nor ratification rituals. It was just two friends binding themselves by a covenant - one motivated by Jonathan who realised that though he was the son of a king, he was not called to be king. And Jonathan cheerfully submitted to the expressed will of God and served Him by serving David, inspiring his friend with courage and encouraging his heart in the midst of trials.\n\nAfter the covenant, the two friends parted. They took different routes - Jonathan to his palace, and David his wilderness cave. Their days would be different, but their mission in life would be the same. Their hearts would beat as one. They would fight side by side against the enemies of Israel, re- establish the worship of Jehovah, and restore the honour of His name. The success of David would be the success of Jonathan. Between these two friends, there was not that spirit of jealousy that darkened the heart and warped the mind of Saul.\n\nSuch must be the magnanimity of heart and generosity of spirit that Christians must have for \"one another to provoke unto love and to good works\" [Hebrews 10:24].\n\n<b></b>\nBe a Jonathan to inspire faith and hope in your friend by fervent prayers, words of encouragement, and whole-hearted cooperation in the Gospel work.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 44&version=KJV\">EZEKIEL 44</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 PETER 4&version=KJV\">1 PETER 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=CHALLENGE&version=KJV\">CHALLENGE</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=18 SEPTEMBER&version=KJV\">18 SEPTEMBER</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=Ace\" is essentially a legal contract between&version=KJV\">Ace\" is essentially a legal contract between</a>\n<a href=\"https://www.biblegateway.com/passage/?search=two of more parties with prescribed terms&version=KJV\">two of more parties with prescribed terms</a>\n<a href=\"https://www.biblegateway.com/passage/?search=and conditions. The objective of a covenant 1s&version=KJV\">and conditions. The objective of a covenant 1s</a>\n<a href=\"https://www.biblegateway.com/passage/?search=to establish and regulate a relationship between&version=KJV\">to establish and regulate a relationship between</a>\n<a href=\"https://www.biblegateway.com/passage/?search=persons. In the Bible, there are covenants made&version=KJV\">persons. In the Bible, there are covenants made</a>\n<a href=\"https://www.biblegateway.com/passage/?search=between individuals [Genesis 21:27, 31; 31:44] and&version=KJV\">between individuals [Genesis 21:27, 31; 31:44] and</a>\n<a href=\"https://www.biblegateway.com/passage/?search=nations [1 Kings 5:12; Obadiah 7], Israel and God&version=KJV\">nations [1 Kings 5:12; Obadiah 7], Israel and God</a>\n<a href=\"https://www.biblegateway.com/passage/?search=[Exodus 20].&version=KJV\">[Exodus 20].</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=In the covenant between Jonathan and David,&version=KJV\">In the covenant between Jonathan and David,</a>\n<a href=\"https://www.biblegateway.com/passage/?search=there was neither enumeration of conditions nor&version=KJV\">there was neither enumeration of conditions nor</a>\n<a href=\"https://www.biblegateway.com/passage/?search=stipulation of penalties if conditions were not&version=KJV\">stipulation of penalties if conditions were not</a>\n<a href=\"https://www.biblegateway.com/passage/?search=met; there was neither eyewitnesses nor ratification&version=KJV\">met; there was neither eyewitnesses nor ratification</a>\n<a href=\"https://www.biblegateway.com/passage/?search=rituals. It was just two friends binding themselves&version=KJV\">rituals. It was just two friends binding themselves</a>\n<a href=\"https://www.biblegateway.com/passage/?search=by a covenant -- one motivated by Jonathan who&version=KJV\">by a covenant -- one motivated by Jonathan who</a>\n<a href=\"https://www.biblegateway.com/passage/?search=realised that though he was the son of a king, he&version=KJV\">realised that though he was the son of a king, he</a>\n<a href=\"https://www.biblegateway.com/passage/?search=was not called to be king. And Jonathan cheerfully&version=KJV\">was not called to be king. And Jonathan cheerfully</a>\n<a href=\"https://www.biblegateway.com/passage/?search=submitted to the expressed will of God and served&version=KJV\">submitted to the expressed will of God and served</a>\n<a href=\"https://www.biblegateway.com/passage/?search=Him by serving David, inspiring his friend with&version=KJV\">Him by serving David, inspiring his friend with</a>\n<a href=\"https://www.biblegateway.com/passage/?search=courage and encouraging his heart in the midst of&version=KJV\">courage and encouraging his heart in the midst of</a>\n<a href=\"https://www.biblegateway.com/passage/?search=trials.&version=KJV\">trials.</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=After the covenant, the two friends parted.&version=KJV\">After the covenant, the two friends parted.</a>\n<a href=\"https://www.biblegateway.com/passage/?search=They took different routes -- Jonathan to his palace,&version=KJV\">They took different routes -- Jonathan to his palace,</a>\n<a href=\"https://www.biblegateway.com/passage/?search=and David his wilderness cave. Their days would&version=KJV\">and David his wilderness cave. Their days would</a>\n<a href=\"https://www.biblegateway.com/passage/?search=be different, but their mission in life would be the&version=KJV\">be different, but their mission in life would be the</a>\n<a href=\"https://www.biblegateway.com/passage/?search=same. Their hearts would beat as one. They would&version=KJV\">same. Their hearts would beat as one. They would</a>\n<a href=\"https://www.biblegateway.com/passage/?search=fight side by side against the enemies of Israel, re-&version=KJV\">fight side by side against the enemies of Israel, re-</a>\n<a href=\"https://www.biblegateway.com/passage/?search=establish the worship of Jehovah, and restore the&version=KJV\">establish the worship of Jehovah, and restore the</a>\n<a href=\"https://www.biblegateway.com/passage/?search=honour of His name. The success of David would&version=KJV\">honour of His name. The success of David would</a>\n<a href=\"https://www.biblegateway.com/passage/?search=be the success of Jonathan. Between these two&version=KJV\">be the success of Jonathan. Between these two</a>\n<a href=\"https://www.biblegateway.com/passage/?search=friends, there was not that spirit of jealousy that&version=KJV\">friends, there was not that spirit of jealousy that</a>\n<a href=\"https://www.biblegateway.com/passage/?search=darkened the heart and warped the mind of Saul.&version=KJV\">darkened the heart and warped the mind of Saul.</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=Such must be the magnanimity of heart and&version=KJV\">Such must be the magnanimity of heart and</a>\n<a href=\"https://www.biblegateway.com/passage/?search=generosity of spirit that Christians must have for&version=KJV\">generosity of spirit that Christians must have for</a>\n<a href=\"https://www.biblegateway.com/passage/?search=\"one another to provoke unto love and to good&version=KJV\">\"one another to provoke unto love and to good</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=works\" [Hebrews 10:24].&version=KJV\">works\" [Hebrews 10:24].</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=Be a Jonathan to inspire faith and hope in your&version=KJV\">Be a Jonathan to inspire faith and hope in your</a>\n<a href=\"https://www.biblegateway.com/passage/?search=friend by fervent prayers, words of encouragement,&version=KJV\">friend by fervent prayers, words of encouragement,</a>\n<a href=\"https://www.biblegateway.com/passage/?search=and whole-hearted cooperation in the Gospel work.&version=KJV\">and whole-hearted cooperation in the Gospel work.</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "19 SEPTEMBER": "<b><u>19 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:18&version=KJV\">1 Samuel 23:18</a>\n\n<b>LESSON</b>\nThe parting of friends\n\n<b>VERSE 18</b>\n<i>And they two made a covenant before the LORD: and David abode in the wood, and Jonathan went to his house.</i>\n\nAfter the covenant, Jonathan and David parted. I am sure they hoped to meet again in better times and certainly not in stealth. However, what they proposed, God disposed otherwise. The two friends would never meet again. The next time David hears of Jonathan would be his friend's death at the hands of the Philistines. Death ended their earthly friendship. One cannot read David's lament over Jonathan's death - \"How are the mighty fallen in the midst of the battle! O Jonathan, thou wast slain in thine high places. I am distressed for thee, my brother Jonathan: Very pleasant hast thou been unto me: Thy love to me was wonderful, passing the love of women\" [2 Samuel 1:25-26] - without being moved by the depth of their friendship. David's success was stained by his tears of sorrow.\n\nThere is one Friend - only one - from whom death cannot sever. Paul wrote, \"For I am persuaded, that neither death, nor life, nor angels, nor principalities, nor powers, nor things present, nor things to come, nor height, nor depth, nor any other creature, shall be able to separate us from the love of God, which is in Christ Jesus our Lord\" [Romans 8:38-39]. Times of trial, seasons of sorrow, not even death will break the friendship or separate us from the love of Christ. In fact, in death that union is bound eternally.\n\n\"What a Friend we have in Jesus\" is a familiar hymn but there is a fourth stanza seldom sung. It reads: \"Blessed Savior, Thou hast promised Thou wilt all our burdens bear; May we ever, Lord, be bringing all to Thee in earnest prayer. Soon in glory bright, unclouded, There will be no need for prayer-- Rapture, praise, and endless worship, will be our sweet portion there.\"\n\n<b>THOUGHT</b>\nTruly, what a Friend we have in Jesus.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 45&version=KJV\">EZEKIEL 45</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 PETER 5&version=KJV\">1 PETER 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "20 SEPTEMBER": "<b><u>20 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:19-23&version=KJV\">1 Samuel 23:19-23</a>\n\n<b>LESSON</b>\nThe treachery of the Ziphites\n\n<b>VERSE 20</b>\n<i>Now therefore, O king, come down according to all the desire of thy soul to come down, and our part shall be to deliver him into the kings hand.</i>\n\nLike the men of Keilah, the Ziphites chose to betray David for the king's favour. They told Saul that David was hiding in the \"strong holds in the wood, in the hill of Hachilah, which is on the south of Jeshimon\".\n\nHachilah is a hill in the Judean desert. The Bible record says that Hachilah was on the south of Jeshimon, a term often used as a common noun in referring to the Sinai desert [Deuteronomy 32:10; Psalm 78:40; 106:14; Isaiah 43:19]. The region is arid and sterile, its soil saturated with salt, making farming impossible. This was David's hideout, a land as parched as his soul.\n\nThe Ziphites assured Saul that with their knowledge of the region, they would be able to apprehend David for Saul. The Ziphites seemed to have a personal stake in David's capture. Their treachery was made worse by the fact that David and the Ziphites were from the same tribe of Judah. David was from that tribe as was Caleb [Numbers 13:6], who was related to Ziph [1 Chronicles 2:42].\n\nWhat were the reasons underlying the Ziphites' treachery? Simply, it is human depravity manifesting itself first in moral indifference; they had no sympathy for the needy and unjustly persecuted. Second, in immoral greed; like Balaam, they were willing to injure the innocent for the favour of the rich and powerful. Third, in wicked godlessness. In Psalm 54 (note its title), David describes the Ziphites as \"strangers ... oppressors seek after my soul: They have not set God before them\" [Psalm 54:3].\n\nWhat a difference it makes in our lives who/ what we set before us.\n\n<b>THOUGHT</b>\nHe hath shewed thee, O man, what is good; And what doth the LORD require of thee, but to do justly, and to love mercy, and to walk humbly with thy God? - Micah 6:8\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 46&version=KJV\">EZEKIEL 46</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 PETER 1&version=KJV\">2 PETER 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "21 SEPTEMBER": "<b><u>21 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:20-23&version=KJV\">1 Samuel 23:20-23</a>\n\n<b>LESSON</b>\nThe treachery of Saul\n\n<b>VERSE 21</b>\n<i>And Saul said, Beessed be ye of the LORD; for ye have compassion on me.</i>\n\n\"Blessed be ye of the LORD; for ye have compassion on me.\" The meaning of these words depends on the person who speaks them. These words could well have come from David, and they would be truthful. However, coming from Saul, the same words betray a false piety as much as evoke pity.\n\nFalse piety because behind those words was concealed deep hatred and evil intent. Jeremiah wrote that the \"tongue is as an arrow shot out; it speaketh deceit: One speaketh peaceably to his neighbour with his mouth, but in heart he layeth his wait\" [Jeremiah 9:8]. But lest we point an accusing finger at others, we must confess we are just as likely to speak so piously but know deep in our hearts that our words carry no such intent. As Jeremiah said, \"The heart is deceitful above all things, and desperately wicked: who can know it?\" [Jeremiah 17:9]\n\n\"Ye have compassion on me.\" There is something pitiable in Saul's answer. He knew he had been rejected by God. He knew God had chosen David to replace him. However, Saul convinced himself and others that he was the person who had been wronged, and David was the wicked conspirator plotting to overthrow him. And the tighter he grasped the throne against the expressed will of God, the more depressed Saul became. As he continued to brood over what he had lost, Saul made himself a prey of abject misery - a misery that would end tragically; as Paul said, the covetous man will pierce himself with many sorrows [1 Timothy 6:10].\n\n<b>THOUGHT</b>\nAnd they lay wait for their own blood; they lurk privily for their own lives. So are the ways of every one that is greedy of gain; which taketh away the life of the owners thereof. - Proverbs 1:18-19\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 47&version=KJV\">EZEKIEL 47</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 PETER 2&version=KJV\">2 PETER 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "22 SEPTEMBER": "<b><u>22 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 23:24-26&version=KJV\">1 Samuel 23:24-26</a>\n\n<b>LESSON</b>\nMaking haste\n\n<b>VERSE 26</b>\n<i>And Saul went on this side of the mountain, and David and his men on that side of the mountain: and David made haste to get away for fear of Saul; for Saul and his men compassed David and his men round about to take them.</i>\n\nAs Saul plotted with the Ziphites to capture David, he moved to the wilderness of Maon. David would have been justified in retaliating against Saul, and yet in the account, it seemed that David strived to avoid conflict with Saul. As Saul and his men moved to one side of the mountain, David and his men moved to the other.\n\nComparing the account here and David's recollection of this situation in Psalm 54, we learn an important life lesson. In the Psalm, David prayed for deliverance, \"Save me, O God, by Thy name, and judge me by Thy strength. Hear my prayer, O God; Give ear to the words of my mouth ... Behold, God is mine helper: The Lord is with them that uphold my soul\" [Psalm 54:1-2, 4]. Yet, David also \"made haste to get away\" from Saul. David trusted God because his life is in God's hand. At the same time, he spared no effort to escape as though everything depended on his skill and discretion. This is the Christian exercising his personal responsibility and submission to God.\n\nOne of the lessons I learnt from the COVID-19 pandemic is that faith in God does not exempt us from exercising personal responsibility; neither should it embolden us to have a brazen callous attitude toward life. Rather, faith in God empowers us to live in the unseen spiritual sphere of God's sovereignty, but concurrently exert our human wisdom and prudence in this visible material world.\n\nIn our daily living, whether it is work or ministry, dealing with adversity or temptation, we must do so with all fervency; yet also with faith in the need and certainty of God's help.\n\n<b>THOUGHT</b>\n\"Pray as if everything depended on God, and work as if everything depended on you.\" - Martin Luther\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EZEKIEL 48&version=KJV\">EZEKIEL 48</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 PETER 3&version=KJV\">2 PETER 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "23 SEPTEMBER": "<b><u>23 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 27 worst situation -- when we are utterly helpless, and</b>\n<i>But there came a messenger beyond our own ability to save ourselves -- so that unto Saul, saying, Haste thee, we may cry out to Him. God delivers at the point and come; for the Philistines of our greatest peril and weakness. Micah wrote: have invaded the land \"When I fall, I shall arise; When I sit in darkness, the LORD shall be a light unto me\" [Micah 7:8b]. Second, God will never allow His people to suffer without help. Paul reminds us that \"there hath no temptation (testing) taken you but such as is common to man: but God is faithful, who will not suffer you to be tempted above that ye are able; but will with the temptation also make a way to escape, that ye may be able to bear it\" [1 Corinthians 10:13]. When the children of Israel were caught between the raging sea and the advancing chariots, Moses said, \"Fear ye not, stand still, and see the salvation of the LORD\" [Exodus 14:13]. Third, God uses the most unexpected means for our deliverance. The world's forces are at His disposal. In the case of David, the Lord used the To CompLete THE BIBLE invasion of the Philistines to halt Saul's pursuit. IN 2 YEARS, READ He dispatched the enemy of Israel to deliver His DANIEL 1 beloved. God rules and overrules for His own 1 JOHN 1 glory and for our good. THOUGHT Be patient in trial because \"the Lord knoweth how to deliver the godly out of temptations, and to resetve the unjust unto the day of judgment to be punished\" [2 Peter 2:9].</i>\n\nAs David fled into the wilderness of Maon, he soon found himself surrounded by Saul and his army. It was at this critical juncture that the Philistines invaded the land of Judah, and Saul was forced to pull back his forces to deal with the urgent matter.\n\nGod delivered David at the right time. There are several lessons to learn concerning God's dealing with His people. First, God puts us in the worst situation - when we are utterly helpless, and beyond our own ability to save ourselves - so that we may cry out to Him. God delivers at the point of our greatest peril and weakness. Micah wrote: \"When I fall, I shall arise; When I sit in darkness, the LORD shall be a light unto me\" [Micah 7:8b].\n\nSecond, God will never allow His people to suffer without help. Paul reminds us that \"there hath no temptation (testing) taken you but such as is common to man: but God is faithful, who will not suffer you to be tempted above that ye are able; but will with the temptation also make a way to escape, that ye may be able to bear it\" [1 Corinthians 10:13]. When the children of Israel were caught between the raging sea and the advancing chariots, Moses said, \"Fear ye not, stand still, and see the salvation of the LORD\" [Exodus 14:13].\n\nThird, God uses the most unexpected means for our deliverance. The world's forces are at His disposal. In the case of David, the Lord used the invasion of the Philistines to halt Saul's pursuit. He dispatched the enemy of Israel to deliver His beloved. God rules and overrules for His own glory and for our good.\n\n<b></b>\nBe patient in trial because \"the Lord knoweth how to deliver the godly out of temptations, and to reserve the unjust unto the day of judgment to be punished\" [2 Peter 2:9].\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "24 SEPTEMBER": "<b><u>24 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:1-2&version=KJV\">1 Samuel 24:1-2</a>\n\n<b>LESSON</b>\n3000 to chase 1\n\n<b>VERSE 2</b>\n<i>Then Saul took three thousand chosen men out of all Israel, and went to seek David and his men upon the rocks of the wild goats. To COMPLETE THE BIBLE</i>\n\nDavid had moved to the wilderness of Engedi. This was a place of extraordinary terrain. With sharp and craggy rock formations, the only inhabitants that loved to be there were mountain goats which were skilful in leaping from one rock to another, often standing at the edge of impossible precipices.\n\nGiven a choice, David and his men would not have chosen to be in Engedi, but they were hapless fugitives. Saul, on the other hand, had the choice to leave David alone in the harsh land of Engedi and get on with living his life as king. But Saul was determined to pursue David. David was the thorn in his flesh, and he had set his heart on removing it at all cost. Hardly resting after a battle with the Philistines, Saul chose 3000 men, his best ones, to pursue David and his men upon the rocks of the wild goats.\n\nSuch is the miserable condition of one blinded by obsession. He could not see beyond the thing that possessed his heart and mind. He was willing to give up anything to gratify his desire. And the sad thing is, without God's grace, he could not be freed of the bondage of his obsession.\n\nThanks be to God Who has saved us from the bondage of sin, that by the blood of our Lord Jesus Christ, we are a new creature. God has opened our eyes. We can see our sinful nature and recognise our foolish preoccupations. We realise the truth that we are created for a higher purpose, not to indulge in vanity, like foolish goats.\n\n<b>THOUGHT</b>\nCreate in me a clean heart, O God; and renew a right spirit within me. - Psalm 51:10\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=DANIEL 2&version=KJV\">DANIEL 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 JOHN 2&version=KJV\">1 JOHN 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "25 SEPTEMBER": "<b><u>25 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 4 On the way to Engedi, Saul entered a cave to</b>\n<i>And the men of David relieve himself. Little did he realise that cave was said unto him, already occupied -- David and his men were hiding Behold the day of there. Saul was alone and completely vulnerable, which the LORD said unto and David's men interpreted the situation exactly thee, Behold, I will deliver the way Saul had done before. They told David, \"Today is the day of which the Lord said to you, that thou mayest do to him 'Behold, I will give your enemy into your hand, and as it shall seem good unto thee. you shall do to him as it shall seem good to you.\" Then David arose, and cut off David's men did not hear anything from God. the skirt of Saul's robe privily. They were just following their carnal and worldly- wise instincts and using God's name in vain by telling David, \"This is the day God is telling you to follow your heart's desire.\" David, however, was not so tempted. He had something else in mind. He moved toward Saul and secretly cut off a corner of Saul's robe. A little action, yet even this would later cause him to be ereatly conscience-stricken. thine enemy into thine hand,</i>\n\nIn the previous chapter when Saul learnt that David was in the town of Keilah, he deemed it a God-given opportunity to attack him. He interpreted that turn of events as God delivering David into his hands [1 Samuel 23:7]. In today's verses, we have a similar situation. But this time, it was David's turn to be presented that chance, and the difference in David's response showed us why he was indeed a man after God's own heart.\n\nOn the way to Engedi, Saul entered a cave to relieve himself. Little did he realise that cave was already occupied - David and his men were hiding there. Saul was alone and completely vulnerable, and David's men interpreted the situation exactly the way Saul had done before. They told David, \"Today is the day of which the Lord said to you, 'Behold, I will give your enemy into your hand, and you shall do to him as it shall seem good to you.'\"\n\nDavid's men did not hear anything from God. They were just following their carnal and worldly- wise instincts and using God's name in vain by telling David, \"This is the day God is telling you to follow your heart's desire.\"\n\nDavid, however, was not so tempted. He had something else in mind. He moved toward Saul and secretly cut off a corner of Saul's robe. A little action, yet even this would later cause him to be greatly conscience-stricken.\n\n<b></b>\nThe secret of the LORD is with them that fear Him; and He will shew them His covenant. - Psalm 25:14\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 3&version=KJV\">DANIEL 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 JOHN 3&version=KJV\">1 JOHN 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=THOUGHT The secret of the LORD is with them that fear&version=KJV\">THOUGHT The secret of the LORD is with them that fear</a>\n<a href=\"https://www.biblegateway.com/passage/?search=Him; and He will shew them His covenant.&version=KJV\">Him; and He will shew them His covenant.</a>\n<a href=\"https://www.biblegateway.com/passage/?search=-- Psalm 25:14&version=KJV\">-- Psalm 25:14</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "26 SEPTEMBER": "<b><u>26 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 5 him. This means David's conscience was stricken,</b>\n<i>And it came to pass afterward, not by mere unease over a misdemeanour but by that David' heart smote him, stark apprehension and horror at the sinfulness of because he had what he had just done. Commentators have various cut off Saul's skirt opinions as to David's intention in cutting off the corner of Saul's robe and the gravity of this sin. Nevertheless, it is clear from his subsequent words and actions, that David had a tender conscience, one that was sensitive to the prompting of the Holy Spirit, one that was informed and ruled by God, and one that had deep reverence for God's sovereignty and judgement. David did not try to suppress his conscience but allowed his conscience to lead him to do right in God's eyes. God has given each of us a conscience too. How is its condition? Is it informed and governed by God's Word? Is it sensitive to the prompting of the Spirit? Do you heed it and exercise it so that God is always honoured and holiness upheld in out lives? May the Lord help us cultivate a healthy To Compete THE BIBLE conscience that is captive to His will!</i>\n\nDavid had just cut off a corner of Saul's robe. Saul was still relieving himself, oblivious to what was happening. Meanwhile David's men were standing by, ready to kill Saul at their leader's command. Clearly, in the eyes of David's men, this was a God-given opportunity.\n\nIt was at this crucial juncture, when David could easily have slain the adversary who was relentlessly pursuing him that his heart \"smote\" him. This means David's conscience was stricken, not by mere unease over a misdemeanour but by stark apprehension and horror at the sinfulness of what he had just done. Commentators have various opinions as to David's intention in cutting off the corner of Saul's robe and the gravity of this sin. Nevertheless, it is clear from his subsequent words and actions, that David had a tender conscience, one that was sensitive to the prompting of the Holy Spirit, one that was informed and ruled by God, and one that had deep reverence for God's sovereignty and judgement. David did not try to suppress his conscience but allowed his conscience to lead him to do right in God's eyes.\n\nGod has given each of us a conscience too. How is its condition? Is it informed and governed by God's Word? Is it sensitive to the prompting of the Spirit? Do you heed it and exercise it so that God is always honoured and holiness upheld in our lives? May the Lord help us cultivate a healthy conscience that is captive to His will!\n\n<b></b>\nAnd herein do I exercise myself, to have always a conscience void of offence toward God, and toward men. - Acts 24:16\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 4&version=KJV\">DANIEL 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 JOHN 4&version=KJV\">1 JOHN 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=THOUGHT And herein do I exercise myself, to have always&version=KJV\">THOUGHT And herein do I exercise myself, to have always</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=a conscience void of offence toward God, and&version=KJV\">a conscience void of offence toward God, and</a>\n<a href=\"https://www.biblegateway.com/passage/?search=towatd men. -- Acts 24:16&version=KJV\">towatd men. -- Acts 24:16</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "27 SEPTEMBER": "<b><u>27 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:6&version=KJV\">1 Samuel 24:6</a>\n\n<b>LESSON</b>\nThe LORD's anointed\n\n<b>VERSE 6</b>\n<i>And he said unto his men, The LORD forbid that I should do this thing unto my master, the LORD': anointed, to stretch forth mine hand against him, seeing he ts the anointed of the LORD.</i>\n\nIf there is one quality that characterises David, it is his profound reverence for God. So deep was his reverence that it extended even to those whom the LORD had anointed. And this was why he refused to harm Saul--because Saul was the \"LORD's anointed\".\n\nWhat is the significance of anointing? Under the old covenant, the act of anointing with oil signified that God had set apart that person and given him authority for his office. Submission to the authority of the LORD's anointed therefore signified one's submission to the Lord Himself; reverence for the LORD's anointing indicates one's reverence for that which is sacred and holy. Although Saul had drifted from God, even seeking to kill David, David revered the LORD behind Saul's throne and continued to give Saul utmost respect.\n\nToday, individuals are no longer anointed to the Old Testament offices because our Lord Jesus Christ, the Anointed One, has perfectly fulfilled all those roles. Nevertheless, God continues to ordain faithful men to lead His church and His work. How much respect do we show our leaders? Do we bear a critical and judgemental attitude towards them, question their decisions, doubt their competence, or criticise their preaching? How easy it is for us to lose sight of the LORD behind the man! While it does not mean we should have an unquestioning servile attitude towards the leadership, it does mean we must accord respect to the office and love for the Lord's ministers. Revere the LORD and wait patiently to see what He will achieve through His ordained servants.\n\n<b>THOUGHT</b>\nLet every soul be subject unto the higher powers. For there is no power but of God: the powers that be are ordained of God. - Romans 13:1\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 5&version=KJV\">DANIEL 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=1 JOHN 5&version=KJV\">1 JOHN 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "28 SEPTEMBER": "<b><u>28 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:7-8&version=KJV\">1 Samuel 24:7-8</a>\n\n<b>LESSON</b>\nLove your enemies\n\n<b>VERSE 8</b>\n<i>David also arose afterward, and went out of the cave, and cried after Saul, saying, My lord the king. And when Saul looked behind him, David stooped with his face to the earth, and bowed himself.</i>\n\nDavid not only refused to take advantage of the situation to kill Saul, he also \"stayed\" his men from doing so. The Hebrew word for \"stayed\" means to tear apart an animal. It is an unusual word to use in this context, but it reflects his radical obedience that stems from a profound reverence for God. Instead of \"tearing apart\" their enemy, David \"tore apart\" their murderous intent to lay hands on the LORD's anointed.\n\nDavid did not stop at sparing his pursuer's life, he went out of the way to assure Saul of his continued allegiance. David waited until Saul was safely out of the cave before calling out to him. He addressed Saul with a term of utmost respect and bowed humbly before him.\n\nDavid's treatment of Saul illustrates what it means to love our enemies, as our Lord Jesus has taught us in Matthew 5:44. Even though Saul sought to kill him, David did not retaliate in kind but overcame evil with good [Romans 12:21]. He was able to do so because he trusted God to accomplish His purpose in his life.\n\nUltimately, David points us to our Lord Jesus. As sinners, we are all enemies of the Holy God. \"But God commendeth His love toward us, in that, while we were yet sinners, Christ died for us\" [Romans 5:8]. Is there anyone you find hard to forgive? Pray and ask God to help you love and forgive your enemies, just as you have been loved and forgiven.\n\n<b>THOUGHT</b>\nDo you bless and pray for your enemy, as our Lord commanded? Do it and experience how God will use your prayers to transform your heart and enable you to love your enemy.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 6&version=KJV\">DANIEL 6</a>\n<a href=\"https://www.biblegateway.com/passage/?search=2 JOHN&version=KJV\">2 JOHN</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "29 SEPTEMBER": "<b><u>29 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 11 him. -- ee</b>\n<i>Moreover, my father, see, yea, This passage contrasts David's integrity against see the skirt of thy robe in my Saul's lack thereof. Given the opportunity, David hand: for in that I cut off the did not use providence or his men's urgings as skirt of thy robe, and killed excuses to take a life. Instead he stood firm doing what he knew was right - giving reverence to the LORD and His anointed. In contrast, Saul was not so much misled by his men's lies, as by the and I have not sinned against harbouring of evil in his heart because he was thee; yet thou huntest my soul jealous of David. Using his men's lies as an excuse, to take it he relentlessly pursued David to kill him. So strong was his evil desire that he diverted three thousand of his best soldiers in the midst of the war with the Philistines to hunt David [v. 2]. Our Lord Jesus taught us that obeying God begins with the heart [Matthew 5:21-32]. Do your actions reflect the integrity of your heart or do you find excuses to cover up your motives? May the Lord help us to walk close to Him with integrity of thee not, know thou and see that there 1s neither evil nor transgression in mine hand, heart. To CompLete THE BIBLE</i>\n\nHaving demonstrated his allegiance through his actions, David now defended his integrity through his words. He declared that when providence brought Saul into the cave and some of his men urged him to kill Saul, he refused. Holding up the piece of Saul's robe as proof of his integrity, David declared that he bore no evil in his heart. He had neither transgressed against the Lord nor sinned against Saul; it was Saul who wanted to kill him.\n\nThis passage contrasts David's integrity against Saul's lack thereof. Given the opportunity, David did not use providence or his men's urgings as excuses to take a life. Instead he stood firm doing what he knew was right - giving reverence to the LORD and His anointed. In contrast, Saul was not so much misled by his men's lies, as by the harbouring of evil in his heart because he was jealous of David. Using his men's lies as an excuse, he relentlessly pursued David to kill him. So strong was his evil desire that he diverted three thousand of his best soldiers in the midst of the war with the Philistines to hunt David [v. 2].\n\nOur Lord Jesus taught us that obeying God begins with the heart [Matthew 5:21-32]. Do your actions reflect the integrity of your heart or do you find excuses to cover up your motives? May the Lord help us to walk close to Him with integrity of heart.\n\n<b></b>\nSearch me, O God, and know my heart: try me, and know my thoughts: And see if there be any wicked way in me, and lead me in the way everlasting. - Psalm 139:23-24\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 7&version=KJV\">DANIEL 7</a>\n<a href=\"https://www.biblegateway.com/passage/?search=3 JOHN&version=KJV\">3 JOHN</a>\n<a href=\"https://www.biblegateway.com/passage/?search=PRAYER Search me, O God, and know my heart: try me, and&version=KJV\">PRAYER Search me, O God, and know my heart: try me, and</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=know my thoughts: And see if there be any wicked&version=KJV\">know my thoughts: And see if there be any wicked</a>\n<a href=\"https://www.biblegateway.com/passage/?search=way in me, and lead me in the way everlasting.&version=KJV\">way in me, and lead me in the way everlasting.</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n<a href=\"https://www.biblegateway.com/passage/?search=-- Psalm 139:23-24&version=KJV\">-- Psalm 139:23-24</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>",
    "30 SEPTEMBER": "<b><u>30 SEPTEMBER</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=1 Samuel 24:12-15&version=KJV\">1 Samuel 24:12-15</a>\n\n<b>LESSON</b>\nThe LORD be the Judge\n\n<b>VERSE 15</b>\n<i>The LORD therefore be judge, and judge between me and thee, and see, and plead my cause, and deliver me out of thine hand.</i>\n\nIn the face of Saul's false allegations and murderous intent, David did not seek to avenge himself; he called upon the LORD to be the judge. In defence he quoted a proverb to assert his righteousness, demonstrated by his refusal to take Saul's life, unlike Saul who actively sought David's death. David called himself a dead dog and a flea--a contemptible and worthless being too insignificant for a king to bother with.\n\nWhy was David able to wait upon the LORD to judge and avenge him? Because of his faith, reverence, obedience, and humility. As we have seen, David had profound reverence for the LORD and faith in Him to accomplish His purposes in his life. David was also resolute in obeying the LORD and refused to give in to temptation and take things in his own hands. Lastly, he was humble. He had a deep sense of his own insignificance, unworthiness and sinfulness and deferred to the LORD to take up his cause.\n\nYou may think you do not measure up to David, especially in your times of suffering and anguish. But we can and should look to the LORD to be our judge, not because of how good we are, but because of who He is. He is the perfectly just and merciful judge. The wicked will not go unpunished; nor can we escape His judgement. Yet by His mercies through His Son our Saviour, those who repent and put their faith in the Lord Jesus Christ will not be consumed by God's wrath but saved unto eternal life. His compassions fail not; great is His faithfulness.\n\n<b>THOUGHT</b>\nDearly beloved, avenge not yourselves, but rather give place unto wrath: for it is written, Vengeance is mine; I will repay, saith the Lord. - Romans 12:19\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=DANIEL 8&version=KJV\">DANIEL 8</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JUDE&version=KJV\">JUDE</a>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a></b>"
}