{
    "1 OCTOBER": {
        "part1": "Romans 6:1",
        "part2": "What Shall We Say Then?",
        "part3": "VERSE 1",
        "part4": "What shall we say then? Shall we continue in sin, that grace may abound?",
        "part5": "In the preceding chapter, Paul listed the blessings our Lord Jesus Christ has won for us - justification and peace with God [Romans 5:1], access into grace and hope of glory [v. 2], spiritual sustenance [v. 3], gift of the Holy Spirit [v. 5], love of God [v. 8], eternal security [v. 9], joy in God [v. 11]. From Paul's question here, we can surmise that the Christians in Rome were either ignorant of the doctrines of grace or negligent in understanding or impudent in their defiance. It seems the latter two are more likely. This phrase \"What shall we say then?\" is used eight times in Romans [3:5; 4:1; 6:1; 7:7; 8:31; 9:14, 30; 11:15] and each time, Paul uses it to initiate a rebuttal to the believers' nonchalant response to what Paul had taught them. In a sense, Paul is rebuking the Romans that this is no way to respond to the doctrines of grace. This serves as a reminder to us. We must always remember that God's grace is great [Acts 4:33], sufficient [2 Corinthians 12:9], rich [Ephesians 1:7], abundant [1 Timothy 1:14], and manifold [1 Peter 4:10]. The grace of God is the Gospel [Acts 20:24]. In light of such glorious truths, it is therefore reprehensible to say, \"Let us do evil so that more good may come.\" It is unconscionable if we, not only abuse this grace, but also fail to seize every opportunity to preach the Gospel of grace while many souls are perishing.",
        "part6": "THOUGHT",
        "part7": "So what shall we say then? What is our response to the grace of God offered?",
        "part8": [
            "DANIEL 9",
            "MATTHEW 1"
        ]
    },
    "2 OCTOBER": {
        "part1": "Romans 6:1",
        "part2": "Can a Christian Sin? A Natural Disposition",
        "part3": "VERSE 1",
        "part4": "What shall we say then? Shall we continue in sin, that grace may abound?",
        "part5": "The response of the Roman believers to the doctrine of grace exposes the natural disposition of fallen man. If the grace of God triumphs in us [Romans 5:21], does it not give licence for loose living? This is what the Romans seem to be suggesting, \"let us sin more so that grace will be more evident in our lives.\" The issue is that if grace triumphs overall, then what is God's purpose in giving the law? Surely, it cannot be for nothing. How then does the law fit into Paul's teaching of the doctrines of grace? If we say the Gospel is one of salvation by grace without works, why should we be concerned about how we live? Should we not just keep on sinning so that grace may abound? Your answers to these questions are really a test to see if the Gospel you believe is biblical. There are some who teach that to be saved, you must do works, and you must do them long enough and well enough. That is not the Gospel. There are others who say that after we have been saved, how we live does not matter. That also is not the Gospel. The natural disposition, as far as the unrepentant sinner is concerned, is that sin is fun. We have an inherent sinful nature that predisposes us to sin. But for the truly born-again believer, the grace of God dampens that original disposition, and puts us on the path of righteousness. As far as our flesh is concerned, the path of righteousness is unnatural because it demands self-denial and cross bearing, something we can only do daily with the grace of God.",
        "part6": "THOUGHT",
        "part7": "The grace that saves us from sin is the same grace that sustains us in sanctification.",
        "part8": [
            "DANIEL 10",
            "MATTHEW 2"
        ]
    },
    "3 OCTOBER": {
        "part1": "Romans 6:1",
        "part2": "Can a Christian Sin? A Logical Objection",
        "part3": "VERSE 1",
        "part4": "What shall we say then? Shall we continue in sin, that grace may abound?",
        "part5": "There is an irreverent attitude amongst some Christians who glibly declare that God is in the forgiving business, suggesting that when we sin, God is obligated to forgive. The more we sin, the more God forgives. This distortion of the doctrine of grace ignores the fact that God justifies the sinner at an enormous price. Sin demands God's wrath and the sinner's death. But God put forth His Son, our Lord Jesus Christ, as the perfect sacrifice to suffer death in the place of the ones who deserved His wrath and their death. The Son of God was crushed for our iniquities. In light of this, not only is the disposition to sin in the believer unnatural, but also logically objectionable, the reasons being: First, to have eternal life, sinners must be justified which is to be declared righteous by God. The act of justification means that guilt is totally eradicated, which also means it is inconceivable for a person who has experienced God's justifying grace to want to continue in sin. Second, the regenerating power of the Holy Spirit also works to mortify the deeds of the body (see Romans 8:13). In other words, justified people, by the work of the Holy Spirit, have put sin to death. If we have died to the deeds of our sinful flesh, then we who have been justified cannot want to continue in sin. Third, sinners are naturally averse to the law of God. Christians, however, are delivered from the flesh, meaning that we cannot continue in lawlessness because God's Law is now written in our hearts. It is logically untenable for us to love God, obey His commandments and yet continue in sin. Those who continue in sin do so because they are in bondage to the law of sin.",
        "part6": "THOUGHT",
        "part7": "If you are not dead to sin, you will die in sin.",
        "part8": [
            "DANIEL 11",
            "MATTHEW 3"
        ]
    },
    "4 OCTOBER": {
        "part1": "Romans 6:2",
        "part2": "An Unthinkable Proposition",
        "part3": "VERSE 2",
        "part4": "God forbid. How shall we, that are dead to sin, live any longer therein?",
        "part5": "God forbid! The phrase in Greek reads literally as \"not may it be\" or \"let it never be\" or \"by no means\". The phrase carries the force of negation, meaning that such a thought should never be considered at all. In the context of Romans 6, Paul is saying the thought that one who has been delivered from sin by grace would turn around and abuse that grace by continuing in sin is unthinkable. Such a notion runs against the very purpose of God's salvation. God's purpose in salvation is to deliver us from the bondage of sin. This deliverance means more than just being spared God's punishment for our sin. It is true we are justified by God and so saved from His wrath at the final judgment. While certainly true, that is only one aspect of salvation. The other aspect is the deliverance from the guilt of sin. This second aspect is important because our sin is not simply overlooked. The Lord Jesus Christ died on the cross and took the punishment on our behalf. We did not get a reprieve just because God is loving but rather, we are restored. By the substitutionary sacrificial atonement of Christ, we are not merely pardoned sinners in God's eyes, but have become His beloved children. We are delivered sinners and we are beloved children - these two aspects of salvation are inseparable. Thus, if we continue in sin, we will not only be contradicting the purpose of God's salvation, but also denying the loving relationship we have with God by virtue of the work of our Lord Jesus Christ.",
        "part6": "THOUGHT",
        "part7": "If you are a child of God, live like a child of God.",
        "part8": [
            "DANIEL 12",
            "MATTHEW 4"
        ]
    },
    "5 OCTOBER": {
        "part1": "Romans 6:2",
        "part2": "Why Christians Cannot Continue in Sin [1]",
        "part3": "VERSE 2",
        "part4": "God forbid. How shall we, that are dead to sin, live any longer therein?",
        "part5": "Antinomianism is a compound word comprising \"anti\" (against) and \"nomos\" (law). It is the notion that the Law of God is totally redundant for the New Testament believer because it was intended for Israel, and not the Church. Antinomians argue that since we are under grace, Old Testament Law no longer has any place in our lives. This idea is absurd because it completely dismisses God's means of salvation. Sinners are justified and accorded a right standing before God because of the sacrificial act of our Lord Jesus Christ. Our salvation is accomplished by God's justification and Christ's redemption. God forgives the sins that the old man has committed, and the Holy Spirit gives life to the new man. The new man must live a new life - one of faith in the redemptive work of God and one of loving obedience to His commandments. Paul uses the phrase \"in Christ\" to describe the believer's relationship with our Lord Jesus (see Romans 8:1; 1 Corinthians 15:22; etc). This union is neither mechanical nor legal in nature. It is a vital union like branches to the vine, or a body to its head. It means that if we are in Christ, He lives in us, and His life in us will cause us to hate sin and love righteousness. Our Lord Jesus who is the fountain head of holiness cannot be the source of sin, and we who are in union with Him (being the branches vitally attached to the life-giving vine) cannot go on sinning so that grace may abound. That is why Paul asks, \"How shall we, that are dead to sin, live any longer therein?\"",
        "part6": "THOUGHT",
        "part7": "Christ in us cannot but bear the fruit of holiness.",
        "part8": [
            "HOSEA 1",
            "MATTHEW 5"
        ]
    },
    "6 OCTOBER": {
        "part1": "Romans 6:2",
        "part2": "Why Christians Cannot Continue in Sin [2]",
        "part3": "VERSE 2",
        "part4": "God forbid. How shall we, that are dead to sin, live any longer therein?",
        "part5": "Antinomians have not only failed to understand, but also misinterpreted and misapplied the grace of God. Paul writes about the abundant grace of God [2 Corinthians 4:15]. \"Where sin abounded, grace did much more abound\" [Romans 5:20]. This means that God's grace will never diminish or fade; nor will it ever be exhausted because of our sin. God will never cease to be gracious when we sin. On the contrary, God's grace, like the gathering momentum of the incoming ocean tide, strengthens when we sin, \"so might grace reign through righteousness unto eternal life by Jesus Christ our Lord\" [Romans 5:21]. The late Martyn Llyod-Jones describes grace as an undefeated triumphant king marching on to war against sin. The grace of God, he adds, \"is to deliver us from the bondage and the reign of sin, and to put us under the reign of grace.\" The grace of God is victorious on every front. And if God's grace reigns in us, we are also advancing in our conquest over sin. Do Christians sin? Certainly. But God's triumphant grace means that sin will never reign over us. We are never defeated by sin. We do not continue in it. So Paul's rhetorical question in today's verse informs us of the impossibility of sin having the upper hand in the believer's life. The goal of grace is to destroy sin. That victory is assured. Therefore, for a person to continue in sin is to have no part in that grace, and such a person remains in bondage to sin and is not saved.",
        "part6": "THOUGHT",
        "part7": "Wonderful the matchless grace of Jesus, deeper than the mighty rolling sea, higher than the mountain, sparkling like a fountain, all sufficient grace for even me. - Haldor Lillenas",
        "part8": [
            "HOSEA 2",
            "MATTHEW 6"
        ]
    },
    "7 OCTOBER": {
        "part1": "Romans 6:2",
        "part2": "Dead to Sin",
        "part3": "VERSE 2",
        "part4": "God forbid. How shall we, that are dead to sin, live any longer therein?",
        "part5": "The concept of \"we, that are dead to sin\" is critical to our understanding of salvation. To appreciate this truth is to know the importance and necessity of holy living. This is the key to the believer's sanctification. Paul uses the first-person pronoun \"we\" to make an emphatic statement and to distinguish between \"we\" (those who are in Christ) and before we come to Christ and others who are still not in Christ. What does \"dead to sin\" mean? It does not mean Christians are no longer responsive to sin; that believers no longer feel and respond to temptations. We know this is not the case in our personal experience. \"Dead to sin\" also does not mean that Christians are commanded to die to sin. Those in the holiness movement suggest that this is the key to victorious Christian living. But this interpretation is wrong because it starts with man and not God. No sinner, of his own accord, can die to sin. Paul here is stating a fact that is true to us only when we are in Christ. We must understand that the basis and source for our sanctification is the work that our Lord Jesus Christ has done for and in us. By His atoning, we are dead to sin, and not gradually dying to sin. Another misinterpretation is to equate \"dead to sin\" as \"dead to sin's guilt\". This view focuses on justification and ignores sanctification altogether. While it is true that we have died to sin's guilt and freed from sin's condemnation, Paul in verse 2 goes further to say that we can no longer live in sin. \"Dead to sin\" therefore highlights our uniqueness, and our special position in and our special relationship with our Lord Jesus Christ. Paul is making the point that we - being who we are - are to be different. We are no longer bound to sin. We are dead to sin.",
        "part6": "THOUGHT",
        "part7": "Therefore if any man be in Christ, he is a new creature: old things are passed away; behold, all things are become new. - 2 Corinthians 5:17",
        "part8": [
            "HOSEA 3",
            "MATTHEW 7"
        ]
    },
    "8 OCTOBER": {
        "part1": "Romans 6:2",
        "part2": "Alive from the Dead",
        "part3": "VERSE 2",
        "part4": "God forbid. How shall we, that are dead to sin, live any longer therein?",
        "part5": "This phrase - \"we ... are dead to sin\" is repeated later in verses 10 and 11. In verses 2 and 11, the reference is to Christians, whereas in verse 10, the reference is to our Lord Jesus Christ. The question then needs to be asked - How did Christ die to sin [Romans 6:10]? And in what sense are Christians dead to sin [Romans 6:2, 11]? The usual response is that Christ suffered for sin on our behalf. But in Romans 6:10, Paul does not say that Christ died for sin - though that was what He did. Paul explicitly states that Christ \"died unto sin\". For added emphasis, Paul says that Christ \"died unto sin once\" [Romans 6:10]. There is significant change. When God sent His own Son in the likeness of sinful flesh, and for sin, condemned sin in the flesh\" [Romans 8:3]; that sinful flesh is condemned and forever finished. While Christ was on earth, He experienced the infirmities and temptations of sinful flesh (though I hasten to add Christ did not sin). But having gone to the cross and resurrected, that sinful flesh is no longer present in our Lord Jesus. The same truth is also applied to believers. We too, are dead to sin [Romans 6:2, 11] by our union with Christ in His death and resurrection (although, and unlike our Lord Jesus, we still succumb to our carnal desire). The point is that our old life of sin in Adam is past. We are on a new track, and we can no longer go back to the old life because in Christ, we are dead to sin. Instead, we are \"alive unto God through Jesus Christ our Lord\" [Romans 6:11]. And in Christ, we advance on the path of righteousness.",
        "part6": "THOUGHT",
        "part7": "The biography of the Christian must show a distinction between our old nature before our conversion and our new nature in Christ. The old life of sin is gone, the new life in Christ has begun.",
        "part8": [
            "HOSEA 4",
            "MATTHEW 8"
        ]
    },
    "9 OCTOBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 3 In the New Testament, the word \"baptize\"' is",
        "part4": "",
        "part5": "W LESSON",
        "part6": "",
        "part7": "Know ye not, that so many of us as were baptized into Jesus Christ were baptized into his death?  THOUGHT  hat kind of life should a Christian live? Paul answers this question by way of a rhetorical question - \"Know ye not, that so many of us as were baptized into Jesus Christ were baptized into his death?\" While Paul did not establish the church of Rome, by the question, Paul assumed that they knew the significance of Christ's death, and understood the association between baptism and the death of our Saviour. In the New Testament, the word \"baptize\" is used in three ways - as an expression for the rite of \"baptism\", or in connection with Jewish ritualistic washings [Mark 7:4; Luke 11:38], or as a metaphor for the death of Christ (see Mark 10:38-39). In the context of Romans 6:3, it is clear that Paul uses \"baptism\" as a metaphor for the sacrificial death of Christ, and not as an explicit stipulation of a particular mode of baptism, namely immersion. In his epistle to the Corinthians, when Paul said that the Israelites were \"all baptized unto Moses\" [1 Corinthians 10:2] or when he asked if they were \"baptized in the name of Paul?\" [1 Corinthians 1:13], the meaning is that they were baptized in reference to Moses, Paul, or Christ, so as to be united with them. In his commentary on Romans, Charles Hodge writes, \"in the expression baptized into his death, the preposition expresses the design and the result,\" meaning that believers are baptized in order that we should be united to Christ, and the result is that we are brought into a personal relationship with Him, so that His death becomes meaningful to us, and we partake of its benefits.  Baptism signifies our deliverance from the bondage of sin and our entry into a new life of freedom.",
        "part8": [
            "HOSEA 5",
            "MATTHEW 9"
        ]
    },
    "10 OCTOBER": {
        "part1": "Romans 6:4",
        "part2": "Buried with Christ by Baptism",
        "part3": "VERSE 4",
        "part4": "",
        "part5": "B LESSON",
        "part6": "THOUGHT",
        "part7": "Therefore we are buried with him by baptism into death: that like as Christ was raised up from the dead by the glory of the Father, even so we also should walk in newness of life.  THOUGHT  urial follows death. Since believers who are \"baptized into Jesus Christ [are] baptized into His death\" [v. 3], it follows that believers are also \"buried with [Christ] by baptism into death\" [v. 4]. At the mere mention of baptism, the thoughts of some people immediately turn to the sacrament of water baptism, and those who believe immersion is the only mode of baptism argue that just as burial involves the whole body being put under the ground, so water baptism must necessarily mean the person has to be completely submerged under water. This argument fails to consider that the act of baptism - whether by sprinkling or immersion - produces no significant change in a person. In Romans 6:3-4, Paul is not speaking of the onetime act of baptism; rather he is talking about the permanent change as a result of being united in and to Christ - by being \"baptized into Jesus Christ\" [v. 3] and by being \"buried with him by baptism into death\" [v. 4]. Paul puts forth the same idea when he told the Galatians that \"as many of you as have been baptized into Christ have put on Christ\" [Galatians 3:27]. The main lesson of being \"buried with Christ by baptism into death\" is that just as burial is the final act that marks a person's death, so in baptism - being united with Christ - marks the end of the old life of sin and the beginning of the new life in Christ. Paul is making the point that we, having been identified with Christ's death, are \"buried\" with Him; our past has ended; we are a \"new creature: old things are passed away; behold, all things are become new\" [2 Corinthians 5:17]; it means we are dead to sin but made alive by the Spirit [Romans 8:11; 1 Peter 3:18]. Externally, water baptism dramatizes your decision to follow Christ. Internally, it serves as an impetus for holy living.",
        "part8": [
            "HOSEA 6",
            "MATTHEW 10"
        ]
    },
    "11 OCTOBER": {
        "part1": "Romans 6:4",
        "part2": "Raised with Christ in glory",
        "part3": "VERSE 4",
        "part4": "",
        "part5": "\" LESSON",
        "part6": "THOUGHT",
        "part7": "Therefore we are buried with him by baptism into death: that like as Christ was raised up from the dead by the glory of the Father, even so we also should walk in newness of life.  THOUGHT  So many of us as were baptized into Jesus Christ were baptized into his death ... raised up from the dead ... even so we also should walk in newness of life\" [v. 3-4]. Paul is saying that as all believers are joined with Christ in His death and burial, thus all believers are with Christ also in His resurrection. To put it another way, we die with Christ, in order that we shall live with Him. We share in His death so that we may be partakers of His life. That renders us completely identified with Him in death and resurrection, as Christ Himself promised, \"Because I live, ye shall live also\" [John 14:19]. Earlier in this epistle, Paul stated that God the Father raised the Son from the dead (see Romans 4:24-25). In Romans 6:4, Paul adds that \"Christ was raised up from the dead by the glory of the Father\". This phrase \"the glory of the Father\" has three aspects. First, the \"glory of the Father\" is the power of God, which simply means that Christ was raised by the \"power of the Father\". Second, Christ was also raised in glory in that it was a glorious resurrection. Third, \"Christ was raised up from the dead by the glory of the Father\" also suggests that the fullness of the Father's glory is most eminently displayed in raising Christ from the dead. In raising His beloved Son from the dead, the Father's glory is on full display because of the redemptive significance of the resurrection. The Lord Jesus Christ's resurrection is the most glorious display of divine power. God raised Christ from the dead in glorious triumph, and believers by virtue that are united in Him will also be raised in glory. What a blessed hope for the believer! Beloved, now are we the sons of God, and it doth not yet appear what we shall be: but we know that, when he shall appear, we shall be like him; for we shall see him as he is. - 1 John 3:2",
        "part8": [
            "HOSEA 7",
            "MATTHEW 11"
        ]
    },
    "12 OCTOBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 4 the moral laws; that a born-again person can",
        "part4": "",
        "part5": "D LESSON",
        "part6": "",
        "part7": "Therefore we are buried with him by baptism into death: that like as Christ was raised up from the dead by the glory of the Father, even so we also should walk in newness of life.  THOUGHT  eath is the end of life. When believers are buried with Christ by baptism into death, it means that the old man of sin is dead. In Christ, a new creature is born; new life begins. And the new man must walk in newness of life. The new man cannot continue to live the old life. The antinomians (\"anti\" meaning \"against\" and \"nomos\" meaning \"law\") teach otherwise. They claim that believers are neither required nor expected by God to obey the moral laws; that a born-again person can continue to live in sin so that grace may abound [v. 1]. This is the heresy Paul was dealing with. The Apostle used the images of death and the newness of life to dispel the error of antinomianism and emphasize the necessity of a believer's complete break from the sinful life of the past. A Christian - redeemed by the precious blood of Christ - cannot continue to wallow in the mire of sin. Walking presupposes the possession of life, and walking is used in the Scriptures as a metaphor for living. Paul says, \"If we live in the Spirit, let us also walk in the Spirit\" [Galatians 5:25]. And if we have \"received Christ Jesus the Lord, so walk ye in him\" [Colossians 2:6]. In Romans 6:4, when Paul says that Christians are to \"walk in newness of life\", he is not talking about the mere fact of being alive. When Lazarus was raised from the dead, he was brought back to a living state, but he did not have a newness of life. This newness of life that Paul talks about is a new kind of life - one that is marked by sobermindedness, righteous, and godly living in this present world [Titus 2:12]. We must be reconciled to God in order to be holy, and we cannot be reconciled without thereby becoming holy.",
        "part8": []
    },
    "13 OCTOBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 5 2001; the tsunami of 26 December 2004 that",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "For if we have been planted together in the likeness of his death, we shall be also in the likeness of his resurrection.  THOUGHT  here are events in history that are of great significance, such as 31 October 1517 when Martin Luther nailed the 95 Theses on the door of Wittenberg Castle and lit the fires of the 16th Century Reformation; the atomic bombings of Hiroshima and Nagasaki on the 6 and 9 August 1945. Some of you, who are older, will remember more recent events - the terrorist attacks on the Twin Towers in New York City on 11 September 2001; the tsunami of 26 December 2004 that killed a quarter million people. We lived through those events, but were not actually present at any of them. We have an intellectual but not an experiential connection. There is, however, one event in which we are not present, but with which we have an intimate connection, namely the crucifixion and the resurrection of our Lord Jesus. \"He came unto his own, and his own received him not\" [John 1:11]. He was crucified. He rose from the dead. We were not present when Christ died and rose again. But faith transports us to that world-changing event, and we are united with Christ in His death and resurrection! The timelessness of the eternal Christ intersects with our time-bound lives so that we may know the newness of life. In Romans 6:5, Paul says that believers \"have been planted together in the likeness of [Christ's] death, we shall be also in the likeness of [Christ's] resurrection\". It simply means that we are united with Christ. In a sense, a believer can say, \"I was there\". That union must be life-transforming, as Peter says, though we have not seen Christ, \"ye love; in whom, though now ye see him not, yet believing, ye rejoice with joy unspeakable and full of glory\" [1 Peter 1:8]. Blessed are they that have not seen [not there], and yet have believed. - John 20:29",
        "part8": []
    },
    "14 OCTOBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 6 to Christ in repentance by faith, we were crucified",
        "part4": "",
        "part5": "I LESSON",
        "part6": "",
        "part7": "Knowing this, that our old man is crucified with him, that the body of sin might be destroyed, that henceforth we should not serve sin.  THOUGHT  t is clearly shown in the preceding verses that the gift of salvation by grace through the death and resurrection of Jesus Christ does not mean freedom to continue in sin. On the contrary, believers saved by grace should not serve sin. Verse 6 further explains why. Firstly, our old man has been crucified with Him (Christ). The old man refers to the corrupt unregenerate self we received in Adam described in chapter 5. When we turned to Christ in repentance by faith, we were crucified with Him, and we rose with Him. Crucified means our old self is put to death and consequently our body of sin is destroyed. Secondly, the word \"destroyed\" literally means \"to make something ineffective by removing its power of control\". Having received new life in Christ, our old self (the old man) has no more power and control over us. Sin no longer reigns in our body. That is why it is wrong for a believer to blame the old man when he sins and claim he cannot help it. The reason we still sin is that the newness of life we have in Christ is not yet perfected. We are in the process of being sanctified. Sin is still being expressed through the weaknesses of our human flesh. That is why we bear responsibility for our sins and not blame it on our old nature. With the help of God, we are able to not serve sin but serve our Lord by obeying His Word and living victoriously for Him.  Likewise reckon ye also yourselves to be dead indeed unto sin, but alive unto God through Jesus Christ our Lord. - Romans 6:11",
        "part8": [
            "HOSEA 10",
            "MATTHEW 14",
            "we should not serve sin.",
            "THOUGHT Likewise reckon ye also yourselves to be dead",
            "indeed unto sin, but alive unto God through Jesus",
            "Christ our Lord. -- Romans 6:11"
        ]
    },
    "15 OCTOBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 6 to death. Unless we lay hold of this wondrous truth",
        "part4": "",
        "part5": "G LESSON",
        "part6": "",
        "part7": "Knowing this, that our old man is crucified with him, that the body of sin might be destroyed, that henceforth we should not serve sin.  THOUGHT  iven the principle that the old man in us is dead and sin has no more power over us, God's Word exhorts us henceforth we should not serve sin. This tells us firstly, that sin can still exert an influence over us to try to control us like it did before we were saved. Secondly, we must be resolved to resist temptation and not allow sin to reign over our mortal body. Thirdly, we must believe what the Scriptures say about our old nature having been put to death. Unless we lay hold of this wondrous truth which is the very basis of our faith in our Lord, we will fall back to serving our former master, sin. Is this not why believers who should be living victorious Christian lives are rather living defeated ones? Instead of trusting the Lord to live by faith founded on His Word with disciplined resolve, they live in their own strength by sight and therefore succumb to sin. Is this what you are going through? But even if we are saved by grace in Christ and living by faith, it does not mean we will struggle no more against temptation. We are still in the flesh and as yet imperfect. How then do we not serve sin? Only by constantly looking to God and yielding ourselves to our Lord Jesus. Romans 6:13 says, \"Neither yield ye your members as instruments of unrighteousness unto sin: but yield yourselves unto God, as those that are alive from the dead, and your members as instruments of righteousness unto God.\" We submit ourselves daily to God.  Having therefore these promises, dearly beloved, let us cleanse ourselves from all filthiness of the flesh and spirit, perfecting holiness in the fear of God. - 2 Corinthians 7:1",
        "part8": [
            "HOSEA 11",
            "MATTHEW 15",
            "THOUGHT Having therefore these promises, dearly beloved,",
            "let us cleanse ourselves from all filthiness of the",
            "flesh and spirit, perfecting holiness in the fear of",
            "God. -- 2 Corinthians 7:1"
        ]
    },
    "16 OCTOBER": {
        "part1": "Romans 6:7",
        "part2": "Freed from Sin",
        "part3": "VERSE 7",
        "part4": "",
        "part5": "W LESSON",
        "part6": "THOUGHT",
        "part7": "For he that is dead is freed from sin.  THOUGHT  hat does it mean to be freed from sin? The perfect sacrifice of Jesus Christ on the cross for our sins, meant that for those who believe and trust Him, sin no longer rules over their mortal body and souls. We are no more under the control of sin. We are freed from the guilt and punishment of our sins because Jesus paid it all by the atonement of His shed blood and death. And God accepted that payment and declared us \"not guilty\". Question is - If we are freed from sin why do we still sin? Because even though the old man within us is dead with no power to dictate, the human frailty of our flesh is still bent towards sin. The only way to strengthen our weaknesses is to walk in newness of life. According to Ephesians 4:22-24, \"That ye put off concerning the former conversation the old man, which is corrupt according to the deceitful lusts; And be renewed in the spirit of your mind; And that ye put on the new man, which after God is created in righteousness and true holiness.\" In other words, freedom from sin can be our experience when we continue casting off our old sinful lifestyle and put on the new born-again nature we have in Christ. We have examples of what to put away in Colossians 3:8-9 \"But now ye also put off all these; anger, wrath, malice, blasphemy, filthy communication out of your mouth. Lie not one to another, seeing that ye have put off the old man with his deeds\". This is how we ought to live our lives since we are freed from sin by God's grace.  I am crucified with Christ: nevertheless I live; yet not I, but Christ liveth in me: and the life which I now live in the flesh I live by the faith of the Son of God, who loved me, and gave himself for me. - Galatians 2:20",
        "part8": [
            "HOSEA 12",
            "MATTHEW 16"
        ]
    },
    "17 OCTOBER": {
        "part1": "Romans 6:7",
        "part2": "True Freedom",
        "part3": "VERSE 7",
        "part4": "",
        "part5": "B LESSON",
        "part6": "THOUGHT",
        "part7": "For he that is dead is freed from sin.  THOUGHT  efore our conversion, we were under the bondage of sin. In that previous state of \"freedom\" we had, it was really the freedom to express the depravity of our sin nature. Then, sin was our master and under its dictate we sinned freely without restrain. But thank God for His plan of Salvation so rich and free that redeemed us with the price of the shed blood of His Son Jesus Christ on Calvary's cross. That is the price of true freedom summed up by our Lord in John 8:34, 36: \"... whosoever committeth sin is the servant of sin ... if the Son therefore shall make you free, ye shall be free indeed.\" We see how the Lord forgave and set free the woman caught in adultery [John 8]. Knowing the true condition of her believing heart, Jesus said to her \"Neither do I condemn thee: go, and sin no more\" [John 8:11]. This did not mean sinless perfection henceforth for her, but speaks of true freedom from guilt, bondage and eternal judgment. This brings us back to God's Word, our infallible source of true freedom. John 8:31-32 read, \"Then said Jesus to those Jews which believed on him, If ye continue in my word, then are ye my disciples indeed; And ye shall know the truth, and the truth shall make you free.\" The only way we can enjoy true freedom from sin is to trust and obey God's Word. \"Thy word have I hid in mine heart that I might not sin against Thee\" [Psalm 119:11]. Being set free from sin, we are then to serve others through telling them the Gospel to meet their needs.  Freely we have received, freely we give.",
        "part8": [
            "HOSEA 13",
            "MATTHEW 17"
        ]
    },
    "18 OCTOBER": {
        "part1": "Romans 6:8",
        "part2": "Raised Together",
        "part3": "VERSE 8",
        "part4": "",
        "part5": "I LESSON",
        "part6": "THOUGHT",
        "part7": "Now if we be dead with Christ, we believe that we shall also live with him.  THOUGHT  n the preceding verses Paul showed us that to be saved by grace through faith in Christ is to be identified with Him in His death and resurrection. Ephesians 2:5-6 explains - \"Even when we were dead in sins, hath quickened us together with Christ, (by grace ye are saved;) And hath raised us up together, and made us sit together in heavenly places in Christ Jesus\". Because we died with Christ, we will also live with Him who is risen from the dead. The result of His death and resurrection is twofold. First, spiritually we have new life in Christ to live for Him today. Second, we can look forward to the day when the Lord will raise us up physically to be with Him forevermore. Meanwhile since the Lord has raised us from spiritual death, how do we live in newness of life? Paul tells us in 1 Corinthians 15:31b that \"... in Christ Jesus our Lord, I die daily\". How do we reconcile \"I die daily\" with our living daily for Christ? It means that the way to live for Christ is to die to self. We must be willing to die to pride, envy, resentment and anything else that displeases the Lord and thereby we live for Him. In Christian living, how much we are willing to die to self is in direct proportion to how much people see Christ shining through us. The more we die to self, the more Christ is magnified through our conduct. We thank God that He not only raised us together in Christ, but also empowered us to live so when we give ourselves to Him.  Therefore we are buried with him by baptism into death: that like as Christ was raised up from the dead by the glory of the Father, even so we also should walk in newness of life. - Romans 6:4",
        "part8": [
            "HOSEA 14",
            "MATTHEW 18"
        ]
    },
    "19 OCTOBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 9 the wages of sin is death. For mankind, there is",
        "part4": "",
        "part5": "F LESSON",
        "part6": "",
        "part7": "Knowing that Christ being raised from the dead dieth no more; death hath no more dominion over him.  THOUGHT  rom the time of Adam, the most dreaded event for mankind is death. The natural man fears it because he does not know what will happen after death. The world has conceived many theories, legends, folk tales and hypotheses concerning death and the afterlife. None of these are true but built upon the imaginations and fabrications of man's fancy. The Bible clearly tells us that all have sin and the wages of sin is death. For mankind, there is no escaping death. But while death is the end of our earthly life, it is also the beginning of a living conscious eternity either in heaven or in hell. Our Lord Jesus died but was resurrected on the third day and lives again forevermore. This gives us the reason and assurance that those who believe in Him will rise too, for He told us so [John 14:19]. We may live for 70 years and more or less. Then this short life as we know it is done. So let us live to serve God for His glory. We do not need to accumulate vast wealth for we will take nothing with us. Living on earth is a temporary sojourn but in Christ we will be in Heaven with Him forever. Christians therefore need not fear death. We face sicknesses and heartaches while we dwell in our bodies of flesh. But all these will be gone, and we exchange this fragile life for an eternal lasting one. So, serve God, obey His Word and preach the Gospel. Help others find the way to life everlasting by believing in Jesus as the Saviour. Thank God all fear of death is gone, and ignorance of the afterlife is removed. It is because our Saviour lives.  O death, where is thy sting? O grave, where is thy victory? - 1 Corinthians 15:55",
        "part8": []
    },
    "20 OCTOBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 10 Jesus died for our sins of the past. Some wrongly",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "For in that he died, he died unto sin once: but in that he liveth, he liveth unto God.  THOUGHT  his is the complete Gospel concisely summarised in one verse. Unlike the people of the Old Testament, we no longer need priests to offer sacrifices on our behalf because the Lord Jesus died on the cross for us two thousand years ago, cleansing us of our sins, past, present and future. And whosoever confesses their sins and trusts in the work of Christ on the cross, will be saved. Jesus died for our sins of the past. Some wrongly think that their past sins are too grievous to be forgiven. But no, there is no sin too big that cannot be covered by the blood of Christ - as long as we truly confess them and ask God for forgiveness, \"He is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness\" [1 John 1:9]. This is God's promise to us. Jesus died for our sins in the present. Some on the other hand think mistakenly that their present sins are too small for God to notice - that He is not bothered by their trivial transgressions. But no, there is no sin so small that God will condone. Do not let Satan gain a foothold in your life by thinking this. Read 1 Peter 1:13-16. God wants us to be holy, because He is holy. Jesus died for our sins of the future. Life is full of challenges and struggles, but we are confident that whenever we fall into temptation, we can come before God's throne of grace not only to ask for forgiveness, but also obtain strength and wisdom to live an abundant and victorious life. All because our Lord Jesus has died once for all our sins.  And that he died for all, that they which live should not henceforth live unto themselves, but unto him which died for them, and rose again. - 2 Corinthians 5:15",
        "part8": []
    },
    "21 OCTOBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 11 In today's verse, doctrine gives way to",
        "part4": "",
        "part5": "P LESSON",
        "part6": "",
        "part7": "Likewise reckon ye also yourselves to be dead indeed unto sin, but alive unto God through Jesus Christ our Lord.  THOUGHT  aul in the first five chapters of this letter taught that because of sin all men are condemned. In order to be saved from God's condemnation, righteousness is needed [Romans 1-3:20]; and when righteousness is imputed upon the sinner, he is justified and receives salvation grace [Romans 3:21-5:21]. Paul wanted his readers to understand the mystical union of believers with Jesus Christ, often reminding that Christians are \"in Christ\". In today's verse, doctrine gives way to exhortation. Scriptural exhortation must be built on spiritual knowledge. For example, God in His grace and compassion, gives the reason why we are to live according to His standards in His command - \"Be ye holy; for I am holy\" (see Leviticus 11:44; 1 Peter 1:15-16). So, Paul in following up with his teachings in Chapters 1 to 5 exhorts his readers here to \"Likewise reckon ye also yourselves to be dead indeed unto sin, but alive unto God through Jesus Christ our Lord.\" \"Reckon\" is an accounting term. Paul exhorts us to \"calculate\" the facts listed in verses 1-10 and act accordingly. To understand Paul's exhortation, we ought to know for a fact and believe the divine truths that we are now spiritually dead to sin and the reality that we are alive to God. Our Lord Jesus Christ suffered and died for our sins. Our sins are reckoned to Christ and paid for by Him. His righteousness is being reckoned (credited) to us. We are thereby justified and saved. Christ accomplished this for us. On the cross, He declared \"It is finished:\" [John 19:30]. We can count on that. Amazing love! ... That Thou, my God shouldst die for me? - Charles Wesley",
        "part8": []
    },
    "22 OCTOBER": {
        "part1": "Roman 6:11",
        "part2": "Live as One Who is Dead to Sin",
        "part3": "VERSE 11",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "Likewise reckon ye also yourselves to be dead indeed unto sin, but alive unto God through Jesus Christ our Lord.  THOUGHT  he first of two things God has done for us who believe is we can count on the divinely revealed fact that we are \"dead to sin\". This is stated explicitly in Romans 6:2, \"We that are dead to sin\". In verses 3 and 4, we were \"baptized into his death ... buried with him by baptism into death\". In verse 5, \"we have been planted together in the likeness of his death\". In verse 6, \"our old man is crucified with him\". In verse 7, \"For he that is dead is freed from sin\". However, it does not mean that we are now immune to sin and its temptation, nor will we not sin again. But it does mean that we are removed from the realm of sin. Though the force of sin is still in us, its force has been broken [v. 6]. Despite our present conflict with sin, we are no longer under sin's tyranny nor will ever be again. Christ has broken the power of sin over our lives. Being dead to sin means that sin no longer reigns over us. In our former natural condition, we were dead in sin, through Christ we are now dead to sin. With sin's tyranny broken, even in the midst of temptation we can successfully resist it in God's power. \"There hath no temptation taken you but such as is common to man: but God is faithful, who will not suffer you to be tempted above that ye are able; but will with the temptation also make a way to escape, that ye may be able to bear it [1 Corinthians 10:13].  Who his own self bare our sins in his own body on the tree, that we, being dead to sins, should live unto righteousness: by whose stripes ye were healed. - 1 Peter 2:24",
        "part8": [
            "AMOS 1",
            "MATTHEW 22"
        ]
    },
    "23 OCTOBER": {
        "part1": "Roman 6:11",
        "part2": "Live as One Alive to God",
        "part3": "VERSE 11",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "Likewise reckon ye also yourselves to be dead indeed unto sin, but alive unto God through Jesus Christ our Lord.  THOUGHT  he second thing God has done for us who believe is we are made alive unto God through Jesus Christ. Even as we have been united with Him in His death, we are united with Him in His resurrection. Paul is not speaking of the future resurrection at the end of our earthly life but rather a present experience of Christ's resurrection in our life even now. Just as we have died to sin, we have also been made alive through our Saviour. This has brought about a complete change in our relationship with God our Creator. Born in sin and prone to sin, we were condemned to face God's wrath. Now through Christ our Saviour we are reconciled to God [Romans 5:10]. Positionally we are justified, no more enemies of God but His friend, even adopted to be His children. There is no more condemnation [Romans 8:1]. In Christ we are a new creation even as Christ told Nicodemus \"Ye must be born again.\" [John 3:7]. As God breathed life into Adam to make him aware of his Creator, God has breathed new spiritual life into us. To be alive in God means we have complete awareness of Him and have a close relationship with Him. We become responsive to Him - His presence in our lives, His Word, grace, love, mercy and goodness. Now spiritually transformed, we are to be like Christ, having His heart and mind. All our thoughts, aspirations, desires and actions must now be attuned to God to the praise and glory of His name.  If ye then be risen with Christ, seek those things which are above, where Christ sitteth on the right hand of God. Set your affection on things above, not on things on the earth. - Colossians 3:1-2",
        "part8": [
            "AMOS 2",
            "MATTHEW 23"
        ]
    },
    "24 OCTOBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 12 surrendered to the evils of passion and falling into",
        "part4": "",
        "part5": "A LESSON",
        "part6": "",
        "part7": "Let not sin therefore reign in your mortal body, that ye should obey it in the lusts thereof.  THOUGHT  lthough believers are no longer living constantly in sin, sin is not completely eradicated from their lives. Sin will always be a powerful force attacking our mortal bodies with temptations to stir up the lust of our flesh, the lust of our eye and the pride of life [1 John 2:16]. It was so with David \"a man after God's own heart\", and many others recorded in the Bible who surrendered to the evils of passion and falling into sin now and then. We are no different. Sin, which had full dominion over the lives of unsaved sinners, is now dethroned from the hearts of believers but ever determined to regain his former throne. Paul himself speaks of his struggle with sin [Romans 7:15-25]. He admonishes believers \"let not sin therefore reign in your mortal body\". We are to hate evil [Psalm 97:10]. As believers, we are new creatures in Christ and our immortal souls are forever beyond sin's reach. Sin can attack only our mortal body now which one day will be glorified and be forever rid of sin [1 Corinthians 15:53]. As we are \"a chosen generation, a royal priesthood, an holy nation, a peculiar people; that ye should shew forth the praises of him who hath called you out of darkness into his marvellous light ... abstain from fleshly lusts, which war against the soul\" [1 Peter 2:9, 11b], Paul reminds us \"For it is God which worketh in you both to will and to do of his good pleasure.\" [Philippians 2:13]. Our lives will be controlled by God's will only as our wills are submitted to His.  Put on the whole armour of God, that ye may be able to stand against the wiles of the devil. For we wrestle not against flesh and blood, but against principalities, against powers, against the rulers of the darkness of this world, against spiritual wickedness in high places. - Ephesians 6:11-12",
        "part8": []
    },
    "25 OCTOBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 13a anymore. But even though we have been cleansed",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "Neither yield ye your members as instruments of unrighteousness unto sin: but yield yourselves unto God ...  THOUGHT  o yield is to give in and present oneself at the disposal of another who is greater than us. In yielding to another, we submit to his will and do not offer any resistance against him. When we were saved by our Lord Jesus, we submitted our lives to Him. We became new creatures in Christ because we were freed from the bondage of sin. Sin does not control our lives anymore. But even though we have been cleansed and forgiven of unrighteousness, we are neither sinless nor incapable of sin. The devil still tempts us to disobey God's commands with enticements of worldly pleasures and gratification of our fleshly desires. Even Abraham, Moses and David, men who loved God and were loved by God, yielded to temptation and sinned. Let us not be mistaken. Sin is a powerful force that Christians have to reckon with. Paul depicts sin as an ousted ruler who wants to reign over the believer as he did before [v. 12]. Paul exhorts us not to yield ourselves to sin but to resist it. Yield to God and offer our bodies to serve Him instead. Christian, do you yield yourself to God in the knowledge that He saved you through the atoning sacrifice of His only begotten Son, our Lord Jesus? God chose you to be His child because He is gracious and merciful towards you. The only correct response is to love Him and yield to Him.  But yield yourselves unto the LORD, and enter into his sanctuary, which he hath sanctified for ever: and serve the LORD your God, that the fierceness of his wrath may turn away from you. - 2 Chronicles 30:8",
        "part8": [
            "AMOS 4",
            "MATTHEW 25",
            "THOUGHT But yield yourselves unto the LORD, and enter into",
            "his sanctuary, which he hath sanctified for ever:",
            "and serve the LORD your God, that the fierceness",
            "of his wrath may turn away from you.",
            "-- 2 Chronicles 30:8"
        ]
    },
    "26 OCTOBER": {
        "part1": "Romans 6:13",
        "part2": "The Tools of Sin",
        "part3": "VERSE 13a",
        "part4": "",
        "part5": "P LESSON",
        "part6": "THOUGHT",
        "part7": "Neither yield ye your members as instruments of unrighteousness unto sin: but yield yourselves unto God ...  THOUGHT  aul warns us not to present our members (or body parts) as instruments for committing sin. It is really through our physical bodies that sin operates and makes us disobey God. Print and digital media bombard our eyes and ears daily with a deluge of news, advertisements and entertainment which promote a worldly way of thinking and living opposed to holiness. These appeal to the lust of the flesh, the lust of the eyes and the pride of life [1 John 2:16], and lure us to disobey God. Indeed, Achan saw silver, gold and a goodly Babylonish garment and took it for himself despite God's command to dedicate the spoils from the battle of Jericho to Him [Joshua 7]. King David saw Bathsheba bathing and that led to adultery and murder [2 Samuel 11]. Their eyes were tools that led them to unrighteousness and sin. They saw and desired to satisfy their lusts leading to disastrous consequences for themselves, their family and the nation of Israel. God's Word also warns of the damage and hurt our tongues can cause. It is a little member of our body but it \"is a fire, a world of iniquity\" [James 3:6]. It is unruly, untameable and full of deadly poison. With our tongues we lie, gossip, slander and even pronounce cursing on others [James 3:8-9]. Many relationships have been broken and families torn apart because the tongue was used for sin instead of blessing. May God teach us to use our body parts for His glory and not for sin.  Out of the same mouth proceedeth blessing and cursing. My brethren, these things ought not so to be. - James 3:10",
        "part8": [
            "AMOS 5",
            "MATTHEW 26:1-46"
        ]
    },
    "27 OCTOBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 13b Such a radical change requires our minds to feed on",
        "part4": "",
        "part5": "W LESSON",
        "part6": "",
        "part7": "... but yield yourselves unto God, as those that are alive from the dead, and your members as instruments of righteousness unto God.  THOUGHT  hen God gave Israel His Law, He said, \"Sanctify yourselves therefore, and be ye holy: for I am the LORD your God.\" [Leviticus 20:7]. As God reigns in our hearts, He expects us to be holy like Him. After salvation, we are no longer to conform to this world but be transformed by the renewing of our minds [Romans 12:2]. This way of living begins with a complete change in our way of thinking. Such a radical change requires our minds to feed on a diet different from before. No longer should we occupy our time binge-viewing movies and soap operas or listening to songs of popular culture on streaming services. These indoctrinate us with the secular ways of the world and draw us away from God. Instead, we should nourish our minds with spiritual food found in God's Word. Let us make a determined commitment to study the Bible, read sound Christian literature, memorise scripture and listen to godly, soul-edifying music. Pray to God in humility and ask Him to renew our mind. With time, we will grow in holiness and learn to discern what pleases God from what dishonours Him. This is invaluable in helping us resist temptation. When our minds are saturated with God's Word, we will be sanctified by it, and our wills and desires will grow in alignment to His will. This will bring us much joy and blessing. May God give us the discipline to devote time each day to reading His Word and growing in His truth.  The statutes of the LORD are right, rejoicing the heart: the commandment of the LORD is pure, enlightening the eyes. - Psalm 19:8",
        "part8": [
            "AMOS 6",
            "MATTHEW 26:47-75",
            "THOUGHT The statutes of the LORD are right, rejoicing the",
            "heart: the commandment of the LORD 1s pure,",
            "enlightening the eyes. -- Psalm 19:8"
        ]
    },
    "28 OCTOBER": {
        "part1": "Romans 6:13",
        "part2": "The Tools of Service",
        "part3": "VERSE 13b",
        "part4": "",
        "part5": "H LESSON",
        "part6": "THOUGHT",
        "part7": "... but yield yourselves unto God, as those that are alive from the dead, and your members as instruments of righteousness unto God.  THOUGHT  aving yielded ourselves to God and sanctified our minds with His Word, it naturally follows that we present our bodies to serve Him. Our hands and feet are tools of service. Every week there are worship services, fellowship group meetings, Sunday School classes and many other spiritual activities that require physical preparation and clearing up thereafter. We can employ our tongues to teach God's Word and sing His praises. Outside church, we can visit the sick and disabled to encourage them with God's Word and minister to their physical needs. Our service is not restricted to those of the household of faith but to unbelievers too. Our Lord Jesus commissioned all His disciples to \"Go ye therefore, and teach all nations, baptizing them ... Teaching them to observe all things whatsoever I have commanded you\" [Matthew 28:19-20]. But \"how shall they believe in him of whom they have not heard? and how shall they hear without a preacher? ... How beautiful are the feet of them that preach the gospel of peace, and bring glad tidings of good things!\" [Romans 10:14-15]. Therefore, let us go forth and spread the Gospel message to others in our usual social circles and beyond, in obedience to God's command. May God use us as mighty witnesses for Him as we befriend others and tell of God's mercy and love for us and the message of forgiveness of sin through our Lord Jesus. May our service to God bring glory to His name.  For ye are bought with a price: therefore glorify God in your body, and in your spirit, which are God's. - 1 Corinthians 6:20",
        "part8": [
            "AMOS 7",
            "MATTHEW 27"
        ]
    },
    "29 OCTOBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 14 committed by us. Sin however does not dominate",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "For sin shall not have dominion over you: for ye are not under the law, but under grace.  THOUGHT  he child of God is no longer under the dominion of sin because of what Christ has done at the cross of Calvary. This is a propositional statement and declaration. It declares the present state of God's children because of their union with Christ. Sin no longer reigns in our mortal bodies. The fact the apostle Paul writes this and the preceding verses under the Holy Spirit's inspiration shows we have an ongoing problem with sin being committed by us. Sin however does not dominate us. It cannot and must not dominate us. To be under sin's dominion means that sin is our master. But God forbid! \"And we have seen and do testify that the Father sent the Son to be the Saviour of the world\" [1 John 4:14]. God has saved us from His wrath, saved us from sin, sin's penalty, sin's power, a love of sinning and eventually from sin's presence. The Lord Jesus' death on the cross is not a remote historical fact of an event 2000 years ago. Jesus Christ, the Son of God, the second person in the triune Godhead died that day to rise again so that all who believe in Him will have union with Him. Union in His death means that our old person is crucified with Christ. Union in His resurrection means we walk in newness of life with a gracious, loving, life-giving God as our Master instead of sin and death. Is it God or sin who has mastery over your life? Our God and King has saved us to have victory in life and death over sin. \"But thanks be to God, which giveth us the victory through our Lord Jesus Christ\" [1 Corinthians 15:57].  If the Son therefore shall make you free, ye shall be free indeed. - John 8:36",
        "part8": []
    },
    "30 OCTOBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 14 \"Who did no sin, neither was guile found in His",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "For sin shall not have dominion over you: for ye are not under the law, but under grace.  THOUGHT  he believer is not dependant on fulfilling the law to achieve acceptance by God. Our standing before God is in Christ alone. He came not to destroy but fulfill the law [Matthew 5:17]. We, in ourselves, fail miserably trying to fulfill the law, continually missing the mark. The Lord Jesus Christ being sinless fulfilled the law perfectly in our stead thus becoming the only acceptable substitute for us at the cross [Hebrews 4:15]. \"Who did no sin, neither was guile found in His mouth ... Who His own self bare our sins in His own body on the tree, that we, being dead to sins, should live unto righteousness: by whose stripes ye were healed\" [1 Peter 2:22, 24]. \"For He hath made Him to be sin for us, who knew no sin; that we might be made the righteousness of God in Him\" [2 Corinthians 5:21]. Because our standing before God is not dependent on our law-keeping but rests on Christ's righteousness imputed to us, we are under His grace. This does not mean the law is abrogated for believers. We are not free from the obligation to keep the law. Paul also writes that we are to live according to the law and fulfill it [Romans 13:8-10]. The difference is that being under His grace, we are free from the reign of sin unto death [Romans 5:21], and now under grace's reign and being transformed to be more and more Christ-like in righteousness and holiness. Praise the Lord!  We are redeemed from being under the law, and adopted so that we can cry out \"Abba, Father\" to Him! [Galatians 4:5-6]",
        "part8": [
            "AMOS 9",
            "MARK 1",
            "THOUGHT We are redeemed from being under the law, and",
            "adopted so that we can cry out \"Abba, Father' to",
            "Him! [Galatians 4:5-6]"
        ]
    },
    "31 OCTOBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 14 holy and cannot tolerate sin [Habakkuk 1:13]. The",
        "part4": "",
        "part5": "W LESSON",
        "part6": "",
        "part7": "For sin shall not have dominion over you: for ye are not under the law, but under grace.  THOUGHT  hat is the relationship between the law and grace? How does the Christian relate to them both? Is the law bad? The law cannot be bad as it is from God. \"But we know that the law is good\" [1 Timothy 1:8a]. \"The law of the LORD is perfect, converting the soul: the testimony of the LORD is sure, making wise the simple\" [Psalm 19:7]. The moral law of God shows us the perfect standards of the Law-giver. He is righteous and holy and cannot tolerate sin [Habakkuk 1:13]. The law shows those, who are under it, that they cannot expect to fulfill and meet its perfect inflexible standards. This, if it stood alone, is very bad news for law-breakers as the deserved penalty is death. He needs God's grace in order to live. So the law drives us to God to plead for the grace He has already offered to us in His Son. The law shows us we need God's Anointed One to perfectly fulfill it on our behalf and remove our sins. \"And ye know that He was manifested to take away our sins; and in Him is no sin.\" [1 John 3:5]. \"For the law was given by Moses, but grace and truth came by Jesus Christ\" [John 1:17]. Now that we are saved by grace through faith in the Lord Jesus, we are empowered by the Holy Spirit to obey the law, and abound in every good work to His glory [Hebrews 13:21]. Thank God for His grace shown to us in His Son, our Lord Jesus Christ!  Read Ezekiel 36:25-27. Grace is God cleansing us from filthiness, giving us a new heart and His Spirit within us to cause us to walk in His statutes and obey His law.",
        "part8": [
            "OBADIAH",
            "MARK 2",
            "THOUGHT Read Ezekiel 36:25-27. Grace is God cleansing us",
            "from filthiness, giving us a new heart and His Spirit",
            "within us to cause us to walk in His statutes and",
            "obey His law."
        ]
    },
    "1 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 15 resurrection of our Lord Jesus.",
        "part4": "",
        "part5": "P LESSON",
        "part6": "",
        "part7": "What then? shall we sin, because we are not under the law, but under grace? God forbid.  THOUGHT  aul has previously established that as God's redeemed, we have been saved from the penalty of sin [Romans 6:9]. We have also been saved from the power of sin, so that sin will no longer have dominion over us [Romans 6:14]. Paul has been talking about the reign of sin and death in Adam [Romans 5:14, 21], and the reign of grace in Christ [Romans 5:21]. He has shown that the dominion of sin and death has been broken by the death and resurrection of our Lord Jesus. Now, playing the role of the antagonist, Paul asks another provoking question - \"What then? Shall we sin, because we are not under the law, but under grace?\" His \"argument\" runs as follows: If the dominion of sin has been broken and the reign of sin and death is over, then we are no longer under Law, which means that the Law no longer has power over us. Does this not mean we can do whatever we want? Does the doctrine of salvation by grace give license for us to continue our indulgence in sin? This is the perverse argument of the antinomian, ignoring the simple truth that we are what we do, and we do what we are; that nature determines behaviour; that a slave must serve his master; that a person will do the dictates of his heart and desire. Thus if a person is consumed with the desire to sin and disobey God at every turn and opportunity, then what can we say about the controller of his heart? Whose slave is he? Whose slave are you?  Yield yourselves unto God ... and your members as instruments of righteousness unto God. - Romans 6:13",
        "part8": [
            "JONAH 1",
            "MARK 3",
            "THOUGHT Yield yourselves unto God ... and your members",
            "as instruments of righteousness unto God.",
            "-- Romans 6:13"
        ]
    },
    "2 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 15 that experiment, and he concluded: \"I said in mine",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "What then? shall we sin, because we are not under the law, but under grace? God forbid.  THOUGHT  he antinomians claim that since sinners have been saved from the penalty of sin, and the future of eternal bliss is assured, it does not matter now what they do with their lives on earth. Paul had no intention of conceding to the antinomians. So they devolved into epicureanism. This is the philosophy that pleasure is the chief good and the chief end of life. Live it up! Walk on the wild side! Indulge in pleasure. Solomon tried that experiment, and he concluded: \"I said in mine heart, Go to now, I will prove thee with mirth, therefore enjoy pleasure: and, behold, this also is vanity ... And whatsoever mine eyes desired I kept not from them, I withheld not my heart from any joy; for my heart rejoiced in all my labour\" [Ecclesiastes 2:1, 10]. What was his conclusion? \"Behold, all was vanity and vexation of spirit, and there was no profit under the sun\" [Ecclesiastes 2:11]. In Romans 6:15, Paul does not concede to the antinomian and epicurean views. His response is terse - \"God forbid!\" Literally, the phrase reads \"may it never be\". May it never be that the hearts of God's people are filled with carnal desires that rob us of our commitment and devotion to our Lord and Saviour. May it never be that the minds of the redeemed are so satiated with immoral and wicked thoughts that there is no room for the Word of God. May it never be that the lips of the children of promise utter freely gossip and slander such that we cannot minister grace to those who hear us. May it never be that the children of light continue to live under the cover of darkness of sin. Every person has a master in his/her life. That master is either Sin or God. Who is yours?",
        "part8": []
    },
    "3 NOVEMBER": {
        "part1": "Romans 6:16",
        "part2": "The Right Master",
        "part3": "VERSE 16",
        "part4": "",
        "part5": "I LESSON",
        "part6": "THOUGHT",
        "part7": "Know ye not, that to whom ye yield yourselves servants to obey, his servants ye are to whom ye obey; whether of sin unto death, or of obedience unto righteousness?  THOUGHT  n March of 1775, just a few weeks before the start of the American Revolutionary War against Great Britain, Patrick Henry steeled the spines of his countrymen with the declaration - \"Give me liberty, or give me death!\" That slogan has been used throughout history by oppressed people fighting for their freedom. Freedom is deemed and declared to be a fundamental human right. We who live in affluent societies with relatively minimal restrictions think we are \"free\", and we can do whatever we want whenever we want. We see this falsehood perpetrated in popular culture today with catchphrases such as \"Be yourself \", \"Just do it\". The truth is that this \"freedom\" is enslaving people to the thoughts of man. So, Paul says we are neither the master of our fate, nor the captain of our soul. We are not free. On the contrary, he states that we are slaves to whom we obey. We are either slaves to sin, which leads to death; or slaves to God which leads to life. So, freedom is not the panacea to the problems of our society. In fact, freedom without external restraints or internal constraints leads to anarchy, chaos and slavery. The answer to the trouble in our society and turmoil in our lives is to find the right master. Our Lord Jesus declared that He was anointed \"to preach the gospel ... to preach deliverance to the captives ... to set at liberty them that are bruised\" [Luke 4:18]. And if we would submit to His lordship, we would be truly free because \"if the Son therefore shall make you free, ye shall be free indeed\" [John 8:36]. Do not fight for freedom. Instead, surrender to the right Master.",
        "part8": [
            "JONAH 3",
            "MARK 5"
        ]
    },
    "4 NOVEMBER": {
        "part1": "Romans 6:17",
        "part2": "A Blemished Past",
        "part3": "VERSE 17",
        "part4": "",
        "part5": "E LESSON",
        "part6": "THOUGHT",
        "part7": "But God be thanked, that ye were the servants of sin, but ye have obeyed from the heart that form of doctrine which was delivered you.  THOUGHT  very person has a blemished past. In his epistle to the Ephesians, Paul reminds us we are \"by nature the children of wrath\" [Ephesians 2:3]. Before we came to Christ, we were \"aliens from the commonwealth of Israel, and strangers from the covenants of promise, having no hope, and without God in the world\" [Ephesians 2:12]. In Romans 6:17, he said that we were \"the servants [Gk: doulos] of sin\" meaning we are in bondage to sin; wholly under its control; subject to its demands; moved by its dictates and lacking power to resist it. As slaves, we have no will independent of sin. As our Lord Jesus said to the unbelieving Pharisees, \"Ye are of your father the devil, and the lusts of your father ye will do\" [John 8:44]. Our enslavement to sin is seen in its various facets. The most obvious are the easily recognizable sinful deeds - killing, stealing, committing adultery, lying, drunkenness, debauchery, etc. The less obvious are the sinful attitudes - envy, pride, covetousness, fear, distrust, bitterness. Then there are so-called \"respectable sins\" - ingratitude, greed, self-indulgence, materialism - those whom Paul describes as \"having a form of godliness, but denying the power thereof \" [2 Timothy 3:1-5]. If that were the end of the story, we are doomed. \"But God be thanked ...\". The \"but\" denotes a turning point, a glorious transformation! A change that comes about not on account of what we have done, but what God has done. By His grace and mercy, the blemish of sin is removed; this slavery is past. \"God be thanked\" that in Christ, we have obeyed. We are His servants. We are His heirs. God is the transformer, who is able to change the sinner into a saint.",
        "part8": [
            "JONAH 4",
            "MARK 6"
        ]
    },
    "5 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 17 perspective, new passion, new hope.",
        "part4": "",
        "part5": "B LESSON",
        "part6": "",
        "part7": "But God be thanked, that ye were the servants of sin, but ye have obeyed from the heart that form of doctrine which was delivered you.  THOUGHT  y nature, we are servants of sin with a horrid past. By God's grace, we have become saints with a glorious future. This change comes in three phases. We have been changed. Paul writes: \"if any man be in Christ, he is a new creature: old things are passed away; behold, all things are become new\" [2 Corinthians 5:17]. This change gives us a new standing before God, with new purpose, new perspective, new passion, new hope. We are also in the process of being changed. Paul says that we are being \"transformed by the renewing of [our] mind\" [Romans 12:2]. We have the mind of Christ. We are being conformed more and more to the image of our Saviour [Romans 8:29]; so that we are driven not by the gratification of our desires but by the glory of God. We see the wisdom of laying up treasures in heaven, not on earth. We \"count all things but loss for the excellency of the knowledge of Christ Jesus ... and do count them but dung, that [we] may win Christ\" [Philippians 3:8]. We will be changed. The day will come when our change into the image of Christ will be complete, when the corruptible us will put on incorruption, and the \"mortal must put on immortality\" [1 Corinthians 15:51-53]; when we will \"bear the image of the heavenly\" [1 Corinthians 15:49]. The hope of the child of God is both present and future. John reminds us we are now \"the sons of God, and it doth not yet appear what we shall be: but we know that, when [Christ] shall appear, we shall be like Him; for we shall see Him as He is.\" [I John 3:2]. Life on earth is but a march en route to God in whose presence is fullness of joy and pleasures for evermore. [Psalm 16:11]",
        "part8": []
    },
    "6 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 18 person born in the flesh is cursed and condemned",
        "part4": "",
        "part5": "M LESSON",
        "part6": "",
        "part7": "Being then made free from sin, ye became the servants of righteousness.  THOUGHT  an in his prideful vanity imagines he is master of his fate and captain of his soul. He believes he is free to choose his destiny and control its outcome. He does not realize he is in the grip of Satan's greatest lie when he persuaded Eve that \"ye shall be as gods\" [Genesis 3:5] and wrought the downfall of man from his original blessed sinless state. God's Word informs unequivocally that every person born in the flesh is cursed and condemned because of Adam's fall [1 Corinthians 15:22]. We are born under the dominion of the devil, enslaved to sin and sinful desires even if we do not realize it and may deny it [John 8:44; 1 John 3:10]. But the good news is that Jesus Christ, Son of God incarnate, came into our world to save and liberate us. In Christ, we are freed from sin. As children of God, we love and serve Him who is righteousness personified. To be freed from sin's yoke is to belong to a good and righteous master whose yoke is easy and light [Matthew 11:28-30]. The born-again believer has the Holy Spirit's help. He has a daily longing for righteousness to please His new Master. No longer a slave to sin, he is now a servant of righteousness: pursuing, exercising and manifesting it in a new and transformed life so that his Lord will be glorified. Who is your master? There is no neutral ground. No one can be a \"free-thinker\". We belong either to the Prince of this world or to God's spiritual and heavenly kingdom. On that fateful meeting day, will you hear your master say, \"Well done, thou good and faithful servant?\" There is no middle state of personal independence; for which we were never made, and to which we have no claim. - Jamieson-Fausset Brown Commentary",
        "part8": []
    },
    "7 NOVEMBER": {
        "part1": "Romans 6:19-20",
        "part2": "Break Free from Sin",
        "part3": "VERSE 19",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "I speak after the manner of men because of the infirmity of your flesh: for as ye have yielded your members servants to uncleanness and to iniquity unto iniquity; even so now yield your members servants to righteousness unto holiness.  THOUGHT  he natural man is under sin's bondage but ignorant of the fact. Because of Adam's sin, the manner of all mankind after him was infirmed and cursed. They do not realize they are enslaved to the great deceiver, the father of lies. A slave to sin does not mean he is incapable of doing some good some of the time or feels no remorse for some offence committed. But it does mean he is deceived to believe he is not a bad person; that his good works are good enough and his pluses outweigh his minuses. In his mind, he is \"alright\". The natural man is born alive but already dead in sin. David knew this - \"Behold, I was shapen in iniquity; and in sin did my mother conceive me\" [Psalm 51:5]. He is enslaved by his sinful nature, controlled by sinful impulses; he has no desire to change and is blind to his final end. He is ignorant of God's truth, resistant to it and believes the lies of his evil master. Yet all is not lost. God through His Son provided the way for the sinner to break free. Our hearts and minds are now enlightened. God's Word speaks to us, and we believe and understand. We have a desire to obey and follow our Lord. This desire grows stronger day by day. We are conscious of sin; our distaste and aversion to sin increases as we grow closer to Him. Those things and activities which attracted us before lose their appeal. Even the company we keep and have common interests with change. This is the reality of 2 Corinthians 5:17. Our Saviour has broken the shackles of sin and replaced them with His cords of love. The erstwhile slave is now free indeed. If the Son therefore shall make you free, ye shall be free indeed. - John 8:36",
        "part8": [
            "MICAH 3",
            "MARK 9"
        ]
    },
    "8 NOVEMBER": {
        "part1": "Romans 6:19-20",
        "part2": "Develop Holiness",
        "part3": "VERSE 19",
        "part4": "",
        "part5": "W LESSON",
        "part6": "THOUGHT",
        "part7": "I speak after the manner of men because of the infirmity of your flesh: for as ye have yielded your members servants to uncleanness and to iniquity unto iniquity; even so now yield your members servants to righteousness unto holiness.  THOUGHT  ho is a servant of righteousness? One who knows Christ and is known by Him. Saved by his new Master, he is no longer helpless under sin's control but recognizes it, repents of it and resolves to turn away from it. In Christ, he has become a new creature and his old life is passed away [2 Corinthians 5:17]. Whereas before he was spiritually dead, now he is born again to new life. What marks a person yielded to righteousness? He is one who leads a transformed life seeking after holiness and seeking to please his Lord; who desires to follow and emulate his Master out of love. Jesus said, \"If ye love me, keep my commandments\" [John 14:15]. He bears the fruit of the Holy Spirit in his life. The apostle John tells us, \"And hereby we do know that we know him, if we keep his commandments. He that saith, I know him, and keepeth not his commandments, is a liar, and the truth is not in him. But whoso keepeth his word, in him verily is the love of God perfected: hereby know we that we are in him\" [1 John 2:3-5]. The servant of righteousness strives for holiness with the enabling of the Holy Spirit. He is able to break free from past sins and sinful habits to live a new life glorifying his Lord and Saviour. He makes no excuses for sin but is transformed by the power of God within him. Claiming to be a Christian is easy, but the proof is in the product. The wheat and the tare both look alike. But Jesus says, \"Wherefore by their fruits ye shall know them.\" [Matthew 7:20].  Not every one that saith unto me, Lord, Lord, shall enter into the kingdom of heaven; but he that doeth the will of my Father which is in heaven. - Matthew 7:21",
        "part8": [
            "MICAH 4",
            "MARK 10"
        ]
    },
    "9 NOVEMBER": {
        "part1": "Romans 6:21-22",
        "part2": "Fruit unto Death",
        "part3": "VERSE 21",
        "part4": "",
        "part5": "R LESSON",
        "part6": "THOUGHT",
        "part7": "What fruit had ye then in those things whereof ye are now ashamed? for the end of those things is death.  THOUGHT  eaping what you sow is the law of the harvest. It is also the universal law that governs our life, the path we choose and the choices we make. And here the apostle makes it personal to the Roman Christians and to us by asking \"What fruit had ye then in those things whereof ye are now ashamed?\" The issue at hand was sin in man's heart manifested in their actions before and after they were saved. Now that they had received the knowledge of saving grace, would they continue to indulge their sinful passions? What benefit would continuing in sin bring them? The revelation of God's Word made clear His hatred of sin and man's inability to keep the law perfectly in order to save themselves. So, Christ came into this world to save. Now if they thought God's grace and love would allow them to continue in their old ways, they were sadly mistaken. The Christian walk and pursuit of holiness do not happen automatically and as a matter of course. We are commanded to exercise ourselves in godliness. It requires discipline and perseverance because it is a spiritual battle. It is God through His Spirit who works in us to will and do of His good pleasure, but we must not disregard and resist Him. If we quench the Spirit repeatedly, His voice will eventually become silent and have no influence on us. The fruit of such a barren life is misery and woe, restlessness and discontentment. Be mindful of the choices we make in the light of God's Word. If we persist in disobedience to His Word, there can be only sorrow and finally death.  For he that soweth to his flesh shall of the flesh reap corruption; but he that soweth to the Spirit shall of the Spirit reap life everlasting. - Galatians 6:8",
        "part8": [
            "MICAH 5",
            "MARK 11"
        ]
    },
    "10 NOVEMBER": {
        "part1": "Romans 6:21-22",
        "part2": "Fruit unto Holiness",
        "part3": "VERSE 22",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "But now being made free from sin, and become servants to God, ye have your fruit unto holiness, and the end everlasting life.  THOUGHT  he person freed from sin's dominion by Jesus Christ now comes under the control of the holy righteous Lord, who is good in all His ways and will do no wrong and ill to them. To serve Him is to be in a place of incomparable blessing and privilege for there is no better master. God's faithful servant will manifest and enjoy the fruit of holiness in his life. His servitude will be joyful. Freed from the bondage and burden of sin, he will grow in grace and knowledge of his Saviour and abound in the fruit of love, joy, peace, longsuffering, gentleness, goodness, faith, meekness and temperance [Galatians 5:22-23]. He will grow in Christ-likeness and God's Word will be his delight. His anticipation of his heavenly home and dissatisfaction with the world around him will increase. In God's service he will find contentment and peace. His life will be fruitful as a tree planted by the rivers of water and what he does in the name of his Lord will be blessed. God will be his sun and shield by day and by night. The Lord will give grace in perfect measure and no good thing will be withheld from him because he walks uprightly in the fear of God. Thus the psalmist declares, \"O LORD of hosts, blessed is the man that trusteth in thee\" [Psalm 84:12]. His journey of faith and walk with his Lord on earth will culminate in his entrance into his Master's presence and the mansion already prepared for him. The promise of everlasting life will become reality. Dear reader, do you know who your master is and your final destination? Will it be everlasting life with God in heaven or eternal death and separation from Him in hell? And let us not be weary in well doing: for in due season we shall reap, if we faint not. - Galatians 6:9",
        "part8": [
            "MICAH 6",
            "MARK 12"
        ]
    },
    "11 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 23 Pleasures of sin--corrupt riches, the lying tongue,",
        "part4": "",
        "part5": "S LESSON",
        "part6": "",
        "part7": "For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord.  THOUGHT  in is the transgression of the Law [1 John 3:4b]. Here, sin is a transgressor of the law, a paymaster, who gives wages to all who serve him - death! What a fearful thought and frightening truth, but transgressors are too engrossed in the pleasures of sin in the present to think of the consequences of death in the future: Eat, drink, and be merry, for tomorrow we die. Pleasures of sin - corrupt riches, the lying tongue, proud look, wicked imaginations, false witness, \"adultery, fornication, uncleanness, lasciviousness, idolatry, witchcraft, hatred, variance, emulations, wrath, strife, seditions, heresies, envyings, murders, drunkenness, revellings, and such like: ... that they which do such things shall not inherit the kingdom of God\" [Galatians 5:19-21]. Death is not the end of life on earth as revealed in Scripture. Physical death is separation of soul and body, which is the first death. Spiritual death is the separation of soul from God, and this is the second death [Revelation 20:14]. It is a dreadful thing to be separated from God eternally and cast into the lake of fire, where there is weeping and gnashing of teeth. This is the wages of those who serve sin, their paymaster - eternal death! Take heed reader, to the deceitfulness of sin [Hebrews 3:13]. It usually presents itself as something that offers pleasurable gain and profitable exchange. It promises temporal satisfaction, but the end thereof are the ways of death and damnation. And indulging in the pleasures of sin will only harden one's heart against God and His truth.  To commit sin is to attempt spiritual suicide.",
        "part8": []
    },
    "12 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 23 The gift offered is not something that can be",
        "part4": "",
        "part5": "I LESSON",
        "part6": "",
        "part7": "For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord.  THOUGHT  n contrast to the money wages we work for, the wages that Sin the paymaster pays is death. And the foretaste of death for those who serve sin [Romans 6:6b] is misery, guilt, absence of peace, a wasted life, regretful actions and decisions, etc. What a cheerful and comforting thought that the gift God freely offers is the opposite of eternal death, which is eternal life. The gift offered is not something that can be worked for or earned but simply accepted and received by faith from the Giver who is God. God saw not only the sinfulness of man and his eternal destiny but also his helplessness to save himself. He pitied man and showed His mercy in offering this gift of eternal life to all who call upon Him in faith. The gift of eternal life to man entails forgiveness of sin, peace with God, the joy of salvation; the sonship of God and His abiding presence to oversee his life, to guide, protect and provide for him; His wonderful love and access to His majestic throne, and union and communion with Him. Hear the voice of God, \"As I live, saith the Lord GOD, I have no pleasure in the death of the wicked; but that the wicked turn from his way and live: turn ye, turn ye from your evil ways; for why will ye die?\" [Ezekiel 33:11]. How foolish to reject such a wonderful divine offer. How deceitful is our heart which prompts us to wait for a more convenient season. A severe warning awaits all who spurn this offer - \"It is a fearful thing to fall into the hands of the living God\" [Hebrews 10:31].  \"Why will ye die?\" the voice of God is calling; \"Why will you die?\" re-echo in His name; Jesus has died to save from death appalling, Life and salvation therefore go proclaim. - James McGranahan",
        "part8": []
    },
    "13 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 23 is man, which drinketh iniquity like water?' [Job",
        "part4": "",
        "part5": "H LESSON",
        "part6": "",
        "part7": "For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord.  THOUGHT  ow can a thrice holy God accept a sinner, for He is of purer eyes than to behold evil and cannot look on iniquity. Now we know that God \"heareth not sinners\" [John 9:31], but some have said, \"God hates sin but loves the sinner.\" Nay, but the truth is, the foolish shall not stand in His sight: He hates all workers of iniquity [Psalm 5:5]. If man's righteousness in the sight of God are as filthy rags, \"How much more abominable and filthy is man, which drinketh iniquity like water?\" [Job 15:16]. The divine pronouncement and judgment is that \"the soul that sinneth, it shall die\" [Ezekiel 18:4, 20]. The holiness and justice of God cannot be compromised. How then can a sinner be saved and what is the price to set the sinner free? \"None of them can by any means redeem his brother, nor give to God a ransom for him: (For the redemption of their soul is precious, and it ceaseth for ever)\" [Psalm 49:7-8]. Notwithstanding, God delights in mercy and hath no pleasure in the death of the wicked. God had found a ransom. The God-Man Christ Jesus had paid the penalty for sin. He died in the sinners' place. His perfect sacrifice is infinite and therefore enough to save all sinners who come to God in repentance and faith. He will pardon their transgressions and take away their iniquity. Christ, \"who of God is made unto us wisdom, and righteousness, and sanctification, and redemption\" [1 Corinthians 1:30], makes the sinner acceptable to God. On the cross He uttered the accomplished mission, \"It is finished.\" The perfect life He lived on earth, this righteousness God imputed unto the sinner. Thanks be unto God for his unspeakable gift! How shall we escape, if we neglect so great salvation; which at the first began to be spoken by the Lord, and was confirmed unto us by them that heard him. - Hebrews 2:3",
        "part8": []
    },
    "14 NOVEMBER": {
        "part1": "Romans 7:1",
        "part2": "The Dominion of the Law",
        "part3": "VERSE 1",
        "part4": "",
        "part5": "W LESSON",
        "part6": "THOUGHT",
        "part7": "Know ye not, brethren, (for I speak to them that know the law,) how that the law hath dominion over a man as long as he liveth?  THOUGHT  hat is sin? What is the Law? To understand the relationship between sin and law, and their dominion over us, Paul builds upon what he had written in the preceding chapter. The two chapters run parallel - Chapter 6 on the dominion of sin, and Chapter 7 on the dominion of the Law. Compare the similarities in these two chapters: the reign of sin [Romans 6:1] and the reign of Law [Romans 7:1]; death to sin [Romans 6:2] and death to Law [Romans 7:4]; walk in newness of life [Romans 6:4] and serve in newness of the Spirit [Romans 7:6]; freed from sin [Romans 6:7, 18] and freed from the Law [Romans 7:6, 3]. The phrase \"Know ye not, brethren ... \" implies that the Roman believers, especially the Jewish converts, should be familiar with what he was saying - that the Law had dominion over a man as long as he lived in that old system of the Mosaic Law. But just as the Law has no hold on a dead person, so it also has no hold on a believer who has been made righteous by Christ. The believer is dead to the Law also in the sense that he is no longer required to keep the Old Testament laws and the countless oral traditions in order to be saved. A believer is not condemned; he is justified in Christ. But how does the believer understand sin and the Law in his life? Note carefully what Paul said, \"The believer is dead to the Law\" [Romans 7:4]. But he did not say that the law is dead to the believer. The Law - the Word of God - expresses His wise, good and perfect will which is, and should be, the delight of every true believer [Psalm 119:97].  God's people are dead to the Law, but we cannot be lawless.",
        "part8": [
            "NAHUM 3",
            "MARK 15"
        ]
    },
    "15 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 2 This is a simple straightforward illustration",
        "part4": "",
        "part5": "P LESSON",
        "part6": "",
        "part7": "For the woman which hath an husband is bound by the law to her husband so long as he liveth; but if the husband be dead, she is loosed from the law of her husband.  THOUGHT  aul uses marriage as an illustration to prove his point. A wife is bound to her husband as long as he is alive. But the marriage bonds are terminated upon the death of the husband, and the wife \"is loosed from the law of her husband.\" The widow then is free to marry another man. But her husband's death was necessary. The point is that his death dissolves the legal obligation of the woman to the law of her husband. This is a simple straightforward illustration comparing our relationship to the Law and to Christ. Paul's point is that the Law has dominion over a man as long as he lives under the Law (a reference to the Mosaic Law and Jewish oral traditions that must be kept for one to be saved). Our Lord Jesus Christ made it possible for sinners to be \"loosed from the Law\". The word \"loosed\" is translated \"make void\" [Romans 3:31], \"without effect\" [Romans 3:3], \"destroyed\" [Romans 6:6]. It means that the Law is rendered inoperative. How so? The sinner lives under the dominion of the Law. He has an intimate relationship with the Law because that is the only thing he knows. However, his inability to keep the Law perfectly brings him under the dominion of sin. He is headed for eternal judgment, not knowing the Saviour and His saving grace. But God in His mercy called the sinner out of darkness into His marvellous light. Now he knows the Saviour. Faith in Christ terminated the sinner's dominion by the Law, loosed him from the Law and delivered him from the Law's penalty. The one who professes love for Christ must also love His Word. Read John 14:15; 15:10.",
        "part8": []
    },
    "16 NOVEMBER": {
        "part1": "Romans 7:3",
        "part2": "Illustration from Marriage",
        "part3": "VERSE 3",
        "part4": "",
        "part5": "R LESSON",
        "part6": "THOUGHT",
        "part7": "So then if, while her husband liveth, she be married to another man, she shall be called an adulteress: but if her husband be dead, she is free from that law; so that she is no adulteress, though she be married to another man.  THOUGHT  omans 7:2-3 are not Paul's exhaustive teaching on marriage and remarriage. Paul is also not advocating divorce or the dissolution of the marriage. It is obvious the main thought of the text is the spiritual marriage to Jesus Christ. Paul's point in his illustration is that death frees the wife to marry another man. If a married woman goes and finds another man and has a relationship with him, she is an adulteress. However, upon her husband's death, if she goes out and remarries, she has done no wrong. The main thought here is that death dissolves the legal obligation of the woman to her husband - and vice versa. From the passage, there are two lessons. First, it is implied that before, we are married to another, but now we are married to Him - in other words, a second marriage. We are now His bride, and He is the bridegroom [Revelation 21:2, 9]. The spiritual lesson is that faith in Christ brings death to the Law and therefore freedom from the Law's penalty. Like the married woman, we had an intimate relationship with the Law, and we had an intimate relationship with sin as a result of our inability to keep the Law. Now like the married woman whose husband has died, she is free to marry another man. So when we come to faith in Christ, our relationship to the Law is terminated. We are no longer under its bondage. When we come to know the Saviour and are known of Him, our relationship to the Law and sin is broken. Second, it is also implied that our relationship/ marriage to Jesus is our life. He is also our love which calls for our absolute commitment and devotion to Him. \"And can it be that I should gain, an int'rest in the Savior's blood? ... Amazing love! how can it be that Thou, my God, should die for me?\" (Charles Wesley). That is why this is the mystery of the Gospel [Ephesians 5:32].",
        "part8": [
            "HABAKKUK 2",
            "LUKE 1:1-38"
        ]
    },
    "17 NOVEMBER": {
        "part1": "Romans 7:4",
        "part2": "Married to Christ",
        "part3": "VERSE 4",
        "part4": "",
        "part5": "T LESSON",
        "part6": "PRAYER",
        "part7": "Wherefore, my brethren, ye also are become dead to the law by the body of Christ; that ye should be married to another, even to him who is raised from the dead, that we should bring forth fruit unto God.  PRAYER  ill death do us part. The believer dies through a supernatural but very real unity with the body of the crucified Christ. We are \"become dead\" is in the past tense, and it conveys the truth that this \"death\" is a historical event. Hallelujah, for the bondage of the Law is destroyed; not that we may live according to our own will, like a widow, who lives as she pleases because she is single again; but that we may be now bound to another husband. We are joined to the risen Lord Jesus Christ. We, who are full of wickedness and sin, having no desirable traits or righteous merits have been joined in an intimate relationship to our beautiful Saviour Jesus Christ. What a wonder, that the God Who created us, redeems us and then marries us! It is important to pause for a moment to consider the contrast between our new relationship in our Lord Jesus and our former relationship under the Law. Our relationship is now a love relationship, not a legal one. What a blessed thought that our Lord has made us the recipients of his affection. In turn, we are to make Him the ultimate object of ours. The question is, what false lovers entice you to forget Jesus Christ and the faithfulness He deserves? When we set our minds and our heart on our reputation, personal relationships, recreation, career path, or possessions, we allow these things to eclipse the beauty of Christ.  Dear Lord, help me to set my affections on you alone, and not on things of this earth. Amen.",
        "part8": [
            "HABAKKUK 3",
            "LUKE 1:39-80"
        ]
    },
    "18 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 4 His name as \"Christ-ians\". And this new name is",
        "part4": "",
        "part5": "S LESSON",
        "part6": "",
        "part7": "Wherefore, my brethren, ye also are become dead to the law by the body of Christ; that ye should be married to another, even to him who is raised from the dead, that we should bring forth fruit unto God.  THOUGHT  ince the first book of the Bible, God has emphasized that the relationship of a husband and wife is so completely united that they \"shall be one flesh\" [Genesis 2:24]. And because we are married into Christ, we have great and innumerable privileges. The privileges of this new relationship is like night and day in comparison to our former relationship to the Law. One of the privileges of being married to Christ is that we have now joined another family and bear His name as \"Christ-ians\". And this new name is accompanied by a new status. Just as Ruth, a lowly widow, who rose in status when she married Boaz, so too are we now considered of great standing that \"we shall judge angels\" [1 Corinthians 6:3]. Since we are joined to Christ, \"God [will] supply all [our] need according to his riches in glory by Christ Jesus\" [Philippians 4:19]. Added to this provision in our union with Christ is the promise that no power can sever this union God has joined together [Matthew 19:6]. In Paul's letter to the Ephesians, he exhorted husbands to love their wives as their own bodies. Just as a man will nourish and cherish his own body, and do the same for his wife, likewise we need not worry for our Lord Jesus Christ whom we are joined to will love us so dearly as to care for us and tend to all our needs.  For no man ever yet hated his own flesh; but nourisheth and cherisheth it, even as the Lord the church. - Ephesians 5:29",
        "part8": [
            "ZEPHANIAH 1",
            "LUKE 2",
            "THOUGHT For no man ever yet hated his own flesh; but",
            "nourisheth and cherisheth it, even as the Lord the",
            "church. -- Ephesians 5:29"
        ]
    },
    "19 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 4 meekness, and temperance\" [Galatians 5:22]. And",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "Wherefore, my brethren, ye also are become dead to the law by the body of Christ; that ye should be married to another, even to him who is raised from the dead, that we should bring forth fruit unto God.  PRAYER  he purpose of our union with Christ is to bear fruit for God. God has not left us alone to wander aimlessly and be lost in this life without a purpose. This fruit is the united product of Christ and the believing soul. Our Lord Jesus gives the vivid illustration of believers bearing fruit as branches attached to the true vine [John 15:5]. There is fruit in our attitudes of \"love, joy, peace, longsuffering, gentleness, goodness, faith, meekness, and temperance\" [Galatians 5:22]. And then there is fruit in our actions. We are told in Hebrews 13:15 that the \"fruit of our lips [gives] thanks to his name.\" A transformation in our speech, relationships, habits, work ethic, hobbies, and way of handling problems are all fruits of this new union with Christ. Just as a gardener rejoices in the fruits of his labour, so too does the believer rejoice in his fruitfulness. But our own satisfaction and joy in bearing fruit is not the ultimate end of our fruitfulness. And bearing fruit for the benefit of others is not the ultimate purpose. The chief end of man is to glorify God and to enjoy him forever. And Jesus tells us the way to glorify God is when \"[we] bear much fruit\" [John 15:8]. How do we glorify God in our fruitfulness? When believers become \"trees of righteousness\" [Isaiah 61:3], we become more like Christ and reflect more of the splendour of God. The question really is: how is Christ reflected in me?  Dear Lord Jesus, help me to bear much fruit so that You may be glorified. Amen.",
        "part8": [
            "ZEPHANIAH 2",
            "LUKE 3",
            "PRAYER Dear Lord Jesus, help me to bear much fruit so that",
            "You may be glorified. Amen."
        ]
    },
    "20 NOVEMBER": {
        "part1": "Romans 7:5",
        "part2": "Fruit unto Death",
        "part3": "VERSE 5",
        "part4": "",
        "part5": "W LESSON",
        "part6": "THOUGHT",
        "part7": "For when we were in the flesh, the motions of sins, which were by the law, did work in our members to bring forth fruit unto death.  THOUGHT  hen foraging for mushrooms or berries in the wild, one must be careful not to mistakenly pick vegetables or fruit that may be poisonous. In our old union with the Law, the fruit produced was poisonous in nature and resulted in death. Before our union to Christ, all fruit was hopeless and futile. Why was that the case? Because we have gone astray and \"turned every one to his own way\" [Isaiah 53:6]. When our human nature was unaided by God, the Law actually moved our passions to sin. When we were in the flesh, the sinful desires were activated by the very presence of the Law because the mere fact that a thing is forbidden lends it a certain attraction. Tell a child \"Do not touch that\", and that prohibition may very well provoke the child to disobey. These motions of sin are desires to defy and trespass the law. Ultimately these rebellious desires of our heart manifested in our members committing the act of defiance produces fruit unto death. This is the opposite of what is expected of the life of a Christian. Paul is reiterating an earlier point that we are no longer servants of sin but now servants of God, to have our fruit unto holiness and to glorify God [Romans 6:21-22]. This is because in Christ, we are free from the power of sin and the punishment for sin.  There is a way which seemeth right unto a man, But the end thereof are the ways of death. - Proverbs 14:12",
        "part8": [
            "ZEPHANIAH 3",
            "LUKE 4"
        ]
    },
    "21 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 5 outselves empowered by the Spirit and now able to",
        "part4": "",
        "part5": "H LESSON",
        "part6": "",
        "part7": "For when we were in the flesh, the motions of sins, which were by the law, did work in our members to bring forth fruit unto death.  PRAYER  ow does the believer's present state differ from the former? Prior to our union with Christ, we lived under the dominion of the flesh. The flesh does not simply refer to the physical part of the human body. The flesh is the sinful nature that is \"enmity against God: for it is not subject to the law of God\" [Romans 8:7]. This flesh is the power of the old realm, set in opposition to the Spirit. When we become believers, we find ourselves empowered by the Spirit and now able to walk in righteousness in a manner pleasing to God. If you ever are in a position where you find yourselves unable to bear fruit in your walk, then perhaps the problem is you are not looking to the correct source for help. The new Spirit within the believer is what makes the difference. Apart from the Spirit, we will find ourselves reverting back to our old nature that depended on our own strength alone. Again, it is important to note the dependency on the Spirit in this new union with Christ. The Spirit is not a leader like a pacer in a marathon. Rather, He is a leader like a locomotive on a train. We are led by His power. This implies that we submit our wills to God in whom the flesh is non-existent. Are you willing to let the Holy Spirit lead and guide you in every decision of your life?  Dear God, please help me to be sensitive to the leading of the Holy Spirit in all aspects of my life. Amen.",
        "part8": [
            "HAGGAI 1",
            "LUKE 5",
            "PRAYER Dear God, please help me to be sensitive to the",
            "leading of the Holy Spirit in all aspects of my life.",
            "Amen."
        ]
    },
    "22 NOVEMBER": {
        "part1": "Romans 7:6",
        "part2": "The Letter and the Spirit",
        "part3": "VERSE 6",
        "part4": "",
        "part5": "O LESSON",
        "part6": "THOUGHT",
        "part7": "But now we are delivered from the law, that being dead wherein we were held; that we should serve in newness of spirit, and not in the oldness of the letter.  THOUGHT  bedience is the chief virtue emphasized in the Bible. It is an outward sign of submission and faithfulness. Yet the danger is it becomes blind adherence to rules and instructions. To the sinner, God's Law acts as a curb to turn away from sin; the knowledge of its consequences acts as a deterrent to further sins, but this may only cause him to follow the letter of the Law - learning to do the necessary simply to avoid discipline and chastisement. The better motivation for obedience is understanding. If one is aware of the reasons for his actions, he will do the right thing even if no one is watching (though this is not possible with our omniscient God). He will be obedient because he wants to be. He comprehends what Christ has done for him and yearns to live a life that is like Christ - one pleasing in God's eyes. He finds his purpose in life following God's will, because this is exactly what God created him to be. Galatians 3:24-26 describe God's Law as our \"schoolmaster\". It is good for us to learn obedience through following God's Law, but when we realize what has been taught is inherently good for us, we will be obedient willingly and cheerfully. Then we do not need someone to monitor us anymore. We have acquired the spirit of the Law and the wisdom to apply its principles in our lives beyond the basic behaviour required. Faith in our Lord Jesus causes us to serve God and man in the newness of a fervent spirit, not in the oldness of the letter.  Wherefore the law was our schoolmaster to bring us unto Christ, that we might be justified by faith. But after that faith is come, we are no longer under a schoolmaster. For ye are all the children of God by faith in Christ Jesus. - Galatians 3:24-26",
        "part8": [
            "HAGGAI 2",
            "LUKE 6"
        ]
    },
    "23 NOVEMBER": {
        "part1": "Romans 7:6",
        "part2": "The Law Awakens Sin",
        "part3": "VERSE 6",
        "part4": "",
        "part5": "I LESSON",
        "part6": "THOUGHT",
        "part7": "But now we are delivered from the law, that being dead wherein we were held; that we should serve in newness of spirit, and not in the oldness of the letter.  THOUGHT  n the reformed tradition, the purposes of the Law are often described as acting as a curb, a mirror, and a guide. The Law deters us from sinning, causes us to reflect on our behaviour, and gives us direction in striving for holiness. All these lead us to realize our insufficiency and point us to the all-sufficient Gospel of Christ. But we also learn that there is a possibility of the sinful condition of man being aggravated by the Law. Though this was not God's purpose in giving us His commandments, it is the natural consequence of sin. When a depraved sinner reads God's Law, without the gracious work of the Spirit in his heart, his natural self will seek to rebel against what has been revealed and do the opposite in defiance. The well-known story of Adam and Eve illustrates this. The fruits on the tree of the knowledge of good and evil may not look different from the rest of the fruits in the Garden of Eden, but after the couple heard God's instruction not to eat it, that particular tree stood out in attractiveness from the rest and they knew that it was possible to do something that falls short of God's glory by disobedience. Though they were not as depraved as sinners after the fall, the choice to obey or disobey was made clear to them. Do not blame God or His Law for man's sin. Sin comes by our disobedience. Our free will was a wonderful gift from God but sadly it was abused by man.  Let no man say when he is tempted, I am tempted of God: for God cannot be tempted with evil, neither tempteth he any man: But every man is tempted, when he is drawn away of his own lust, and enticed. Then when lust hath conceived, it bringeth forth sin: and sin, when it is finished, bringeth forth death. - James 1:13-15",
        "part8": [
            "ZECHARIAH 1",
            "LUKE 7"
        ]
    },
    "24 NOVEMBER": {
        "part1": "Romans 7:7",
        "part2": "Is the Law Sin?",
        "part3": "VERSE 7",
        "part4": "",
        "part5": "W LESSON",
        "part6": "THOUGHT",
        "part7": "What shall we say then? Is the law sin? God forbid. Nay, I had not known sin, but by the law: for I had not known lust, except the law had said, Thou shalt not covet.  THOUGHT  e focus on the first part of verse 7 this morning, and consider Apostle Paul's question, \"What shall we say then? Is the law sin?\" He asserts immediately, \"God forbid.\" Matthew Henry puts it this way: \"(the law) is holy, just and good.\" Why? Because God Himself, the Lawgiver, is holy, just, and good. In the United States, the debate about whether guns should be banned has been going on for years. Proponents of the ban say that guns are dangerous in the light of numerous mass shooting incidents, particularly in schools where innocent children are injured and killed. Their opponents counter that the US constitution provides for every person to bear arms. One particular slogan goes: \"Guns don't kill people; people kill people.\" This statement points to man's sinfulness, but that is not the subject for today. The law is a tool, and in this particular instance, God's holy Law, given by Himself, is a tool for man to see his sinfulness by knowing what sin is and what it is not. Without the law, a state of lawlessness prevails. This begs the question: Is lawlessness sin? Definitely! Without the Law, \"every man did that which was right in his own eyes\" [Judges 17:6, 21:25] leading to anarchy and sin. So, let us thank the Lord for giving us His holy precepts, because He cares for us, and has our welfare at heart.  Every way of a man is right in his own eyes: but the LORD pondereth the hearts. - Proverbs 21:2",
        "part8": [
            "ZECHARIAH 2",
            "LUKE 8"
        ]
    },
    "25 NOVEMBER": {
        "part1": "Romans 7:7",
        "part2": "The Purpose of the Law (Part 1)",
        "part3": "VERSE 7",
        "part4": "",
        "part5": "I LESSON",
        "part6": "THOUGHT",
        "part7": "What shall we say then? Is the law sin? God forbid. Nay, I had not known sin, but by the law: for I had not known lust, except the law had said, Thou shalt not covet.  THOUGHT  n the previous reading, we considered how God's Law is holy because God Himself is holy, just and good and that lawlessness leads to sin. Today, we consider the purpose of God's holy Law. Consider the story of Steven Pete and his brother Chris; they were born with congenital analgesia, a rare condition that prevented them from feeling pain. Steven and Chris grew up with numerous visits to and long stays in the hospital because of injuries that went undetected. Steven's brother took his own life, because he could not face the prospect of being wheelchair-bound for the rest of his life, as his spine became progressively worse after multiple injuries. Similarly, without the Law, the consequences of sin will go undetected and be grievous. As Paul said, he would not have known lust, except the Law had stated, \"Thou shalt not covet.\" Adam and Eve would not have known sin, except God had said, \"Thou shalt not eat of it (the fruit of that tree)\" [Genesis 2:17]. So, the Law was given because God cares for us, and He wants only what's best for us. God gave Moses the Law because of man's transgressions [Galatians 3:19]. God knows that without the Law, man will be like chaff, blown about in every direction by the wind. Finally, the Law was given so that man can realize their wretchedness in sin, their slavery to sin, and seek out the solution to their wretched sinfulness, which is faith in Christ Jesus our Lord.  Wherefore the law was our schoolmaster to bring us unto Christ, that we might be justified by faith. - Galatians 3:24",
        "part8": [
            "ZECHARIAH 3",
            "LUKE 9"
        ]
    },
    "26 NOVEMBER": {
        "part1": "Romans 7:7",
        "part2": "The Purpose of the Law (Part 2)",
        "part3": "VERSE 7",
        "part4": "",
        "part5": "W LESSON",
        "part6": "THOUGHT",
        "part7": "What shall we say then? Is the law sin? God forbid. Nay, I had not known sin, but by the law: for I had not known lust, except the law had said, Thou shalt not covet.  THOUGHT  e continue this morning on the purpose of the Law, asking the question: is the Law still needed today? As the Apostle Paul argued in Galatians 3, the Law was our schoolmaster, to bring us unto Christ, that we might be justified by faith. But after that faith is come, we are no longer under the schoolmaster because we are all children of God by faith in Christ Jesus. In these times, especially during the onset of the current COVID-19 pandemic, our government introduced various laws: wearing of masks in public places, washing of hands and keeping high standards of personal hygiene. These laws are put in place to make us aware of the seriousness of the pandemic and to keep us safe. With the introduction of vaccines, and the high vaccination rate of the population, the earlier safe management measures are no longer necessary, and the government relaxed the rules even though the pandemic is still ongoing and infection rates are still being tracked. In the same way, after Christ came into our lives, we are no longer under Law in the sense that Christ is now our Master, not the Law. Is the Law still needed? Yes, because this world is still in sin, and the Law still serves to point man to Christ for the solution to their sin problem. For us who have found our refuge in Christ, let us, therefore, live our lives worthy of the name of Christ who suffered and died on the cross so that our sins are forgiven and no longer counted to us.  Knowing that a man is not justified by the works of the law, but by the faith of Jesus Christ, even we have believed in Jesus Christ, that we might be justified by the faith of Christ, and not by the works of the law: for by the works of the law shall no flesh be justified. - Galatians 2:16",
        "part8": [
            "ZECHARIAH 4",
            "LUKE 10"
        ]
    },
    "27 NOVEMBER": {
        "part1": "Romans 7:8",
        "part2": "The Law Provokes Sin",
        "part3": "VERSE 8",
        "part4": "",
        "part5": "\" LESSON",
        "part6": "THOUGHT",
        "part7": "But sin, taking occasion by the commandment, wrought in me all manner of concupiscence. For without the law sin was dead.  THOUGHT  Sin\" defies precise definition. It does not stand for any one particular action or attitude, but a label for a vast complex of different wrongful acts, even thoughts and motives. The Apostle Paul in this verse portrays sin as an active force that uses the Law to provoke us to commit acts of sin. Paul sees sin as a principle and power. The Law increases rather than diminishes sin and provokes rather than prevents it. Note his choice of words - \"But sin, taking occasion (opportunity) by the commandments, wrought (produced) in me all manner of concupiscence (covetous desire).\" It is the Law that gives sin the opportunity to be aroused. It stirs and awakens sin to work all manner of evil. Again, in Romans 7:11, \"For sin, taking occasion by the commandment, deceived me, and by it slew me.\" The Law reveals sin's deceitfulness. Sin misuses the Law to deceive us. This is an allusion to Eve's temptation, which is regarded as representing ours [2 Corinthians 11:3]. The origin of human sin recorded in Genesis is that man before the fall lived with God in a state of innocence but the commandment \"thou shalt not eat of it: for in the day that thou eatest thereof thou shalt surely die\" [Genesis 2:17] was used by the serpent to arouse sinful lust, and the commandment though itself holy became occasion for sin and death as its consequence. Without the Law, sin was dead and inactive. The Law of God is neither evil nor sinful but good. But in itself, it is powerless to save. The force of the Law only shows us our guilt and the judgement we deserve. It is \"holy, and the commandment holy, and just, and good\" [v. 12]. It is also spiritual [v. 14]. It points us to our need for salvation, which it cannot provide. For when we were in the flesh, the motions of sins, which were by the law, did work in our members to bring forth fruit unto death. - Romans 7:5",
        "part8": [
            "ZECHARIAH 5",
            "LUKE 11"
        ]
    },
    "28 NOVEMBER": {
        "part1": "Romans 7:9",
        "part2": "Alive without the Law",
        "part3": "VERSE 9",
        "part4": "",
        "part5": "I LESSON",
        "part6": "PRAYER",
        "part7": "For I was alive without the law once: but when the commandment came, sin revived, and I died.  PRAYER  n this verse, Paul described his pre-salvation experience. He gives a picture of his \"righteousness\" as a child and a young man. \"For I was alive without the law once\" does not mean that he had never heard or knew the Law before. He was a Jew of Tarsus [Acts 21:39], a Pharisee and the son of a Pharisee [Acts 23:6]. As a Pharisee, he kept the Law to the letter and considered himself zealous and blameless before God. He trusted his self-righteousness to be accepted by God. He was a Hebrew of the Hebrews of the tribe of Benjamin [Philippians 3:5] and a pupil of Gamaliel, taught according to the perfect precepts of the fathers [Acts 22:3; Galatians 1:14]. No one knew the Law better than Paul [Philippians 3:5-6]. He was alive - physically alive. In other words, he had no dread of punishment and harboured no painful consciousness of sin. Life without the Law allowed the knowledge of sin to lie dormant. A man who does not know or pay attention to the Law thinks and feels alive, not knowing he is dead in his sins. He is not aware he has fallen short of God's glory, condemned, violating His will and contrary to God in all ways. He has scant regard for right and wrong. He feels no consciousness of sin, no guilt, no dread of punishment, and no sense of judgement. He feels he is doing fine, safe, secure, confident, and assured that he is pleasing to God and will be approved and accepted by Him. But he is deluded. The holy Law of God reflects His holiness. If we love Him, let us not only keep His holy Law, but treasure it forever in our heart by constant reading and meditation. Father, let there be genuine confession and repentance of sin before You so that any sin of my old nature may be mortified and the Spirit of God dwells within me.",
        "part8": [
            "ZECHARIAH 6",
            "LUKE 12"
        ]
    },
    "29 NOVEMBER": {
        "part1": "Romans 7:9",
        "part2": "Dead with the Law",
        "part3": "VERSE 9",
        "part4": "",
        "part5": "P LESSON",
        "part6": "THOUGHT",
        "part7": "For I was alive without the law once: but when the commandment came, sin revived, and I died.  THOUGHT  aul declares \"when the commandment came\" - when the Law with its pure and holy precepts was applied by the Holy Spirit to the heart and conscience of the apostle and became clear to him, the full force of sin and the depth of his sinfulness was revealed. He realized his true condition as one who was corrupted and destined to face death. He says, \"sin revived (became alive)\". The once dormant depravity was awakened. \"Sin revived\". His eyes were opened to his sin and he felt it in all its power. He realized his guilt and condemnation. He thought that sin was dead to him, but the Law revealed sin's sting. \"The sting of death is sin; and the strength of sin is the law\" [1 Corinthians 15:56]. The power of sin, which was dormant before [v. 8], was quickened and became active. \"I died.\" The righteous life Paul lived in which he had previously trusted was extinguished. The Law now convicted him. He realized he was dead in sins because he could not attain the righteousness God through the Law demanded. What the Law could not do, God did by sending His Son, Jesus Christ who imputed His righteousness upon Paul. He could then say, \"I live, yet not I, but Christ liveth in me\" [Galatians 2:20]. \"For ye are dead, and your life is hid with Christ in God\" [Colossians 3:3]. \"He that believeth in me, though he were dead, yet shall he live\" [John 11:25b]. Believers cannot gain approbation from God by keeping the Law. All the Law does is condemn. All we can do is turn to Christ for grace to live as we should before God.  For I through the Law am dead to the Law, that I might live unto God. - Galatians 2:19",
        "part8": [
            "ZECHARIAH 7",
            "LUKE 13"
        ]
    },
    "30 NOVEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 10 life, actually brings about death. It condemns us,",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "And the commandment, which was ordained to life, I found to be unto death.  THOUGHT  he commandments showed us a way of life in the righteousness of God. But instead of reconciling fellowship with Him, the Law seem to widen the gap between God and us. The Law describes the standard which God requires which we cannot attain by our own strength and will. The problem arises when we look to works of the Law as a means to obtain salvation. In that sense, the Law, which holds the keys to life, actually brings about death. It condemns us, standing as our accuser before God. The Law is good and holy in itself. But it was never a means of justification before God. It shows us the level of righteousness God possesses and requires, but also shows us how we fall short of obtaining the required standard. The Law did not cause us to take a wrong turn - it simply told us which direction was wrong. The Law cannot deliver us from sin. It can only expose sin in us to drive us back to Christ. The Law is holy, but it cannot make us holy. The Law is holy in that it reveals to all who try to follow it just how very sinful we are. Our salvation is not in a written code. It is in the Saviour. While the Law points out our shortcomings compared to God's righteousness, it also points to Jesus Christ. By trusting in Him to save us, His holiness is transferred (imputed) to us and we, therefore, stand justified before God.  The true purpose of the Law was to point us to Christ Jesus as our Saviour.",
        "part8": [
            "ZECHARIAH 8",
            "LUKE 14",
            "THOUGHT The true purpose of the Law was to point us to",
            "Christ Jesus as our Saviout."
        ]
    },
    "1 DECEMBER": {
        "part1": "Romans 7:11",
        "part2": "Deception of Sin",
        "part3": "VERSE 11",
        "part4": "",
        "part5": "P LESSON",
        "part6": "THOUGHT",
        "part7": "For sin, taking occasion by the commandment, deceived me, and by it slew me.  THOUGHT  aul said that the deception of sin killed him - describing his spiritual death and separation from God. Thus, he confirmed that by the Law; no one can find life, only death. This is because sin is death. Sin uses the Law to condemn the sinner. Sin makes one feel the Law is unreasonable in its demands; it praises the sinner and causes us to think highly of ourselves. It makes us think what we are doing will make us acceptable to God and we can become righteous by our own effort and works, so that we have no need to be saved and no need to trust in another. Sin seizes the opportunity created by God's commands in the Law to convince us that acting on our own desire is better than obeying God. When there is no Law, people do not notice sin. Sin lies motionless as if it were dead. But as soon as people learn a specific commandment, sin springs to life and stirs up evil desires. Sin deceives us with the false promise of satisfaction. It falsely claims an adequate excuse. It falsely promises an escape from punishment. Sin, which was always alive in us, uses the Law to lure and captivate us. It is not the Law that deceives. It is sin that uses the Law as an occasion for rebellion. Today, we can be thankful that God used the commandments to show us our need for Jesus.  Law offered the rules. Sin breaks the rules.",
        "part8": [
            "ZECHARIAH 9",
            "LUKE 15"
        ]
    },
    "2 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 12 we have fallen short of His glory. The holiness of",
        "part4": "",
        "part5": "\" LESSON",
        "part6": "",
        "part7": "Wherefore the law is holy, and the commandment holy, and just, and good.  THOUGHT  Law\" in this verse refers to the whole body of Scripture; \"commandment\" refers to the particular edicts. In other words, the Word of God is holy. It is set apart from the world, for it belongs to Him. Through God's Law, we know Who He is and what He wants us to do in our lives. God's Law is holy because God is holy. Interestingly and inevitably, it is also through God's Law that we know who we are, and how we have fallen short of His glory. The holiness of God's Law stands in stark contrast to the sinful nature of man. The natural man will follow his own lusts and pride and go the opposite way of what God intended him to. We will read in this chapter that even after a person believes, his heart still struggles with God's instructions so much so that even the apostle Paul grieved about his own wretched and imperfect condition [v. 24]. God's Law thus serves to expose the waywardness of man, making him aware of his sins. Two different outcomes are possible. God's Spirit can use His Law to convict the sinner of sin and turn him to repentance, or it can happen that the sinner's heart becomes so hardened that he chooses to sin wilfully despite the knowledge revealed to him by God's Word. \"The law of the LORD is perfect, converting the soul: the testimony of the LORD is sure, making wise the simple\" [Psalm 19:7]. Blessed indeed is the person whose heart is teachable by God's Law. Though the road of sanctification is not without challenges, he will have divine direction and discover that with the passing of each day, he is being renewed and transformed to be more and more like Christ. Blessed are the pure in heart: for they shall see God. - Matthew 5:8",
        "part8": []
    },
    "3 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 12 walk in God's ways.",
        "part4": "",
        "part5": "G LESSON",
        "part6": "",
        "part7": "Wherefore the law is holy, and the commandment holy, and just, and good.  THOUGHT  od's Law is described here by three adjectives - \"holy\", \"just\" and \"good\". They may be explained in part by the orientation in which God's Law applies to our lives. \"Holy\" is upward looking, as God sets His standards for us and we align the direction and purpose of our lives towards them. While there is no way we can reach perfection this side of eternity, at least, we have a direction for our sanctification and can understand what it means to walk in God's ways. \"Just\" is the perspective of looking outward. A child of God who seeks holiness will desire to lead a just life as well. We should be as blameless as possible so that the world will not be presented with an excuse to blaspheme the holy name of our God. Being just does not stop at passively staying away from evil; it also means actively doing good. God's Word tells us that though we are not justified by our works, we are saved to do good. Ephesians 2:8-10 illustrates this. Indeed, \"by grace are ye saved through faith; and that not of yourselves: it is the gift of God; not of works, lest any man should boast.\" It then tells us what must happen after we are justified by faith: \"For we are His workmanship, created in Christ Jesus unto good works, which God hath before ordained that we should walk in them.\" [v. 10]. Just as baptism is the outward sign of God's inward grace, walking in God's holy and just ways are the outward fruits of His Spirit's work in our inward being. And let us not be weary in well doing: for in due season we shall reap, if we faint not. As we have therefore opportunity, let us do good unto all men, especially unto them who are of the household of faith. - Galatians 6:9-10",
        "part8": []
    },
    "4 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 12 justice with our looking outward, and goodness",
        "part4": "",
        "part5": "I LESSON",
        "part6": "",
        "part7": "Wherefore the law is holy, and the commandment holy, and just, and good.  THOUGHT  n Matthew 19:16-17, when one came to ask the \"Good Master\", what good thing he should do to have eternal life, Jesus replied, \"Why callest thou Me good? there is none good but one, that is, God: but if thou wilt enter into life, keep the commandments.\" The Lord's instruction is clear - goodness is defined only by God's standards as spelt out in His law. Holiness is associated with our looking upward, justice with our looking outward, and goodness directs us to be looking inward. Having made known to us His divine standards, God's Spirit then causes us to change outwardly, being fuelled by our inward transformation, renewing our minds to recognize good from evil, and to pursue good by God's grace. \"Holy\", \"just\" and \"good\" are sometimes associated with the three kinds of law recorded in Old Testament Scripture - ceremonial law, civil law and moral law. Morality, our sense of good and evil, is what makes a human being, setting him apart from the rest of God's creation, and by God's mercies, He has revealed to us what it means to be good. \"The statutes of the LORD are right, rejoicing the heart: the commandment of the LORD is pure, enlightening the eyes. The fear of the LORD is clean, enduring for ever: the judgments of the LORD are true and righteous altogether\" [Psalm 19:8-9]. A child of God is known by his obedience to God's good instructions. Although at times it may be difficult to choose God's way over the ways of the world, as we walk with Him each day, our eyes will be opened to His marvellous truths and we will find true joy in pursuing His goodness. One thing have I desired of the LORD, that will I seek after; that I may dwell in the house of the LORD all the days of my life, to behold the beauty of the LORD, and to enquire in His temple. - Psalm 27:4",
        "part8": []
    },
    "5 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 13 God and tells us what displeases Him.",
        "part4": "",
        "part5": "E LESSON",
        "part6": "",
        "part7": "Was then that which is good made death unto me? God forbid. But sin, that it might appear sin, working death in me by that which is good; that sin by the commandment might become exceeding sinful.  THOUGHT  arlier, we learnt that the law serves to tell us what sin is. Unbelievers would argue that it would have been better to remain ignorant of what the Bible calls out as sin because with the knowledge of sin comes condemnation. Here, Paul anticipates this argument and clarifies that it is not the Law which is the problem. Rather, the problem is the sinful heart we have. Let us realize that God's Law is edifying. It shows us the character of our God and tells us what displeases Him. Instead of adopting an attitude of \"ignorance is bliss\", let us delve deeper into God's Word and be brave and honest in recognizing our own sins. As we have a better understanding of the attributes of God - His holiness, His justice, His mercy, His longsuffering, etc.- we will also have an increased awareness of how sinful we are, how far short of His standard we have fallen and our failure to follow His example. Doing so will have an edifying effect on us. We begin to strip away delusions of self-righteousness and pride, and see how wretched we are. We become less inclined to excuse our own sinful behaviour. And as we become more honest in acknowledging the sin in our life, we will call upon the Holy Spirit to help us live in a way that pleases God.  In the mirror of His Word, reflections that I see. Makes me wonder why He never gave up on me. But He loves me as I am and helps me when I pray, remember He's the Potter, I'm the clay. - J. Hemphill",
        "part8": [
            "ZECHARIAH 13",
            "LUKE 19",
            "THOUGHT In the mirror of His Word, reflections that I see.",
            "Makes me wonder why He never gave up on me.",
            "But He loves me as I am and helps me when I pray,",
            "remember He's the Potter, I'm the clay.",
            "-- J. Hemphill"
        ]
    },
    "6 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 13 of being \"exceeding sinful\" is an exaggeration or a",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "Was then that which is good made death unto me? God forbid. But sin, that it might appear sin, working death in me by that which is good; that sin by the commandment might become exceeding sinful.  THOUGHT  oday, we want to look at the word \"exceeding\". In today's verse, the Greek for \"exceeding\" is \"huperbole\", from which the English word \"hyperbole\" is derived. In modern English, \"hyperbole\" is a figure of speech used to describe something in an exaggerated manner (for example, he was quick as lightning). However, when we look at the occurrence of the word \"huperbole\" in verse 13, it would be fitting to consider whether the idea of being \"exceeding sinful\" is an exaggeration or a precise description of our condition. As God's law shines into our lives and tears away our illusions of self-righteousness, we indeed begin to see how infinitely sinful we are. A similar Greek word \"exceeding\" appears in 2 Corinthians 9:14, where Paul describes how the Corinthian Christians' lives have been transformed through the exceeding grace of God. From sinful, self-serving sinners, the Corinthians have become a people sincerely desiring to please God and giving generously to the Gospel work. Just as we are exceedingly sinful human beings, God is exceedingly gracious in His working in us to change us into His image. The word \"exceeding\" also appears in 2 Corinthians 4:17, where Paul seeks to encourage the Corinthian church to persevere through the challenges they face as they seek to follow Christ. Even as we face challenges in our Christian walk, let us be encouraged that they are nothing compared to the exceeding reward we will get on the other side of eternity.  Saved to exceeding glory through exceeding grace though exceeding sinful.",
        "part8": []
    },
    "7 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 13 shows what happens when we trust our own sense",
        "part4": "",
        "part5": "L LESSON",
        "part6": "",
        "part7": "Was then that which is good made death unto me? God forbid. But sin, that it might appear sin, working death in me by that which is good; that sin by the commandment might become exceeding sinful.  THOUGHT  et us think about the depravity of sin from which God has saved us. Previously, we considered our exceeding sinfulness and God's exceeding graciousness. Today, let us consider why sin is such a dangerous enemy. First, sin perverts our sense of right and wrong to the extent we are no longer able to rightly discern what is good (that is, what pleases God) and what is bad. A look at the prevailing relative moralism of the world today shows what happens when we trust our own sense of right and wrong. Man moves further and further away from God's Law and becomes increasingly apathetic about living a holy life; yet he grows more insistent about having the freedom to indulge in sinful living. Second, sin completely dominates the natural man to the point where he cannot help but sin. Even after we have a new life in Christ, sin does not die easily. In Romans 7:15, we see Paul's struggle against his flesh. It is a constant struggle we are familiar with. Even though we want to be more Christ-like, sin does not make holy living easy. It is only through the help of the Holy Spirit that we can break free from its bondage. Finally, there is no escaping the consequences of sin. The Bible is very clear the wages of sin is death. Despite knowing this, the world today is hardly concerned with what happens after physical death. Rather, hedonistic philosophies abound.  O wretched man that I am! who shall deliver me from the body of this death? I thank God through Jesus Christ our Lord. So then with the mind I myself serve the law of God; but with the flesh the law of sin. - Romans 7:24-25",
        "part8": [
            "MALACHI 1",
            "LUKE 21",
            "THOUGHT O wretched man that I am! who shall deliver me",
            "from the body of this death? I thank God through",
            "Jesus Christ our Lord. So then with the mind I",
            "myself serve the law of God; but with the flesh the",
            "law of sin. -- Romans 7:24-25"
        ]
    },
    "8 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 14 to have a body of flesh and blood which we inherit",
        "part4": "",
        "part5": "I LESSON",
        "part6": "",
        "part7": "For we know that the law is spiritual: but I am carnal, sold under sin.  THOUGHT  n the preceding verses, Paul explained the purpose of the Law. In a word, the Law is spiritual. It reveals the sinfulness of sin and how sinful the natural man is. Paul used to think highly of himself and how God must have been so pleased with him, a \"Hebrew of Hebrews\". But now he confesses; \"I am carnal and sold under sin.\" What does it mean to be carnal? The word \"carnal\" or \"fleshly\" means to be made of flesh; to have a body of flesh and blood which we inherit from our parents. It also means to be given up to the flesh, that is, living a fleshly, sensual life; to be given over to animal appetites; to be controlled by one's sin nature. This is a surprising confession because outwardly, everybody could see that Paul was a godly man who kept God's commandments. But Paul is referring to his inner man, which only God can see, and in the subsequent verses, he elaborates. What about us? We are certainly worse than Paul. To make matters even worse, we live in a culture saturated with enticements to satisfy our fleshly desires; that constantly encourages us to \"eat, drink and be merry, because tomorrow we die\"; because this life is all there is. But this idea is unbiblical and carnal. There is life after physical death, and it includes judgment for all [Hebrews 9:27]. Only those who have been made righteous by faith in Christ will experience eternal life in heaven, and those who reject Christ as Saviour will be sent to eternal punishment in hell.  But as he which hath called you is holy, so be ye holy in all manner of conversation; Because it is written, Be ye holy; for I am holy. - 1 Peter 1:15-16",
        "part8": []
    },
    "9 DECEMBER": {
        "part1": "Romans 7:14",
        "part2": "Sold under sin",
        "part3": "VERSE 14",
        "part4": "",
        "part5": "M LESSON",
        "part6": "THOUGHT",
        "part7": "For we know that the law is spiritual: but I am carnal, sold under sin.  THOUGHT  any of us have seen the movie classic, Ben Hur (1959). There is a scene where Ben Hur is chained in a galley ship with two hundred other rowers. \"You are all condemned men. We keep you alive to serve this ship. Serve well and live,\" the commander told them. During the subsequent battle scene, the other prisoners tried desperately to free themselves when they saw they were being rammed by the enemy's ship. But only Ben Hur was able to break free because the commander liked him and quietly ordered that he be unlocked. This is a picture of what it is to be \"sold under sin\". In The Teacher's Outline and Study Bible (Romans, Volume 2), the author makes the point that we are given over to sin, and we cannot keep from sinning - not perfectly. We are under sin's influence, and we cannot erase sin's presence - not completely. We are subject to sin, and we cannot cast sin out of our lives - not totally. We are capable of sinning, and we cannot get rid of sin - not permanently. We are guilty of sinning, and we have to bear the consequences [Romans 6:23]. Basically, to be sold under sin means that we are enslaved to sin. All our works of righteousness are like filthy rags in God's eyes [Isaiah 64:6]. We cannot free ourselves. We need a saviour; not any saviour. Our Lord Jesus Christ is the only Saviour, \"for there is none other name under heaven given among men, whereby we must be saved\" [Acts 4:12].  And they said, Believe on the Lord Jesus Christ, and thou shalt be saved, and thy house. - Acts 16:31",
        "part8": [
            "MALACHI 3-4",
            "LUKE 23"
        ]
    },
    "10 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 15 understand or recognize (\"allow''). He fights and",
        "part4": "",
        "part5": "E LESSON",
        "part6": "",
        "part7": "For that which I do I allow not: for what I would, that do I not; but what I hate, that do I.  THOUGHT  very born-again believer is a convicted Christian. God's Holy Spirit indwells us, and as long as we are alive in our corruptible body, there is a spiritual struggle, \"for the flesh lusteth against the Spirit, and the Spirit against the flesh\" [Galatians 5:17]. There are no exceptions. Even a man of Paul's spiritual stature struggles with sin and he shares his experience with us in Romans 7:15. Firstly, he finds himself doing things he cannot understand or recognize (\"allow\"). He fights and struggles against them, but before he knows it, he has sinned. Secondly, those things that he \"would\", namely the things he wants to do to please God, to be conformed to the image of Christ, he does not do. And thirdly, no matter how hard he struggles against doing those things he hated doing, which he knows are displeasing to God, he still finds himself committing those sins, and thus falling short. Do you not face the same struggles? If so, Paul's experience should comfort you. You need not be alarmed. But if you don't, then there is cause for worry. Perhaps you have not been born again in the first place. The Apostle John warns thus in 1 John 1:8; \"If we say that we have no sin, we deceive ourselves and the truth is not in us.\" One day when we face our Lord, may we not hear Him say these dreaded words; \"I never knew you: depart from me, ye that work iniquity.\" [Matthew 7:23]  If we confess our sins, he is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness. - 1 John 1:9",
        "part8": [
            "REVELATION 1",
            "LUKE 24",
            "THOUGHT If we confess our sins, he is faithful and just to",
            "forgive us our sins, and to cleanse us from all",
            "unrighteousness. -- 1 John 1:9"
        ]
    },
    "11 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 16 need a saviour, one who is outside our flesh, who",
        "part4": "",
        "part5": "H LESSON",
        "part6": "",
        "part7": "If then I do that which I would not, I consent unto the law that it is good.  THOUGHT  ow does Paul or any of us know we have sinned and fallen short of the glory of God? Answer - through knowing God's standards as expressed in the Law. As Paul explained in great lengths in this epistle to the Romans; \"for by the law is the knowledge of sin\" [Romans 3:20[. We may know the Law, and we may try to keep the Law, but this desire to know and to seek God will not save us. In our flesh, we will fail. Hence, we need a saviour, one who is outside our flesh, who can forgive our sins and impart eternal life. Paul acknowledges that he has failed often and done things he knew were not right by God's standards. But the fact that he knows they are wrong, and that he had no desire to do them shows that the Law is good. Thus, Paul consents to and agrees that the Law is good. In fact, his carnal life proves the Law is good. The writer of Psalm 119 goes further than consent to the Law; he declares his love for the Law in verse 97: \"O how love I thy law! It is my meditation all the day\", and verse 127, \"Therefore I love thy commandments above gold; yea above fine gold.\" Why? Because he knows \"Blessed are the undefiled in the way, who walk in the law of the LORD. Blessed are they that keep his testimonies, and that seek him with the whole heart\" [Psalm 119:1-2].  Our Lord says in John 14:15: \"If ye love Me, keep My commandments.\"",
        "part8": [
            "REVELATION 2",
            "JOHN 1",
            "THOUGHT Our Lord says in John 14:15: \"If ye love Me, keep",
            "My commandments.\""
        ]
    },
    "12 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 17 law of God in our members (as we will see in our",
        "part4": "",
        "part5": "I LESSON",
        "part6": "",
        "part7": "Now then it is no more I that do it, but sin that dwelleth in me.  THOUGHT  f we do not read this verse in the context of the entire chapter, we may misunderstand Paul's intention. Paul is not denying responsibility for his actions and blaming sin within him for causing him to commit unrighteousness. Paul is using his own experience as an example to point out to the Roman church that there is sin dwelling within him. There is a \"tension\" that arises within when the law of God in our mind wages war with the law of God in our members (as we will see in our devotion in the days ahead). Christian, are you conscious of your indwelling sin(s)? Are you aware of your weaknesses? Everyone comes to church looking perfect and holy on the outside, but inside, we are a mess. We all struggle with indwelling sin, in one form or another. Like Paul, we first need to identify our sins and be aware of them. For example, we may be a church leader but struggle with an unforgiving spirit and pride. This is embedded deep within us, and no one can knows, not even our closest loved ones. It is so easy to allow for and overlook \"respectable sins\", such as sinful attitudes that are accepted by society and even the church. Committing adultery may be more obvious and objectionable but not sins like pride, selfishness and resentment which may continue to fester unnoticed. Beware of all sins, not just the socially unacceptable ones. Reflect, consider, and be attuned to your sins and confess them before the Lord.  Paul looked at himself and was very aware of his own sin. He did not look at the sin of others. The church would be a better place if we all did the same.",
        "part8": [
            "REVELATION 3",
            "JOHN 2",
            "THOUGHT Paul looked at himself and was very aware of his",
            "own sin. He did not look at the sin of others. The",
            "church would be a better place if we all did the",
            "same."
        ]
    },
    "13 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 18a depraved. But you may say, \"What about the time",
        "part4": "",
        "part5": "P LESSON",
        "part6": "",
        "part7": "For I know that in me (that is, in my flesh,) dwelleth no good thing ...  THOUGHT  aul moves on to state the fact that there is no good thing in him, nothing at all. This is something we must all face up to. As the American preacher, Jonathan Edwards said: \"You contribute nothing to your salvation except the sin that made it necessary.\" We are all messed up and sinful people. Yesterday, we spoke about identifying our sins. Today our focus is on acknowledging the fact that there is nothing good within us and we are totally depraved. But you may say, \"What about the time when I volunteered to serve in that ministry?\" Ask yourself, what was the motivation for service? Was it because you wanted to meet the expectations of the person who called you to serve? Was it because everyone else was serving and you weren't? Was it to impress your peers? Or was it for God? Praise the Lord if your answer is \"for the Lord\". Even then, it was not you who desired to serve God, but the Holy Spirit who was doing a good work in you. Recognizing your own depraved sinfulness is a mark of spiritual maturity. It begins there. What then? Go on your knees before the Lord and claim Psalm 51 and Psalm 32 as your own. Confess your sins before the Lord, cast them unto Him because \"He careth for you\" [1 Peter 5:7]. Confess your inability to walk aright and seek the Spirit's help to do so. God will surely give you an upright heart and with it, the desires of your heart.  Put to death your sinfulness on a daily basis through prayer and supplication. This is absolutely necessary for every Christian, no matter how mature you are.",
        "part8": [
            "REVELATION 4",
            "JOHN 3",
            "THOUGHT Put to death your sinfulness on a daily basis",
            "through prayer and supplication. This is absolutely",
            "necessary for every Christian, no matter how",
            "mature you are."
        ]
    },
    "14 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 18b the comfort of the Holy Spirit, and the fellowship",
        "part4": "",
        "part5": "P LESSON",
        "part6": "",
        "part7": "... for to will is present with me; but how to perform that which is good I find not.  THOUGHT  aul exclaims that he has a desire to do good but not the ability to do it. He admits he is unable to do good by his own strength. Such are the struggles in life. Yet these are the challenges we need to overcome by God's grace. Everyone we see, both in and outside the church, comes with his own set of problems. Behind the smile, there may be a heart caught in the upheavals of life. But we are not alone. Children of God have the comfort of the Holy Spirit, and the fellowship of His people. Indeed, \"Blessed are the poor in spirit: for theirs is the kingdom of heaven. Blessed are they that mourn: for they shall be comforted\" [Matthew 5:3-4]. Beloved, there is nothing wrong in admitting our inability to do good. Even the church leader Paul admitted it. The church should be a community of grace where we can confide in trustworthy brothers or sisters our temptations and sins. We can find accountability partners, encourage, guard and pray for one another, but without being judgmental. We can be open about our brokenness with the right people. In a society that celebrates strength and values privacy, we tend to hide our weaknesses. We become accustomed to dealing with our own struggles - whether physical or spiritual - and putting up a brave front. The church should be different. It should be a refuge for those seeking to be transformed day by day into the image of Christ.  Identify sin, confess sin, desire change and be accountable and share openly with trustworthy brothers (or sisters) in Christ. Man to man and woman to woman. - Tim Chester, Christian author",
        "part8": []
    },
    "15 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 19 like an unbeliever? The first view is that the man",
        "part4": "",
        "part5": "R LESSON",
        "part6": "",
        "part7": "For the good that I would I do not: but the evil which I would not, that I do.  THOUGHT  omans 7:19-20 highlight the problem of sin. This problem is ongoing every day. The words \"I do not\" and \"I do\" is the besetting problem here. Many of us are familiar with this struggle, that is, to do or not to do. Our sin nature often leads us to make wrong decisions in life. Bible commentators are divided over who the person being referred to is. Is Paul referring to a believer or an unbeliever? Can a believer behave like an unbeliever? The first view is that the man mentioned here is unsaved. The reason given is the contradictory comments made by him. Though claiming to believe, his remarks about the fellow believer show his disagreement in Romans 7. This person does not know who can deliver him, though he is convicted. Even believers face moral dilemmas at one time or another. Life is not always plain sailing. And many of us can definitely identify with being guilty of bad actions despite our knowledge of what is good. Ever heard someone (maybe even yourself) say, \"I did not mean it\" when their actions were not right? Simple short words like \"I do\" and \"I do not\" make a world of difference. It reveals our true character and intentions. What we say and do will show the kind of person we are. Every child of God must be trustworthy at all times. Every believer is exposed to temptations while living on this earth because of our sinful nature, yet we can pray for God's help to overcome them.  Say what you mean and mean what you say.",
        "part8": [
            "REVELATION 6",
            "JOHN 5",
            "THOUGHT Say what you mean and mean what you say."
        ]
    },
    "16 DECEMBER": {
        "part1": "Romans 7:20",
        "part2": "Was It Me Who Did It?",
        "part3": "VERSE 20",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "Now if I do that I would not, it is no more I that do it, but sin that dwelleth in me.  THOUGHT  he blame game continues. Such is sinful human nature. Man is so good at pointing a finger at another. According to some Bible commentators, the man of Romans 7 is unsaved but under conviction. Hence, he is struggling to make a decision about his own salvation. This is what every unbeliever has to do. No one can force a person to believe. Though true that salvation is entirely by the will of our sovereign God for it is only by His grace we will choose the good and right way, from man's perspective, the decision is his to make - and he will bear full responsibility for his choice. Yet after receiving Jesus Christ as our Saviour, we will still have new challenges to deal with. Satan loves to mess up our lives and we are ever ready to blame him for it. However, if we are honest, we will realize we have only ourselves to blame. Every believer goes through this struggle with his own problems, but if we turn to our Lord for help, we can surely overcome it. It is a question of whether we succumb to temptation (and try to blame Satan for it) or we gain victory over the devil through the power of Christ. So, what should we do? We must deal with our own convictions ourselves. Are you facing such a challenge right now? Are you undecided about accepting Christ as your personal Lord and Saviour? Do not hesitate to do so. If you are already a believer, hold on to the promises of God and fight the good fight of faith.  Submit yourselves therefore to God. Resist the devil, and he will flee from you. Draw nigh to God, and he will draw nigh to you. Cleanse your hands, ye sinners; and purify your hearts, ye double minded. - James 4:7-8",
        "part8": [
            "REVELATION 7",
            "JOHN 6"
        ]
    },
    "17 DECEMBER": {
        "part1": "Romans 7:21",
        "part2": "Evil Within",
        "part3": "VERSE 21",
        "part4": "",
        "part5": "P LESSON",
        "part6": "THOUGHT",
        "part7": "I find then a law, that, when I would do good, evil is present with me.  THOUGHT  aul tells us that as soon as a good thought arises within us or we resolve to do some good, evil is immediately ready to impede us from our desire to do it. We may try our best to avoid and flee evil thoughts but like an unwelcomed guest in our house, evil shows up unbidden. John Calvin comments, \"[w]hile the faithful strive after what is good, they find in themselves a certain law which exercises a tyrannical power; for a vicious propensity, adverse to and resisting the law of God, is implanted in their very marrow and bones.\" Like the psalmist, we may delight in God's laws [Psalm 119:16] and desire to obey them but end up sinning despite our good intentions. The fact that we love God's precepts does not mean that our evil desires are destroyed. After all, the heart is \"desperately wicked\" [Jeremiah 17:9]. Such a desire to do evil is innate, for in our flesh \"dwelleth no good thing\" [Romans 7:18]. There will always be this bitter conflict in us. Do not let failure or temptation cause us to despair and think we will never be capable of any good. Be of good cheer for our sins are forgiven. As God's chosen race and priesthood, we are to show forth the praises of God who has called us out of darkness into God's marvellous light [1 Peter 2:910] and not to live in self-pity and guilt.  Forgetting the things which are behind you, reach forward to the things which are before. Press toward the mark for the prize of the high calling of God in Jesus Christ. - Philippians 3:13-14",
        "part8": [
            "REVELATION 8",
            "JOHN 7"
        ]
    },
    "18 DECEMBER": {
        "part1": "Romans 7:22",
        "part2": "Delight in the Law",
        "part3": "VERSE 22",
        "part4": "",
        "part5": "W LESSON",
        "part6": "THOUGHT",
        "part7": "For I delight in the law of God after the inward man:  THOUGHT  hile recounting his struggle with sin, Paul also wanted his readers to know that he was not an unwilling servant of God's law. Paul delighted in the law of God. Paul was not forced to obey out of fear of the consequence of God's wrath. Paul teaches that his \"inward man\" or his renewed self, sympathised and approved of God's Law. This approval was not only intellectual assent but expressed by a deep emotion of pleasure even thinking of His Law. As believers, do we sincerely delight in God's Word and desire to obey it? We are called to \"put on the new man, which after God is created in righteousness and true holiness\" [Ephesians 4:2324]. Paul had a definite desire to do what was right and he enjoyed doing it. However, he did not always pick the things that were good, holy, just and right. Surely like Paul, we see the beauty and excellence of God's Law. We are convicted by the perfect standard of His Law, for it is \"perfect, converting the soul\". We are humbled by the testimony of the LORD, which is \"sure, making wise the simple\" [Psalm 19:7]. We see that God's statutes are \"right, rejoicing the heart\" and His commandments are \"pure, enlightening the eyes\" [Psalm 19:8] and teaching us a new way of life. We see the truth and righteousness of God's judgments [Psalm 19:9].  LORD, may our inward man be renewed day by day and our delight in Your Law grows. Help us to love Your Law which is perfect, sure, right, and pure.",
        "part8": [
            "REVELATION 9",
            "JOHN 8"
        ]
    },
    "19 DECEMBER": {
        "part1": "Romans 7:23",
        "part2": "Life of Spiritual Struggle",
        "part3": "VERSE 23",
        "part4": "",
        "part5": "W LESSON",
        "part6": "THOUGHT",
        "part7": "But I see another law in my members, warring against the law of my mind, and bringing me into captivity to the law of sin which is in my members.  THOUGHT  hen God called us to be His own, He called us to a lifetime of spiritual struggle against sin. This is sanctification. Before we knew the Lord, we were blinded to our sins. With seared consciences, we would enjoy sin. But when the truth of God shined into our lives, we became aware of how dark our hearts were. From that day, the spiritual battle began - and by God's grace, every day should tell of our slow but sure victory over sin. A good illustration of Christian growth would be akin to looking into a microscope. When we first believe in Jesus, the journey of knowing God starts - we examine our lives under a microscope lens that magnifies our lives fifty times. We see the undesirable parts in our lives and day by day work at getting rid of them. As we read more of God's Word and become more sensitive to His teachings, we change the lens to one that magnifies a hundred times. Now sins we did not notice in the past, become more apparent. And we go through the same process of refinement again. The spiritual \"changing of lenses\" can be difficult because it often requires us to consider our ways and move out of our comfort zone. The same is the process of change. We struggle because spiritual transformation is often contrary to our natural self. It is a lifelong process because we can never attain perfection in this life. Yet with every upward step we take by God's strength and wisdom, we rest in the peace of a good conscience, which God ministers unto us.  O death, where is thy sting? O grave, where is thy victory? The sting of death is sin; and the strength of sin is the law. But thanks be to God, which giveth us the victory through our Lord Jesus Christ. - 1 Corinthians 15:55-57",
        "part8": [
            "REVELATION 10",
            "JOHN 9"
        ]
    },
    "20 DECEMBER": {
        "part1": "Romans 7:23",
        "part2": "No Victory by Ourselves",
        "part3": "VERSE 23",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "But I see another law in my members, warring against the law of my mind, and bringing me into captivity to the law of sin which is in my members.  THOUGHT  here are at least three things we must take note of when we consider Christian growth. Firstly, it comes about by God. Without God, we are but utterly depraved sinners. There is no way we will want to deny our natural self and become more and more like our Lord. God must remove our stony heart and give us a heart of flesh, so that we become humble and teachable, and change according to His ways. Spiritual transformation is only by grace through Christ, \"And of His fulness have all we received, and grace for grace\" [John 1:16]. Secondly, Christian growth comes about through God. By our own carnal strength and intelligence, we cannot win spiritual battles. God not only grants us the determination to want to lead lives that please Him, but He also teaches us how to go about doing that through His Word and by His Spirit. We will never achieve spiritual victory by ourselves. As our Lord reminds: \"Abide in Me, and I in you. As the branch cannot bear fruit of itself, except it abide in the vine; no more can ye, except ye abide in Me\" [John 15:4]. Thirdly, Christian growth comes about for God. Spiritual struggles are difficult but once by God's grace we conquer the temptations, we will marvel at how it is even possible. It is then we will give all glory to Him in our Lord Jesus, \"By whom also we have access by faith into this grace wherein we stand, and rejoice in hope of the glory of God\" [Romans 5:2]. As the prophet said to King Jehoshaphat, \"Thus saith the LORD unto you, Be not afraid nor dismayed by reason of this great multitude; for the battle is not yours, but God's.\"[2 Chronicles 20:15b]. For of him, and through him, and to him, are all things: to whom be glory for ever. Amen. - Romans 11:36",
        "part8": [
            "REVELATION 11",
            "JOHN 10"
        ]
    },
    "21 DECEMBER": {
        "part1": "Romans 7:23",
        "part2": "Weapons for Battle",
        "part3": "VERSE 23",
        "part4": "",
        "part5": "S LESSON",
        "part6": "THOUGHT",
        "part7": "But I see another law in my members, warring against the law of my mind, and bringing me into captivity to the law of sin which is in my members.  THOUGHT  ince victory over sin comes about only by God, through Him and for Him, He will surely also provide us with the means of grace to win every spiritual battle. Though we must be strong, our strength must come from the Lord; we should live our lives in the power of His might. We must put on the whole armour of God to stand against the wiles of the devil. Consider Ephesians 6:10-12. Spiritual battles must be fought the spiritual way. Challenges in life can come in many different forms. For one, it can be a matter of facing the same routine and problems day after day. The mundaneness of daily life seeks to wear us out and make us despair over our plight. For another, the temptations one faces are always changing. This unpredictability causes us to be filled with anxiety and worry. Yet in all situations, we can commit each day to God and live by His grace, not pretending we have fully understood all, but abiding by His Word, holding on to His promises and through prayer and thanksgiving, allowing God to lead us each step of our way. Stay focused on Christ. Remember Philippians 3:12-14. Daily battles must be fought with Christ always in sight. There is no temptation unique to you. We have a great cloud of witnesses from whom we can emulate and be encouraged, but above all, we have the grace of our Lord Jesus who reminds us of the love of our heavenly Father and the abiding presence of the Holy Spirit. Keep in mind Hebrews 12:1-2. Today's battles must be fought with eternity in view. But the Comforter, which is the Holy Ghost, whom the Father will send in my name, he shall teach you all things, and bring all things to your remembrance, whatsoever I have said unto you. Peace I leave with you, my peace I give unto you: not as the world giveth, give I unto you. Let not your heart be troubled, neither let it be afraid. - John 14:26-27",
        "part8": [
            "REVELATION 12",
            "JOHN 11"
        ]
    },
    "22 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 24 despair! When a sinner realizes there is no way",
        "part4": "",
        "part5": "\" LESSON",
        "part6": "",
        "part7": "O wretched man that I am! who shall deliver me from the body of this death?  THOUGHT  O wretched man that I am!\" What a cry of conviction! When the Holy Spirit works in the heart of a sinner and makes him see the holiness of God, he will become aware of how far he has fallen short of God's glory and how far away he is from God. This is a cry that marks the start of a wonderful journey of transformation. \"O wretched man that I am!\" What a cry of despair! When a sinner realizes there is no way he can save himself no matter how hard he tries because his flesh will always draw him away from where God wants him to go. This is a cry that marks the beginning of his wisdom in trusting God and committing everything into His hands. \"O wretched man that I am!\" What a cry of hope! When regenerated men give up their struggle against lusts and pride in their own strength and live each day by God's sustaining grace, placing their hope not on things in this world, but on the rewards that await them above. This is a cry that marks the first flow of unspeakable peace and joy that can only be experienced by the child of God. \"O wretched man that I am!\" This will become a cry of praise and thanksgiving when saints who have fought the good fight of faith enter heaven and see God's glory with their own eyes. What is man, that God is mindful of him? Yet to deliver us from our wretchedness, God sent His only begotten Son to die for our sins, so that His righteousness can be imputed to us. Indeed, the more wretched we realise we are, the more we shall appreciate God's love for us.  O LORD our Lord, how excellent is thy name in all the earth! - Psalm 8:9",
        "part8": [
            "REVELATION 13",
            "JOHN 12",
            "Indeed, the more wretched we realise we are,",
            "the more we shall appreciate God's love for us.",
            "THOUGHT O LORD our Lord, how excellent is thy name in all",
            "the earth! -- Psalm 8:9"
        ]
    },
    "23 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 24 sensitive and vulnerable to changes in the weather.",
        "part4": "",
        "part5": "M LESSON",
        "part6": "",
        "part7": "O wretched man that I am! who shall deliver me from the body of this death?  THOUGHT  an was created good - both body and soul. \"And the LORD God formed man of the dust of the ground, and breathed into his nostrils the breath of life; and man became a living soul\" [Genesis 2:7]. Yet after the first Adam sinned against God [Genesis 3:6], the destiny of humanity changed forever. For the first time, the coolness of the day was mentioned [Genesis 3:8] perhaps suggesting that the body had changed to one sensitive and vulnerable to changes in the weather. Hence, a corruptible body we have inherited - one susceptible to the elements, which will \"naturally\" age and eventually die. Living in a fallen world, we will face constant dangers and threats. The unpredictability of life and weakness of our bodies will contribute to our fears and anxieties, worries and despair. But the most tragic consequence of the fall is we are lost to the bondage of sin. We carry not only the curse of the original sin but also commit actual sins every day, enticed by the lusts of our body and the pride of our soul. Our lives fall short of the glory God intended for us to show. And for our sins, we will face a second death - the spiritual death of eternal separation from God. Thus, depraved sinners groan and travail in pain, waiting for a Saviour. And the Messiah came two thousand years ago, to cleanse and transform us as we learn to trust Him day by day. The Lord Jesus has delivered us from this body of death. \"For which cause we faint not; but though our outward man perish, yet the inward man is renewed day by day\" [2 Corinthians 4:16]. So when this corruptible shall have put on incorruption, and this mortal shall have put on immortality, then shall be brought to pass the saying that is written, Death is swallowed up in victory. - 1 Corinthians 15:54",
        "part8": []
    },
    "24 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 24 suffer God's wrath, and there is no way we can",
        "part4": "",
        "part5": "T LESSON",
        "part6": "",
        "part7": "O wretched man that I am! who shall deliver me from the body of this death?  THOUGHT  he question \"who will deliver?\" is very much related to \"how will he deliver?\" For thousands of years, people of God were looking for a Messiah - one who would deliver them from their troubles. Yet how can any mortal deliver us from our sickness and death? Who is always there for us, to protect from danger and harm? Who is that king who can deliver God's people and give them eternal peace? What about spiritual death? Wretched sinners suffer God's wrath, and there is no way we can stand righteously before God. Animal sacrifices may atone for our sins for a while. Even the priests who sacrificed on behalf of man needed first to seek atonement for their own sins. Who can be that priest who offers the once and for all perfect sacrifice which lasts forever? Who will deliver? And how will he deliver? Surely this deliverer cannot be an ordinary being. He must be one sent from God - one endowed with divine wisdom and power to save lost sinners and show the way of salvation to all men past, present and future. Who can be the prophet that will proclaim God's message of salvation? The answer lies not in man. God Himself had to come into this world. The Lord Jesus Christ is the Prophet, Priest and King who will bring the Gospel of salvation, offer the perfect sacrifice, and grant to saints power to overcome sin and death. He not only shows the way, teaches the truth, and gives life. He is the Way, the Truth and the Life.  O death, where is thy sting? O grave, where is thy victory? The sting of death is sin; and the strength of sin is the law. But thanks be to God, which giveth us the victory through our Lord Jesus Christ. - 1 Corinthians 15:55-57",
        "part8": [
            "REVELATION 15",
            "JOHN 14",
            "THOUGHT O death, where is thy sting? O grave, where is thy",
            "victory? The sting of death is sin; and the strength",
            "of sin is the law. But thanks be to God, which",
            "giveth us the victory through our Lord Jesus Christ.",
            "-- 1 Corinthians 15:55-57"
        ]
    },
    "25 DECEMBER": {
        "part1": "Romans 7:25;Matthew 1:21",
        "part2": "Christ Jesus",
        "part3": "VERSE 25",
        "part4": "",
        "part5": "A LESSON",
        "part6": "THOUGHT",
        "part7": "I thank God through Jesus Christ our Lord. So then with the mind I myself serve the law of God; but with the flesh the law of sin.  THOUGHT  fter what seemed like a heart-rending cry of despair, Paul let out another cry. This time, it was not a cry of anguish or a plea for help but an outburst of thanksgiving -- one filled with confident hope. His indwelling sin beset him; his struggles were intense and real. But the more he apprehended his sinfulness and helplessness, the more he was overwhelmed by the sweetness of God's grace through Jesus Christ our Lord. If you are a born-again Christian, the struggles Paul described would not be alien to you. As we mature in Christ, our desire to please Him and be like Him grows, and so will our struggles against sin. This process of sanctification - dying more and more to sin and self - will continue throughout the Christian's life. Whenever you go through these struggles, how do you respond? Do you despair? Do you complain? Or do you look up to Christ with praise and thanksgiving? Today as we celebrate the birth of the Lord Jesus, we are reminded once again of what He came to do for us -- to save His people from their sins. Christ bore the curse of sin on the cross for us and gave us His righteousness. Without the finished work of Christ on the cross, our struggles will be hopeless and futile. So may our hearts be filled with thankfulness as we remember that we do not rely on ourselves but on God. He is for us, and our victory is assured through the work of His Son.  My heart is filled with thankfulness to Him who bore my pain; who plumbed the depths of my disgrace and gave me life again. - S. Townend",
        "part8": [
            "REVELATION 16",
            "JOHN 15"
        ]
    },
    "26 DECEMBER": {
        "part1": "Romans 7:25",
        "part2": "Deliverance from Sin's Penalty",
        "part3": "VERSE 25",
        "part4": "",
        "part5": "I LESSON",
        "part6": "THOUGHT",
        "part7": "I thank God through Jesus Christ our Lord. So then with the mind I myself serve the law of God; but with the flesh the law of sin.  THOUGHT  n what ways have believers been delivered from sin through Christ? If we have professed faith in Christ and possess a new life in Him, why has our sinning not ceased? Why do we still struggle with sin? The problem does not lie with our salvation but with our understanding of what salvation entails. Our deliverance from sin takes place in three stages: we were saved from sin's penalty, we are being saved from sin's power, and we will be saved from sin's presence. Deliverance from sin's penalty occurs at the point when a person comes to saving faith in Christ. We were guilty sinners worthy of eternal damnation. But when we repented of our sins and trusted Christ to save us from the punishment we deserved, God justified us. That means He forgave all our sins and accepted us as righteous in His sight. God could do that because Christ bore the full penalty for our sins on the cross. Our sins were imputed to Christ and His righteousness imputed to us. Once justified, we are freed from sins' penalty -- past, present, and future. There is no condemnation for those who are in Christ Jesus [Romans 8:1]. Have you been freed from the penalty of sin? Or do you take pride in your obedience to God's laws and try to be righteous by your own efforts? Stop relying on yourself and put your faith in the person and work of the Lord Jesus Christ. He has accomplished for us everything we need to secure our salvation.  Come unto me, all ye that labour and are heavy laden, and I will give you rest. Take my yoke upon you, and learn of me; for I am meek and lowly in heart: and ye shall find rest unto your souls. For my yoke is easy, and my burden is light. - Matthew 11:28-30",
        "part8": [
            "REVELATION 17",
            "JOHN 16"
        ]
    },
    "27 DECEMBER": {
        "part1": "Romans 7:25",
        "part2": "Deliverance from Sin's Power",
        "part3": "VERSE 25",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "I thank God through Jesus Christ our Lord. So then with the mind I myself serve the law of God; but with the flesh the law of sin.  THOUGHT  he second stage in salvation is our deliverance from sin's power. After we have received Christ as our Saviour, it does not mean we can easily say no to sin and always choose righteousness. Rather, our life will be a constant struggle against sin. We struggle, not because of imperfection in our salvation -- our deliverance from sin's penalty is complete -- but because we still possess a sinful nature. Though justified, we have no righteousness in ourselves, but it is Christ's imputed to us. We need the Holy Spirit to work in us and help us grow in holiness. This process of sanctification, whereby we are enabled increasingly to die to sin and choose righteousness, will continue throughout our Christian life. If we still sin, in what sense then, are we being saved from sin's power? In the past, we could only choose sin. Even our \"good\" deeds were ultimately sinful because they could have no higher purpose than to glorify self. Now, because of our new life in Christ, we resist sin and struggle against it. We have a growing desire to please God and be like Christ. Because Jesus is saving us from sin's power, we are more and more able to defeat sin and obey God in our daily struggles against sin. If you have believed in the Lord Jesus as your Saviour, how are you growing in your Christian life? Do you find yourself struggling against sin? Do you work hard with God's help to live a godly life? Press on, for our victory is assured through Christ.  And he said unto me, My grace is sufficient for thee: for my strength is made perfect in weakness. Most gladly therefore will I rather glory in my infirmities, that the power of Christ may rest upon me. - 2 Corinthians 12:9",
        "part8": [
            "REVELATION 18",
            "JOHN 17"
        ]
    },
    "28 DECEMBER": {
        "part1": "Romans 7:25",
        "part2": "Deliverance from Sin's Presence",
        "part3": "VERSE 25",
        "part4": "",
        "part5": "T LESSON",
        "part6": "THOUGHT",
        "part7": "I thank God through Jesus Christ our Lord. So then with the mind I myself serve the law of God; but with the flesh the law of sin.  THOUGHT  he last stage of deliverance is from sin's presence. Although we die more and more to sin as we grow in holiness, we can never be freed completely from its presence in this life. Sin persistently clings to our hearts and assails us on all fronts. Our struggle against it will continue throughout our earthly lives. Again, this is not due to any imperfection in our salvation. God could have made us sinless and perfect at the point of new birth. Yet He chose to sanctify us through a long painful process to show forth the glory of His grace. At death, our sanctification is complete. God will remove all sin from our hearts and make us perfectly holy. Our struggles against sin will cease forever as there can be no sin in His presence. In Christ, we will find eternal rest. Eventually, we will also be raised to a new resurrected body. This is our eternal or glorified state. With a redeemed will and a resurrected body, we will live with God in the new heavens and new earth, and share in His glory forever. So, in verse 24, when Paul cried out, \"who shall deliver me from the body of this death\", he was not referring to deliverance from sin's penalty which was already past. Nor was he referring to deliverance from sin's power which he knew was ongoing. Rather he was looking forward with longing to be delivered from sin's presence and thanking God for the assurance of complete deliverance that all believers have in Christ.  He will swallow up death in victory; and the Lord GOD will wipe away tears from off all faces; and the rebuke of his people shall he take away from off all the earth: for the LORD hath spoken it. - Isaiah 25:8",
        "part8": [
            "REVELATION 19",
            "JOHN 18"
        ]
    },
    "29 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 25 to God. |",
        "part4": "",
        "part5": "M LESSON",
        "part6": "",
        "part7": "I thank God through Jesus Christ our Lord. So then with the mind I myself serve the law of God; but with the flesh the law of sin.  THOUGHT  uch of what Paul said in Romans 7 about his struggles against sin seems dismal at first, but the contrast at the end of the chapter exudes much hope and encouragement. Even at the lowest point of his struggles, when his own efforts seemed futile and hopeless, Paul did not despair. He knew that ultimate victory would be his through Jesus Christ, and this filled him with a great thankfulness to God. No matter how great our sins, how badly we think we are doing, or how difficult and prolonged our struggles may be, we too need not despair. The outcome of our battle against sin is certain because we have the assurance of the triumph of God's grace. Earlier in Romans 5:20, Paul stated that \"where sin abounded, grace did much more abound\". There is no sin too great for God's grace. God's grace is great enough to pardon and cleanse us from all sin and guilt. Our victory is also assured because it is accomplished through Christ our Lord. Apart from Him, none of us can prevail, not even for a moment. But Christ has overcome the world; He has defeated sin, death, and Satan. Being united to Christ through faith, we too, shall have victory in Him. So press on in your spiritual war against sin, for we can be confident that \"He which hath begun a good work in you will perform it until the day of Jesus Christ\" [Philippians 1:6].  When we pray for the Spirit's help ... we will simply fall down at the Lord's feet in our weakness. There we will find the victory and power that comes from His love. - Andrew Murray",
        "part8": [
            "REVELATION 20",
            "JOHN 19",
            "THOUGHT When we pray for the Spirit's help ... we will simply",
            "fall down at the Lord's feet in our weakness. There",
            "we will find the victory and power that comes from",
            "His love. -- Andrew Murray"
        ]
    },
    "30 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 1 In Romans 8:1, God declares that in Christ,",
        "part4": "",
        "part5": "\" LESSON",
        "part6": "",
        "part7": "There is therefore now no condemnation to them which are in Christ Jesus, who walk not after the flesh, but after the Spirit.  THOUGHT  Therefore ... \" marks a conclusion based on what has been previously stated. In Romans 8, Paul is referring to all he has written up to this point. Romans 8:1 is the climax, as it were; prior to that, the law hangs over our necks like an albatross. We are caught between a rock and hard place. We are required to keep the law, but unable to fulfil that obligation perfectly. And for our failure to keep the law, we are condemned. In Romans 8:1, God declares that in Christ, \"there is therefore now no condemnation\". The word \"now\" is emphatic. It is a very strong adverb of time. \"There is now no ... \" connotes complete cessation. It has the idea of completeness. It means God will not now or ever hang that albatross of guilt over our necks anymore even though we are not yet perfect and may be guilty on countless occasions. From the moment we are in Christ, God will never lay upon us the punishment that should come to one who is guilty. In other words, there is absolutely no condemnation and no punishment in the life of any believer in Christ. To be a child of God is to receive not even the smallest element of condemnation on account of our sin. In Christ, we do not receive the sentence of death for our sins. That is the very heart and soul of the Gospel. What is the Gospel? It is that our Lord Jesus totally, completely and permanently paid the debt for the sins of all who put their trust in Him.  Hear the news, sinner, free! free! free! Why not believe it? 'Tis good news for thee. Jesus the Just One has died on the tree, Died for guilty sinners, and \"Salvation is free.\" - T.D.W. Muir",
        "part8": [
            "REVELATION 21",
            "JOHN 20",
            "THOUGHT Hear the news, sinner, free! free! free!",
            "Why not believe it? \"Tis good news for thee.",
            "Jesus the Just One has died on the tree,",
            "Died for guilty sinners, and \"Salvation ts free.'",
            "-- T.D.W. Muir",
            "2"
        ]
    },
    "31 DECEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 1 is a two-edged sword: It is to receive the verdict",
        "part4": "",
        "part5": "B LESSON",
        "part6": "",
        "part7": "There is therefore now no condemnation to them which are in Christ Jesus, who walk not after the flesh, but after the Spirit.  THOUGHT  ut now in Christ, there is no condemnation. The Greek word here translated as \"condemnation\" appears only three times in the New Testament [Roman 5:16, 18; 8:1]. In Adam, \"as by the offence of one judgment came upon all men to condemnation\" [Romans 5:18]. \"Condemnation\" is a strong term. In the English language, a distinction is made between condemnation and execution. However, in Scripture, condemnation is a two-edged sword: It is to receive the verdict of \"guilty\", and at the same time the resulting punishment demanded by the sentence. In other words, to be condemned is to be declared guilty by the all-knowing God, and then to come receive the execution of His divine justice, which in Scripture is death. What a contrast this is to Romans 7, in which Paul depicts the sinner as wretched and struggling with sin. Now in Christ, we hear the victorious shout - \"There is therefore now no condemnation to them which are in Christ Jesus\". The weight of sin and guilt is removed from our shoulders! There is nothing we can do but respond with exultation and praise. In times when we are burdened by sin and weighed down by the worries of life, we must preach to ourselves that we are accepted in Christ, and in Him the penalty for all our sins has been paid in full. God has given us \"the victory through our Lord Jesus Christ\" [1 Corinthians 15:57]. We are \"more than conquerors through him that loved us ... [nothing] shall be able to separate us from the love of God, which is in Christ Jesus our Lord\" [Romans 8:37, 39]. The gospel can lift this destroying burden [of condemnation] from the mind, give beauty for ashes, and the garment of praise for the spirit of heaviness. - A.W. Tozer",
        "part8": []
    }
}