{
    "26 JUNE": {
        "part1": "2 Samuel 13:39",
        "part2": "David's response",
        "part3": "VERSE 39",
        "part4": "And the soul of king David longed to go forth unto Absalom: for he was comforted concerning Amnon, seeing he was dead.",
        "part5": "It is not difficult to put ourselves in the king's shoes. The sword had not only cut through his house [2 Samuel 12:10]; it had thrust deep into his heart. When Amnon was killed, David effectively lost two sons - one to death and another to exile.\n\nBut time heals. After three years, David had gotten over the incident. Some commentaries have pointed out that the verse could also be translated \"David ceased to go against Absalom\". The conclusion is the same - the heat of the incident had cooled - and perhaps some in the king's court might even feel that the time for reconciliation had come.\n\nIn fact, the matter was far from settled. David's lack of discipline toward his son Absalom - now the next in line to the throne - would lead to disastrous complications. It would cause David more trouble in the days to come. Absalom's unpunished transgression and unchecked pride would cause him to grow in arrogance. Even if he had continued to be in exile, he was an easy tool to be manipulated by opportunists who wished to usurp power from whoever was on the throne.\n\nHaving been king for so many years, David could have seen this impending threat, but he allowed his emotions to get the better of him. In the deepest recesses of his heart, he longed for this beloved son. As king, he was duty and morally bound to exact punishment for the murder especially of a prince, yet as a father, he was about to condone the abhorrent behaviour of his son. This marks the beginning of disaster.",
        "part6": "THOUGHT",
        "part7": "He that spareth his rod hateth his son: but he that loveth him chasteneth him betimes. - Proverbs 13:24",
        "part8": [
            "DEUTERONOMY 29",
            "PSALM 119:97-120"
        ]
    },
    "27 JUNE": {
        "part1": "2 Samuel 14:1",
        "part2": "Joab - the opportunist",
        "part3": "VERSE 1",
        "part4": "Now Joab the son of Zeruiah perceived that the king's heart was toward Absalom.",
        "part5": "In the king's court, some perhaps could perceive a reconciliation between David and his son. And though Absalom seemed to have lost David's favour, he was still after all be an heir and next in the line of succession. It would take an opportunist to seize this chance of ingratiating himself to advance his own interests. And such a person was none other than David's army commander, Joab.\n\nJoab is the ultimate example of the opportunistic pragmatist. His actions were not guided by morals or principles, but motivated by self-interest. His life history of violence and immorality was clear. In 2 Samuel 3:27, his murder of Saul's commander, Abner, under the guise of avenging his brother, had removed the greatest rival in his career path then. Though a great help to the king in their battles [1 Chronicles 11:6-9; 19:9-13], he was once also David's worst accessory to sin [2 Samuel 11].\n\nNow in the case of Absalom, getting this estranged son back for David would open many career options for him. But later when it turned out Absalom had failed (and given that Absalom trusted and made Amasa his commander - 2 Samuel 17:25), it was also Joab who would kill both Absalom [2 Samuel 18:9-15 - explicitly against David's order] and Amasa [2 Samuel 20:8-12 - conveniently in the chaos of another revolt].\n\nBy 2 Samuel 20:23, Joab was the most powerful man in Israel after David - so powerful that David was afraid to act against him and had instead beseeched his successor Solomon to kill him [1 Kings 2:5-6]. His death would be a most tragic one [1 Kings 2:28-33].",
        "part6": "THOUGHT",
        "part7": "All the ways of a man are clean in his own eyes; but the LORD weigheth the spirits. Commit thy works unto the LORD, and thy thoughts shall be established. The LORD hath made all things for Himself: yea, even the wicked for the day of evil. - Proverbs 16:2-4",
        "part8": [
            "DEUTERONOMY 30",
            "PSALM 119:121-144"
        ]
    },
    "28 JUNE": {
        "part1": "2 Samuel 14:1",
        "part2": "David's soft spot",
        "part3": "VERSE 1",
        "part4": "Now Joab the son of Zeruiah perceived that the king's heart was toward Absalom.",
        "part5": "Commentators on this verse vary widely in their reading of David's attitude towards Absalom at this point of time. Some think that \"toward\" in this verse should be translated as \"against\", as this would better account for why Joab needed to come out with a plan to convince David to recall Absalom, and also explain why David refused to meet Absalom for another two years even when the latter was back.\n\nYet we must also understand David's position. As king, David needed to show an example to his people. If he had welcomed his own son back with open arms, without any retribution whatsoever, it would make it difficult for him to judge any murder in future, especially one involving fratricide. But like most fathers, it is also \"natural\" that he has a soft spot for his son, especially one as beautiful as Absalom.\n\nWe often use \"natural\" as an excuse to condone wrongdoing. \"He shouldn't have done it, but given the situation, it is natural for him to do that.\" Granted when it comes to judging and meting out discipline, we can make room for exceptions that call for compassion, but we need to examine our motives, and be impartial. We should not allow our hearts to lead us astray - especially in the training of our children.\n\nIt is the same in our Christian walk. There may be compromises which the world deems quite \"natural\" but they may go against what God has taught. And if we acquiesce, often our deceitful heart will whisper that it is alright to close an eye to sin. In times like these, gird up our loins and stand firm. Guard our hearts and follow God's way.",
        "part6": "THOUGHT",
        "part7": "Now no chastening for the present seemeth to be joyous, but grievous: nevertheless afterward it yieldeth the peaceable fruit of righteousness unto them which are exercised thereby. - Hebrews 12:11",
        "part8": [
            "DEUTERONOMY 31",
            "PSALM 119:145-176"
        ]
    },
    "29 JUNE": {
        "part1": "2 Samuel 14:2-3",
        "part2": "Joab's plan",
        "part3": "VERSE 2",
        "part4": "And Joab sent to Tekoah, and fetched thence a wise woman, and said unto her, I pray thee, feign thyself to be a mourner, and put on now mourning apparel, and anoint not thyself with oil, but be as a woman that had a long time mourned for the dead:",
        "part5": "The king harbours a soft spot for his wayward son. Yet perhaps regarding public opinion, he did not make the call to get him back. Seeing this, the opportunist Joab grabbed this chance to ingratiate the king and perhaps also his presumptive heir. This would place him in a good political position.\n\nJoab sent for a woman in Tekoah, which was at the border of the wilderness southeast of Jerusalem. He must have heard the reputation of this cunning woman, or even used her in some of his past conspiracies. But she was someone he trusted to understand and deliver what Joab wanted done.\n\nShe would make great pretence as a mourner appealing to the king. And \"Joab put the words in her mouth\" [v. 3], telling her exactly what to say. The story spun would bring to David's mind the dilemma he himself faced, from which she would then present her remonstration.\n\nThe element of guile aside, this plan was a tactful one, which tells us of Joab's cleverness. The method of entreating the king in a gentle manner is not wrong. We could even say a similar strategy was used by prophet Nathan in confronting David with his sin [2 Samuel 12], except he had used a parable, not a lie. But it is the intention that makes all the difference. Nathan was used by God to rebuke David, whereas Joab, acting for his own interests, sought the help of a deceitful woman to manipulate David into a decision he would later regret.",
        "part6": "THOUGHT",
        "part7": "But if ye have bitter envying and strife in your hearts, glory not, and lie not against the truth. This wisdom descendeth not from above, but is earthly, sensual, devilish. For where envying and strife is, there is confusion and every evil work. - James 3:14-16",
        "part8": [
            "DEUTERONOMY 32",
            "PSALMS 120-122"
        ]
    },
    "30 JUNE": {
        "part1": "2 Samuel 14:4-7",
        "part2": "Justice versus family",
        "part3": "VERSE 4",
        "part4": "And when the woman of Tekoah spake to the king, she fell on her face to the ground, and did obeisance, and said, Help, O king.",
        "part5": "The woman of Tekoah presented her case, paying obeisance to the king. Her intention was to remonstrate, and she began with a moving expression of seeming humility and submission, pretending to seek the king's help.\n\nThe fabricated case was made to touch the heart of its hearer. She was a widow with two sons, and one slew the other. The whole family wanted the life of the murderer, according to levitical law. But this remaining son was her only support on earth, and the only son to continue the line of her husband. This then might be a case that calls for compassion and mercy.\n\nThe analogy the woman presented was apt and vivid: killing her son would \"quench my coal which is left\" [v. 7] - her flame of life was already reduced to simmering embers, and killing him would snuff it out completely.\n\nThe situation painted by the woman was not exactly that faced by David. Perhaps it was intended so David would not realise prematurely the woman's motive. But it did soften and prime his heart, suggesting to him there might be a way out of his dilemma between justice and family. All he needed then was for someone to justify his actions to recall his son, after which he hoped that no one would bring up the incident again. Granted that David would refuse to see Absalom for another two years, still they could be reconciled later. But Absalom would get away with a grievous crime, with no proper correction and no accountability.",
        "part6": "THOUGHT",
        "part7": "Foolishness is bound in the heart of a child; but the rod of correction shall drive it far from him. - Proverbs 22:15",
        "part8": [
            "DEUTERONOMY 33-34",
            "PSALMS 123-125"
        ]
    },
    "1 JULY": {
        "part1": "2 Samuel 14:5-7",
        "part2": "Justice is essential",
        "part3": "VERSE 6",
        "part4": "And thy handmaid had two sons, and they two strove together in the field, and there was none to part them, but the one smote the other, and slew him.",
        "part5": "This is the second of two parables in 2 Samuel. The parable of the ewe-lamb spoken by Nathan was inspired by God, [2 Samuel 12] intended to reprove David of his sin, and to induce repentance. The parable of the woman of Tekoah, on the other hand, was made up by an unprincipled man - Joab - intended solely to advance his personal interests.\n\nThe parallels between the story of the Tekoan woman and the experience in David's life are unmistakable. One son had been murdered. The other was the murderer who deserved to die for his offence. However, that would mean the woman would be left childless. The story was intended to tug at the heartstrings of David.\n\nThe woman gave two reasons David should forgive Absalom. First, David would be inconsistent if he would show mercy to the woman's son and not extend the same mercy to his own. Second, if David were to carry out the full force of justice, without a reconciliation between him and Absalom, David would live in great regret. Thus, David was faced with a dilemma - justice or mercy. The choice between being a righteous judge and being a loving father, humanly speaking, is an impossible one.\n\nFor God, justice and mercy are met in our Lord Jesus Christ on the cross. God the Father who is perfectly just exercises perfect justice by offering His only begotten Son as the payment for our sins. Our Lord Who is also perfectly just and merciful offers His life for us. As Peter puts it, He \"suffered for sins, the just for the unjust, that He might bring us to God\" [1 Peter 3:18].",
        "part6": "THOUGHT",
        "part7": "Mercy and truth are met together; righteousness and peace have kissed each other. - Psalm 85:10",
        "part8": [
            "JOSHUA 1",
            "PSALMS 126-128"
        ]
    },
    "2 JULY": {
        "part1": "2 Samuel 14:7",
        "part2": "Quenching the coal",
        "part3": "VERSE 7",
        "part4": "And, behold, the whole family is risen against thine handmaid, and they said, Deliver him that smote his brother, that we may kill him, for the life of his brother whom he slew; and we will destroy the heir also: and so they shall quench my coal which is left, and shall not leave to my husband neither name nor remainder upon the earth.",
        "part5": "The plea for mercy by the Tekoan woman for her son, who had killed his own brother, is based on the argument he was the only remaining heir in the family. Her family was already in ruins. He was her remaining hope, the only one to support her and continue with her husband's name. She cleverly presented her son as the smouldering ember among the ashes. If justice were to be zealously carried out to the letter - a life for life [Exodus 21:23-25] - the family line would be terminated; the coal would be quenched. And the only people who stood to gain from that were her husband's relatives.\n\nBy this, the widow was insinuating the reason there were calls within David's own household demanding justice be meted out to Absalom was because he was the heir to the crown. If they could remove him, they would stand to gain from his inheritance.\n\nIn her plea, the woman was appealing for sympathy. This is not uncommon in our day too, where those in power - whether presidents or kings - have the authority to pardon by reducing or even wholly remitting the penalties that are required by the law.\n\nDavid prays, \"For Thy name's sake, O LORD, pardon mine iniquity; for it is great\" [Psalm 25:11]. The prophet Isaiah writes that God \"will abundantly pardon\" [Isaiah 55:7]. However, God's pardon is not based on emotions alone. The Word of God repeatedly states that pardon and forgiveness is available only through the offering of atonement in connection with prescribed sacrifices [Leviticus 4:20, 26, 31, 35; 5:10, 13, 16, 18; 6:7; 19:22]. Biblical pardon is possible only through the substitutionary atonement of our Lord Jesus.",
        "part6": "THOUGHT",
        "part7": "Praise the LORD who \"made him (Jesus Christ) to be sin for us ... that we might be made the righteousness of God in Him\" [2 Corinthians 5:21].",
        "part8": [
            "JOSHUA 2",
            "PSALMS 129-131"
        ]
    },
    "3 JULY": {
        "part1": "2 Samuel 14:8-10",
        "part2": "David's warning",
        "part3": "VERSE 10",
        "part4": "And the king said, Whosoever saith ought unto thee, bring him to me, and he shall not touch thee any more.",
        "part5": "The story of the Tekoan woman was contrived by Joab. And just as Joab hoped, David was so moved with compassion by the widow's account he issued the decree that her son would be spared. To absolve the king of any blame for his decision of mercy, the widow said she would personally shoulder all responsibility for any criticism the king might receive for his judgement. David, however, would have none of it, warning that anyone who dared question his decision would have to face his displeasure. Milking David's sympathies for her plight to the fullest, the woman asked David to confirm his promise by an oath - \"let the king remember the LORD thy God\" [2 Samuel 14:11a] - that no one would seek to take vengeance on her son. By then, David's heartstrings had been well played by the woman's superb performance, swore with a strong oath that not a hair of her son's head would fall to the ground [v. 11b]. While David was misled by the woman's story, his decision was motivated by compassion, mercy, and the spirit of forgiveness. The Apostle Paul exhorts us to be \"kind one to another, tenderhearted, forgiving one another, even as God for Christ's sake hath forgiven you\" [Ephesians 4:32]. That said, we must also bear in mind that by forgiving, God does not mean that justice is to be totally cast aside for mercy. Evil is never to be condoned. Justice must be executed against wrongdoing lest disorder and anarchy become the norm of society. Hence, there must be a careful balance in the execution of justice and the exercise of mercy and compassion [Matthew 6:14-15; Mark 11:25; Luke 11:4; 17:4; Colossians 3:13].",
        "part6": "THOUGHT",
        "part7": "Justice must reign with mercy at its side.",
        "part8": [
            "JOSHUA 3",
            "PSALMS 132-134"
        ]
    },
    "4 JULY": {
        "part1": "2 Samuel 14:11",
        "part2": "\"Let the king remember the LORD ...\"",
        "part3": "VERSE 11",
        "part4": "Then said she, I pray thee, let the king remember the LORD thy God, that thou wouldest not suffer the revengers of blood to destroy any more, lest they destroy my son. And he said, As the LORD liveth, there shall not one hair of thy son fall to the earth.",
        "part5": "The Tekoan woman played her part so well that David did not even hesitate to grant her son mercy even though he might have known that her pleas were not likely to be impartial. One writer describes her as a clever talkative gossip, who employs the right words to attain her ends.\n\nThe phrase - \"let the king remember the LORD thy God\" - appeals to David and to all believers to recall the excellencies of God - His relation to us as Creator, Sustainer, sovereign King and Redeemer; His goodness to us in what He has done, is doing, and has promised to do.\n\nIt is interesting to note that the woman called on David to remember the LORD reminding us that even kings are required to be mindful of the LORD. In fact, the higher the position we have attained, the more we need to keep in mind it is God who has placed us there and to whom we will give account. The greater the trust God has committed to us, the more we need to look to Him for help to fulfil the ministry to which we have been appointed. Our Lord Jesus says, \"For unto whomsoever much is given, of him shall be much required: and to whom men have committed much, of him they will ask the more\" [Luke 12:48b].\n\nThis truth applies to every believer. We are all bound to remember God and live as being in His sight. It is not only our present duty but also for our own spiritual profit to have the LORD ever before us. As one writer aptly points out, it is this remembrance of God that stirs our devotion to Him in life and ministry.",
        "part6": "THOUGHT",
        "part7": "David prays, \"I have set the LORD always before me: Because He is at my right hand, I shall not be moved\" [Psalm 16:8].",
        "part8": [
            "JOSHUA 4",
            "PSALMS 135-136"
        ]
    },
    "5 JULY": {
        "part1": "2 Samuel 14:12-13",
        "part2": "The woman's true intention revealed",
        "part3": "VERSE 13",
        "part4": "And the woman said, Wherefore then hast thou thought such a thing against the people of God? for the king doth speak this thing as one which is faulty, in that the king doth not fetch home again his banished.",
        "part5": "Having made her point and pled her case, the Tekoan woman asked to have one more word. She asked David two questions. First, in refusing to show mercy to Absalom, was David not withholding favour from the people of Israel? Second, in showing mercy to her son, would David not be convicting himself of habouring an unforgiving spirit if he did not extend the same mercy to his own son?\n\nThis was her real intention in the first place in coming before David. The end goal of the whole plot was for Joab to convince David of his need to be reconciled with Absalom. Her words unmasked her motives. The widow was arguing from the lesser to the greater, imploring David to apply the lesson to himself. The king had pardoned her son; he had also sworn an oath to protect him from a blood vendetta. Why then would he keep Absalom an outcast in Geshur, in northern Israel, far from Jerusalem and deprive him from worshipping God?\n\nPoor David had to juggle between two conflicting roles as king and father. The Bible teaches that \"it is not good to have respect of persons in judgment\" [Proverbs 24:23]. Peter said that \"God is no respecter of persons\" [Acts 10:34]. Paul also said that \"there is no respect of persons with God\" [Romans 2:11]. Yet, it is also God's divine prerogative to be gracious to whom He will be gracious, and to have mercy on whom He will have mercy [Exodus 33:19; Romans 9:15].\n\nIn hindsight, we know that David's decision to pardon Absalom was wrong, teaching us that in such situations, the guiding principle must always be to uphold the honour and glory of God.",
        "part6": "THOUGHT",
        "part7": "Let the light of God's truth guide us in our thoughts and actions.",
        "part8": [
            "JOSHUA 5",
            "PSALMS 137-138"
        ]
    },
    "6 JULY": {
        "part1": "2 Samuel 14:14",
        "part2": "We must needs die (1)",
        "part3": "VERSE 14",
        "part4": "For we must needs die, and are as water spilt on the ground, which cannot be gathered up again; neither doth God respect any person: yet doth He devise means, that His banished be not expelled from Him.",
        "part5": "In verse 14, the Tekoan widow espouses three great truths about human life. First, we must all die; that is the absolute certainty of death. Second, because of the certainty of death, there is the absolute necessity for God to save. Third, the mercy of God is that He will not lightly destroy life, and neither should we.\n\n\"We must needs die, and are as water spilt on the ground, which cannot be gathered up again.\" Death is the undeniable certainty because God had told Adam that \"in the day that thou eatest thereof thou shalt surely die\" [Genesis 2:17]. The writer of Hebrews says, \"And as it is appointed unto men once to die, but after this the judgment\" [Hebrews 9:27].\n\nNot only is death certain, but the days of our lives once spent are also irrecoverable like water spilt on the ground. The Bible writers portray human life as the withering of the grass [Psalm 102:11], the fading of the flower [Psalm 103:15- 16], the fleeing of the shadows [Psalm 144:4], and the vanishing of the vapour [James 4:14].\n\nDeath is certain; it is also universal. However, while death is the great equalizer in the sense that no one regardless of his status will be spared, yet death yields different outcomes. The wicked \"must needs die\" so that the truthfulness of God's threats may be fully proven. The righteous also \"must needs die\" so the promises of God's eternal reward may be realised. To the righteous, redemption is God's first giving of grace, and death is the entrance to the receiving of the crown of eternal glory.",
        "part6": "THOUGHT",
        "part7": "In light of the certainty and brevity of death, we must learn \"to number our days, that we may apply our hearts unto wisdom\" [Psalm 90:12].",
        "part8": [
            "JOSHUA 6",
            "PSALM 139"
        ]
    },
    "7 JULY": {
        "part1": "2 Samuel 14:14",
        "part2": "We must needs die (2)",
        "part3": "VERSE 14",
        "part4": "For we must needs die, and are as water spilt on the ground, which cannot be gathered up again; neither doth God respect any person: yet doth He devise means, that His banished be not expelled from Him.",
        "part5": "We \"must needs die.\" That is the reality of our mortality. This is the solemn truth! We live in a dying world, and daily we are slowly dying. On our own and by our natural powers, we are wholly lost, beyond any hope of recovery \"as water spilt on the ground, which cannot be gathered up again.\" The certainty of death is the compelling reason God seeks to save life. Without the intervention of God in this matter, we are all doomed not just to physical death but also the second death, which is eternal separation from God [Revelation 20:6, 14; 21:8]. This is the second great truth coming from the Tekoan widow - God by His sovereign grace \"devise means\" so \"banished [sinners] be not expelled from Him.\"\n\nThe point is that despite death being the promised consequence of sin [Genesis 2:17], God has made provision for the sinner's restoration and life through the atoning work of His only begotten Son. Our Lord Jesus came into the world and died for the sinner's guilt; He is now the great Refuge to whom if we will flee to, we can be saved from the condemnation we deserve.\n\n\"For as in Adam all die, even so in Christ shall all be made alive\" [1 Corinthians 15:22]. \"In this was manifested the love of God toward us, because that God sent his only begotten Son into the world, that we might live through him. Herein is love, not that we loved God, but that he loved us, and sent his Son to be the propitiation for our sins\" [1 John 4:9-10].",
        "part6": "THOUGHT",
        "part7": "Without our Lord Jesus Christ, we are banished sinners. In Him, we are embraced saints.",
        "part8": [
            "JOSHUA 7",
            "PSALMS 140-141"
        ]
    },
    "8 JULY": {
        "part1": "2 Samuel 14:14",
        "part2": "We must needs die (3)",
        "part3": "VERSE 14",
        "part4": "For we must needs die, and are as water spilt on the ground, which cannot be gathered up again; neither doth God respect any person: yet doth He devise means, that His banished be not expelled from Him.",
        "part5": "The certainty of death as a result of sin and the saving grace of God despite our sins bring home the truth of God's mercy and compassion, that He will not lightly destroy life. Absalom fled from David's presence because he not only sinned against his father's love, he had also broken the law of the land and of God. His own deeds sent him into banishment. Likewise, sin has banished us from the presence of and favour with our heavenly Father.\n\nSin has driven us away from God. And it is God's grace that will draw sinners to Himself. He devises \"means, that His banished be not expelled from Him\". The God in heaven is not arbitrary or indifferent on matters of life and death.\n\nDespite the people's sins and continued disobedience, the LORD extended His hand of mercy and offered them life. \"See, I have set before thee this day life and good, and death and evil ... I call heaven and earth to record this day against you, that I have set before you life and death, blessing and cursing: therefore choose life, that both thou and thy seed may live\" [Deuteronomy 30:15-19].\n\nGod, through Prophet Ezekiel, made a similar appeal - \"I have no pleasure in the death of the wicked; but that the wicked turn from his way and live: turn ye, turn ye from your evil ways; for why will ye die, O house of Israel?\" [Ezekiel 33:11].\n\nIn the New Testament, Peter expresses the desiderative will of God, saying, \"The Lord ... is longsuffering to us-ward, not willing that any should perish, but that all should come to repentance\" [2 Peter 3:9]. The question for us is this - why will you flee from the presence and favour of God?",
        "part6": "THOUGHT",
        "part7": "The plan of salvation and the sacrificial death of our Lord Jesus Christ on the cross, began in God's own heart [Romans 5:8].",
        "part8": [
            "JOSHUA 8",
            "PSALMS 142-143"
        ]
    },
    "9 JULY": {
        "part1": "2 Samuel 14:15-16",
        "part2": "Speaking out of fear",
        "part3": "VERSE 15",
        "part4": "Now therefore that I am come to speak of this thing unto my lord the king, it is because the people have made me afraid: and thy handmaid said, I will now speak unto the king; it may be that the king will perform the request of his handmaid.",
        "part5": "In verse 15, the Tekoan woman gives the reasons for her appeal. While she made a compelling case on behalf of Absalom by tugging at David's heartstrings, she also confessed she spoke \"because the people have made [her] afraid\". Perhaps through the grapevine, she had come to learn of the whisperings of the people in favour of Absalom. There is a hint that David too should be afraid of what the people were thinking. The woman is in effect saying to David, \"I am afraid for you.\" The people's dissatisfied rumblings might be the harbinger of another insurrection by Absalom with support from the king of Geshur.\n\nThe fear of man is never a good reason for deciding on a particular course of action. The ten spies feared the Canaanites, and they \"brought up an evil report\" of the Promised Land [Numbers 13:32]. Aaron feared the people and acceded to their demand to build a golden calf [Exodus 32:22]. The children of Israel feared Goliath, and God's name was reproached [1 Samuel 17:24]. Saul feared the people, and he disobeyed God [1 Samuel 15:24]. Peter feared, and he denied the Lord Jesus Christ three times. Later, he feared the circumcised Jewish believers and withdrew his fellowship from Gentile converts [Galatians 2:12-13]. In these examples, the fear of men drove them to disobey God.\n\nProverbs tells us \"the fear of man bringeth a snare\" [Proverbs 29:25]. The word \"snare\" refers to a pit that hunters use to catch prey. Once an animal falls in, it can do nothing to change its course. The only way out of fear is faith in God. However, God frees us from fear not by removing it, but by replacing our paralyzing fear of man with a reverential fear of Himself.",
        "part6": "THOUGHT",
        "part7": "Instead of fearing men, have faith in God. \"And fear not them which kill the body, but are not able to kill the soul: but rather fear him which is able to destroy both soul and body in hell\" [Matthew 10:28].",
        "part8": [
            "JOSHUA 9",
            "PSALM 144"
        ]
    },
    "10 JULY": {
        "part1": "2 Samuel 14:17",
        "part2": "David - an angel of God?",
        "part3": "VERSE 17",
        "part4": "Then thine handmaid said, The word of my lord the king shall now be comfortable: for as an angel of God, so is my lord the king to discern good and bad: therefore the LORD thy God will be with thee.",
        "part5": "The Tekoan woman used every trick in the book to persuade David to restore Absalom - from appealing to David's kindness and sympathy, to giving a veiled threat about the people's sentiment, and now flattering David as an angel of God. She is saying she knows David's decision will be comforting because like an angel of God, he is able to discern good and bad, and will do the right thing in restoring Absalom. Then, the woman pulled out one final trick by ending her appeal with a pronouncement of blessing on David: \"The LORD thy God will be with thee.\" The statement left David with no choice. If he did not do the \"right thing\" by her, he is neither an angel of God nor will he have the presence of God with him.\n\n\"The LORD thy God will be with thee\" is a common salutation used by the Israelites, much like \"God bless you\" - a benediction which we frequently utter but often without much thought or feeling for its significance. When Saul found out David had gone to Keilah, he said that God had delivered David into his hand [1 Samuel 23:7]. The Pharisee came to the temple, and prayed, \"God, I thank thee, that I am not as other men are, extortioners, unjust, adulterers, or even as this publican\" [Luke 18:11a].\n\nHow often we carelessly employ such platitudes too. This is something we must guard against. We must be careful also to recognise such flattering manipulation and not be pressured by it in order not to feel badly. And while we should desire the presence of God with us, His nearness to us must be precipitated by purity of our hearts and our single-minded devotion to Him [James 4:8].",
        "part6": "THOUGHT",
        "part7": "Immanuel - God with us. This blessing can only be secured by becoming righteous through repentance and faith in our Lord Jesus Christ.",
        "part8": [
            "JOSHUA 10",
            "PSALM 145"
        ]
    },
    "11 JULY": {
        "part1": "2 Samuel 14:18-20",
        "part2": "Turning neither left nor right",
        "part3": "VERSE 19",
        "part4": "And the king said, Is not the hand of Joab with thee in all this? And the woman answered and said, As thy soul liveth, my lord the king, none can turn to the right hand or to the left from ought that my lord the king hath spoken: for thy servant Joab, he bade me, and he put all these words in the mouth of thine handmaid.",
        "part5": "King David's question to the woman, \"Is not the hand of Joab with thee in all this? revealed his insight with regards to Joab's plot. The word \"not\" (in italics), inserted by the Authorised Version, changes the meaning of David's uncertainty to certainty. David was certain that Joab was behind the story of the woman. He had a suspicion the woman's scheme was planned by Joab. To verify it, he would get the truth from her. She answered that no one could turn to the right hand or to the left.\n\n\"To turn to the right or left\" means \"to be evasive\" (to use deceit to escape or avoid). To say \"none can turn right or left\" means \"there is no way to escape telling the truth\". The woman knew she could not hide the truth and admitted it was Joab who planted the words in her mouth.\n\nLet us learn that no one can circumvent and sidestep the truth and hope to get away with it. As children of the true and living God, we must always be truthful and true to Him in obeying His word. In Deuteronomy 28:14, God speaks to His people \"And thou shalt not go aside from any of the words which I command thee this day, to the right hand, or to the left, to go after other gods to serve them\". \"Take fast hold of instruction; let her not go: keep her; for she is thy life\" [Proverbs 4:13]. May God help us to put Him first (not people or things) in obedience to His Word. \"Little children, keep yourselves from idols. Amen.\" [1 John 5:21]",
        "part6": "THOUGHT",
        "part7": "For we can do nothing against the truth, but for the truth - 2 Corinthians 13:8",
        "part8": [
            "JOSHUA 11",
            "PSALMS 146-147"
        ]
    },
    "12 JULY": {
        "part1": "2 Samuel 14:20",
        "part2": "Flattery",
        "part3": "VERSE 20",
        "part4": "To fetch about this form of speech hath thy servant Joab done this thing: and my lord is wise, according to the wisdom of an angel of God, to know all things that are in the earth.",
        "part5": "Unable to withhold the truth, the woman admitted that Joab was behind her story about her two sons. David faced a similar dilemma. His beloved son Absalom had killed his brother Amnon for violating his sister. What would David do with Absalom to balance love and justice?\n\nThe woman's story was aimed at tugging the heartstrings of David to act and restore Absalom. Her intention was to make the king so pleased with himself that he would do what he longed for in his heart. To that end she used flattering words, \"my lord is wise, according to the wisdom of an angel of God, to know all things that are in the earth\". She ascribed to the king a wisdom on par with an angel of God. Such a compliment of exaggerated untruth would certainly inflate a man's pride. And pride in the heart will be the surest way to ruin and death.\n\nWhile appropriate compliments are always warranted, the Bible warns us of flattery's pernicious nature. \"A man that flattereth his neighbour spreadeth a net for his feet\" [Proverbs 29:5]. We read later, after Absalom returned to Jerusalem, how his plan to usurp his father as king was achieved by swaying the people's affection through flattery. \"See, thy matters are good and right; but there is no man deputed of the king to hear thee ... Oh that I were made judge ... that every man which hath any suit or cause might come unto me, and I would do him justice ... he put forth his hand, and took him, and kissed him...so Absalom stole the hearts of the men of Israel.\" [2 Samuel 15:3-6]. Flattery resulted not only in David having to flee Jerusalem but also in Absalom's downfall. Flattery destroys. Take heed.",
        "part6": "THOUGHT",
        "part7": "A lying tongue hateth those that are afflicted by it; and a flattering mouth worketh ruin. - Proverbs 26:28",
        "part8": [
            "JOSHUA 12-13",
            "PSALM 148"
        ]
    },
    "13 JULY": {
        "part1": "2 Samuel 14:21-24",
        "part2": "Restoration of Absalom",
        "part3": "VERSE 21",
        "part4": "And the king said unto Joab, Behold now, I have done this thing: go therefore, bring the young man Absalom again.",
        "part5": "The scheme devised by Joab and executed by the woman moved David to long even more for the return of his estranged son. But the trigger point for his act of restoring Absalom was David's great love for him. David knew Absalom had done wrong; killing Amnon for raping his sister. David should have punished Amnon then, but he did not. David should have punished Absalom, but he could not bear to do so. Now he would soothe his longing for Absalom by bringing him back from exile but restricting him to his own house [v. 24]. That way David hoped to convey to Absalom that he was not pleased with his ways. Thus might Absalom appreciate his father's love for him and depart from evil.\n\nWe can note two things about David's way of restoring Absalom. First, it falls short of God's way which required sin to be admitted and forsaken. Unrepentant Absalom was restored to the good graces of his father but at the expense of justice. It was only an outward semblance of reconciliation. Second, Absalom's restoration was partial without personal access to his father. David might be glad for his son's return to Jerusalem. But that added to Absalom's defiance and stirred rebellion in his heart.\n\nHow do you restore someone you love who has sinned? God restores sinners when they repent of their sins. Anything less would be less than full reconciliation. Peter made a direct connection between repentance and forgiveness of sins in his message to the Sanhedrin council [Acts 5:31]. Scripture is clear - without repentance there is no forgiveness.",
        "part6": "THOUGHT",
        "part7": "If we confess our sins, He is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness. - 1 John 1:9",
        "part8": [
            "JOSHUA 14-15",
            "PSALMS 149-150"
        ]
    },
    "14 JULY": {
        "part1": "2 Samuel 14:25-27",
        "part2": "The beauty of Absalom",
        "part3": "VERSE 25",
        "part4": "But in all Israel there was none to be so much praised as Absalom for his beauty: from the sole of his foot even to the crown of his head there was no blemish in him.",
        "part5": "Absalom the third son of David was blessed with good looks. His physique was the talk of the town. The people were obviously blown away by the display of his beautiful long hair. It is a fact that one's beauty never fails to make waves. In the people's eyes, Absalom had what it took to be king. People are naturally impressed by appearance. The sight meeting the eye matters much more than the character of one's heart. But do you not know the Scriptures concerning the calling of David? We are told how Samuel \"looked on Eliab, and said, Surely the LORD'S anointed is before him. But the LORD said unto Samuel, Look not on his countenance, or on the height of his stature; because I have refused him: for the LORD seeth not as man seeth; for man looketh on the outward appearance, but the LORD looketh on the heart\" [1 Samuel 16:6b-7].\n\nMan looks at the outward, but God looks at the heart. Inner beauty is of greater importance to Him. Flattered by the esteem of the populace, Absalom was indeed eyeing his father's throne. But was Absalom a man after God's own heart like his father? Most certainly not, thus, his beauty is only skin-deep. He did not have what it takes to be king - a God-fearing heart and godly character.\n\nDearly beloved, we thank God that no matter how we look - beautiful or not in the eyes of man, God is working in our hearts to mould our inner man to be more like our Lord Jesus Christ. We praise the Lord for making something beautiful out of our lives.",
        "part6": "THOUGHT",
        "part7": "Favour is deceitful, and beauty is vain: but a woman that feareth the LORD, she shall be praised. - Proverbs 31:30",
        "part8": [
            "JOSHUA 16-17",
            "ACTS 1"
        ]
    },
    "15 JULY": {
        "part1": "2 Samuel 14:28-30",
        "part2": "Absalom's demand for attention",
        "part3": "VERSE 30 crime of killing Amnon according to God's law. But",
        "part4": "Therefore he said unto his servants, See, Joab's field is near mine, and he hath barley there; go and set it on fire. And Absalom's servants set the field on fire.",
        "part5": "After spending two years in Jerusalem without seeing the king's face, Absalom called for Joab to send him to the king. Twice he called and twice Joab did not come. So, he ordered his servants to set fire to Joab's barley field. Such drastic demand for attention speaks volumes of Absalom's character. He would do anything to get what he wants. Why would he resort to such action?\n\nAbsalom knew that he faced execution for his crime of killing Amnon according to God's law. But he felt fully justified because Amnon had abused his sister. That attitude of arrogance showed up in his challenge to his father \"... if there be any iniquity in me, let him kill me\" [v. 32b]. Absalom could not accept his father's refusal to see him. So when Joab did not answer his demand to arrange the meeting, Absalom set his barley field on fire. What a shock it must have been for battle-hardened general Joab?\n\nHow do we seek attention? From our perspective, how do we get God's attention for help? When we are perplexed, confused, fearful and helpless, do we make unreasonable demands for attention? Note the contrast between Absalom and the prodigal son in the Lord Jesus' parable [Luke 15]. Absalom responded by burning Joab's field. The prodigal son responded and returned with a humble repentant heart. \"Though the LORD be high, yet hath He respect unto the lowly: but the proud He knoweth afar off \" [Psalm 138:6]. May we humble ourselves so that God is pleased with us.",
        "part6": "THOUGHT",
        "part7": "Sometimes God gets our attention by setting our \"barley field\" on fire. \"He, knowing that we will not come by any other means, sendeth a serious trial - He sets our barley-field on fire, which He has a right to do, seeing our barley-fields are far more His than they are ours.\" (Spurgeon quoted in Enduring Word Bible Commentary)",
        "part8": [
            "JOSHUA 18-19",
            "ACTS 2"
        ]
    },
    "16 JULY": {
        "part1": "2 Samuel 14:31-32",
        "part2": "Joab's dilemma",
        "part3": "VERSE 31",
        "part4": "Then Joab arose, and came to Absalom unto his house, and said unto him, Wherefore have thy servants set my field on fire?",
        "part5": "Joab's crop fields had been destroyed because he had ignored Absalom's summons. Joab asked the question, but he knew the reason for this cruel act. He was a shrewd and perceptive politician, a good \"sizer up\" of men and situations, with a keen sense of what was going on around him and he could discern Absalom's heart.\n\nEarlier on, Joab had perceived David's \"soft spot\" for Absalom and engineered his return to Jerusalem from exile. Now he was faced with Absalom's demand for an audience with the king which perhaps conflicted with his own judgement that the time for meeting was not right. So, caught between the proverbial rock and a hard place, he simply avoided him. This vindictive act would serve only to confirm Joab's reservations about Absalom's heart.\n\nAbsalom's actions betrayed a lack of remorse for his crime against Amnon and his impatience with the king's continued silence. He knew his father did not have it in him to execute him before and had even acquiesced to his return albeit not into his presence. Weary of waiting, he would call his father's bluff and demand that either he be judged fully guilty on pain of death, or fully guiltless and be restored to his rightful position.\n\nWe are often placed in quandaries as Joab was and called to make difficult decisions. Even if it may cost us dearly, always seek to honour God and let Him vindicate. Plead for the Spirit's wisdom and help and He will never fail nor disappoint.\n\nIf we are entangled in wrongdoing as Absalom was, let our remorse and repentance be genuine and full, so that we do not play the hypocrite. True repentance guarantees God's forgiveness and restoration.",
        "part6": "THOUGHT",
        "part7": "Man can easily be fooled but God knows our heart. \"O God, Thou knowest my foolishness; and my sins are not hid from Thee.\" [Psalm 69:5]",
        "part8": [
            "JOSHUA 20-21",
            "ACTS 3"
        ]
    },
    "17 JULY": {
        "part1": "2 Samuel 14:33",
        "part2": "Pseudo reconciliation",
        "part3": "VERSE 33",
        "part4": "So Joab came to the king, and told him: and when he had called for Absalom, he came to the king, and bowed himself on his face to the ground before the king: and the king kissed Absalom.",
        "part5": "At Absalom's behest, Joab thus becomes the mediator between the prince and his king. A wrongdoer seeking reconciliation is a laudable thing but here many things were wrong. This mediator was a man of deeply flawed character, and this wrongdoer was possessed of an unremorseful and unrepentant heart. This reconciliation was a sham.\n\nTrue reconciliation must be done with a right heart in the right way. There must be recognition of wrongdoing, repentance in the heart and reparation made for it. Only then can real restoration and reconciliation take place. But such could not be said of Absalom. And this is the picture of many an unrepentant sinner.\n\nThanks be to our God the righteous King who so earnestly desires the reconciliation of every sinner; that in His love He provides the only acceptable mediator [1 Timothy 2:5], His own sinless Son, to make the only satisfactory reparation (propitiation) for our sins by His death, thus satisfying the demands of divine justice. This flawless mediator was nothing like the general Joab but the divine captain of our salvation, our Lord Jesus Christ, resurrected Son of God, whose victory over death is the only acceptable way to the King.\n\nAnd what is a right heart? It is a heart that recognises no semblance of good in it, claims no ability to save itself and believes that only the Lord Jesus saves; a heart of true repentance, of sorrow and regret over sin, which is resolved to return to it no more; a broken and contrite heart that God will not despise [Psalm 51:17].\n\nDavid kissed Absalom and father and son were reconciled. But this pseudo-reconciliation and false peace would not last, and the worst was yet to be.",
        "part6": "THOUGHT",
        "part7": "All roads do not lead to heaven. In Christ alone is reconciliation with God a reality. \"Jesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by Me.\" [John 14:6]",
        "part8": [
            "JOSHUA 22",
            "ACTS4"
        ]
    },
    "18 JULY": {
        "part1": "2 Samuel 15:1",
        "part2": "The image of Absalom",
        "part3": "VERSE 1",
        "part4": "And it came to pass after this, that Absalom prepared him chariots and horses, and fifty men to run before him.",
        "part5": "The world is concerned with and impressed by outward appearances. A thing's beauty is often judged by its looks. Hence the worldling devotes much time and attention in enhancing the veneer of its image.\n\nSo, Absalom surrounded himself with a magnificent retinue of chariots and horses. Presently restored by David, he wasted no time in donning the appurtenances of power and prestige to burnish his regal status. This was a surreptitious plan to stand out and impress the citizenry even as he worked silently to undermine his father the king. Absalom's heart was not right even though he was a picture of beauty and grandeur.\n\nThis applies to the Christian in two ways. First, in our judgement of self, what is our greatest concern before men? Are we so absorbed with what can be seen of us and have scant regard for the unseen within us? Man may be impressed and taken by looks but truth will out in the end, if not in another's eye, then certainly in God's judgement. Thus, Peter exhorts \"But let it be the hidden man of the heart, in that which is not corruptible, even the ornament of a meek and quiet spirit, which is in the sight of God of great price\" [1 Peter 3:4].\n\nSecond, how do we judge others? The All-wise God told Samuel, \"Look not on his countenance, or on the height of his stature ... for the LORD seeth not as man seeth; for man looketh on the outward appearance, but the LORD looketh on the heart\" [1 Samuel 16:7]. Judge not a book by its cover or persons by appearance. Rather, \"judge righteous judgment\" [John 7:24] both of others and of self.",
        "part6": "THOUGHT",
        "part7": "Don't fool others and don't fool ourselves. The Lord knows.",
        "part8": [
            "JOSHUA 23",
            "ACTS5"
        ]
    },
    "19 JULY": {
        "part1": "2 Samuel 15:2",
        "part2": "The ambition of Absalom",
        "part3": "VERSE 2",
        "part4": "And Absalom rose up early, and stood beside the way of the gate: and it was so, that when any man that had a controversy came to the king for judgment, then Absalom called unto him, and said, Of what city art thou? And he said, Thy servant is of one of the tribes of Israel.",
        "part5": "The gate of the city was where the king would give audience to his citizens for the purpose of hearing their grievances and administering justice. To stand there in such manner in the absence of the king would do two things for Absalom: first, it would give him exposure to and recognition by the common people; and second, it would give them the impression he was concerned for their welfare, interested in their complaints and approachable with his friendly demeanour.\n\nBut behind this facade of familiarity and friendliness was a burning ambition to be king, and a covetous heart for his father's crown. And Absalom would work to achieve it through subterfuge and craft.\n\nWhat are your consuming ambitions? Are they solely centred on things in the here and now like qualifications, career, success, wealth, power and prestige? Or are your ambitions and desires for the things that have a value transcending the limited years of this life?\n\nThe rich and ambitious man was a fool in God's eyes because he did not prepare for the unseen eternity and did not care about the Kingdom of God [Luke 12:20-21]. His earthly treasures were valueless since he could not bring them with him, and all his worldly accomplishments would count for nothing where he was going. Worse still, life for him would end in a few short hours and he did not even realise it.\n\nLet us have the right view of ambition. \"Seek ye first the kingdom of God and His righteousness\" is our Lord's wise prescription because that is where we will be for all eternity.",
        "part6": "THOUGHT",
        "part7": "Be ambitious for the Lord. \"And seekest thou great things for thyself ? seek them not.\" [Jeremiah 45:5a]",
        "part8": [
            "JOSHUA 24",
            "ACTS 6"
        ]
    },
    "20 JULY": {
        "part1": "2 Samuel 15:3-4",
        "part2": "The undermining of David",
        "part3": "VERSE 4",
        "part4": "Absalom said moreover, Oh that I were made judge in the land, that every man which hath any suit or cause might come unto me, and I would do him justice!",
        "part5": "Absalom's words in verses 3 and 4 are the words of a cunning heart. He agreed with the petitioners in their complaints. He sympathised with the people whose grievances were not listened to. He empathised with them heartily and insinuated they were being neglected by their king. Every word was calculated to undermine the credibility and authority of their monarch, and elevate himself in the people's eyes. The bitterness of being snubbed by his father still smouldered within and fomented hatred and sin in his heart. He would exact his revenge.\n\nThe experience of bitterness is common to all man. The difference for the Christian lies in how we deal with it. The Bible is clear. The root of bitterness defiles our soul and must be pulled out [Hebrews 12:15]. The gall of bitterness enslaves us in a bond of iniquity and wickedness which must be repented of [Acts 8:22-23]. Therefore, God through the apostle instructs that all bitterness, wrath and malice be put away lest we grieve the Holy Spirit [Ephesians 4:30-31].\n\nGod is greatly grieved, and the Spirit's influence quenched when we allow such feelings and emotions to dwell within and control us. Instead, we are to be \"kind one to another, tenderhearted, forgiving one another, even as God for Christ's sake hath forgiven you\" [Ephesians 4:32]. We who have known God's love, experienced His forgiveness, made free from sin's enslavement by His Spirit within us, directing and helping us, are certainly able to do that when we yield wholly to Him. This is well pleasing to our Lord and glorifies His name.",
        "part6": "THOUGHT",
        "part7": "Remember Cain's bitterness towards Abel and its bitter end. Read 1 John 3:12.",
        "part8": [
            "JUDGES 1",
            "ACTS 7"
        ]
    },
    "21 JULY": {
        "part1": "2 Samuel 15:5-6",
        "part2": "Stealing the heart",
        "part3": "VERSE 6",
        "part4": "And on this manner did Absalom to all Israel that came to the king for judgment: so Absalom stole the hearts of the men of Israel.",
        "part5": "Absalom, the third son of David, was born in Hebron to his third wife, Maacah, a heathen princess of Geshur [2 Samuel 3:3]. Being the son of a pagan mother, Absalom had little or no concern for the peace of Israel. He had only been recently restored to his place in court but now coveted his father's throne. Absalom was not content with the honour and privileges he enjoyed as a prince. He wanted to be king. Absalom's perverted greed for his father's throne was synonymous to Satan's desire to usurp God's throne [Isaiah 14:13-14; Ezekiel 28:14-17].\n\nAbsalom cunningly planned the insurrection against his father, first by undermining his authority. He projected artfully that he would be a better king by portraying himself as a god-like figure of greatness and goodness. Accompanied by horses and chariots, he would appear in pomp and magnificence. Every morning, he would be at the palace gate to intercept the people who were going to the palace to seek audience with the King regarding their problems. Absalom received them with false humility and made them believe he empathised with them and would attend to their woes more assiduously than his father. With charm, pretence, and affability, he stole the hearts of the men of Israel.\n\nSimilarly, Satan the Angel of Light, attempts to cause us to rebel against God by stealing our hearts through deception and temptation. We are to submit to God, resist the devil, and he will flee from us [James 4:7]. May God's Word continue to sanctify and strengthen our hearts daily.",
        "part6": "THOUGHT",
        "part7": "Thy Word have I hid in mine heart, that I might not sin against Thee. - Psalm 119:11",
        "part8": [
            "JUDGES 2",
            "ACTS 8"
        ]
    },
    "22 JULY": {
        "part1": "2 Samuel 15:7-9",
        "part2": "The strategy of Absalom - revolt from Hebron",
        "part3": "VERSE 7",
        "part4": "And it came to pass after forty years, that Absalom said unto the king, I pray thee, let me go and pay my vow, which I have vowed unto the LORD, in Hebron.",
        "part5": "Absalom's going to Hebron on the pretext of paying his vows was only to put a veneer of religiosity over his ill intentions - preparation for the revolt from that city. His credulous father was mistakenly pleased in his heart that his murderer son had now returned to the Lord. Controlled by the satanic spirit, Absalom had no qualms about using the name of God to pursue his evil designs.\n\nAbsalom chose Hebron in Judah because firstly, it was his birthplace where his father reigned as king for several years over Judah [2 Samuel 2:4] and over all Israel [2 Samuel 5:3]. As Hebron was the royal city before the throne was moved to Jerusalem, it would be the appropriate place to proclaim himself as the new king.\n\nSecondly, Hebron being on the road to Geshur would provide an easy escape should his plot fail.\n\nThirdly, in Judah, there was much discontent over David's transferring his royal seat to Jerusalem. The tribe of Judah had been the mainstay and bedrock of David's support. Winning Judah over to his side would lead to the collapse of David's kingship.\n\nOur faith in God is founded upon the revealed, inspired, inerrant, infallible, authoritative Word of God - that our Lord Jesus Christ, the Second Person of the Godhead incarnate, by His finished work at Calvary's cross and resurrection, is our Saviour, God and King. The devil seeks to dethrone our Saviour King from our hearts by attacking His Deity, His Word and works - but in vain. \"For ever, O LORD, thy word is settled in heaven\" [Psalm 119:89]. By His grace may we remain faithful till He comes.",
        "part6": "THOUGHT",
        "part7": "The LORD is my rock, and my fortress, and my deliverer; my God, my strength, in whom I will trust; my buckler, and the horn of my salvation, and my high tower. - Psalm 18:2",
        "part8": [
            "JUDGES 3",
            "ACTS 9"
        ]
    },
    "23 JULY": {
        "part1": "2 Samuel 15:10",
        "part2": "The strategy of Absalom - sending spies and preparing the ground",
        "part3": "VERSE 10",
        "part4": "But Absalom sent spies throughout all the tribes of Israel, saying, As soon as ye hear the sound of the trumpet, then ye shall say, Absalom reigneth in Hebron.",
        "part5": "Absalom's thorough and meticulous plans testified to his intense lust for power and his father's throne. Having won the hearts of a large populace in and around Jerusalem, he sought to secure a base farther away from Jerusalem, in Hebron, where he could continue to secretly advance his plot.\n\nHe sent emissaries throughout the land, infiltrating the other tribes. Their modus operandi was to discredit the king through subterfuge, lies and fabrications that he was not competent to rule. This was the same tactic he employed with great success in Jerusalem. The objective was to stir up a groundswell of unhappiness against the king so that when the signal was given, the multitudes would rally to Absalom's flag.\n\nJust as Absalom had sent spies throughout the tribes spreading falsehoods to undermine the king's authority, the apostle Paul warned the Ephesian elders that agents of the Devil would as \"grievous wolves enter in among you, not sparing the flock. Also of your own selves shall men arise, speaking perverse things, to draw away disciples after them\" [Acts 20:29-30]. This would undermine the authority of God's Word and disrupt the church. The leaders of the church were instructed to \"take heed therefore unto yourselves, and to all the flock, over the which the Holy Ghost hath made you overseers, to feed the church of God, which he hath purchased with his own blood\" [Acts 20:28]. Paul then commended the church \"to God, and to the word of His grace\" [Acts 20:32]. May God be merciful to help us to keep the purity and unity of the church.",
        "part6": "THOUGHT",
        "part7": "With all lowliness and meekness, with longsuffering, forbearing one another in love; Endeavouring to keep the unity of the Spirit in the bond of peace. - Ephesians 4:2-3",
        "part8": [
            "JUDGES 4",
            "ACTS 10"
        ]
    },
    "24 JULY": {
        "part1": "2 Samuel 15:11-12",
        "part2": "The strategy of Absalom - buying allegiances",
        "part3": "VERSE 11",
        "part4": "And with Absalom went two hundred men out of Jerusalem, that were called; and they went in their simplicity, and they knew not any thing.",
        "part5": "To further strengthen his position, Absalom sought to buy allegiances among the people - those of power, position, and influence. By his display of magnificence, apparent love and care, he won the hearts of two hundred courtiers who followed him \"in their simplicity\", unaware of his evil designs. The closeness of these men would lend him much credence in the eyes of the masses. At the critical moment, when Absalom demanded their loyalty and support, it would be difficult for them to refuse him.\n\nAbsalom next bought the allegiance of Ahithophel, Bathsheba's grandfather and David's long-trusted counsellor. Ahithophel harboured a secret grudge against David for engineering Uriah's death. Ahithophel seized the opportunity for revenge by joining Absalom. The buying of allegiances has always been the product of a carnal mind and depraved heart. Its primary motivation is to advance one's personal agenda at the expense of another, even to the annihilation of the other party as in the case of Absalom against David.\n\nSaved by the precious blood of our Lord Jesus and called to be God's children, we are to \"walk worthy of the vocation wherewith ye are called\" [Ephesians 4:1]. As ambassadors for our Lord [2 Corinthians 5:20], we are to bear a good testimony for Him always and \"live peaceably with all men\" [Romans 12:18]. As soldiers of our Lord Jesus Christ, we rally under the banner of King Jesus and our allegiance is to Him and Him alone. In our service for Him, there should be no buying of allegiances, factionalism nor divisions. United and faithful, we will stand striving for the Gospel till He comes.",
        "part6": "THOUGHT",
        "part7": "Only let your conversation be as it becometh the Gospel of Christ: that whether I come and see you, or else be absent, I may hear of your affairs, that ye stand fast in one spirit, with one mind striving together for the faith of the Gospel.",
        "part8": [
            "JUDGES 5",
            "ACTS 11"
        ]
    },
    "25 JULY": {
        "part1": "2 Samuel 15:12",
        "part2": "Ahithophel",
        "part3": "VERSE 12",
        "part4": "And Absalom sent for Ahithophel the Gilonite, David's counsellor, from his city, even from Giloh, while he offered sacrifices. And the conspiracy was strong; for the people increased continually with Absalom.",
        "part5": "Ahithophel was King David's private counsellor who had such a reputation for wisdom that his advice \"was as if a man had enquired at the oracle of God\" [2 Samuel 16:23]. Ahithophel was so sharp and shrewd that the counsel he gave King David and later Absalom always hit their target and achieved the desired results. How was Absalom able to entice Ahithophel to switch allegiance? Bible scholars believe Ahithophel was Bathsheba's grandfather who was furious with David for bringing dishonour to his family by his adultery with Bathsheba. Ahithophel may have been enamoured with Absalom, and thought it better to align with Absalom the rising star, rather than David the setting sun. Ahithophel was too smart to join in Absalom's conspiracy without feeling reasonably sure of its success. But though he possessed much worldly wisdom, Ahithophel lacked spiritual discernment. David was God's anointed, chosen to lead God's own nation Israel. By attempting to frustrate the wisdom of God, the wisest man in the land lived up to his name, which translated is \"brother of foolishness\". God's plans can never be thwarted by man's cunning. Absalom's efforts to wrest the throne from David were doomed to fail because by divine design, the throne belonged to another. May we learn that worldly wisdom cannot defeat God's will, nor should it be used to plot ill against others. God will not allow such plans to prosper. Only plans made through prayer in submission to God will be blessed.",
        "part6": "THOUGHT",
        "part7": "The fear of the LORD is the beginning of wisdom: and the knowledge of the holy is understanding. - Proverbs 9:10",
        "part8": [
            "JUDGES 6",
            "ACTS 12"
        ]
    },
    "26 JULY": {
        "part1": "2 Samuel 15:13-14",
        "part2": "The success of Absalom",
        "part3": "VERSE 13",
        "part4": "And there came a messenger to David, saying, The hearts of the men of Israel are after Absalom.",
        "part5": "Absalom enjoyed great success in winning the hearts of the people and they flocked to him in droves. A coup was in progress as Absalom advanced to ascend the throne.\n\nOn hearing the news, David appeared resigned to the fact. There was not so much as a complaint or fret, nor did he put up any resistance. Why not fight to defend his throne? David understood this was part of God's punishment for his adulterous sin. To resist Absalom at this time, would be tantamount to resisting God.\n\nEarlier, David had already felt the effect of his transgression in his own family when the baby born to Bathsheba died and Absalom murdered Amnon. Now the consequences of David's sin would be felt by the whole nation. He wanted to spare the innocent people of Jerusalem pain and suffering which a battle between a father king and his usurper son would cause. What irony that Absalom whom David loved so much, yet was filled with such vicious hate for his father, would be the rod God used to chastise David. He understood that the righteous, all-wise God corrects His children for their good, and trusted God to give him grace to endure this correction. Therefore, David would not resist but humbly submit to God's will. Although David was being chastised for his sins, he knew his sin was forgiven [2 Samuel 12:13] and did not lose sense of God's loving kindness. Although Absalom's rebellion fulfilled Nathan's prophecy, God would also hold Absalom accountable for his wickedness.",
        "part6": "THOUGHT",
        "part7": "\"If ye endure chastening, God dealeth with you as with sons; for what son is he whom the father chasteneth not?\" [Hebrews 12:7]. Let us learn to accept the correction that comes from our holy God.",
        "part8": [
            "JUDGES 7",
            "ACTS 13"
        ]
    },
    "27 JULY": {
        "part1": "2 Samuel 15:15-17",
        "part2": "Pledge of loyalty",
        "part3": "VERSE 15",
        "part4": "And the king's servants said unto the king, Behold, thy servants are ready to do whatsoever my lord the king shall appoint.",
        "part5": "Even as news came that most of Israel had switched sides and now turned against David, his servants pledged loyalty to him. These would have included some government officials, military officers, and palace staff of the royal family. This provided David some comfort in desperate times, yet the danger was great because David's supporters were greatly outnumbered by Absalom's.\n\nThese loyal servants would have seen David and Absalom up close in the palace, even in their unguarded moments, and noticed distinct differences between them. David was a man after God's own heart and communed often with God. The many psalms David wrote reflected the trust and confidence he placed in God even in times of affliction. David humbly acknowledged God's blessings upon him and Israel [2 Samuel 7:18-29] and extolled the goodness of God to the people around him. David often sought God's wisdom and desired to act in obedience to God's will both in times of prosperity and distress.\n\nIn contrast, Absalom was proud, vain, and covetous. There was no god in his life save self, and any religiosity he displayed was pretence. The people who followed him were deceived by his lies and hypocrisy. God granted David's loyal followers the ability to discern that David was a God-fearing and rightful king of divine appointment, whereas Absalom was but a handsome God-rejecting fool. May God also grant us wisdom and discernment to make good judgement and the right choices in life for His glory.",
        "part6": "THOUGHT",
        "part7": "The wicked, through the pride of his countenance, will not seek after God: God is not in all his thoughts. - Psalm 10:4",
        "part8": [
            "JUDGES 8",
            "ACTS 14"
        ]
    },
    "28 JULY": {
        "part1": "2 Samuel 15:18",
        "part2": "Support from foreign forces",
        "part3": "VERSE 18",
        "part4": "And all his servants passed on beside him; and all the Cherethites, and all the Pelethites, and all the Gittites, six hundred men which came after him from Gath, passed on before the king.",
        "part5": "The Cherethites and Pelethites were soldiers led by Beniah, son of Jehoiada. They were loyal to David in the revolts by Absalom and the rebel Benjamite Sheba [2 Samuel 20:7]. They formed the bodyguard at Solomon's anointing after Adonijah's attempt to succeed David as king [1 Kings 1:38]. Bible scholars believe they came from Crete and the land of the Philistines.\n\nThe Gittites were from Gath, a Philistine city where David had sought refuge before while fleeing from Saul. As they possibly followed David when he left Gath then, they now followed him out of Jerusalem. The Cherethites, Pelethites and Gittites proved valuable and valiant in the fighting that followed, ensuring Absalom's forces were defeated.\n\nIt is interesting to note that these foreigners remained true to David while many of David's countrymen abandoned him. Having witnessed his life, obedience, and submission to God's will while on the run from Saul, they would have been impressed with David's love for God and his country. They would have been struck by his God- fearing heart and embraced the Jewish religion through David's example. David's leadership and military skills won them over too. All these warriors wanted David as their leader and supported him wholeheartedly, not least because he was God's anointed. If God was backing David, they would be with David too. Absalom's horses, runners and good looks did not impress them, nor would his promises and flattery move them. May God open our spiritual eyes to differentiate holiness from sin, so we are not led down the wrong path of destruction.",
        "part6": "THOUGHT",
        "part7": "I have hated them that regard lying vanities: but I trust in the LORD ... Be of good courage, and he shall strengthen your heart, all ye that hope in the LORD. - Psalm 31:6, 24",
        "part8": [
            "JUDGES 9",
            "ACTS 15"
        ]
    },
    "29 JULY": {
        "part1": "2 Samuel 15:19-21",
        "part2": "Ittai",
        "part3": "VERSE 21",
        "part4": "And Ittai answered the king, and said, As the LORD liveth and as my lord the king liveth, surely in what place my lord the king shall be, whether in death or life, even there also will thy servant be.",
        "part5": "Ittai was the commander of the Gittites, who together with the Cherethites and Pelethites, were mercenaries serving David as vassals rather than part of his regular army. The Gittites came from Gath and may have been a military group formed during David's time at Gath serving Achish [1 Samuel 27].\n\nBeing a foreigner and non-Israelite [v. 19], Ittai was already in exile from the land of Gath and only recently settled [v. 20] in Jerusalem. David dissuades him from following for he does not want Ittai to endure the hardship of roaming the wilderness. David wishes him well and tells him his service is to whoever is king, resigned to the fact that he has lost the kingship. His farewell blessing expresses the desire that the Lord shows steadfast love and faithfulness to Ittai.\n\nIttai's response exhibits a knowledge of Jehovah, and great loyalty acknowledging David as God's chosen king. Using God's covenant name, he acknowledges that the Almighty God lives and is actively sovereign, preserving David's life. Thus, the true and living God is the basis for his desire to be wherever David is, as he is God's anointed king, and serving him to the end. He was not merely a mercenary whose services were for hire and whose allegiance was changeable, but a foreigner outside God's chosen people now choosing to stay with God's chosen king and trusting the one living and true God.\n\nLikewise, we must serve God because He first loved us [1 John 4:19] and saved us so that we are henceforth inseparable from Him in our Lord Jesus Christ [Romans 8:38-39].",
        "part6": "THOUGHT",
        "part7": "God the Son's love, loyalty and humble obedience to God the Father's will, fulfilled His plan to save us to be His children. Read John 6:38.",
        "part8": [
            "JUDGES 10",
            "ACTS 16"
        ]
    },
    "30 JULY": {
        "part1": "2 Samuel 15:22-23",
        "part2": "David's road of tears",
        "part3": "VERSE 23",
        "part4": "And all the country wept with a loud voice, and all the people passed over: the king also himself passed over the brook Kidron, and all the people passed over, toward the way of the wilderness.",
        "part5": "David, anointed king, one-time shepherd boy, giant slayer, great warrior, king of Israel in the royal city, now has to flee into the wilderness. David was reaping the fruits of sin. It had started with his lust for Bathsheba, leading to the murder of Uriah and his attempted cover up for which God had pronounced \"the sword shall never depart from thine house\" [2 Samuel 12:10a]. Now David's son Absalom was lusting after what was not his, usurping his father's throne. Such is sin. Sin is never alone for oft it comes with companions and then begets even more. The result is tears and sorrow all round.\n\n\"Then when lust hath conceived, it bringeth forth sin: and sin, when it is finished, bringeth forth death\" [James 1:15]. The people who witnessed this departure wept. Did they weep for how the king and his kingdom had fallen? Or perhaps for what they had lost materially and the uncertain times ahead? Were they weeping for the sins which had led to this national tragedy?\n\nDavid crossed the Kidron in tears. In the Kidron valley lies the Garden of Gethsemane where some 1000 years later, the promised seed of David, our Lord Jesus Christ would pray on His way to Calvary to die for our sins. He would shed much tears for our sins. God has revealed how terrible sin is, in its immediate and far-reaching effects both personally and nationally. Knowing this, we must weep for our sins and turn to the only sinless Mediator, the Lord Jesus Christ, to seek forgiveness from God. Turn to Him. He is gracious to forgive.",
        "part6": "THOUGHT",
        "part7": "For the people shall dwell in Zion at Jerusalem: thou shalt weep no more: he will be very gracious unto thee at the voice of thy cry; when he shall hear it, he will answer thee. - Isaiah 30:19",
        "part8": [
            "JUDGES 11",
            "ACTS 17"
        ]
    },
    "31 JULY": {
        "part1": "2 Samuel 15:24",
        "part2": "Zadok",
        "part3": "VERSE 24",
        "part4": "And lo Zadok also, and all the Levites were with him, bearing the ark of the covenant of God: and they set down the ark of God; and Abiathar went up, until all the people had done passing out of the city.",
        "part5": "Zadok was a descendant of Aaron the first high priest of Israel, and a leader of his family of Levites [1 Chronicles 27:17]. He was a priest and son of Ahitub [2 Samuel 8:17]. His lineage goes back through Phinehas to Eleazar, Aaron's third son. He was co-high priest with Abiathar at this point in time. He led the Levites carrying the Ark of the Covenant which represented God's presence with Israel.\n\nHere, Zadok continued to fulfil his role as priest to serve God and His anointed king. In spite of difficult and challenging times, when we fulfil the role God has given us, we display our nature as God's children. We are then living out the truth as His chosen people rather than living a life of our pleasing. Zadok is from a faithful line that traces back to Eleazar. Eleazar's son, Phinehas, was given the high priesthood for being \"zealous for his God and made an atonement for the children of Israel\" [Numbers 25:11-13] during their whoredom in the wilderness. Abiathar however traces back through Eli's evil son Phinehas to Ithamar, Aaron's fourth son. Recall that Nadab and Abihu, Aaron's first two sons were consumed by divine wrath for offering strange fire [Leviticus 10]. Then Eli's wicked sons, Hophni and Phinehas abused their priesthood and God promised the end of Eli's line of priesthood in time [1 Samuel 3:13].\n\nZadok was persistently faithful and later obeyed David in anointing Solomon [1 Kings 1:32-34] contrasting Abiathar who supported Adonijah's attempt to usurp the throne [1 Kings 1:7]. Thus, faithful obedience resulted in Zadok becoming the sole high priest, returning the office to Phinehas' line and fulfilling God's word in Numbers 25.",
        "part6": "THOUGHT",
        "part7": "Be faithful for \"the Lord is faithful, who shall stablish you, and keep you from evil.\" [2 Thessalonians 3:3]",
        "part8": [
            "JUDGES 12",
            "ACTS 18"
        ]
    }
}