{
    "1 JULY": {
        "part1": "Romans 9:28",
        "part2": "He will finish the work",
        "part3": "VERSE 28",
        "part4": "For he will finish the work, and cut it short in righteousness: because a short work will the Lord make upon the earth.",
        "part5": "From the context of verses 22 to 29, Paul is talking about the work that God will finish. It has to do with unleashing His holy wrath on sins after holding it back from the unbelieving Jews. The quotations in verse 25 from Hosea and verse 27 from Isaiah, point to the fact that even though the children of Israel would be numerous as \"the sand of the sea\", only a remnant would be saved because most had rejected the Lord Jesus and saw their nationality as guaranteeing God's favour.\n\nTo be saved these Jews demanded that \"except ye be circumcised after the manner of Moses, ye cannot be saved\" [Acts 15:1b]. But the truth is that even a circumcised Jew could not keep the law of Moses for their salvation. The only way is to accept the Lord Jesus as their Saviour and the Promised Messiah by faith, which only a remnant did as recipients of God's election grace.\n\nAs for the unbelieving Jews, God \"will finish the work, and cut it short in righteousness ... upon the earth\", meaning He will speedily carry out His righteous judgment upon an unbelieving Jewish nation. This is a warning that no one can escape if they reject Christ. The only reason judgment is delayed is because \"the Lord is not slack concerning his promise, as some men count slackness; but is longsuffering to us-ward, not willing that any should perish, but that all should come to repentance\" [2 Peter 3:9]. God will finish His work in His time. He is the Righteous Judge of all the earth. Amen.",
        "part6": "THOUGHT",
        "part7": "For all the promises of God in him are yea, and in him Amen, unto the glory of God by us. - 2 Corinthians 1:20",
        "part8": [
            "JOSHUA 1",
            "PSALMS 126-128"
        ]
    },
    "2 JULY": {
        "part1": "Romans 9:29",
        "part2": "Except the LORD",
        "part3": "VERSE 29",
        "part4": "And as Esaias said before, Except the Lord of Sabaoth had left us a seed, we had been as Sodoma, and been made like unto Gomorrha.",
        "part5": "Here, Paul again cited the Old Testament Scriptures to show that Israel deserved judgment because they had rejected the Lord. Yet the Lord of Sabaoth (the Lord of Hosts), on account of His covenant grace and mercies allowed \"a seed\" - a remnant to survive. Interestingly a seed gives the picture that it will again grow and multiply by God's grace. If this seed had not been spared, Isaiah says that they would have become like Sodom and Gomorrah, the two cities that God destroyed because of their wickedness. God spared Lot, his wife and their two daughters. But Lot's wife did not make it because she looked back in disobedience.\n\nThe point is that even though God is angry at sin and will judge the disobedient, He will keep His covenant promises. This is illustrated in the two historical exiles of Israel and how God brought them back from Egypt and Babylon, and again in their modern-day return to the land on 14th May 1948. God's salvation plan for the remnant of Israel to be a light to the nations has not changed. In Isaiah 49:6 \"And he (The LORD) said, It is a light thing that thou shouldest be my servant to raise up the tribes of Jacob, and to restore the preserved of Israel: I will also give thee for a light to the Gentiles, that thou mayest be my salvation unto the end of the earth.\" God's purpose in preserving a remnant of believing Jews is to proclaim the Gospel of Christ by which sinners are saved by grace. We, being Gentiles, are required to do the same in proclaiming this. With love and gratitude we give ourselves to God to worship and serve Him.",
        "part6": "THOUGHT",
        "part7": "For I am not ashamed of the gospel of Christ: for it is the power of God unto salvation to every one that believeth; to the Jew first, and also to the Greek. - Romans 1:16",
        "part8": [
            "JOSHUA 2",
            "PSALMS 129-131"
        ]
    },
    "3 JULY": {
        "part1": "Romans 9:30-31",
        "part2": "Gentiles and Israel",
        "part3": "VERSE 30",
        "part4": "What shall we say then? That the Gentiles, which followed not after righteousness, have attained to righteousness, even the righteousness which is of faith.",
        "part5": "The purpose and existence of Israel as God's chosen was to testify to the world for Him; they were never meant to hoard God's truth from the world. When The LORD called Abram and made him the recipient of His covenant of grace, He told him, \"In thee shall all families of the earth be blessed\" [Genesis 12:3b].\n\nIt is clear the descendants of Abraham were to actively bear witness for the LORD to the ends of the world. They were to proclaim the Promised Seed - Jesus Christ the Messiah of Israel and Saviour of the world to the Gentiles. But the Jews could not stomach the fact that Gentiles could share the benefits of their belief in the Messiah even though they did not keep God's Law and they were not circumcised. How can that be?\n\nThe key is the word \"faith\". The righteousness the Gentiles attained was neither their own nor the righteousness of their works but the righteousness of Christ which they received by faith in Him. It is all by God's grace as Ephesians 2:8-9 says \"For by grace are ye saved through faith; and that not of yourselves: it is the gift of God: Not of works, lest any man should boast.\" Salvation is through faith in the Lord Jesus, turning from sins, and trusting Him as the Saviour. Romans 10:12: \"For there is no difference between the Jew and the Greek: for the same Lord over all is rich unto all that call upon him.\" Hence the five Solas of the Reformation state that in the light of Scripture alone, we are saved by grace through faith in Christ alone, and to His Glory alone.",
        "part6": "THOUGHT",
        "part7": "For whosoever shall call upon the name of the Lord shall be saved. - Romans 10:13",
        "part8": [
            "JOSHUA 3",
            "PSALMS 132-134"
        ]
    },
    "4 JULY": {
        "part1": "Romans 9:32",
        "part2": "Stumbled by the Stone",
        "part3": "VERSE 32",
        "part4": "Wherefore? Because they sought it not by faith, but as it were by the works of the law. For they stumbled at that stumblingstone;",
        "part5": "Verse 32 explains why Israel despite meticulously trying to keep God's Law did not attain the righteousness of the Law. This is because no one can keep it perfectly according to Leviticus 18:5: \"Ye shall therefore keep my statutes, and my judgments: which if a man do, he shall live in them: I am the LORD.\"\n\nHow then can one be saved since none can obey the Law fully? It is by observing another portion of the Law based on faith which is the Day of Atonement when worshippers would bring their animal sacrifices before the Lord.\n\nAs we read in Hebrews 10:1,4, \"For the law having a shadow of good things to come, and not the very image of the things, can never with those sacrifices which they offered year by year continually make the comers thereunto perfect ... For it is not possible that the blood of bulls and of goats should take away sins.\" The only way to take away our sins is to look to Jesus Christ by faith for He is \"The Lamb of God which taketh away the sin of the world\" [John 1:29b]. Sadly, Israel put their faith not in Christ but in their \"ability to keep the Law\". He is the stone Israel stumbled and tripped on.\n\nAre you being told that there are things you must do beyond putting your faith in Christ in order to be saved? If so, perhaps you have not fully trusted in Jesus as Lord but depending on yourself. May you put your faith in Christ today and become a \"stepping stone\" instead for many to come to Christ.",
        "part6": "THOUGHT",
        "part7": "Let us draw near with a true heart in full assurance of faith, having our hearts sprinkled from an evil conscience, and our bodies washed with pure water. - Hebrews 10:22",
        "part8": [
            "JOSHUA 4",
            "PSALMS 135-136"
        ]
    },
    "5 JULY": {
        "part1": "Romans 9:33",
        "part2": "Zion's stumbling stone",
        "part3": "VERSE 33",
        "part4": "As it is written, Behold, I lay in Sion a stumblingstone and rock of offence: and whosoever believeth on him shall not be ashamed.",
        "part5": "Paul cites from the Scriptures \"as it is written\" to show that Jesus is that foundation rock God laid in Sion which became a stone of stumbling and rock of offence to the unbelieving Jewish nation. He quotes from Isaiah to substantiate this, \"And he shall be for a sanctuary; but for a stone of stumbling and for a rock of offence to both the houses of Israel, for a gin and for a snare to the inhabitants of Jerusalem\" [Isaiah 8:14]. \"Therefore thus saith the Lord GOD, Behold, I lay in Zion for a foundation a stone, a tried stone, a precious corner stone, a sure foundation: he that believeth shall not make haste\" [Isaiah 28:16]. In contrast to unbelieving Israel, Paul tells us that believers in Christ \"are built upon the foundation of the apostles and prophets, Jesus Christ himself being the chief corner stone\" [Ephesians 2:20].\n\nThe chief corner stone is the most important stone in the building because upon it everything else is aligned and supported. Because of unbelief, Israel stumbled over Jesus their Messiah and He became a rock of offence. They were offended by His words in John 5:40 \"And ye will not come to me, that ye might have life\". They were spiritually blind and refused to see who Jesus is even though they witnessed His many mighty miracles with their own eyes. Failure to accept Jesus causes a person to trip (stumble). But understanding who He is, accepting and trusting Him by faith will lead to life everlasting. Is the Lord Jesus Christ the Son of the living God to you?",
        "part6": "THOUGHT",
        "part7": "Our Lord Jesus said, \"Search the scriptures; for in them ye think ye have eternal life: and they are they which testify of me.\" [John 5:39]",
        "part8": [
            "JOSHUA 5",
            "PSALMS 137-138"
        ]
    },
    "6 JULY": {
        "part1": "Romans 10:1",
        "part2": "My Heart's Desire",
        "part3": "VERSE 1",
        "part4": "Brethren, my heart's desire and prayer to God for Israel is, that they might be saved.",
        "part5": "Despite the unbelief of his countrymen and the harsh treatment he received from them, apostle Paul did not dismiss them nor wish them an evil end. He lovingly regarded his \"brethren\", expressing his heartfelt desire for their salvation for which he would pray to God.\n\nPrayer is the ordained means accorded to man to intercede for the salvation of his fellow-man. We can imagine Paul's prayer to be pleading, earnest and persistent, just as he wrote to the Thessalonians to pray continually [1 Thessalonians 5:17]. It behoves us to pray likewise even as God moves us to pray for the salvation of others, trusting that God will save those for whom He moves us to pray because He desires all men to be saved [1 Timothy 2:3-4]. Paul's foremost calling was to be the apostle to the Gentiles [Romans 11:13; Acts 9:15], but that did not diminish his love and heart's desire for the salvation of his fellow Jews.\n\nHe was aware Jesus had declared that \"salvation is of the Jews\" [John 4:22]. Wherever he went, he would first preach the gospel in a synagogue if he could find one [Acts 9:20; 13:14; 14:1]. Paul remembered how Jesus on the cross prayed \"Father, forgive them for they know not what they do;\" and Stephen in his dying breath cried aloud \"Lord lay not this sin to their charge\" [Acts 7:60]. The Lord and Stephen prayed even for their murderers. Paul's \"heart's desire\" was for the salvation even of his countrymen who persecuted him. May God grant us a heart like Paul's to desire and pray for the salvation of all men.",
        "part6": "THOUGHT",
        "part7": "But I say unto you, Love your enemies, bless them that curse you, do good to them that hate you, and pray for them which despitefully use you, and persecute you. - Matthew 5:44",
        "part8": [
            "JOSHUA 6",
            "PSALM 139"
        ]
    },
    "7 JULY": {
        "part1": "Romans 10:1",
        "part2": "Burden for Souls",
        "part3": "VERSE 1",
        "part4": "Brethren, my heart's desire and prayer to God for Israel is, that they might be saved.",
        "part5": "Prior to his conversion, the apostle Paul was a die-hard Pharisee who strongly rejected and opposed Jesus Christ. He persecuted Christ's followers ferociously, throwing men, women and children into prison, even having some killed [Acts 8:1-3]. But on the road to Damascus, Paul was confronted by the risen Lord who in His grace and love saved Paul. Having received salvation grace, Paul became a changed man. His deep gratitude and love for his Saviour moved him to dedicate the rest of his life to his Master's cause. With a newfound burden for unsaved souls, Paul embarked on his missionary journeys preaching the Gospel throughout Asia Minor and Europe to the saving of souls.\n\nWhile we were yet sinners lost and undone, God demonstrated His amazing love towards us, and Jesus with great compassion for our souls, died on Calvary's cross to save us [John 3:16; Romans 5:8-9]. We too like Paul ought to respond to our Saviour's love and grace with a similar burden for souls.\n\nWe pray to God for all sorts of things; for \"daily bread\", physical needs, safety, comfort, success, peace for ourselves and families; for righteousness and wisdom for our rulers. While these benefits make our life here comfortable, they do not count for eternity. What counts is where our souls will be - in Heaven with God our Heavenly Father or in hellfire with the devil. The Lord Jesus has said, \"For what is a man profited, if he shall gain the whole world, and lose his own soul?\" [Matthew 16:26a].\n\nMay the Lord grant us a burden for souls, earnestly proclaiming the good news of salvation and praying for the lost.",
        "part6": "THOUGHT",
        "part7": "Let him know, that he which converteth the sinner from the error of his way shall save a soul from death, and shall hide a multitude of sins. - James 5:20",
        "part8": [
            "JOSHUA 7",
            "PSALMS 140-141"
        ]
    },
    "8 JULY": {
        "part1": "Romans 10:2",
        "part2": "Misguided Zeal",
        "part3": "VERSE 2",
        "part4": "For I bear them record that they have a zeal of God, but not according to knowledge.",
        "part5": "Paul earnestly desired and prayed for the salvation of his fellow Jews who were zealously religious but yet far from God. From his personal life experience as a radical Pharisee steeped in traditional Judaism before his conversion, he knew what it meant. Most Jews took their religion very seriously, having great zeal for their ancestral traditions [Galatians 1:13-14]. Paul admitted that before his conversion, he was proud of his heritage, his tribe, his upbringing and rabbinical training. He zealously and legalistically fulfilled the outward demands of the law. Paul thought himself righteous and godly even as he persecuted the church.\n\nBut Paul, like his fellow Pharisees, was far from God. Though taught by the leading theologian Gamaliel, Paul, like many other Jewish leaders had only a certain kind of knowledge (gnosis), an intellectual knowledge of the demands of the law but not the spiritual knowledge (epignosis) that comes from a personal and saving knowledge of God.\n\nBlinded by ignorance, and hardened in their hearts by pride and arrogance, they rejected the teachings of His Son the Lord Jesus, and persecuted Him and His followers. It was only by God's grace that Paul came to a realisation that his zeal was misguided. The risen Lord confronted him on the road to Damascus and caused him to know that Jesus of Nazareth whom he was persecuting was indeed the Son of God. The religious zeal of the unbelieving Jews could not save them if they failed to know and believe this.\n\nMay the Lord grant to us spiritual discernment and keep us in the path of Truth.",
        "part6": "THOUGHT",
        "part7": "Open thou mine eyes, that I may behold wondrous things out of thy law. - Psalm 119:18",
        "part8": [
            "JOSHUA 8",
            "PSALMS 142-143"
        ]
    },
    "9 JULY": {
        "part1": "Romans 10:2",
        "part2": "Vanity of misguided zeal",
        "part3": "VERSE 2",
        "part4": "For I bear them record that they have a zeal of God, but not according to knowledge.",
        "part5": "While the Jews had a \"zeal for God\", they were unsaved because their zeal was not based on correct knowledge and Paul felt compelled to pray for their salvation. Their problem was they were ignorant of God's righteousness and their own sinfulness. Like Luther centuries later, they mistakenly thought that God requires of man \"human righteousness\", such as developing a good character manifested in \"good works\" through human effort, not realizing that human \"good works\" are but filthy rags before the thrice holy God. \"But we are all as an unclean thing, and all our righteousnesses are as filthy rags; and we all do fade as a leaf; and our iniquities, like the wind, have taken us away.\" [Isaiah 64:6]\n\nTrue salvation is not merely a renovation of one's character by adopting a higher standard of morality. It involves the working of the Holy Spirit in convicting the sinner's heart of sin, bringing him to repentance, and regenerating him with new life in Christ. He is transformed into a new creature with a renewed mind. \"Therefore if any man be in Christ, he is a new creature: old things are passed away; behold, all things are become new.\" [2 Corinthians 5:17]\n\nThe nation of Israel was the most privileged of all people on earth. Chosen by God, they were blessed by the revelation of God's Word and His promises. But lacking a true knowledge of who He was, their zeal for God through pride in their lineage, ancestral traditions, and man-made laws generated a religiosity that was vain and empty, devoid of salvation grace. Only the Gospel of Christ \"is the power of God unto salvation to every one that believeth.\" [Romans 1:16]",
        "part6": "THOUGHT",
        "part7": "I am the way, the truth, and the life: no man cometh unto the Father, but by me. - John 14:6",
        "part8": [
            "JOSHUA 9",
            "PSALMS 144"
        ]
    },
    "10 JULY": {
        "part1": "Romans 10:3",
        "part2": "Ignorant of Christ's Righteousness",
        "part3": "VERSE 3",
        "part4": "For they being ignorant of God's righteousness, and going about to establish their own righteousness, have not submitted themselves unto the righteousness of God.",
        "part5": "Some years ago, this writer was driving back to Singapore from Ipoh in Perak, Malaysia, and had to make a stop in Kuala Lumpur. Resuming our journey, we tried to get onto the newly-completed section of the North-South Highway from Kuala Lumpur to Seremban, the next major stop on the highway. We saw some blue signs directing us to Seremban and dutifully followed them. However, it soon became apparent those signs did not lead us to the highway; and it was only when we reached a small town called Kajang that we learnt that to get onto the North-South Highway, we needed to follow the green-coloured signs, not the blue ones.\n\nIn this verse, Paul explained that his fellow Jews were making the same kind of mistake. No matter how zealous they were and how hard they tried to obey the Old Testament laws, they would not be able to meet the Holy God's high standards of righteousness which require perfect obedience to His Law. They were ignorant of the perfect righteousness God had provided in the person of Jesus Christ and tried to establish their own righteousness by studiously following a set of manmade rules and rituals.\n\nLittle wonder our Lord told His disciples that unless their righteousness exceeded that of the scribes and Pharisees, they will never enter the kingdom of heaven [Matthew 5:20]. God's righteousness is a gift we can only receive by faith. It is not a reward for our own works-righteousness.",
        "part6": "THOUGHT",
        "part7": "For by grace are ye saved through faith; and that not of yourselves: it is the gift of God: Not of works, lest any man should boast. - Ephesian 2:8-9",
        "part8": [
            "JOSHUA 10",
            "PSALM 145"
        ]
    },
    "11 JULY": {
        "part1": "Romans 10:3",
        "part2": "Submission to Righteousness",
        "part3": "VERSE 3",
        "part4": "For they being ignorant of God's righteousness, and going about to establish their own righteousness, have not submitted themselves unto the righteousness of God.",
        "part5": "Paul said that his countrymen, the Jews, had tried to establish their own way of righteousness. They tried to make themselves acceptable to God through rituals, ceremonies, laws, and works. They sought to save themselves by being as religious as they could. They made up many rules and regulations and followed them strictly. They believed God would accept them, especially since they were descendants of Abraham [Matthew 3:9]. Paul himself was a perfect example of such a person who had \"confidence in the flesh\". He was \"circumcised the eighth day, of the stock of Israel, of the tribe of Benjamin, an Hebrew of the Hebrews; as touching the law, a Pharisee; Concerning zeal, persecuting the church; touching the righteousness which is in the law, blameless\" [Philippians 3:5-6].\n\nBut when the Lord removed his spiritual blindness through \"the excellency of the knowledge of Christ Jesus\" [Philippians 3:8], all he wanted was to \"be found in him, not having mine own righteousness, which is of the law, but that which is through the faith of Christ, the righteousness which is of God by faith\" [Philippians 3:9]. In other words, he now \"submitted himself unto the righteousness of God.\"\n\nThe Jews were not the only ones who held this wrong understanding of righteousness. All the man-made religions of the world teach the same thing. They desperately need the light of the Gospel. But how can they hear the Gospel without a preacher [Romans 10:14]? Pray that God will send you to preach the Gospel to those who need it.",
        "part6": "THOUGHT",
        "part7": "And he said unto them, Go ye into all the world, and preach the gospel to every creature. - Mark 16:15",
        "part8": [
            "JOSHUA 11",
            "PSALMS 146-147"
        ]
    },
    "12 JULY": {
        "part1": "Romans 10:3",
        "part2": "The righteousness of God",
        "part3": "VERSE 3",
        "part4": "For they being ignorant of God's righteousness, and going about to establish their own righteousness, have not submitted themselves unto the righteousness of God.",
        "part5": "The word \"righteous\" used in the everyday context, refers to a person who is morally upright in the eyes of people around him. In the Old Testament, other adjectives like upright and blameless - or \"perfect\" in the case of the King James Version - are also employed to describe such persons. Job was a good example. The opposite of such a person would be the wicked or evildoers described in Psalm 37. However, no matter how \"perfect\" such a man is, he is still a sinner and can never achieve the righteousness required by a righteous and holy God. That's why Paul says in Romans 3:10 and 23 that \"there is none righteous, no, not one ... for all have sinned, and come short of the glory of God\". Compared to God's righteousness, the works of righteousness of all the religions of the world are like filthy rags [Isaiah 64:6].\n\nGod's righteousness differs from the manconceived works-righteousness of the world in a number of ways. Firstly, it is not earned, but is given through a vicarious exchange. Christ takes on our sin - in fact He became our sin - and in exchange, we receive His righteousness. To be declared righteous in God's sight you must be willing to put all your sins on Christ and take up his righteousness. Secondly, it cannot be bought by us, but it has been paid for ... by the precious blood of our Saviour. Thirdly, it is not temporary but eternal. God will remember our sins no more.\n\nThe tragedy for the Jews is that they refused to accept Christ.",
        "part6": "THOUGHT",
        "part7": "For he hath made him to be sin for us, who knew no sin; that we might be made the righteousness of God in him. - 2 Corinthians 5:21",
        "part8": [
            "JOSHUA 12-13",
            "PSALM 148"
        ]
    },
    "13 JULY": {
        "part1": "Romans 10:4",
        "part2": "Christ, the End of the Law",
        "part3": "VERSE 4",
        "part4": "For Christ is the end of the law for righteousness to every one that believeth.",
        "part5": "In saying that Christ is the end of the law, Paul is not saying there is no more need for the moral law in our lives; that it was annulled and Christians can now sin all they want. That Christians should lead holy lives and hate sin is something taught by Christ Himself and all the New Testament writers. What Paul means by that statement is that we have been released from the penalty and condemnation of the law. Christ took the sins of man upon Himself to bear the condemnation they deserved.\n\nChrist also ended the law in the sense that He fulfilled and completed the law perfectly. Although He was born into our world as a human and suffered the physical frailties and temptations as a man, He was sinless and obeyed every rule and requirement of the law. Christ also ended the law in that He is the object toward which the law pointed. All the ceremonies, sacrifices, offerings, and purifications required by the Mosaic Law pictured and pointed toward Christ. The law was never intended to be the way to become righteous and acceptable to God. Rather it showed them their own sinfulness and inadequacy. The law was given to point and lead men to Christ, who is the righteousness of God. The law was but a shadow of the real substance that was to come [Colossians 2:17].\n\nIt is vital to note that Christ is the end of the law for righteousness only to those who truly believe and trust in Him. When we do that, God not only removes our sins, He also imputes Christ's righteousness in us. Hallelujah, what a Saviour!",
        "part6": "THOUGHT",
        "part7": "There is therefore now no condemnation to them which are in Christ Jesus, who walk not after the flesh, but after the Spirit. - Romans 8:1",
        "part8": [
            "JOSHUA 14-15",
            "PSALM 149-150"
        ]
    },
    "14 JULY": {
        "part1": "Romans 10:4",
        "part2": "Christ, our Complete Righteousness",
        "part3": "VERSE 4",
        "part4": "For Christ is the end of the law for righteousness to every one that believeth.",
        "part5": "To the natural man, the message of the Gospel is foolishness [1 Corinthians 1:18]. How can we receive forgiveness for our sins simply by believing and calling upon the name of Christ? Certainly, there must be something we need to do to earn it. Hence, many Christians believe that in addition to believing, we have to do good works. This is an insult to the cross of Calvary. Just before He breathed His last, the Lord declared; \"It is finished\" [John 19:30]. The work of redemption has been completed. Salvation is a finished work. We cannot and do not need to do anything to add to it.\n\nThen there are those who argue that we need to do good works and live holy lives so as not to lose our salvation citing James 2:26 which says, \"faith without works is dead\". This again is not what the Bible teaches. This is a misinterpretation. James did not say \"salvation without works is dead.\" He is simply asserting that our profession of faith should be evident by our lives. The clear teaching of the Bible is that, when a person comes to know Christ as his Saviour, he is brought into a relationship with God that guarantees his salvation to be eternally secure.\n\nWe do not need to work to earn our salvation. All God is looking for is simply our belief in Christ. In fact, He does not even need us to promise to be good for the rest of our lives. We are saved by believing in the promises that He has made to us.  ",
        "part6": "THOUGHT",
        "part7": "His robes for mine:\nO wonderful exchange!\nClothed in my sin,\nChrist suffered 'neath God's rage.\nDraped in His righteousness, I'm justified.\nIn Christ I live, for in my place He died.\n- His Robes for Mine by Chris Anderson.",
        "part8": [
            "JOSHUA 16-17",
            "ACTS 1"
        ]
    },
    "15 JULY": {
        "part1": "Romans 10:5",
        "part2": "Moses' View of the Law",
        "part3": "VERSE 5",
        "part4": "For Moses describeth the righteousness which is of the law, That the man which doeth those things shall live by them.",
        "part5": "Romans 10:5, which is a paraphrase of Leviticus 18:5, seems to suggest that God's covenant with Israel through Moses is merely a repackaging of the Covenant of Works that God made with Adam at the dawn of creation. God's test for Adam in the Covenant of Works was obedience. Simply, do and live.\n\nHowever, the contexts in which the two Covenants were established show that they are radically different in their nature and intention. The covenant God made with Adam after the fall - and formalised in the giving of the Ten Commandments - is known as the Covenant of Grace.\n\nGod prefaced His giving of the Law to the people with these words: \"I am the LORD thy God, which have brought thee out of the land of Egypt, out of the house of bondage\" [Exodus 20:12]. In other words, the Ten Commandments were not given so that the Israelites could be delivered if they obeyed God's commandments. Rather, the Law was given to a people, whom God had already redeemed from bondage. The Law was not given to strangers, but to a people God had chosen to be His own - God is their God [Leviticus 18:2]; they are not to live like the Egyptians or the Canaanites [Leviticus 18:3]. The Israelites are to do God's judgments, and keep God's ordinances, to walk therein ... keep God's statutes, \"which if a man do, he shall live in them: I am the LORD\" [Leviticus 18:4-5].\n\nIn other words, God's Law was not given as a Covenant of Works. It is not \"do so that you can live\". God's law is a covenant of grace - \"do because you have been given new life\".",
        "part6": "THOUGHT",
        "part7": "The Covenant of Grace is God's covenant of love with His people. He first loved us, and in grateful response, we love Him by obeying His Word.",
        "part8": [
            "JOSHUA 18-19",
            "ACTS 2"
        ]
    },
    "16 JULY": {
        "part1": "Romans 10:5",
        "part2": "The Law and the First Man",
        "part3": "VERSE 5",
        "part4": "For Moses describeth the righteousness which is of the law, That the man which doeth those things shall live by them.",
        "part5": "God gave instruction to Adam, \"Of every tree of the garden thou mayest freely eat: But of the tree of the knowledge of good and evil, thou shalt not eat of it: for in the day that thou eatest thereof thou shalt surely die\" [Genesis 2:1617]. Adam was to obey God's command. This is the Covenant of Works, which the Westminster Shorter Catechism defines as a special act of God's providence: \"When God had created man, he entered into a covenant of life with him, upon condition of perfect obedience; forbidding him to eat of the tree of the knowledge of good and evil, upon pain of death\" (Question 12).\n\nGod's command was singular and simple. By giving this command, God placed Adam and Eve on probation. If they obey God's command, they will receive eternal life in heaven. Disobedience on their part would result in banishment from the garden, forfeiture of life, and the curse of death.\n\nHowever, the Covenant of Works is also a promise (a Covenant) of God's Grace. A. A. Hodge says that \"the very act of creation brings the creature under the obligation to the Creator, but it cannot bring the Creator into obligation to the creature. Creation itself, being a signal act of grace, cannot endow the beneficiary with a claim for more grace.\"\n\nIn the covenant between God and Adam, it was required of Adam to obey God, and in return, God would keep Adam in close communion with Him. To put it another way: if Adam had obeyed God, God would surely bless Adam, but God's blessings upon Adam is not the result of Adam's obedience. God's blessings upon Adam are - in themselves - an act of grace on the part of God.",
        "part6": "THOUGHT",
        "part7": "It is all of God's grace, nothing but His grace.",
        "part8": [
            "JOSHUA 20-21",
            "ACTS 3"
        ]
    },
    "17 JULY": {
        "part1": "Romans 10:5",
        "part2": "The Law and the Fallen Man",
        "part3": "VERSE 5",
        "part4": "For Moses describeth the righteousness which is of the law, That the man which doeth those things shall live by them.",
        "part5": "The demand of the covenant God made with Adam, the representative of the human race, is plain and clear: perfect obedience to God's revealed command [Genesis 2:16-17]. The command not to eat from the tree of the knowledge of good and evil is what some theologians call a positive law, which is a reflection of the Moral Law written within his heart. Thus, when God commanded Adam not to eat the forbidden fruit, He was commanding Adam to act in accordance with the Moral Law in his heart. And God expected Adam's perfect and perpetual obedience to His command.\n\nAfter the Fall, God's demands did not change. God still calls for perfect and perpetual obedience, failing which the penalty is death [Leviticus 18:45]. These words quoted by Paul - \"That the man which doeth those things shall live by them\" - is saying that the man who continuously keeps the law shall live - a demand for perfect and perpetual obedience, failing which the curse is death [Romans 6:23a]. Paul adds, \"Cursed is every one that continueth not in all things which are written in the book of the law to do them.\" [Galatians 3:10]\n\nThat is man's problem. The law which promises eternal life also demands perfect obedience in every aspect of our lives. Justification by the works of the law is impossible because no man is able to obey the law perfectly because we are born with a sinful nature on account of Adam's sin [Psalm 51:5]. The law that demands absolute perfection also condemns the least transgression [James 2:10].\n\nThe law entered and sin abounds in our conscience so that we might know our sin personally and intensively. Our hope is not in our keeping of the law; our hope is in God's grace, because where sin abounds, His grace abounds much more.",
        "part6": "THOUGHT",
        "part7": "The law knows no mercy; it knows no mitigation, it overlooks not even the smallest breach, or the smallest deficiency. One guilty thought or desire would condemn for ever. - Robert Haldane",
        "part8": [
            "JOSHUA 22",
            "ACTS 4"
        ]
    },
    "18 JULY": {
        "part1": "Romans 10:5",
        "part2": "The Law and the Second Man",
        "part3": "VERSE 5",
        "part4": "For Moses describeth the righteousness which is of the law, That the man which doeth those things shall live by them.",
        "part5": "In Romans 10:5, we learn that a man could be justified by the law on the condition he kept the law perfectly and perpetually - of course an impossibility. In Romans 10:4, we learn that the only Man who did that is the Lord Jesus Christ. He is \"the end of the law for righteousness to every one that believeth\".\n\nHe was \"made of a woman, made under the law\" [Galatians 4:4] meaning He was born under the expectations of the covenant God made with Adam. In His life, Christ kept the law perfectly to the jot and tittle. In His death, Christ \"redeemed us from the curse of the law, being made a curse for us: for it is written, Cursed is every one that hangeth on a tree\" [Galatians 3:13].\n\nTo accomplish the work of justification, Christ needed to obey, and He needed to die. He lived righteously to fulfil the precepts of the law, and He died to fulfil the penalty of the law.\n\nThus, by His life and death, we who can never be justified by our works of the law now have the righteousness of Christ imputed to us by faith. On account of what Christ has done, and by faith in His finished work, we are justified. Paul says - \"Therefore as by the offence of one judgment came upon all men to condemnation; even so by the righteousness of one the free gift came upon all men unto justification of life. For as by one man's disobedience many were made sinners, so by the obedience of one shall many be made righteous\" [Romans 5:18-19].\n\nWhat a wonderful Saviour! What a relief for sinners!",
        "part6": "THOUGHT",
        "part7": "Christ is the last Adam, He did what the first failed to do, and He did for us what we cannot do [1 Corinthians 15:45].",
        "part8": [
            "JOSHUA 23",
            "ACTS 5"
        ]
    },
    "19 JULY": {
        "part1": "Romans 10:5",
        "part2": "Live and Do",
        "part3": "VERSE 5",
        "part4": "For Moses describeth the righteousness which is of the law, That the man which doeth those things shall live by them.",
        "part5": "When Paul quoted Leviticus 18:5, he did not take it to mean a promise of life on the basis of obedience. That verse does not offer a promise of life through obedience. The intent of it is to show us that the law is to be our way of life; it is not a way to life through our obedience. The way to life and righteousness is faith in Christ, to whom the Law points and leads [Romans 10:4].\n\nThis \"do-and-live\" principle is not the Gospel of Christ. The Bible is explicitly clear that salvation is not based on what we have done and what we must continuously and perfectly do. Our salvation stands on the ground of what our Lord Jesus has done. However, the redeemed person must abide by the \"live-and-do\" principle.\n\nIn John 8:4, we read about the Pharisees who brought before Jesus a woman caught in the act of adultery. They expected Jesus to pass judgment upon her. But our Lord said, \"He that is without sin among you, let him first cast a stone at her\" [John 8:7]. And as the accusers quietly slinked away, our Lord Jesus said to the woman, \"Neither do I condemn thee: go, and sin no more\" [John 8:11].\n\nThe sequence of the words in John 8:11 makes a world of difference. Our Lord Jesus did not say to her, \"Go and sin no more, I do not condemn you.\" In fact, our Lord's words were quite the opposite, \"I do not condemn you, go and sin no more.\" What a relief it must have been for the woman, and what a relief for us sinners. In Christ, we are no longer condemned so that we may live and do!",
        "part6": "THOUGHT",
        "part7": "\"Although true believers be not under the law as a covenant of works, to be thereby justified or condemned; yet is it of great use to them, as well as to others; in that, as a rule of life informing them of the will of God and their duty, it directs and binds them to walk accordingly...\" [Westminster Confession of Faith, Chapter 19.6]",
        "part8": [
            "JOSHUA 24",
            "ACTS 6"
        ]
    },
    "20 JULY": {
        "part1": "Romans 10:6",
        "part2": "The Righteousness of Faith",
        "part3": "VERSE 6",
        "part4": "But the righteousness which is of faith speaketh on this wise, Say not in thine heart, Who shall ascend into heaven? (that is, to bring Christ down from above:)",
        "part5": "What is this righteousness Paul speaks about? We may best understand it by comparing it with its opposite number - the \"righteousness of works.\"\n\nAlmost all religions believe doing good works, living an upright life and performing certain rituals earn a person merit which will offset the bad things they do. In the final accounting when all these are weighed, if the scales tip in favour of the good, then the outcome (eternal or otherwise) for that person will be favourable. Human efforts to gain the approval of some deity even the God of the Scriptures is the righteousness of works which even the majority of Jews, privileged recipients of God's Law in the Old Covenant, mistakenly believed in under the teaching of their teachers, the Pharisees.\n\nThe righteousness which God requires is absolute and perfect because He is holy and cannot tolerate sin. If man cannot keep perfectly the Law so as to be sinless, then he does not make the grade. Yet God in His mercy and grace made a way of deliverance by giving sinners a gift. As the apostle said in Ephesians 2:8-9: \"For by grace are ye saved through faith; and that not of yourselves: it is the gift of God: Not of works, lest any man should boast\". Faith in what or who? Faith in the Saviour sent from heaven, for it is only His sacrifice which is able to atone for our sins and His righteousness put on our account when we believe and accept Him by faith which makes us acceptable in God's eyes. When God looks at sinners as we are, He sees the blood and righteousness of His Son covering us. Believing and accepting Him with all our heart is how we obtain His righteousness, the righteousness of faith.",
        "part6": "THOUGHT",
        "part7": "Therefore by the deeds of the law there shall no flesh be justified in his sight: for by the law is the knowledge of sin. - Romans 3:20",
        "part8": [
            "JUDGES 1",
            "ACTS 7"
        ]
    },
    "21 JULY": {
        "part1": "Romans 10:6-7",
        "part2": "Journey into Heaven and the Deep",
        "part3": "VERSES 6-7",
        "part4": "But the righteousness which is of faith speaketh on this wise, Say not in thine heart, Who shall ascend into heaven? (that is, to bring Christ down from above:) Or, Who shall descend into the deep? (that is, to bring up Christ again from the dead.)",
        "part5": "To \"search high and low\" is a familiar idiom meaning to \"look everywhere strenuously\". This in essence is what Paul is talking about in today's verses where he paraphrases Deuteronomy 30:12-14 when Moses commanded the Israelites to heed God's covenant and His commandments which had been clearly revealed to them so that there was no need for them to be searching high and low or attempting to do what only God can do.\n\nWhat is acceptable in God's eyes is a righteousness based on faith - faith in the only way He has prescribed for admittance into His kingdom; faith in the righteousness of the sinless atoning sacrifice He Himself provided which is graciously imputed (put upon) the sinner so that his sins are covered; faith in the only Saviour, whom John the Baptist hailed \"the Lamb of God which taketh away the sin of the world.\" [John 1:29]\n\nAs the covenant was made by God with Israel and the Law given to them before, now God had sent His Son in person thus fulfilling the prophecies of the promised Messiah which the Old Testament Law and practices pointed to. God has done the impossible for them. His righteousness was not something they had to search for or work for by journeying to the highest heavens and deepest deep (literally, abyss or bottomless pit). Christ had come and His salvation work was completed by His death and resurrection to the right hand of God the Father.\n\nWhat every sinner needs today is in the Gospel that has been given. What he needs is to believe and accept by faith the good news of salvation in Jesus Christ offered to all who will believe.",
        "part6": "THOUGHT",
        "part7": "Jesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by me. - John 14:6",
        "part8": [
            "JUDGES 2",
            "ACTS 8"
        ]
    },
    "22 JULY": {
        "part1": "Romans 10:8",
        "part2": "The Word is Nigh",
        "part3": "VERSE 8",
        "part4": "But what saith it? The word is nigh thee, even in thy mouth, and in thy heart: that is, the word of faith, which we preach.",
        "part5": "Paul continues with his reference to Deuteronomy 30:11-14 and asks his readers, \"What does it say?\" It said, \"It is not hidden from thee, neither is it far off.\" Israel in Moses' day knew God's commandments and the righteousness He required. For the people of Paul's letter and everyone thereafter, Jesus Christ the Living Word had come and His message of amnesty to God's enemies was proclaimed by Him, His apostles and disciples. The righteousness of the Saviour made available to all who by faith, believe was accessible and achievable, and the inevitable judgment awaiting all who rejected it was also made clear. The types and figures of salvation in the Old Testament Scriptures which they knew well, were now perfected in the Son of God who had dwelt among them. The requirement to receive this righteousness which would save was not by man's work and human efforts, but by simple believing faith in the Man of righteousness Himself, Christ Jesus.\n\nThis was the message Paul and other faithful men preached. This is the same message we hold today in God's written Word, the Bible. We have faithful preachers, and we have all the means by which this Word of faith is made available to people everywhere. Truly, the word is near us, even in our mouths and we know it in our hearts. There really is no excuse. What then?\n\nFor us who know Him, let this knowledge cause in us the desire to spread this good news. For those who have heard but still resist, doubt or have your own ideas of escaping the judgment to come, may you heed it, believe and accept by faith this Saviour, the Lord Jesus and have the joy and assurance of His salvation.",
        "part6": "THOUGHT",
        "part7": "So then faith cometh by hearing, and hearing by the word of God. - Romans 10:17",
        "part8": [
            "JUDGES 3",
            "ACTS 9"
        ]
    },
    "23 JULY": {
        "part1": "Romans 10:9",
        "part2": "The Need to be Saved",
        "part3": "VERSE 9",
        "part4": "That if thou shalt confess with thy mouth the Lord Jesus, and shalt believe in thine heart that God hath raised him from the dead, thou shalt be saved.",
        "part5": "Believe it or not, like it or not, the matter of one's salvation is a matter with eternal consequences. Who needs to be saved? Every man and woman - for all have sinned [Romans 3:23] and there is none righteous [Romans 3:10].\n\nWhy is there a need to be saved? Because the wages of sin is death [Romans 6:23] and the soul that sinneth, it shall die [Ezekiel 18:4].\n\nWho is able to save? Only one Saviour and one way [John 14:6]. God in His love sent His Son to us to be the way back to Him. Jesus humbled Himself as a man to die as the substitutionary atonement for our sins [Philippians 2:7-8]. He alone is the Saviour and mediator between God and men [1 Timothy 2:5] because only the sinless Second person of the Triune Godhead could do what no one else could and meet the holy standard God requires.\n\nHow can the sinner be saved? To the Philippian jailor, the apostle declared, \"Believe on the Lord Jesus Christ, and thou shalt be saved, and thy house\" [Acts 16:30-31]. To the Roman Christians, he writes, \"That if thou shalt confess with thy mouth the Lord Jesus, and shalt believe in thine heart that God hath raised him from the dead, thou shalt be saved.\" Believing faith in Christ as the Risen Saviour and submission to Him as Lord of our lives are essential requirements of true salvation.\n\nJesus told the crowds that thronged Him, because they saw His miracles, \"This is the work of God, that ye believe on him whom he hath sent.\" Then He said to them, \"I am the bread of life: he that cometh to me shall never hunger; and he that believeth on me shall never thirst\" [John 6:29, 35]. Do you believe this too?",
        "part6": "THOUGHT",
        "part7": "Salvation is not hard to understand if we are humble and exercise faith in what God has said. - John 3:16-18",
        "part8": [
            "JUDGES 4",
            "ACTS 10"
        ]
    },
    "24 JULY": {
        "part1": "Romans 10:9",
        "part2": "If thou shalt confess ...",
        "part3": "VERSE 9",
        "part4": "That if thou shalt confess with thy mouth the Lord Jesus, and shalt believe in thine heart that God hath raised him from the dead, thou shalt be saved.",
        "part5": "What confession is the apostle talking about here? It is not the admission of guilt this word commonly refers to. Rather it is meant the profession of belief in a person and acknowledging one's acceptance of and submission to him.\n\nWho must the sinner confess? The resurrected Lord Jesus Christ.\n\nWhat does confessing Him entail? It entails understanding, belief, acceptance and submission. We must understand in our minds who we are professing faith in and what He requires of us. He is the Lord, the sinless Son of God. But this head knowledge is not enough. We must believe in our hearts who He is and what He says. We must accept Him personally as our Master with absolute authority over us and be in agreement with all He says to us in His inspired and inerrant Word - the Bible. He has authority over our lives. The doctrines contained in His Word are to be obeyed and are for our good. If He is truly Lord of our lives, then we are to submit to Him in reverence and obedience, with trust and confidence.\n\nIt is also highlighted here that He is the Risen Lord. This is the pre-eminent doctrine of the Gospel. If Jesus had remained dead, then He was powerless over death and certainly powerless to save anyone from death. But He is alive, which validates the truth and authority of everything else He says in His Word. We confess the Saviour who lives today in heaven and who will return again as His Word says.",
        "part6": "THOUGHT",
        "part7": "Whosoever shall confess that Jesus is the Son of God, God dwelleth in him, and he in God. - 1 John 4:15",
        "part8": [
            "JUDGES 5",
            "ACTS 11"
        ]
    },
    "25 JULY": {
        "part1": "Romans 10:10",
        "part2": "The Believing Heart",
        "part3": "VERSE 10",
        "part4": "For with the heart man believeth unto righteousness; and with the mouth confession is made unto salvation.",
        "part5": "Our hearts are \"deceitful above all things and desperately wicked\" [Jeremiah 17:9]. Furthermore, \"out of the heart of men, proceed evil thoughts, adulteries, fornications, murders, thefts, covetousness, wickedness, deceit, lasciviousness, an evil eye, blasphemy, pride, foolishness\" [Mark 7:21-22]. How can we whose hearts are evil have faith in the Lord Jesus who is holy, righteous, good and pure? By God's grace and mercy, God elected us to be His children. The Holy Spirit transformed us, regenerated our hearts and converted our souls. God gave us a new heart to know Him and acknowledge Him as King of our lives [Jeremiah 24:7]. We repented of our sins, and forsook our idols and our lusts, realising these foolish pursuits led to eternal destruction.\n\nWe thank our Lord Jesus for dying on the cross in our place, even though He was sinless and perfect so that His righteousness can be imputed to us. By His death and resurrection, we have reconciliation with God and the blessed hope of eternal life in heaven.\n\nOur hearts are not just the seat of our affections and emotions but also the centre of our intellect and will. When our hearts believe in Jesus, it is not a momentary infatuation or a casual feeling but a whole-hearted, sincere love for Him, for His love and the great sacrifice He made for us. By believing in Him, we acknowledge Jesus Christ's deity and His lordship over our life. Dear reader, do you believe in Jesus? Will you surrender your heart to Him and trust Him alone to be your Saviour?",
        "part6": "THOUGHT",
        "part7": "Take heed, brethren, lest there be in any of you an evil heart of unbelief, in departing from the living God ... To day if ye will hear his voice, harden not your hearts, as in the provocation. - Hebrews 3:12, 15",
        "part8": [
            "JUDGES 6",
            "ACTS 12"
        ]
    },
    "26 JULY": {
        "part1": "Romans 10:10",
        "part2": "The Confessing Mouth",
        "part3": "VERSE 10",
        "part4": "For with the heart man believeth unto righteousness; and with the mouth confession is made unto salvation.",
        "part5": "Confession can mean an admission of one's guilt. The meaning here is to profess or declare our faith and belief in the saving grace of Jesus Christ.\n\nPaul tells us that sincere and wholehearted faith and trust in Jesus Christ results from belief in His power to save us. That same genuine and unshakeable belief will naturally result in our open profession of faith in Him. It is a joyful outflow from our heart that springs from the peace we have with God. Our mouth and our heart act in harmony. Our mouth will sing the hymn of faith as our heart beats the rhythm. Genuine faith combined with our confession gains us the righteousness of the Son and reconciliation with the Father so we have eternal salvation.\n\nConfession is not made once only at our conversion. We confess our faith each time we gather with like-minded Christians for corporate worship. At baptism, we publicly identify ourselves as children of God. We are recipients of the covenant of grace, in-grafted into Christ by the regeneration of the heart and remission of sins, and commit ourselves to walk in newness of life (Westminster Confession of Faith). Partaking the Lord's Supper reminds us of the sacrifice our Lord Jesus made for the forgiveness of our sins. Together, the two sacraments, Holy Baptism and the Lord's Supper, visually express the whole Gospel. Evangelism is another means of confessing our faith to others. May God help us to boldly profess our faith and the good news of salvation to all we meet so they may be saved from their sins.",
        "part6": "THOUGHT",
        "part7": "And said unto them, Thus it is written, and thus it behoved Christ to suffer, and to rise from the dead the third day: And that repentance and remission of sins should be preached in his name among all nations, beginning at Jerusalem. - Luke 24:46-47",
        "part8": [
            "JUDGES 7",
            "ACTS 13"
        ]
    },
    "27 JULY": {
        "part1": "Romans 10:11",
        "part2": "Not Ashamed",
        "part3": "VERSE 11",
        "part4": "For the scripture saith, Whosoever believeth on him shall not be ashamed.",
        "part5": "As Christians, we often face ridicule and shame for our faith. The apostle Paul quotes Isaiah 28:16 to reassure Christians that we will not be ashamed when we place our trust in our Lord Jesus to save. The biblical meaning of not being ashamed has many facets.\n\nFirstly, we will not be disappointed or let down by our faith in Jesus Christ. In Romans 5, Paul tells us we have been justified by faith and have peace with God through our Lord Jesus who died for us while we were yet sinners. Our hope and faith in Jesus will not let us down. We will be saved as God promised in His Word.\n\nSecondly, we will not suffer shame before the Lord God on the Day of Judgement. We can appear boldly because we have no fear of our sins being exposed before Him [1 John 2:28]. Our sins have been washed away and our slate is wiped clean because of the atoning work of Christ. We are now clothed in robes of righteousness by God's grace.\n\nLastly, those who place their trust in riches, achievements and connections to save themselves may mock and pour scorn on the children of God, but we need not be cowed or intimidated. When they appear before God in judgement, all earthly things count for nothing. They will be confounded and left speechless as their spiritual nakedness is exposed. They will have no excuse for their sin and rejection of the Saviour. In shame and humiliation, they will be condemned without hope for redemption. May God use us to bring them the Gospel before it is too late.",
        "part6": "THOUGHT",
        "part7": "Wherefore also it is contained in the scripture, Behold, I lay in Sion a chief corner stone, elect, precious: and he that believeth on him shall not be confounded. - 1 Peter 2:6",
        "part8": [
            "JUDGES 8",
            "ACTS 14"
        ]
    },
    "28 JULY": {
        "part1": "Romans 10:12",
        "part2": "No Difference",
        "part3": "VERSE 12",
        "part4": "For there is no difference between the Jew and the Greek: for the same Lord over all is rich unto all that call upon him.",
        "part5": "The good news about the Gospel of salvation is that it is open to everyone. All are invited without exception to come to our Lord Jesus for salvation. No one is excluded. God does not favour any group of people in salvation either. There is no difference among any of us before God. Neither cultural heritage nor family upbringing confer any advantage for the following reasons.\n\nFirstly, all of us are sinners who have fallen short of God's holy standard [Romans 3:23]. None of us can do anything of our own accord to have a right relationship with God. Everyone is equally sinful and equally deserving of His wrath and punishment.\n\nSecondly, our Lord is the same Lord over all people. He is not different towards different people applying different rules for them. There is only one way of salvation - through Jesus Christ who died for the sins of all mankind. All must come to the Father through the blood of the Son [John 14:6]. Conversely, all who do not believe in Jesus to save will suffer the same condemnation [John 3:18].\n\nLastly, our Lord Jesus is rich toward all that call upon Him. God is infinitely rich in love, mercy and grace, and desires to bestow these abundantly upon us. God's generosity is not reserved for some but offered to all who believe. We thank God no matter how great the multitude that calls upon our Lord for salvation, all have the same promise of blessing. His wealth of saving grace is never exhausted and He never wearies of bestowing it upon us.",
        "part6": "THOUGHT",
        "part7": "For there is one God, and one mediator between God and men, the man Christ Jesus. - 1 Timothy 2:5",
        "part8": [
            "JUDGES 9",
            "ACTS 15"
        ]
    },
    "29 JULY": {
        "part1": "Romans 10:13",
        "part2": "The LORD of Salvation",
        "part3": "VERSE 13",
        "part4": "For whosoever shall call upon the name of the Lord shall be saved.",
        "part5": "Paul was writing to the church at Rome, and his desire was that they might be saved. He had stated in the previous verse that \"there is no difference between the Jew and the Greek: for the same Lord over all is rich unto all that call upon him\" [v. 12]. He had also said that the Jews had \"a zeal of God, but not according to knowledge\" [v. 2]. That meant that their knowledge of God was defective. The Gentiles, on the other hand, were very much influenced by the Graeco-Roman religions and myths. Their knowledge was deficient.\n\nSo, who is this Lord of salvation who is rich unto all that call upon Him?\n\nFirst, He is known by several names. His name is Jesus, which means \"Jehovah Saves\" or \"the Lord is Salvation\" [Matthew 1:21]. This name appears in the first verse [Matthew 1:1] and the last verse [Revelation 22:21] of the New Testament. That is the Name upon whom we call if we want to be saved. He is \"the mighty God ... the Prince of Peace\" [Isaiah 9:6]. He is Immanuel [Isaiah 7:14; Matthew 1:23]. He is the Christ - the promised anointed Messiah - the One to whom the prophets give witness.\n\nSecond, He is known for what He came to do. The angels announced to Joseph that his betrothed wife would bear a Son, and \"he shall save his people from their sins\" [Matthew 1:21]. Jesus came to be our substitute. He is our vicarious atonement.\n\nThird, He is known for His authority. He taught \"as one having authority, and not as the scribes\" [Matthew 7:29]. And His Name became our authority in the preaching of the Gospel [Luke 24:47]. The name of Jesus Christ was Paul's message [1 Corinthians 2:2; 9:16]. And it should be ours as well.",
        "part6": "THOUGHT",
        "part7": "The doctrine is not our message; Christ is.",
        "part8": [
            "JUDGES 10",
            "ACTS 16"
        ]
    },
    "30 JULY": {
        "part1": "Romans 10:13",
        "part2": "Whosoever ...",
        "part3": "VERSE 13",
        "part4": "For whosoever shall call upon the name of the Lord shall be saved.",
        "part5": "The Gospel of Jesus Christ transcends all barriers - national, racial, linguistic, cultural, gender, and socio-economic. \"For whosoever shall call upon the name of the Lord shall be saved.\"\n\nThe word \"whosoever\" simply means \"all\" (Greek: pas). The exact connotation of pas depends upon the context of the passage. Pas with a definite article and a participle has the idea of \"everyone who, whoever\" as in John 3:16, \"whosoever believeth in him should not perish, but have everlasting life.\"\n\n\"Whosoever\" is as broad a category as one can imagine. That is the scope of God's salvation plan. That is what our Lord has done in His will. In this covenant of grace - the final and \"better testament\" [Hebrews 7:22] - God has not identified nationalities. He has not identified personalities. Instead, He used one word that covers the whole world, the whole gamut of humanity - whosoever. It does not matter if you are the richest man in the world or the poorest. It does not matter if you are black or white or brown. It does not matter if you are old or young, if you are ninety or nine, learned or illiterate, bond or free, Jew or Gentile, male or female. All are covered by \"whosoever\".\n\nThat is the glory of the Gospel. The blood of Jesus Christ is shed for and cleanses every sin of every sinner. If you are a believer, you are saved not because of who you are or what you have done, but because God has included you under His \"whosoever\". If you have not believed, you can be saved too, if you will only humble yourself and call upon the Lord Jesus Christ in faith.",
        "part6": "THOUGHT",
        "part7": "The elect of God is the \"whosoever\" of God.",
        "part8": [
            "JUDGES 11",
            "ACTS 17"
        ]
    },
    "31 JULY": {
        "part1": "Romans 10:13",
        "part2": "Whosoever shall call ...",
        "part3": "VERSE 13",
        "part4": "For whosoever shall call upon the name of the Lord shall be saved.",
        "part5": "To \"call upon the name\" of a person has several connotations. First, it is \"to invoke\" that person's authority. The apostle Peter in his first sermon quoted Joel, \"it shall come to pass, that whosoever shall call on the name of the Lord shall be saved\" [Acts 2:21; Joel 2:32]. As the enemies stoned Stephen, he called upon God [Acts 7:59]. In these two instances, it is synonymous with \"praying\".\n\n\"To call upon the name of the Lord\" also has the technical and classical meaning of summoning a witness. In 2 Corinthians 1:23, Paul wrote that he called \"God for a record upon my soul\", appealing to God to witness his actions on behalf of the Corinthians.\n\nThird, to call upon the name of the Lord is to be identified with Him. In the Old Testament, to call upon the name of the LORD signifies a relationship with God - \"If my people, which are called by my name ... \" [2 Chronicles 7:14; see also Deuteronomy 28:10; Isaiah 43:7; Amos 9:12].\n\nIn the New Testament, Luke describes followers of Jesus as those who \"call upon\" the name of the Lord [Acts 9:14, 21; 15:17]. The apostle Paul also associated those calling upon the name of the Lord Jesus Christ with the Church, affirming the deity of our Lord Jesus. Clearly, He is the \"name of the Lord\" to whom believers must turn.\n\nPeter, at the moment he was sinking in the water, called on the Lord [Matthew 14:30]. The leper called on the Lord [Luke 5:12]. The thief on the cross called on the Lord [Luke 23:42]. And He heard them. What a privilege and blessing it is for us to be in such company as those who call upon the name of the Lord.",
        "part6": "THOUGHT",
        "part7": "God's desire is that we who are \"called to be saints ... call upon the name of Jesus Christ our Lord\" [1 Corinthians 1:2]",
        "part8": [
            "JUDGES 12",
            "ACTS 18"
        ]
    },
    "1 AUGUST": {
        "part1": "Romans 10:13",
        "part2": "Sincere Call",
        "part3": "VERSE 13",
        "part4": "For whosoever shall call upon the name of the Lord shall be saved.",
        "part5": "Romans 10:13 is not to be taken as some form of paganistic incantation or heathen superstition. The Bible is clear that sincere faith is of the essence because \"without faith it is impossible to please him: for he that cometh to God must believe that he is, and that he is a rewarder of them that diligently seek him\" [Hebrews 11:6].\n\nBelieving with less than a full heart is as bad as an unbelieving heart. God would not want to have anything to do with a wavering heart. James writes: \"If any of you lack wisdom, let him ask of God, that giveth to all men liberally, and upbraideth not; and it shall be given him. But let him ask in faith, nothing wavering. For he that wavereth is like a wave of the sea driven with the wind and tossed. For let not that man think that he shall receive any thing of the Lord\" [James 1:5-7].\n\nGod is also not pleased with a divided heart. Our Lord Jesus says, \"No man can serve two masters\" [Matthew 6:24a]. He is going to hate one and love the other. He is going to cling to the one and despise the other.\" It is impossible to love and serve two masters! Our minds must be made up.\n\nGod also does not want anything to do with a proud and insincere heart. Instead, God looks for a broken and contrite heart. \"A broken and a contrite heart, O God, thou wilt not despise\" [Psalm 51:17]. The God of the universe - the high and lofty One that inhabiteth eternity, whose name is Holy ... (He will dwell) with him also that is of a contrite and humble spirit, to revive the spirit of the humble, and to revive the heart of the contrite ones\" [Isaiah 57:15].",
        "part6": "THOUGHT",
        "part7": "Ye shall seek me, and find me, when ye shall search for me with all your heart. - Jeremiah 29:13",
        "part8": [
            "JUDGES 13",
            "ACTS 19"
        ]
    },
    "2 AUGUST": {
        "part1": "Romans 10:13",
        "part2": "Silent Call",
        "part3": "VERSE 13",
        "part4": "For whosoever shall call upon the name of the Lord shall be saved.",
        "part5": "To call on the name of the Lord is not restricted to an audible call. Hannah called upon God, but \"she spake in her heart; only her lips moved, but her voice was not heard\" [1 Samuel 1:13]. Hers was a silent call. Mark records a woman sick for twelve years, who had heard of our Lord Jesus, and she said, \"If I may touch but his clothes, I shall be whole\" [Mark 5:25-28]. Hers too was a silent call.\n\nYou can call without saying a word. You can call on the Lord also by simply looking. That was what happened in the wilderness when the LORD instructed Moses to make \"a fiery serpent, and set it upon a pole ... (so) that every one that is bitten, when he looketh upon it, shall live\" [Numbers 21:8]. God also called on the people, \"Look unto me, and be ye saved\" [Isaiah 45:22a].\n\nYou can call on the Lord even without looking. You can call on the Lord just by directing your thoughts toward Him because God knows our hearts; He looks on the heart, especially the broken heart.\n\nThe Pharisee in his religious garb and outward show of piety went to the temple, and \"prayed thus with himself, God, I thank thee, that I am not as other men are, extortioners, unjust, adulterers, or even as this publican\" [Luke 18:11]. The publican, on the other hand, \"would not lift up so much as his eyes unto heaven, but smote upon his breast, saying, God be merciful to me a sinner\" [Luke 18:13], and went away justified.\n\nSo, call on the Lord where you are and in whatever way you can because it is not your eloquence that brings God to your prayers, but your brokenness.",
        "part6": "THOUGHT",
        "part7": "Seek ye the LORD while he may be found, call ye upon him while he is near. - Isaiah 55:6",
        "part8": [
            "JUDGES 14",
            "ACTS 20"
        ]
    },
    "3 AUGUST": {
        "part1": "Romans 10:13",
        "part2": "Saving Call",
        "part3": "VERSE 13",
        "part4": "For whosoever shall call upon the name of the Lord shall be saved.",
        "part5": "We can call on the Lord by looking on Him, reaching out to Him, or even by thinking and desiring salvation. When we begin to realize our utter depravity and desperate inability and turn to the grace and compassion of our Lord Jesus, we will be saved!\n\nThere is no better illustration of desperation than that of a drowning man. When the man is flailing his arms, grasping the air trying to keep himself afloat and screaming, \"save me\", we can be sure his calls for deliverance are real.\n\nSalvation is by calling on the \"name of the Lord\". Now a sinner may miss salvation by calling on the wrong name, on the wrong Saviour, or the wrong Lord. And Paul reminds us that \"whosoever shall call upon the name of the Lord shall be saved\". This is important because \"there is one God, and one mediator between God and men, the man Christ Jesus,\" and \"there is none other name under heaven given among men, whereby we must be saved\" [1 Timothy 2:5; Acts 4:12].\n\nWith the name of the Lord comes also the surety of salvation. \"Whosoever shall call upon the name of the Lord shall be saved.\" After the children of Israel had defeated the Philistines, Samuel erected a stone and called it Ebenezer [1 Samuel 7:12]. The hymn-writer, Robert Robinson appropriated the phrase in a stanza of his hymn Count Thou Fount - \"Here I raise my Ebenezer\" - to remind Christians of their need to rely on the Lord, and the certainty of His deliverance. What a comfort for us to know that there are no ifs and maybes in God's promises, but only shall and will.",
        "part6": "THOUGHT",
        "part7": "For all the promises of God in (Christ) are yea, and in him Amen, unto the glory of God by us. - 2 Corinthians 1:20",
        "part8": [
            "JUDGES 15",
            "ACTS 21"
        ]
    },
    "4 AUGUST": {
        "part1": "Romans 10:14",
        "part2": "How are we to believe",
        "part3": "VERSE 14",
        "part4": "How then shall they call on him in whom they have not believed? and shall they believe in him of whom they have not heard? and how shall they hear without a preacher?",
        "part5": "In his epistle to the Romans, Paul describes the predicament of persons apart from Christ. They are unrighteous, self-seeking not God-seeking, practising evil in word and deed, and living without a conscious fear of God; they are totally unworthy of His grace and salvation [Romans 3:9-20]. How then are they to be saved? \"For whosoever shall call upon the name of the Lord shall be saved. How then shall they call on him in whom they have not believed?\" [v. 13-14]. For them to call, they must believe, and they cannot believe if they have not heard; therefore, someone must tell them the Gospel.\n\nBelieving in Christ is not simply accepting the historic facts of His life. Believing in Christ means committing ourselves to Him, venturing our life here and in eternity upon Him. It means surrendering ourselves to Him so that He can shape and mould us. It is believing in obedience, for where there is obedience, there is faith.\n\nIn Romans 10:9-10, Paul ties belief in Christ's resurrection directly to our salvation experience. \"That if thou shalt confess with thy mouth the Lord Jesus, and shalt believe in thine heart that God hath raised him from the dead, thou shalt be saved. For with the heart man believeth unto righteousness; and with the mouth confession is made unto salvation.\" The encouragement here given is that anyone, Jew or Gentile, trusting in Him, will never be put to shame, but saved. As the saying goes, \"If anyone is saved, it is because God does all the saving.\"",
        "part6": "THOUGHT",
        "part7": "For by grace are ye saved through faith; and that not of yourselves: it is the gift of God: Not of works, lest any man should boast. - Ephesians 2:8-9",
        "part8": [
            "JUDGES 16",
            "ACTS 22"
        ]
    },
    "5 AUGUST": {
        "part1": "Romans 10:14",
        "part2": "Response to Election",
        "part3": "VERSE 14",
        "part4": "How then shall they call on him in whom they have not believed? and shall they believe in him of whom they have not heard? and how shall they hear without a preacher?",
        "part5": "In Romans 9:1-29, apostle Paul gives an exposition of God's sovereign grace in Israel's past election. In Romans 9:30-10:21, he describes the nation's present rejection of the Lord and their need for the Gospel. Paul's heart's desire and prayer to God for Israel is that they will be saved [v. 1]. The Jews were zealous but lacked the knowledge of true salvation outlined in Romans 3:21-26. They refused to embrace salvation through Christ as Simeon had done [Luke 2:28-32]. Israel's hardened condition resulted in a national rejection of the Messiah who was \"the end (completion or perfection) of the law for righteousness to every one that believeth\" [v. 4]. The Jews had stumbled over this stumbling stone who alone could make right their \"faulty\" righteousness of works [Romans 9:31-32]. While God is responsible for the salvation of any Jew who comes to faith as evidenced in chapter 9, Romans 10 explains that the Jews themselves are responsible for their own rejection of the Saviour.\n\nIn Romans 10:12 Paul explains that in Christ \"there is no difference between the Jew and the Greek: for the same Lord over all is rich unto all that call upon him.\" The Gentiles obtained righteousness by faith in Christ and not by lawkeeping. Since faith is the necessary component for one's salvation, the lost must receive this message that accurately proclaims the Gospel of Christ. While ethnic Israel was in a state of hardened rejection, the Lord is still willing to save both sinful Jews and Gentiles as they hear this message of salvation preached.",
        "part6": "THOUGHT",
        "part7": "Election is the eternal act of God with respect to all who are saved, by which, out of pure grace and for Christ's sake He purposed to endow them in time with a spiritual blessing of conversion, justification, sanctification and preservation unto eternal life. - R.D Culver",
        "part8": [
            "JUDGES 17",
            "ACTS 23"
        ]
    },
    "6 AUGUST": {
        "part1": "Romans 10:14",
        "part2": "Response to the Gospel",
        "part3": "VERSE 14",
        "part4": "How then shall they call on him in whom they have not believed? and shall they believe in him of whom they have not heard? and how shall they hear without a preacher?",
        "part5": "To Paul, the Gospel centred on Jesus Christ alone and what God has done through Him. In Christ are the essentials of the Gospel - His virgin birth, His divinity as the Son of God, His humility and death on the cross for our sins, His burial, resurrection, and future coming as the King in judgment. To Paul, Christ is the Gospel. In Romans 10, Paul urges the necessity of preaching this so people may be saved.\n\nWhen Paul preached to the Athenians in Acts 17:16-33, many mocked the doctrine of Jesus' resurrection [Acts 17:32]. This was also the case with the Corinthian Christians. Not many were saved by Paul's preaching. Yet \"faith cometh by hearing and hearing by the word of God\" [v. 17]. The Gospel is for all to hear.\n\nAs in time past, many today reject God's Word. When we share the Gospel with anyone, we will receive several predictable responses depending on the condition of the hearer's heart. Some will refuse, oppose and reject the message. Some will receive it with short-lived enthusiasm. When difficulty arises, they drift away. Their response and faith prove superficial. Some are attracted to the Gospel, but their hearts are still occupied with things of the world. They are unwilling to commit fully to Christ. But, when God's Word is shared with one who is truly seeking, they will believe; the Holy Spirit convicts them and brings them to a wondrous salvation in the Lord Jesus. They accept with their heart the person and work of Christ for them personally and repent of their sins. Therefore, we must be faithful in sharing and sowing the Gospel message wherever we are to whoever we meet, whenever we can.",
        "part6": "THOUGHT",
        "part7": "And he said unto them, Go ye into all the world and preach the gospel to every creature. - Mark 16:15",
        "part8": [
            "JUDGES 18",
            "ACTS 24"
        ]
    },
    "7 AUGUST": {
        "part1": "Romans 10:15",
        "part2": "God's Blessings",
        "part3": "VERSE 15",
        "part4": "And how shall they preach, except they be sent? as it is written, How beautiful are the feet of them that preach the gospel of peace, and bring glad tidings of good things!",
        "part5": "Being able to preach the Gospel is a blessing from God. Afterall, who are we to be given this privilege of conveying God's great salvation plan, and handling things that have eternal impact on people's souls? Finite creatures like us can only understand God's will through what He has revealed to us, and having tasted His goodness, we can bring forth God's blessings to the people around us.\n\nBeing sent to herald God's message to a fallen world is also God's blessing. \"Sent\" here in Greek is apostalosin which comes from the word apostello, from which we get the noun apostolos or \"apostle.\" There are at least two senses to the word \"apostle\": it could refer specifically to Jesus' twelve chosen disciples who have seen the resurrected Christ, or it could simply mean a messenger who is sent forth to preach God's Word. We may not be messengers of the Gospel formally sent by the church, but all of us are told to go forth into the world to shine for Him.\n\nBeing able to receive the true Gospel from a faithful preacher and teacher of God's Word is definitely a blessing from God too. If only every Christian aspires to be a good testimony of the manifold grace of God, and proclaim the Word especially through a life that is consistent to his faith, then consciences will be pricked, hearts made soft and teachable, and lost souls will be saved.\n\nIndeed, salvation is only of the Lord, but God has chosen to work through us to extend His kingdom, that we might in blessing others, be blessed as well.",
        "part6": "THOUGHT",
        "part7": "Give, and it shall be given unto you; good measure, pressed down, and shaken together, and running over, shall men give into your bosom. For with the same measure that ye mete withal it shall be measured to you again. - Luke 6:38",
        "part8": [
            "JUDGES 19",
            "ACTS 25"
        ]
    },
    "8 AUGUST": {
        "part1": "Romans 10:15",
        "part2": "Beautiful Feet",
        "part3": "VERSE 15",
        "part4": "And how shall they preach, except they be sent? as it is written, How beautiful are the feet of them that preach the gospel of peace, and bring glad tidings of good things!",
        "part5": "Paul next quoted from Isaiah 52:7: \"How beautiful upon the mountains are the feet of him that bringeth good tidings, that publisheth peace; that bringeth good tidings of good, that publisheth salvation; that saith unto Zion, Thy God reigneth!\" These descriptions give us a vivid portrait of a person bringing the message everywhere he goes, even to the uttermost parts of the world. He brings peace and gladness of good things. The feet of such a person are beautiful.\n\nWe bring to the world a Gospel of peace. It is only through our Lord and Saviour Jesus Christ that we have peace with God. We are reconciled to God through the blood of Christ, and because of that we can have peace within ourselves - something which the world searches frantically for but to no avail, simply because they are looking in the wrong places. Only the Gospel enables us to have peace with God and have the peace of God. And with that peace, we can have peace with others, as well as with the rest of creation.\n\nWe also need to tell others about the glad tidings of good things. \"Good things\" not in terms of what the world deems good, but rather the spiritual blessings that accompany the grace and knowledge of our Lord Jesus.\n\n\"As it is written\" tells us this is indeed God's beautiful plan from the beginning to the end. The Old Testament and New Testament bear consistent testimony of God's gracious dealings with us, simply because God is the ultimate author of the holy Word. Thank God for His wonderful blessings, and may our feet be beautiful carriers of God's gift to this lost world.",
        "part6": "THOUGHT",
        "part7": "What shall we then say to these things? If God be for us, who can be against us? He that spared not his own Son, but delivered him up for us all, how shall he not with him also freely give us all things? - Romans 8:31-32",
        "part8": [
            "JUDGES 20",
            "ACTS 26"
        ]
    },
    "9 AUGUST": {
        "part1": "Romans 10:16",
        "part2": "Gospel: Command or Offer",
        "part3": "VERSE 16",
        "part4": "But they have not all obeyed the gospel. For Esaias saith, Lord, who hath believed our report?",
        "part5": "We see how Paul cited Isaiah 52:7 in the previous verse. He now names Isaiah (\"Esaias\") specifically, showing us that, whether in the days of old or our day, there are always people who will not believe the testimonies of God's messengers and refuse to obey the Gospel. The sinful nature runs in all men through all times.\n\nThe Gospel is clearly spelt out in God's Word. To be saved, we must confess we are sinners and come to the Lord through His only begotten Son. The Old Testament points toward this truth, and in the New Testament, it was made clear with the coming of our Lord Jesus. Our Lord had proclaimed, \"I am the Way, the Truth, and the Life: no man cometh unto the Father, but by Me.\" Jesus Christ is the only way to be saved from condemnation.\n\nSadly, there are people who do not take this command of God seriously. Some consider it as an offer, as if God is cordially inviting us to trust in Christ as a way, with Christ being only one of several choices we can have in order to be saved. This is especially so in a consumer-oriented society like ours. With so much information and choices at hand (and in our handphones), the Gospel is seen as one option among many \"truths\".\n\nYet God's absolute Word tells us differently. The almighty God in heaven because of His love, came down and died for our sins. What should our response be? It is foolish of us to take the Gospel light-heartedly, or delay like the \"wise\" men of Athens, saying, \"We will hear thee again of this matter.\" [Acts 17:32b]",
        "part6": "THOUGHT",
        "part7": "And this is his commandment, That we should believe on the name of his Son Jesus Christ, and love one another, as he gave us commandment. - 1 John 3:23",
        "part8": [
            "JUDGES 21",
            "ACTS 27"
        ]
    },
    "10 AUGUST": {
        "part1": "Romans 10:16",
        "part2": "Disobedience to the Gospel",
        "part3": "VERSE 16",
        "part4": "But they have not all obeyed the gospel. For Esaias saith, Lord, who hath believed our report?",
        "part5": "The command to obedience is found throughout the Bible. The reason for the Israelites' wandering in the wilderness was disobedience. The reason why they could not settle peacefully in Canaan is because they did not obey God's command to conquer the land completely. They did things according to what they thought was correct in their own eyes. Disobedience to God's command also resulted in their 70 years of exile in a foreign land. Yet such is the tendency of fallen man.\n\nOur sinful nature desires independence and selfautonomy, not realizing that a life out of sync with the will of God is filled with regrets and sorrows. Even when the Son of God came into this world to show us the Gospel which the Old Testament pointed to, there are still many who choose not to believe. There are two reasons why this is so. The first is lust. They are not willing to give up their sinful beliefs and lifestyles. To these people, our Lord Jesus said, \"No man can serve two masters: for either he will hate the one, and love the other; or else he will hold to the one, and despise the other. Ye cannot serve God and mammon.\" [Matthew 6:24]\n\nA second reason for disobedience is pride. We want things to be done our way instead of God's way. Man, including many believers, are so blinded by their projects of wood, hay and stubble, they forget that one day all these works of vanity will not endure the judgment of fire. To these people, our Lord Jesus said, \"If any man will come after me, let him deny himself, and take up his cross, and follow me.\" [Matthew 16:24]",
        "part6": "THOUGHT",
        "part7": "For all that is in the world, the lust of the flesh, and the lust of the eyes, and the pride of life, is not of the Father, but is of the world. And the world passeth away, and the lust thereof: but he that doeth the will of God abideth for ever. - 1 John 2:16-17",
        "part8": [
            "RUTH 1",
            "ACTS 28"
        ]
    },
    "11 AUGUST": {
        "part1": "Romans 10:16",
        "part2": "Who Would Believe?",
        "part3": "VERSE 16",
        "part4": "But they have not all obeyed the gospel. For Esaias saith, Lord, who hath believed our report?",
        "part5": "The Messiah came to this world some 2,000 years ago, yet who would know the purpose, and expect the manner in which He came? The Israelites were praying for their Messiah to come as a mighty king to save them from their neighbouring enemies, yet they did not realise they were in a more dangerous state spiritually. The Saviour came not to save mankind from their physical predicament; He came to save us from our eternal condemnation.\n\nIt is with this understanding that Paul quoted Isaiah 53:1, for the whole chapter of Isaiah 53 is about how Christ came into our world as a suffering servant, \"despised and rejected of men; a man of sorrows, and acquainted with grief \" [Isaiah 53:3]. \"He was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed.\" [Isaiah 53:5]\n\nYet it is precisely in this manner the Son of God would accomplish His Father's salvation plan. It was totally contrary to what human wisdom would suggest. As the Lord walked closer and closer to the cross, one could perhaps even imagine Satan thinking he had succeeded. Yet the moment our Lord Jesus died, the work was finished. The thick curtain in the Temple separating man from God was torn into two from the top to the bottom. Three days later, He rose again, showing that He is indeed God the Son, giving us the assurance of our own resurrection and everlasting life.\n\nIndeed, \"the Jews require a sign, and the Greeks seek after wisdom: But we preach Christ crucified, unto the Jews a stumblingblock, and unto the Greeks foolishness; But unto them which are called, both Jews and Greeks, Christ the power of God, and the wisdom of God.\" [1 Corinthians 1:22-24]",
        "part6": "THOUGHT",
        "part7": "Amazing love! How can it be? That Thou, my God, should die for me? - Charles Wesley",
        "part8": [
            "RUTH 2",
            "ROMANS 1"
        ]
    },
    "12 AUGUST": {
        "part1": "Romans 10:17",
        "part2": "The Origin of Faith",
        "part3": "VERSE 17",
        "part4": "So then faith cometh by hearing, and hearing by the word of God.",
        "part5": "Where does faith originate? What is the source of faith? From Romans 10:17, it would seem that faith is the product of hearing the preaching of the Gospel. We know that is not always the case. There are people who have heard the Gospel preached and yet remained unbelieving. When Paul says, \"faith cometh by hearing, and hearing by the word of God\", he is not saying that all who hear will definitely come to faith in Christ.\n\nWhat Paul meant by those words is that a person cannot come to faith in Christ unless there is the preaching of the Gospel. Faith does not come by any means other than the Word preached. That is why Cyprian of Carthage - the third-century church father - said \"extra ecclesiam nulla salus,\" which is Latin for \"outside the church, there is no salvation,\" meaning that outside of the church, there is no possibility of hearing the Gospel.\n\nFor Paul, faith is the voice that speaks the message heard in the heart, a message that will be confirmed by the Gospel when a person hears it preached. There are those who hold the view that it is the manner in which a person hears and responds to the audible message of the Gospel that produces faith.\n\nThe two ideas are quite different. In one case the onus of belief resides in the man who preaches and the person who hears. In the other, it is the divine work of grace that instills faith in the heart. The first view challenges the unregenerate sinner, \"If you will have faith, God will save you.\" The other view, Paul's view, informs the regenerate sinner, \"God has saved you, and through your hearing the Gospel engenders faith in you.\"",
        "part6": "THOUGHT",
        "part7": "\"When the Son of man cometh, shall he find faith on the earth?\" [Luke 18:8b]. Most assuredly, Christ will find faith where He has worked!",
        "part8": [
            "RUTH 3-4",
            "ROMANS 2"
        ]
    },
    "13 AUGUST": {
        "part1": "Romans 10:17",
        "part2": "Faith cometh by hearing!",
        "part3": "VERSE 17",
        "part4": "So then faith cometh by hearing, and hearing by the word of God.",
        "part5": "\"Faith cometh by hearing\" -- That is the universal testimony of Holy Scripture. Sinners are saved by the grace of God, through the merits of Christ's precious blood, and the mighty operation of God the Holy Ghost, through the instrumentality of Gospel preaching.\n\nThe preaching and the hearing of the Gospel are essential to the salvation of souls. God is absolutely sovereign not only in the subjects of salvation, but also in the means of salvation. The Lord our God is sovereign. He saves His people altogether by grace, without any works of their own.\n\nThat does not mean it is not necessary to preach or hear the Gospel. There are some who take \"Salvation is of the LORD\" [Jonah 2:9b] to mean it is not necessary to preach or hear the Gospel; that there is no need for sinners to repent.\n\nThe Bible teaches otherwise. Our Lord Jesus says, \"He that heareth my word, and believeth on him that sent me, hath everlasting life\" [John 5:24]. There is also a consistent apostolic affirmation of the preaching of the Gospel for salvation. The apostle Paul says \"I am not ashamed of the gospel of Christ: for it is the power of God unto salvation\" [Romans 1:16]. He told the Corinthians that God willed it to use \"the foolishness of preaching to save them that believe\" [1 Corinthians 1:21]. James says that God has begotten us \"with the word of truth [James 1:18]. Peter says that we are \"born again ... by the word of God, which liveth and abideth for ever ... And this is the word which by the gospel is preached unto you\" [1 Peter 1:23-25].\n\nThe simple truth is this - no preaching of the Gospel, no presentation of faith and no pleasing of God [Hebrews 11:6], thus no possibility of salvation. Pray for the preaching as well as hearing of the Gospel.",
        "part6": "THOUGHT",
        "part7": "Pray for faith to believe and to receive the Word of God with meekness and joy.",
        "part8": [
            "1 SAMUEL 1",
            "ROMANS 3"
        ]
    },
    "14 AUGUST": {
        "part1": "Romans 10:17",
        "part2": "Faith cometh by hearing alone?",
        "part3": "VERSE 17",
        "part4": "So then faith cometh by hearing, and hearing by the word of God.",
        "part5": "Paul writes: \"The invisible things of him from the creation of the world are clearly seen, being understood by the things that are made, even his eternal power and Godhead; so that they are without excuse\" [Romans 1:20]. In pre-evangelism apologetics, the question most frequently asked is this - If faith comes by hearing, what about those who have not heard?\n\nThere are two main schools of thought. There are those who hold the view that the believer is responsible to make the first step; he must create faith in the individual by his preaching, and then motivate the individual to take \"saving\" steps toward God. The second view holds that God must first perform the work of grace in the sinner's heart or else all human efforts will be futile. Then there is also the blending of the two - the first work of grace comes from God and yet at the same time the believer must present the Gospel, which the Holy Spirit will use to bring the unbeliever to a state of faith.\n\nIn any case, it is clear that faith never builds on a vacuum of knowledge. It builds on credible evidence for a certain belief. The question is: where does the evidence on which faith rests originate? Does it originate in the message we preach? Or does it originate with God's saving grace planted in the heart generating the voice which speaks within?\n\nSaving faith is based on the enlightening grace of God which He sovereignly bestows in regeneration. It builds on the foundational premise that our knowledge of God and our response to Him grow out of His first act of grace in saving us and bestowing His nature upon us in regeneration.",
        "part6": "THOUGHT",
        "part7": "Meditate upon these things; give thyself wholly to them; that thy profiting may appear to all. Take heed unto thyself, and unto the doctrine; continue in them: for in doing this thou shalt both save thyself, and them that hear thee. - 1 Timothy 4:1516",
        "part8": [
            "1 SAMUEL 2",
            "ROMANS 4"
        ]
    },
    "15 AUGUST": {
        "part1": "Romans 10:17",
        "part2": "Receiving Faith",
        "part3": "VERSE 17",
        "part4": "So then faith cometh by hearing, and hearing by the word of God.",
        "part5": "When we read the Word of God, four essential truths stand out.\n\nFirst, there is only one Gospel. It is the Gospel of God concerning His Son, testifying that Jesus is the Christ. This is the Gospel that Paul and the apostles preached. This is the Gospel that we in the 21st century must continue to preach - \"that Christ died for our sins according to the scriptures\" [1 Corinthians 15:1-3].\n\nSecond, no one can be saved without hearing the Gospel. God could have chosen to send angels to reveal His saving grace. God could, if He chose, take his elect to heaven without ever sending a preacher. Rather, in His infinite and wise sovereignty, He ordained that the preaching of the Gospel would be the means by which salvation would be made known. \"It pleased God by the foolishness of preaching to save them that believe\" [1 Corinthians 1:21].\n\nThird, no one will ever be saved without believing the Christ. \"He that believeth on the Son hath everlasting life: and he that believeth not the Son shall not see life; but the wrath of God abideth on him\" [John 3:36]. Faith in Christ is indispensable to salvation. Whoever believes is God's elect. Whoever is the elect believes.\n\nFourth, no sinner will ever be saved without the repentance of sin. Our Lord Jesus said, \"Except ye repent, ye shall all likewise perish\" [Luke 13:3]. The gate of faith into salvation is also the gate of repentance. Peter writes that the Lord \"is longsuffering to us-ward, not willing that any should perish, but that all should come to repentance\" [2 Peter 3:9b]. Repentance is turning to God. Repentance is a change of heart and mind. Repentance is a change of one's allegiance.",
        "part6": "THOUGHT",
        "part7": "The road of salvation begins at a fork - repent or perish!",
        "part8": [
            "1 SAMUEL 3",
            "ROMANS 5"
        ]
    },
    "16 AUGUST": {
        "part1": "Romans 10:17",
        "part2": "Hearing and not Seeing",
        "part3": "VERSE 17",
        "part4": "So then faith cometh by hearing, and hearing by the word of God.",
        "part5": "When the children of Israel were wandering in the wilderness, they saw the visible manifestation of God daily - the pillar of cloud by day and the pillar of fire by night. Then, forty years later, as they were about to enter the Promised Land, Moses warned them about what they would see and against following the ways of the Canaanites. Moses emphasized the importance of hearing God's Word.\n\n\"Now therefore hearken, O Israel, unto the statutes and unto the judgments, which I teach you, for to do them ...\" [Deuteronomy 4:1]. \"Gather me the people together, and I will make them hear my words, that they may learn to fear me all the days that they shall live upon the earth, and that they may teach their children\" [Deuteronomy 4:10]. \"Take ye therefore good heed unto yourselves; for ye saw no manner of similitude on the day that the LORD spake unto you in Horeb out of the midst of the fire: Lest ye corrupt yourselves, and make you a graven image\" [Deuteronomy 4:15-16; see also 23-24, 33, 36, 40].\n\nWhy the emphasis on hearing rather than seeing? The reason is that our sense of sight often betrays us. Eve \"saw that the tree was good for food, and that it was pleasant to the eyes ...\" [Genesis 3:6], and she ate of the forbidden fruit. Achan saw the spoils, and he coveted and took the forbidden loot [Joshua 7:21]. David saw Bathsheba washing herself; he coveted her and committed adultery [2 Samuel 11:2]. The eye seems to be the organ most susceptible to sin, and idolatry exploits man's weakness of the sense of sight.\n\nThat is why the Gospel presents our Saviour as the Good Shepherd whose \"sheep hear (His) voice ... and they follow (Him)\" [John 10:27].",
        "part6": "THOUGHT",
        "part7": "The look of faith to God comes by way of the hearing of His Word.",
        "part8": [
            "1 SAMUEL 4",
            "ROMANS 6"
        ]
    },
    "17 AUGUST": {
        "part1": "Romans 10:17",
        "part2": "Hearing Scripture",
        "part3": "VERSE 17",
        "part4": "So then faith cometh by hearing, and hearing by the word of God.",
        "part5": "In the parable of the soils [Luke 8:5-18], our Lord Jesus speaks of how the Word of God is received by different types of hearers. Some heard the Word but immediately dismissed it. Others heard but the Word failed to take root in their hearts or they were distracted by the cares of this world. Then, there are others who \"having heard the word, keep it, and bring forth fruit with patience\" [Luke 8:15].\n\nIn that parable, our Lord Jesus tells us that the multitudes came out of every city to hear Him, but there are many who did not receive any saving benefit from the preaching of the Gospel. So, in verse 18, our Lord Jesus gave this application, \"Take heed therefore how ye hear\" [Luke 8:18]. If we would profit spiritually and eternally from the preaching of the Gospel, we must take heed how we hear.\n\nHow then should we hear?\n\nPrepare your heart. Hearing starts with the heart. Whenever you come into God's house, prepare your heart with an intense desire to hear His Word. \"If we were as swift to hear as we are ready to speak there would be ... more profit in our meetings.\" (Thomas Manton)\n\nSeize every opportunity to hear the Word of God. Be careful that nothing chokes out the influence of the Gospel in our lives. Be like David whose one desire was to \"dwell in the house of the LORD all the days of (his) life, to behold the beauty of the LORD, and to enquire in his temple\" [Psalm 27:4]. Be like Mary who \"sat at Jesus' feet, and heard his word\" [Luke 10:39].\n\nMake certain that in hearing, you hear the Gospel. Discern what you hear. Beware of another Gospel.",
        "part6": "THOUGHT",
        "part7": "The responsibility of preaching the Gospel rests on the shoulders of the man in the pulpit. The responsibility of hearing the Gospel rests on the shoulders of the people in the pews. So hear, and hear well!",
        "part8": [
            "1 SAMUEL 5-6",
            "ROMANS 7"
        ]
    },
    "18 AUGUST": {
        "part1": "Romans 10:17",
        "part2": "The Hearer's Heart",
        "part3": "VERSE 17",
        "part4": "So then faith cometh by hearing, and hearing by the word of God.",
        "part5": "Our Lord Jesus, quoting from Isaiah's prophecy, speaks of those who hear but shall not understand. The reason is that the people's \"heart is waxed gross, and their ears are dull of hearing, and their eyes they have closed\" [Matthew 13:1315]. This means that it is God who gives us grace to hear and understand the Gospel.\n\nGod gives us grace to hear with attention. Paul commended the Thessalonians: \"when ye received the word of God which ye heard of us, ye received it not as the word of men, but as it is in truth, the word of God, which effectually worketh also in you that believe [1 Thessalonians 2:13].\n\nGod gives us grace to hear with humility. Paul says that God uses \"the foolish things of the world to confound the wise ... the weak things of the world to confound the things which are mighty\" [1 Corinthians 1:26-27] so that our \"faith should not stand in the wisdom of men, but in the power of God\" [1 Corinthians 2:5]. Thus, we must \"receive with meekness the engrafted word, which is able to save (our) souls\" [James 1:21].\n\nGod gives us grace to listen with purity of heart. This means we are to listen with self-examination and introspection. Three times, the writer of Hebrews says, \"To day if ye will hear his voice, harden not your hearts, as in the provocation\" [Hebrews 3:7-8, 15; 4:7]. It also means that when we are convicted by God's Word, we must confess and repent of our sins.\n\nGod gives us the grace to listen with love. The Psalmist declares, \"I will delight myself in thy commandments, which I have loved. My hands also will I lift up unto thy commandments, which I have loved ... O how love I thy law! It is my meditation all the day\" [Psalm 119:47-48, 97].",
        "part6": "THOUGHT",
        "part7": "Hearing is an act of eternal consequence. According to our hearing, so shall the state of our souls be in eternity.",
        "part8": [
            "1 SAMUEL 7-8",
            "ROMANS 8"
        ]
    },
    "19 AUGUST": {
        "part1": "Romans 10:18",
        "part2": "Have they not heard?",
        "part3": "VERSE 18",
        "part4": "But I say, Have they not heard? Yes verily, their sound went into all the earth, and their words unto the ends of the world.",
        "part5": "When Paul wrote this passage, the Gospel had already been preached extensively in all the known nations. It had been proclaimed in Rome, Jerusalem, Syria, Asia Minor, Arabia and in the islands of the Mediterranean. God's message of salvation had been freely preached to all, for anyone to receive Christ as their Saviour.\n\nBut many people were still unbelieving. Apostle Paul questioned why, rhetorically asking if it was because they had not heard the Scripture for themselves. Of course not! God's creation all around them was a living testament to His greatness (quoting from Psalm 19:4).\n\nJohn 12:37 reminds us that even after Jesus had performed many miracles, many of the people still would not believe in Him. Their spiritual eyes were blinded, and their hearts hardened so they could neither perceive nor understand with their hearts. In fact, through many channels today, the Gospel has been shared in every corner of the world, yet many people who have heard still refuse to believe. They are still spiritually dead in their transgressions and sins [Ephesians 2:1].\n\nDo not be discouraged if our witnessing for Christ is rejected. Our task is to continue reaching out to unsaved souls to share the Good News. We must be prepared to preach the Gospel in season or out of season [2 Timothy 4:2], and keep praying for the Holy Spirit to touch the hearts of our loved ones who have yet to accept Christ.",
        "part6": "PRAYER",
        "part7": "O Lord, I thank You for Your grace and love for us. You have called us as believers to go into the world to proclaim Your Gospel. May You grant me the courage, passion, boldness to witness for You and share my faith with others. Amen.",
        "part8": [
            "1 SAMUEL 9",
            "ROMANS 9"
        ]
    },
    "20 AUGUST": {
        "part1": "Romans 10:19",
        "part2": "Did they not know?",
        "part3": "VERSE 19",
        "part4": "But I say, Did not Israel know? First Moses saith, I will provoke you to jealousy by them that are no people, and by a foolish nation I will anger you.",
        "part5": "The Israelites were God's chosen people from the beginning. Of all the nations, Israel should have been the first to understand God's message and accept Jesus as their Messiah. However, they rejected Him, just as it was described in the Old Testament. God called His people \"stiffnecked people\" [Deuteronomy 9:6] and Jeremiah described God's people as having \"not hearkened, nor inclined your ear to hear\" in Jeremiah 25:4.\n\nNow, Paul quotes Deuteronomy 32:21 to say that God intends to save the Gentiles to provoke the Jews to jealousy. God would make the Jews envious by forging a new relationship with nations who had no previous encounters or relationship with the Almighty God. The Jews had to humble themselves and see how the Spirit of God burned more brightly in the new proselytes. Proverbs 3:3435 echoes this: \"Surely he scorneth the scorners: but he giveth grace unto the lowly. The wise shall inherit glory: but shame shall be the promotion of fools.\"\n\nPaul explains it well in Acts 13:46. The Gospel was first shared with the Jews but they rejected it, thus salvation was offered to the Gentiles. Have we also rejected God in our day to day lives? Do our actions toward God mirror the New Testament Jews, when we claim to love God and yet constantly spite Him and neglect our relationship with Him? Let us not throw away this precious Gift we have been given.",
        "part6": "THOUGHT",
        "part7": "Wherefore, my beloved, as ye have always obeyed, not as in my presence only, but now much more in my absence, work out your own salvation with fear and trembling. For it is God which worketh in you both to will and to do of his good pleasure. - Philippians 2:12-13",
        "part8": [
            "1 SAMUEL 10",
            "ROMANS 10"
        ]
    },
    "21 AUGUST": {
        "part1": "Romans 10:20-21",
        "part2": "God's Compassion and Longsuffering",
        "part3": "VERSE 21",
        "part4": "But to Israel he saith, All day long I have stretched forth my hands unto a disobedient and gainsaying people.",
        "part5": "In verses 20-21, Paul quotes Isaiah 65:1-2 to highlight the contrast between the Jews and the Gentiles in their response to the Gospel. The Gentiles did not seek God but found Him. The Jews, to whom God had continually reached out with the way of salvation, rejected Him. An even greater contrast is found within verse 21 - the contrast between the compassion and longsuffering of God who continually stretches out His hands to sinners, and the hardness of those who stubbornly turn their backs on Him.\n\nGod's love is filled with compassion and longsuffering. We are but helpless condemned sinners, completely unable to save ourselves. In His great love and mercy, He reached out to us, freely offering the gift of salvation in Christ. Even when we obstinately resist His love and rebel against His commands, God does not withdraw His love. He continues to stretch out His hands, calling us to repentance and faith in Christ.\n\nHow have you responded to God's love in Christ? Have you come to Jesus Christ as your Saviour or are you still resisting Him? If you are a Christian, do not presume upon your salvation but \"give diligence to make your calling and election sure\" [2 Peter 1:10]. There are many selfprofessing Christians who treat church attendance lightly, do not study the Bible and are uninterested in the things of God. Let us examine our hearts to see where we truly stand and follow our Lord in obedient discipleship.",
        "part6": "THOUGHT",
        "part7": "The Lord is not slack concerning his promise, as some men count slackness; but is longsuffering to us-ward, not willing that any should perish, but that all should come to repentance. - 2 Peter 3:9",
        "part8": [
            "1 SAMUEL 11",
            "ROMANS 11"
        ]
    },
    "22 AUGUST": {
        "part1": "Romans 11:1",
        "part2": "Romans 11 Introduction",
        "part3": "VERSE 1",
        "part4": "I say then, Hath God cast away his people? God forbid. For I also am an Israelite, of the seed of Abraham, of the tribe of Benjamin.",
        "part5": "In chapter 10, Paul establishes the responsibility of Israel in her rejection of Christ. Israel's unbelief is not due to a lack of hearing or understanding of the Gospel, but due to her obstinacy and disobedience. Nonetheless, God who is full of compassion and longsuffering continues to stretch out His arms toward Israel, inviting her to come to Him in repentance and faith in Christ.\n\nAs a result of Israel's rejection, the Gospel was brought to the Gentiles, many of whom readily received and were saved. Paul anticipates what his readers will ask next. Does this mean that God has rejected Israel? Has His purpose toward Israel failed? In chapter 11, Paul addresses these concerns and reveals God's plans for Israel. God has not cast away His people. He is faithful to His covenant. Israel's stumbling is in accordance with God's sovereign purpose. Her blindness will come to an end, and Israel will be restored to her place of privilege in the future. Ultimately, God has allowed all mankind to be imprisoned in disobedience so that He can reveal His mercy to all who trust in Him.\n\nThrough God's dealings with Israel in the past, present, and then in the future, we catch a glimpse of the heart and mind of our great and infinite God. Although our finite minds cannot grasp the fullness of God's sovereign plan, we know we can trust Him in His goodness, wisdom, faithfulness, and mercies. To God be all honour, glory, and praise.",
        "part6": "THOUGHT",
        "part7": "For the LORD is good; his mercy is everlasting; and his truth endureth to all generations. - Psalm 100:5",
        "part8": [
            "1 SAMUEL 12",
            "ROMANS 12"
        ]
    },
    "23 AUGUST": {
        "part1": "Romans 11:1",
        "part2": "Are There Two Israels",
        "part3": "VERSE 1",
        "part4": "I say then, Hath God cast away his people? God forbid. For I also am an Israelite, of the seed of Abraham, of the tribe of Benjamin.",
        "part5": "In Romans chapters 9-11, Paul affirms God's election of Israel as a nation by referring to the nation of Israel as God's people. Israel as a whole has wilfully rejected the Gospel. It seems as if God's purpose towards Israel, His very own people, has failed, but Paul emphatically rejects any such conclusion. In what sense, then, can Israel remain as the people of God? Or does Paul have in view two Israels?\n\nEarlier in Romans 9:6, Paul qualifies that \"not all Israel ... are of Israel\". There is \"an Israel within Israel\", a remnant who has believed the Gospel and become part of \"spiritual Israel\" by faith. Some theologians see \"spiritual Israel\" as the entire body of believers. They teach that the promises of God to Israel are not fulfilled in Israel as a nation but are fulfilled in both the Jews and the Gentiles as one people of God.\n\nIn the context of Romans 11:1 however, Paul is referring to national Israel and not spiritual Israel. Strictly speaking, only the elect, individuals chosen by God's grace, are true members of God's people. Although the corporate election of Israel does not provide for salvation in and of itself, it plays an important role in God's sovereign plan to bring about the future salvation of the Jews, as Paul will later show. Similarly, being born into a Christian home does not guarantee salvation but brings spiritual blessings to the child. The question then is - Do you treasure your spiritual privileges and use every opportunity to cultivate genuine spiritual fellowship with God?",
        "part6": "THOUGHT",
        "part7": "And that from a child thou hast known the holy scriptures, which are able to make thee wise unto salvation through faith which is in Christ Jesus. - 2 Timothy 3:15",
        "part8": [
            "1 SAMUEL 13",
            "ROMANS 13"
        ]
    },
    "24 AUGUST": {
        "part1": "Romans 11:1",
        "part2": "The Holocaust",
        "part3": "VERSE 1",
        "part4": "I say then, Hath God cast away his people? God forbid. For I also am an Israelite, of the seed of Abraham, of the tribe of Benjamin.",
        "part5": "Romans 11 teaches that God is not done with the nation of Israel and will restore Israel someday. Many theologians, however, reject this literal interpretation, taking the view that God's promises to Israel will be fulfilled in a spiritual Israel and not national Israel. Others argue that God has rejected Israel and replaced it with the church, the new Israel. Martin Luther even wrote a pamphlet to denounce the Jews urging their persecution. The course of history - with the fall of the Jewish nation in AD 70, the diaspora, and the growth of antisemitism - seems to support the view that God has abandoned Israel. Nevertheless, by God's providence, ethnic Jews around the world continue to survive, thrive and preserve their cultural and religious identity to this day.\n\nA genocide of the Jews known as the Holocaust, however, marks a turning point in Jewish history. The murder of nearly six million Jews by the Nazis during the Second World War led many Jews to ask: Where was God? Then, in 1948, out of the tragedy of the Holocaust, against all odds, the State of Israel was re-established by the mighty hand of God. This represented for the Jews the restoration of their homeland after a diaspora of almost two millennia. This miraculous turn of events prompted many Christians to revise their interpretation of Romans 9-11.\n\nHistory serves to remind us to exercise humility in our interpretation of Scriptures. God's ways are much higher than ours. Even when we cannot comprehend the mysteries of His ways, we can still fully rest in the assurance of His faithfulness.",
        "part6": "THOUGHT",
        "part7": "O the depth of the riches both of the wisdom and knowledge of God! how unsearchable are his judgments, and his ways past finding out! - Romans 11:33",
        "part8": [
            "1 SAMUEL 14",
            "ROMANS 14"
        ]
    },
    "25 AUGUST": {
        "part1": "Romans 11:1",
        "part2": "Has God Cast Away Israel?",
        "part3": "VERSE 1",
        "part4": "I say then, Hath God cast away his people? God forbid. For I also am an Israelite, of the seed of Abraham, of the tribe of Benjamin.",
        "part5": "Has God cast away His people? Paul responds with \"God forbid\", which in the original Greek is the most emphatic way one can say \"No!\" In other words, this suggestion is so outrageous that it should not even cross our minds as a possibility. Under no circumstances whatsoever would God abandon Israel!\n\nWhy does Paul use such a strong term? Because Paul has a high view of God. The conclusion that God has rejected His people may seem logical but has profound implications. If God has rejected Israel, it would mean God's Word has failed, that He is unable to keep His promises because His people refused to cooperate. If God has rejected Israel, it would imply that God is unfaithful to His covenant. Believers can have no eternal security in Christ because just as God has cast off Israel, God may also break His promises to us and cast us off. So, to suggest that God has rejected Israel is to undermine God's character and cast doubts on His sovereignty, power, faithfulness, and trustworthiness. How can we entertain such ideas? God forbid!\n\nGod is faithful to His covenant. Even when we are faithless, He remains faithful. His faithfulness endures to all generations. All His promises are true and will come to pass. All these are plainly written in the Bible, and we affirm them as believers. But when circumstances seem otherwise and doubts and storms assail us, will we still hold fast to our faith and uphold a high view of God? May the Lord help us.",
        "part6": "THOUGHT",
        "part7": "Know therefore that the LORD thy God, he is God, the faithful God, which keepeth covenant and mercy with them that love him and keep his commandments to a thousand generations. - Deuteronomy 7:9",
        "part8": [
            "1 SAMUEL 15",
            "ROMANS 15"
        ]
    },
    "26 AUGUST": {
        "part1": "Romans 11:1",
        "part2": "What Is the Future of Israel?",
        "part3": "VERSE 1",
        "part4": "I say then, Hath God cast away his people? God forbid. For I also am an Israelite, of the seed of Abraham, of the tribe of Benjamin.",
        "part5": "Much has been said about the nation of Israel. First, Paul has made it clear that not all Israel is Israel. Only those who have come to a saving faith in Christ are the true children of God. Although Israel as a whole has rejected Christ, God continues to preserve a remnant of true believers within Israel by His grace.\n\nAt the same time, Paul reaffirms God's election of the nation of Israel. God has not rejected Israel. The nation of Israel continues to have a role in God's salvation plan. The spiritual hardening that has come upon Israel because of her rejection of Christ is only temporary and partial. When the full number of the Gentiles has come in, \"all Israel shall be saved\" [v. 26]. There will be a future restoration of the nation of Israel, both spiritual and geographical. God will fulfil His promises to Israel and restore her to her homeland. God will also take away her spiritual hardness, and Israel as a whole will come to a saving faith in Christ.\n\nWe do not know precisely when and how the conversion of Israel's hardened majority will take place. God's wisdom and ways are deep and unsearchable. But what is clear is that the same compassion and kindness of God lies behind His dealings with Israel and His dealings with the church. God mercifully gave salvation to both Jews and the Gentiles even though none deserve it. Knowing this ought to move us to praise and worship Him, and give Him all the glory for our salvation.",
        "part6": "THOUGHT",
        "part7": "For I know the thoughts that I think toward you, saith the LORD, thoughts of peace, and not of evil, to give you an expected end. - Jeremiah 29:11",
        "part8": [
            "1 SAMUEL 16",
            "ROMANS 16"
        ]
    },
    "27 AUGUST": {
        "part1": "Romans 11:2",
        "part2": "The people God foreknew",
        "part3": "VERSE 2",
        "part4": "God hath not cast away his people which he foreknew. Wot ye not what the scripture saith of Elias? how he maketh intercession to God against Israel, saying,",
        "part5": "The fact that Paul, an Israelite, believed God showed that Israel was not completely lost. The people God foreknew refers here to those among the children of Israel who followed Him. God had chosen Israel in love when they were few in number.\n\n\"The LORD did not set his love upon you, nor choose you, because ye were more in number than any people; for ye were the fewest of all people\" [Deuternomy 7:7].\n\nGod prospered Jacob and his family from a group of 70 going down to Egypt to become a great multitude. He preserved them through Egyptian slavery, sent His servant Moses with His message, delivered them by His hand from the military superpower of their day, fed them and provided for them, protected and guided them in the wilderness, and brought them to the verge of entering the promised land of Canaan. He had taught them His ways, His character, and how to worship Him. The people were disobedient in not trusting the God who chose them. Their rebellion resulted in them wandering in the wilderness wandering for 40 years, and the death of all who were 20 years and older except for Joshua and Caleb. Through the course of their history, they persecuted and even killed Jehovah's prophets sent in love, for they rejected the LORD Himself.\n\nDespite this, God did not totally reject them, as there were in their midst some whom God had chosen to save. These are the foreknown people of God, to whom He binds Himself in a covenant He will not break. His will is to save His foreknown to be a special people set apart for His praise and glory. [Deuteronomy 7:6; 1 Peter 2:9].",
        "part6": "THOUGHT",
        "part7": "Heavenly Father forgive us for our rebelliousness, unfaithfulness and being stiff-necked. We praise You for Your mercy in not rejecting us and Your grace in saving us for You have foreknown us to be saved in Your Son our Lord Jesus Christ.",
        "part8": [
            "1 SAMUEL 17",
            "1 CORINTHIANS 1"
        ]
    },
    "28 AUGUST": {
        "part1": "Romans 11:2",
        "part2": "Elijah's prayer against Israel",
        "part3": "VERSE 2",
        "part4": "God hath not cast away his people which he foreknew. Wot ye not what the scripture saith of Elias? how he maketh intercession to God against Israel, saying,",
        "part5": "Paul refers to the historic event when Elijah face-off against the prophets of Baal at Mount Carmel in a contest [1 Kings 18]. From morning till evening, the false prophets prayed to Baal for fire to burn the bullock sacrifice, pleading and cutting themselves in vain. Baal did not respond for he is but a man-made idol. Foolishly, the Israelites had forsaken Jehovah to worship Baal! As proof He is the true LORD God of Israel, and Elijah His prophet, God sent fire from Heaven burning and consuming the water-drenched bullock, wood, stone, earth and water. Obeying Elijah's call, the observing Israelites slew the false prophets by the brook of Kishon. Evil Queen Jezebel hearing of the prophets' end then sent a murderous message to Elijah vowing vengeance for his deeds.\n\nDespite having great faith and courage at Mount Carmel, Elijah fled into the wilderness, despairing and calling on God to take his life. God did not rebuke His servant but sent an angel to provide nourishment, instructing him to rest to gather strength for the journey to Mount Horeb. In response to God asking what he was doing there, Elijah replied: \"I have been very jealous for the LORD God of hosts: for the children of Israel have forsaken thy covenant, thrown down thine altars, and slain thy prophets with the sword; and I, even I only, am left; and they seek my life, to take it away.\" [1 Kings 19:10,14]. Elijah was utterly discouraged and despairing of Israel's idolatry. Being \"jealous for God\" here is to be very fervent, zealous, and careful in protecting the glory of God's name. He had been faithful to God but felt alone in this. This drove him to the point of depression and desiring God to take his life.",
        "part6": "THOUGHT",
        "part7": "Obey them that have the rule over you, and submit yourselves: for they watch for your souls, as they that must give account, that they may do it with joy, and not with grief: for that is unprofitable for you. - Hebrews 13:17",
        "part8": [
            "1 SAMUEL 18",
            "1 CORINTHIANS 2"
        ]
    },
    "29 AUGUST": {
        "part1": "Romans 11:2-3",
        "part2": "Imprecatory Prayer",
        "part3": "VERSES 2-3",
        "part4": "God hath not cast away his people which he foreknew. Wot ye not what the scripture saith of Elias? how he maketh intercession to God against Israel, saying, Lord, they have killed thy prophets, and digged down thine altars; and I am left alone, and they seek my life.",
        "part5": "Elijah cried out for God to hold the children of Israel accountable for forsaking Him, destroying the worship altars, and killing His messengers. Elijah had a zeal for God because of who He is and what He had done for His covenant people, and yet they had forsaken Him. Elijah was zealous for God's glory. Are you?\n\n\"Ye shall not go after other gods, of the gods of the people which are round about you; (For the LORD thy God is a jealous God among you) lest the anger of the LORD thy God be kindled against thee, and destroy thee from off the face of the earth\" [Deuteronomy 6:14-15].\n\nImprecatory prayer invokes curses and punishment by God upon His enemies. It is not for selfish vengeful purposes of the servant of God for being wronged personally. Imprecatory psalms [Psalms 7, 35, 55, 58, 69, 109 and 139] called on God to judge His enemies and protect His people, emphasizing His holiness, purity, abhorrence of evil, whilst submitting to His sovereign wisdom and will. The one who prays conducts self-examination before God, acknowledges their position as His servant, calling on Him to be true to His promise to protect His people for His name's sake. There is no wilful, selfish desire for personal vengeance nor trying to manipulate God for one's own ends.\n\n\"The LORD shall judge the people: judge me, O LORD, according to my righteousness, and according to mine integrity that is in me. Oh let the wickedness of the wicked come to an end; but establish the just: for the righteous God trieth the hearts and reins.\" [Psalm 7:8-9]",
        "part6": "THOUGHT",
        "part7": "\"For the zeal of thine house hath eaten me up; and the reproaches of them that reproached thee are fallen upon me.\" Psalm 69:9 is the basis for imprecatory prayer.",
        "part8": [
            "1 SAMUEL 19",
            "1 CORINTHIANS 3"
        ]
    },
    "30 AUGUST": {
        "part1": "Romans 11:4",
        "part2": "God's Answer",
        "part3": "VERSE 4",
        "part4": "But what saith the answer of God unto him? I have reserved to myself seven thousand men, who have not bowed the knee to the image of Baal.",
        "part5": "God had sent an angel to provide food and water to strengthen Elijah, and command rest before the journey to Mount Horeb (a forty-day journey). There God showed His power by the gale-force winds which broke the mountainside, an earthquake and fire, all whilst preserving Elijah in the midst of these natural wonders wrought by His mighty hand, even though God was not in these. When all that was past, God spoke in a still small voice to Elijah, and he went to the mouth of the cave [1 Kings 19].\n\nHe instructed His servant to anoint Hazael king over Syria; Jehu king over Israel; and Elisha to be prophet in Elijah's place. They would continue God's work.\n\nGod reveals to His faithful but discouraged prophet there were seven thousand men unbeknownst to Elijah who were still faithful to Jehovah. God did not mollycoddle the prophet but revealed Himself, strengthened him to do His work, and gave further instructions how to carry it out. God personally answering Elijah showed he was loved, and that was encouragement and reassurance in itself. The content of this personal message revealed that he was not alone (as he thought) and that God had preserved a remnant for Himself. Further instructions removed doubt and gave direction to the ailing prophet.\n\nGod's answer was not only encouragement to Elijah but to us if we are discouraged in His service. The LORD God of Israel is working His purposes even when we cannot see it. God is continuing to watch over His people in times of discouragement and trouble. He will never forsake us and He continues to bless His work in His way and time, to the glory of His name. We are to faithfully obey.",
        "part6": "THOUGHT",
        "part7": "Blessed is the man whose strength is in thee; in whose heart are the ways of them. They go from strength to strength, every one of them in Zion appeareth before God. - Psalm 84:5, 7",
        "part8": [
            "1 SAMUEL 20",
            "1 CORINTHIANS 4"
        ]
    },
    "31 AUGUST": {
        "part1": "Romans 11:5",
        "part2": "God's Remnant",
        "part3": "VERSE 5",
        "part4": "Even so then at this present time also there is a remnant according to the election of grace.",
        "part5": "The remnant is foreknown by God, and who are preserved by Him for they were elected by His grace. God will always preserve a remnant for Himself. Throughout God's Word, we see the examples of Noah and his family in the ark preserved [Genesis 6] when the living world was destroyed; the seven thousand faithful apart from Elijah [1 Kings 19] when the nation apostatized, and God bringing back exiles from the Babylonian captivity [Ezra 2] according to His promise [Isaiah 6:13], amongst many others. As it was in the time of Elijah, and of Paul's writing, it is so even today as you read this.\n\n\"Who is a God like unto thee, that pardoneth iniquity, and passeth by the transgression of the remnant of his heritage? he retaineth not his anger for ever, because he delighteth in mercy.\" [Micah 7:18]\n\n\"Remnant\" implies a small number out of a larger group. The faithful remnant of the nation of Israel worshipped Jehovah as the LORD God of Israel in the days of Elijah. They did so for they were chosen and sustained by God's grace.\n\nApart from many who reject the good news of salvation in the Lord Jesus Christ the only begotten Son of God, there will always be those who believe, and call on His name in repentance for their sins. This remnant is elected of God's grace. These constitute the spiritual Israel, the true Church of God, and include Israelites as well as Gentiles.\n\n\"And it shall come to pass, that whosoever shall call on the name of the LORD shall be delivered: for in mount Zion and in Jerusalem shall be deliverance, as the LORD hath said, and in the remnant whom the LORD shall call.\" [Joel 2:32]",
        "part6": "THOUGHT",
        "part7": "And I will gather the remnant of my flock out of all countries whither I have driven them, and will bring them again to their folds; and they shall be fruitful and increase. - Jeremiah 23:3",
        "part8": [
            "1 SAMUEL 21-22",
            "1 CORINTHIANS 5"
        ]
    },
    "1 SEPTEMBER": {
        "part1": "Romans 11:6",
        "part2": "What is Grace?",
        "part3": "VERSE 6",
        "part4": "",
        "part5": "I",
        "part6": "THOUGHT",
        "part7": "And if by grace, then is it no more of works: otherwise grace is no more grace. But if it be of works, then is it no more grace: otherwise work is no more work.  THOUGHT  f a debt has been fully repaid, there is nothing further to be settled. If you have a debt of one hundred dollars and your brother repays it and presents you with a receipt for the full amount, you have no more obligation to your creditor. The debt has been fully satisfied. No part of it can thereafter be charged against you. If the Lord Jesus Christ paid for the full guilt of our sins, there is no guilt left to be paid for in any other way. Repentance does not pay for sin, baptism does not, neither does any other religious act pay for sin. What a wonderful picture that God acts towards us according to what is entirely found within His own divine nature of love. When God chose the Israelites to be His people in Deuteronomy 7:8 it was not based on their strength, intellect, character, or their achievements, but \"because the LORD loved (them).\" Neither does God look down the corridors of time to see how we would respond to the call of faith in Jesus Christ as that would suggest something originating from us (our response) is the determinant of our salvation. It is all of God's grace; His unmerited favour bestowed upon unworthy sinners. At the cross, our sins were put upon Jesus Christ as if He had committed those sins, and His righteousness was put upon us as if we had lived His life, so that we might be presented blameless in the sight of God.  Dear God, please help me to release any claim of self-righteousness, and rest completely on Your grace alone.",
        "part8": [
            "1 SAMUEL 23",
            "1 CORINTHIANS 6"
        ]
    },
    "2 SEPTEMBER": {
        "part1": "Romans 11:6",
        "part2": "Grace or Works?",
        "part3": "VERSE 6",
        "part4": "",
        "part5": "T",
        "part6": "THOUGHT",
        "part7": "And if by grace, then is it no more of works: otherwise grace is no more grace. But if it be of works, then is it no more grace: otherwise work is no more work.  THOUGHT  he word \"works\" refers to anything that human beings do. If we could by our works secure God's blessing, then grace would \"no more\" be grace. For grace demands that God be perfectly free to bestow His favour on whomever He chooses. But if God's election were based on what we do, His freedom would be violated, and He would no longer be acting in grace. We must strive to keep grace gracious. Paul affirms that God has called a remnant [v. 5] in his present time; however, this remnant has come into being as the result of God's gracious election. It is not due to Israel's intrinsic merit or their achievement in obeying the law. Jews are no different from Gentiles on this point: only by God's gracious intervention can they be transformed from sinners doomed to die into righteous people destined for eternal life. Because salvation is by grace, works have no part in it. The whole idea of works is that man can provide a basis to force God to give him some blessing as just reward for what he has done. The whole idea of grace is that God acts toward man entirely according to that which is found within His own divine nature of love. The two ideas are mutually exclusive and destroy each other when put together. May this remind us that our upbringing, our merits, and our righteousness does nothing to tip the scales to earn the undeserved mercy of God.  Not by works of righteousness which we have done, but according to his mercy he saved us, by the washing of regeneration, and renewing of the Holy Ghost. - Titus 3:5",
        "part8": [
            "1 SAMUEL 24",
            "1 CORINTHIANS 7"
        ]
    },
    "3 SEPTEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 6 and sovereignly preserved in the faith. God has",
        "part4": "",
        "part5": "P",
        "part6": "",
        "part7": "And if by grace, then is it no more of works: otherwise grace is no more grace. But if it be of works, then is it no more grace: otherwise work is no more work.  THOUGHT  aul's argument leaves no room for work-based salvation. Anything less than grace alone sneaks human works in through the back door. From start to finish, from election to conversion to heaven, salvation is by God's grace alone. Salvation is based solely on God's gracious love and mercy, not on the basis of a human decision or human works. By grace, believers are sovereignly drawn to the faith, and sovereignly preserved in the faith. God has accomplished everything that is necessary for the believer's salvation. What this means is that salvation is personal. God chose those whom He would call. Man had no part in it. If Christ purchased a sinner's salvation based on his action or choice, then man's work is injected into the equation. Rather, salvation is for a particular people whom God sovereignly chose on the basis of His grace alone. And because it is by grace alone, believers can only attribute all praise and glory to God. When salvation is of the Lord and not from anything within us, the only possible response is to fall on our knees before God in humble adoration and awe at His eternal purpose. We cry out with thankful hearts the words of the hymn writer Charles Wesley, \"How can it be that thou, my God, should die for me?\"  But no man can be thoroughly humbled until he knows that his salvation is utterly beyond his own powers, devices, endeavours, will, and works, and depends entirely on the choice, will, and work of another, namely, of God alone ... then he has come close to grace, and can be saved. - Martin Luther",
        "part8": [
            "1 SAMUEL 25",
            "1 CORINTHIANS 8",
            "THOUGHT But no man can be thoroughly humbled until he",
            "knows that his salvation is utterly beyond his own",
            "powers, devices, endeavours, will, and works, and",
            "depends entirely on the choice, will, and work of",
            "another, namely, of God alone ... then he has",
            "come close to grace, and can be saved.",
            "-- Martin Luther"
        ]
    },
    "4 SEPTEMBER": {
        "part1": "Romans 11:7",
        "part2": "The Blind",
        "part3": "VERSE 7",
        "part4": "",
        "part5": "\"",
        "part6": "THOUGHT",
        "part7": "What then? Israel hath not obtained that which he seeketh for; but the election hath obtained it, and the rest were blinded.  THOUGHT  I once was lost, but now I'm found, was blind but now I see.\" When John Newton penned the words of the hymn \"Amazing Grace\", he was describing himself. Likewise, Paul describes a blindness of those who were not chosen by God. The word \"blinded\" in the original language is the word for \"hardened\", meaning to \"cover with a thick skin\". Just as Pharaoh's heart was hardened, so too are the hearts of those who are not elected. Out of their spiritual blindness and the hardness of their hearts, these people tried to seek righteousness and life by the works of the law. Be assured when you read about God \"hardening hearts\", the Bible is not saying God arbitrarily and maliciously makes men unbelievers. The non-elect - those who are hardened - are not passed over because they are worse. And the elect are not chosen because they are better. Otherwise, grace would not be grace. However, we do know that God is the implied agent of the hardening so that there is a spiritual insensitivity that prevents people from responding to God and His message of salvation. The result of God's hardening permanently binds people in the sin they have chosen for themselves. The only solution is for God to take that stony heart and give us a heart of flesh [Ezekiel 36:26].  Let us be thankful that God has removed the veil from our eyes so that we can see who He is and understand what He has written to us.",
        "part8": [
            "1 SAMUEL 26",
            "1 CORINTHIANS 9"
        ]
    },
    "5 SEPTEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 8 Although the Israelites witnessed the hand of God",
        "part4": "",
        "part5": "I",
        "part6": "",
        "part7": "(According as it is written, God hath given them the spirit of slumber, eyes that they should not see, and ears that they should not hear;) unto this day.  PRAYER  t is difficult to wake a person who is in deep sleep. Physically, they are dulled to any force that touches them externally. Paul here describes a person who is in spiritual deep sleep and dull and insensitive to God's many miraculous acts of grace; hence, not seeing and hearing. And Paul draws upon Old Testament texts by conflating Deuteronomy 29:4 and Isaiah 29:10 which comments on Israel's failure to recognize God's work among them. Although the Israelites witnessed the hand of God against Pharoah in their exodus from Egypt, they never appreciated its full significance. Paul also draws upon a passage in which Isaiah spoke of the spiritual blindness and perversity of Israel. This is the state of the world we live in. Unbelievers lie in a deep sleep and see not what is before them; they sleep and hear not the Gospel that is preached all over the earth. We too must be careful not to fall into a condition of moral dullness and apathy. Much prayer is required to ask that our eyes and hearts be open to know both the grace of God and the God of grace who is very much active in the present day. When we become tolerant of sin, distracted by the allures of the world, and self-dependent on our strength, this will cause us to become insensitive to God's providence and sovereignty in our lives.  God, open up my eyes that I may trust you, love you, treasure you, and humble me to see your gracious acts each and every day. Amen.",
        "part8": [
            "1 SAMUEL 27",
            "1 CORINTHIANS 10",
            "PRAYER God, open up my eyes that I may trust you, love",
            "you, treasure you, and humble me to see your",
            "gracious acts each and every day. Amen."
        ]
    },
    "6 SEPTEMBER": {
        "part1": "Romans 11:9",
        "part2": "Trap, Snare and Stumbling Block",
        "part3": "VERSE 9",
        "part4": "",
        "part5": "P",
        "part6": "THOUGHT",
        "part7": "And David saith, Let their table be made a snare, and a trap, and a stumblingblock, and a recompence unto them:  THOUGHT  aul here quotes from Psalm 69:22-23. Importantly, David prays in verse 22 that \"that which should have been for their welfare, let it become a trap.\" This is an important statement for us to reflect on. Often, Christians tend to think of ourselves as people who do not indulge in sins that are very grievous. We may not be the type of people who steal, kill or commit adultery. The Jews Paul talks about in Romans 11 possessed a similar mindset - having a semblance of piety that they believed restrained them from committing grievous sin. Like these Jews, Christians often overlook the fact that neutral things in our lives can also become stumbling blocks and occasions for sin. Let us realize that while God in His goodness has provided us many blessings to enjoy, such as food, leisure activities, and companionship, these things He gives for our well-being cannot and must not take His place in our hearts. Often, we become preoccupied with leisure activities such that we lie to ourselves that we do not have time to serve God. Even worse, it seems we seek our own pleasure and enjoyment in the lawful things of this world more than we seek to do God's will in serving Him and desiring a closer relationship with Him. Let us not deceive ourselves. It is idolatry in a subtle form when the lawful things God has given us to enjoy become snares, turning us away from Him.  You must therefore zealously guard in his mind the curious assumption 'My time is my own'. Let him have the feeling that he starts each day as the lawful possessor of twenty-four hours ... What he must never be permitted to doubt is that the total from which these deductions have been made was, in some mysterious sense, his own personal birthright. - C. S. Lewis in Screwtape Letters",
        "part8": [
            "1 SAMUEL 28",
            "1 CORINTHIANS 11"
        ]
    },
    "7 SEPTEMBER": {
        "part1": "Romans 11:10",
        "part2": "Darkened Eyes",
        "part3": "VERSE 10",
        "part4": "",
        "part5": "I",
        "part6": "THOUGHT",
        "part7": "Let their eyes be darkened, that they may not see, and bow down their back alway.  THOUGHT  n citing this verse, Paul is explaining that the reason the Jews rejected Christ and were so persistent in disbelieving He was the Messiah was because God had blinded their spiritual eyes, as foretold long ago by David. Paul's observation should cause us to respond in thankfulness. For just as God had been the one who blinded the eyes of the Jews, He is also the one who opened our spiritual eyes, that we may recognize and call Christ our Lord and Saviour. Now that we are able to receive, understand, and accept the things of God, let us also examine how we are exercising these gifts. In Isaiah 53:2-3 we are told how the spiritually blind are unable to see any beauty in Christ. Furthermore, we read how Isaiah prophesied that Christ would be despised and rejected because of the Jews' spiritual blindness. Do we see beauty in God's \"things\"? What does worshipping God in the beauty of holiness [Psalm 29:2; 96:9] mean to us? Do we delight in communal worship and fellowship with likeminded brethren or are we constantly dragging our feet to church? What is our attitude in our daily lives? Let us be sensitive to the manifold blessings of God, even for the many things we often take for granted. There is beauty in each sunrise, and there is God's mercy and grace received every time we return home safely.  Nevertheless he left not himself without witness, in that he did good, and gave us rain from heaven, and fruitful seasons, filling our hearts with food and gladness. - Acts 14:17",
        "part8": [
            "1 SAMUEL 29-30",
            "1 CORINTHIANS 12"
        ]
    },
    "8 SEPTEMBER": {
        "part1": "Romans 11:11",
        "part2": "Jews Fall for Gentiles Salvation",
        "part3": "VERSE 11",
        "part4": "",
        "part5": "G",
        "part6": "THOUGHT",
        "part7": "I say then, Have they stumbled that they should fall? God forbid: but rather through their fall salvation is come unto the Gentiles, for to provoke them to jealousy.  THOUGHT  od moves in mysterious ways. Many times, His purposes and intents are beyond mortal comprehension, and it is presumptuous for us to think we can understand Him fully. Here, however, God's inspired Word gives us some insight into why God caused the Jew's eyes to be blinded in unbelief. It was not so that the Jews would be permanently and eternally punished - God did not intend their stumbling to lead to their ultimate fall. Rather, God allowed them to stumble as a means of extending His grace to Gentiles. In some ways, this was a fitting comeuppance for the Jews who had long believed they were culturally superior to those around them because they were Abraham's descendants. In their pride, God allowed them to fall, choosing instead to save the humble and meek. From our perspective, however, this is wholly an act of grace towards us. Let us be humble and thankful for God's mercy extended to us. Furthermore, praise and thank Him that in His sovereign salvation plan, He has chosen to do away with the rituals and rites that were a large part of Jewish culture. Now we have free access to His throne of grace. However, let us also be sober, realizing that even though God has revealed His grace and enabled us to know Him as the Lord and Saviour, there are still many who do not know Him.  Then saith he unto his disciples, The harvest truly is plenteous, but the labourers are few. - Matthew 9:37",
        "part8": [
            "1 SAMUEL 31",
            "1 CORINTHIANS 13"
        ]
    },
    "9 SEPTEMBER": {
        "part1": "Romans 11:11",
        "part2": "Provoked Through Jealousy",
        "part3": "VERSE 11",
        "part4": "",
        "part5": "I",
        "part6": "THOUGHT",
        "part7": "I say then, Have they stumbled that they should fall? God forbid: but rather through their fall salvation is come unto the Gentiles, for to provoke them to jealousy.  THOUGHT  n God's perfect plan, He has also deemed it fit to use weak creatures such as you and I to accomplish His purposes. Paul tells us plainly that it is part of God's will for the salvation of the Gentiles to provoke the Jews to jealousy. This means that as the Jews witness the Christian life, they should be developing a sense of loss as they become more aware of God's favour shining on His people. As the Jews witness an increase in fervour for and service to God among the Christians, God intends for the Jews to begin to see how they have been outstripped by those they previously condemned as godless people in the practice of religion. Through this comparison, God intends for the Jews to grow in awareness of what they have lost by rejecting Christ as the Messiah, and for many of them to ultimately return to Him in repentance by the saving knowledge of who He is. As part of God's plan for the salvation of the Jews, are we demonstrating such a holy zeal for God and His work as some of the Jews ostensibly did in their mistaken beliefs of keeping their Law, rites and rituals for their salvation? Secularism is increasingly the norm in all cultures and societies. There is an increase in the number of people who are cultural Jews but not religious. In Christian circles, we too see a growth in \"secular Christianity\" where many identify themselves as Christian but do not display any evidence of the Spirit working in them. Let us aim to do well that others may see Christ in us and be pointed to Him.  And let us not be weary in well doing: for in due season we shall reap, if we faint not. - Galatians 6:9",
        "part8": [
            "2 SAMUEL 1",
            "1 CORINTHIANS 14"
        ]
    },
    "10 SEPTEMBER": {
        "part1": "Romans 11:12",
        "part2": "Divine Riches for Poor Gentiles",
        "part3": "VERSE 12",
        "part4": "",
        "part5": "P",
        "part6": "THOUGHT",
        "part7": "Now if the fall of them be the riches of the world, and the diminishing of them the riches of the Gentiles; how much more their fulness?  THOUGHT  aul presents further encouragement for Gentiles to display a Christian life worthy of the Jews' envy. If the rejection of the Jews had resulted in spiritual gain for many Gentiles all over the world, Paul here wants to emphasise that an increase in Jewish faith in Christ will bring an abundance of grace and benefit to all of Christianity. Paul states this in order to pre-empt any argument that if God had used the falling away of the Jews to result in the conversion of the Gentiles, then God might allow the conversion of the Jews to likewise result in the falling away of the Gentiles. To outrightly put this thought to rest, Paul relates how the conversion of Jews will benefit all non-Jewish believers. Let us not forget the work of early Jewish Christians in spreading the Gospel. It was the Jewish Christians who were instrumental in the development of the early church and ensuring the Gospel was preached to many Gentile nations. The twelve apostles of Christ, Paul, Barnabas and other early missionaries were all zealous Jews who were willing to serve God to the point of death. Just as these early missionaries had a love for God and His people such that they were able to overcome cultural differences and preach to those different from themselves, we too should be willing to spread the Gospel beyond those familiar to us. Their conversion will be a great blessing to the church.  Who do I shy away from sharing my faith with?",
        "part8": [
            "2 SAMUEL 2",
            "1 CORINTHIANS 15"
        ]
    },
    "11 SEPTEMBER": {
        "part1": "Romans 11:13",
        "part2": "Apostle of the Gentiles",
        "part3": "VERSE 13",
        "part4": "",
        "part5": "P",
        "part6": "THOUGHT",
        "part7": "For I speak to you Gentiles, inasmuch as I am the apostle of the Gentiles, I magnify mine office.  THOUGHT  aul called himself the apostle of the Gentiles, and indeed he is so because he was chosen by God to bring the Gospel from Jerusalem to Asia Minor, and eventually to Europe after receiving the Macedonian call [Acts 16:9-10], a call which he had responded to \"immediately\". Paul was ready to take the Gospel to faraway lands and places which were predominantly Gentile. This may be because he was born outside Jerusalem, in the city of Tarsus. But his willingness to venture far afield was more likely because of the Lord's explicit command to him. When Paul's life took a 180-degree turn on the road to Damascus, he was blinded for three days, and God summoned Ananias to comfort him. Ananias, knowing how Paul (Saul) had persecuted Christians, was at first reluctant to go, \"But the Lord said unto him, Go thy way: for he is a chosen vessel unto me, to bear my name before the Gentiles, and kings, and the children of Israel: For I will shew him how great things he must suffer for my name's sake\" [Acts 9:15-16]. The same charge might have been given to Paul when he spent three years with the Lord in Arabia [Galatians 1:11-20] before his public ministry began. The sovereign God has already ordained everything before they happen, and in His own good time, everything falls into place. God works mysteriously yet we can trust that everything will work together for good to those who love Him, to those who are the called according to His purpose. Pray for God to show you the way you can serve in His kingdom, and having identified it, put in your best for His glory. Press on! There are many devices in a man's heart; nevertheless the counsel of the LORD, that shall stand. - Proverbs 19:21",
        "part8": [
            "2 SAMUEL 3",
            "1 CORINTHIANS 16"
        ]
    },
    "12 SEPTEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 13 not serve out of obligation, but with a cheerful",
        "part4": "",
        "part5": "\"",
        "part6": "",
        "part7": "For I speak to you Gentiles, inasmuch as I am the apostle of the Gentiles, I magnify mine office:  THOUGHT  Magnify\" is the word doxazo, from which we get doxa or \"glory\". Paul held his ministry in high esteem and honour, seeking to glorify God through it. He was called to be the apostle to the Gentiles and was faithful to this calling. Paul sought to magnify the Lord in the ministry entrusted to him. This should be our attitude when we serve Christ. We should be pro-active because it is a great privilege to be serving the almighty God. Let us not serve out of obligation, but with a cheerful heart, always thinking how we can further magnify His name. God has also called us to our different vocations. Christian ministry is not restricted to full-time service, neither is it only the things we do in church that matter. Everyone of us has a role to play in our family, school or workplace. By living and doing well for God, we magnify His name wherever He has put us. More often than not, our family is our greatest ministry opportunity for it is on our loved ones we have the greatest impact. The best example we have is the Lord Jesus. In His high-priestly prayer before going to the cross, He prayed to His Father, \"I have glorified thee on the earth: I have finished the work which thou gavest me to do. And now, O Father, glorify thou me with thine own self with the glory which I had with thee before the world was. I have manifested thy name unto the men which thou gavest me out of the world: thine they were, and thou gavest them me; and they have kept thy word.\" [John 17:4-6]  Magnify the Lord with me, Blessed Lamb of Calvary. For His grace so rich and free, O magnify the Lord with me.",
        "part8": []
    },
    "13 SEPTEMBER": {
        "part1": "Romans 11:14",
        "part2": "Provoked to the Gospel",
        "part3": "VERSE 14",
        "part4": "",
        "part5": "P",
        "part6": "THOUGHT",
        "part7": "If by any means I may provoke to emulation them which are my flesh, and might save some of them.  THOUGHT  aul invokes the idea of jealousy here. This idea is carried forward from verse 11. By the fall of the Jewish nation, salvation has come to the Gentiles. That salvation blessing which would begin with the Jews was first stated in Genesis 12:3 and it required them to acknowledge Jesus of Nazareth as their Messiah and become God's witness to all nations. Their failure and rejection resulted in God giving the privileges and promises to the Gentiles. But this failure is temporary. Paul knows this and has a great desire to save his own people. This message is relevant today because of false teachings that have permeated Christianity. We need to consider this verse in relation to Christians who had once believed in the true Gospel of Christ but now reject it to follow some other heretical teaching. As Jude says in his epistle, we must save them by bringing them the truth, pulling them out of the fire, with a hatred for the defilement of these false teachings [Jude 23]. We need to have this jealousy for truth with a spiritual zeal to bring the Gospel back to those who have gone astray. When we see someone fallen overboard and struggling in deep waters, would we not throw them a lifebuoy? Life is precious when we realize the eventual judgement and death awaiting those who once believed but have now gone astray.  If thou forbear to deliver them that are drawn unto death, and those that are ready to be slain; If thou sayest, Behold, we knew it not; doth not he that pondereth the heart consider it? and he that keepeth thy soul, doth not he know it? - Proverbs 24:11-12",
        "part8": [
            "2 SAMUEL 6",
            "2 CORINTHIANS 2"
        ]
    },
    "14 SEPTEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 15 behind the workings of an AED (automated",
        "part4": "",
        "part5": "P",
        "part6": "",
        "part7": "For if the casting away of them be the reconciling of the world, what shall the receiving of them be, but life from the dead?\"  THOUGHT  aul once again uses jealousy to provoke thoughts of everlasting life. The value of life and the fight to save life can be seen when we consider the history of the medical practice of resuscitation. Modern medical advancements in CPR (cardiopulmonary resuscitation) and defibrillation improve the survival rate of cardiac arrest. Yet the statistics involving this medical advancement show otherwise. In theory, the physics behind the workings of an AED (automated external defibrillator) guarantees 100% revival of the heart. But successful revival outcomes in hospitals are only 43% and outside of hospitals a mere 4% (www.aedusa.com). These numbers tell us the difficulty of bringing physiological life back from the dead. What about spiritual death? When Paul talks about life from the dead he is speaking about the Gospel of Christ. Unlike the AED, our Lord guarantees spiritual awakening and everlasting life. The apostle could declare, \"O death, where is thy sting? O grave where is thy victory?\" [1 Corinthians 15:55] The key word in today's verse is \"reconciling\". Who rejoices greatly in reconciliation? Is it God or man? The parable of the prodigal son informs that God and the heavenly host rejoice over every soul saved and reconciled with Him [Luke 15:10-32]. Charles Spurgeon viewed God as being in the business of new beginnings. He said, \"You are a great sinner, but he is a greater Saviour.\" Paul wants to bring this awareness to the Jews. In the same manner we should offer the Gospel to all to make them aware. But if the Spirit of him that raised up Jesus from the dead dwell in you, he that raised up Christ from the dead shall also quicken your mortal bodies by his Spirit that dwelleth in you. - Romans 8:11",
        "part8": []
    },
    "15 SEPTEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 16 Pharaoh made them slaves until God delivered",
        "part4": "",
        "part5": "J",
        "part6": "",
        "part7": "For if the firstfruit be holy, the lump is also holy: and if the root be holy, so are the branches.  PRAYER  acob's name (meaning \"supplanter\") was changed to Israel (or \"prince of God\") after his unexpected encounter with the Lord God of Abraham and Isaac. God promised to make of him a nation and multiply his seed as the sand of the sea which cannot be numbered, a promise first made to Abraham. Israel went down to Egypt and the Hebrews multiplied greatly to the dismay and fear of the Egyptians. To suppress and subjugate them, Pharaoh made them slaves until God delivered them with mighty signs and wonders through Moses and Aaron. Moses led them through the wilderness to the promised land. \"This is he, that was in the church in the wilderness with the angel which spake to him in the mount Sina, and with our fathers: who received the lively oracles to give unto us\" [Acts 7:38]. By church here is meant a \"called out group or people\". \"And ye shall be unto me a kingdom of priests, and an holy nation\" [Exodus 19:6]. \"And the heathen shall know that I the LORD do sanctify Israel, when my sanctuary shall be in the midst of them for evermore\" [Ezekiel 37:28]. The Church universal now is \"a chosen generation, a royal priesthood, an holy nation, a peculiar people; that ye should shew forth the praises of him who hath called you out of darkness into his marvellous light\" [1 Peter 2:9]. We who are part of the universal Church of Christ are to walk worthy of His holy name and our holy and heavenly calling, for He has said, \"be ye holy, for I am holy\" enabled by His sanctifying grace which is all sufficient for us. Lord God, help me to be holy, for You are holy.",
        "part8": [
            "2 SAMUEL 8-9",
            "2 CORINTHIANS 4",
            "PRAYER Lord God, help me to be holy, for You are holy."
        ]
    },
    "16 SEPTEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 16 The firstfruit was regarded as the first produce",
        "part4": "",
        "part5": "T",
        "part6": "",
        "part7": "For if the firstfruit be holy, the lump is also holy: and if the root be holy, so are the branches.  THOUGHT  he writer uses two metaphors to illustrate God's people throughout Israel's history. He first quoted from the book of Numbers 15:18-21. The firstling of grain or fruit, separated from the whole harvest, was presented as an offering to God as a representation of their thankfulness to and dependence on Him. This was the general practice with all harvested crops. The firstfruit was regarded as the first produce of the land and until this was offered to God in thanksgiving, it was not lawful to partake of the harvest. The reference here is to the small portion of dough or kneaded meal that was offered to God while the remainder was for the use of the offeror. The firstfruit offered to God represented the whole harvest. The writer reasons that believers in the Old and New Testament are inextricably intertwined, same in nature and calling, a holy people, consecrated to God for sacred use. All enjoy the same benefits but differ in their gifts, service-calling and spiritual maturity. While the Old Testament saints' faith in God was exercised mainly through the various sacrifices and offerings, which were the types and pictures of what was to come, Christ has finished the work on the cross. He is the Lamb of God that takes away the sins of the world, sanctifying the believer and making him holy unto God. Christ is the manifestation and perfection of the figures in the Old Testament. The knowledge of the Gospel is made complete in Him [Hebrews 11:40].  For there is no difference between the Jew and the Greek: for the same Lord over all is rich unto all that call upon him. - Romans 10:12",
        "part8": []
    },
    "17 SEPTEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 16 which God promised to the patriarchs came upon",
        "part4": "",
        "part5": "T",
        "part6": "",
        "part7": "For if the firstfruit be holy, the lump is also holy: and if the root be holy, so are the branches.  THOUGHT  he two metaphors used by Paul point to the same truth. The second metaphor of a growing tree illustrates the people of God in the dispensation of time, beginning with the patriarchs - Abraham, Isaac and Jacob, then Israel as a nation. The patriarchs are the roots of the tree and their posterity are the branches. The roots supplied the nutrients to the branches. The covenant blessings which God promised to the patriarchs came upon their seed, as the chosen race. The Jews took pride in their privileged relation as descendants of the patriarchs with whom God made the covenant [John 8:33, 39] despite not walking in God's way as their forefathers did. They were a chosen nation but often marked by unbelief, apostasy, and tragically, the rejection of Christ and the Gospel. Yet according to God's electing grace, He has always preserved to Himself a faithful remnant. It is said that the New Testament is in the Old Testament concealed, and the Old Testament is in the New Testament revealed, and it is crystal clear that from generation to generation, it is the just who live by faith. This promise was first made to Abraham [Genesis 17:47], and Galatians 3:6-9, 14 expounds it excellently to show that Abraham is the father of all who are spiritually faithful. \"Know ye therefore that they which are of faith (in Christ), the same are the children of Abraham. And if ye be Christ's, then are ye Abraham's seed, and heirs according to the promise.\" [Galatians 3:7, 29]. Let us therefore walk as Abraham walked, a model example for us, the father of the faithful, and a friend of God. That ye would walk worthy of God, who hath called you unto his kingdom and glory. - 1 Thessalonians 2:12",
        "part8": []
    },
    "18 SEPTEMBER": {
        "part1": "Romans 11:17",
        "part2": "Wild Olive Tree",
        "part3": "VERSE 17",
        "part4": "",
        "part5": "T",
        "part6": "THOUGHT",
        "part7": "And if some of the branches be broken off, and thou, being a wild olive tree, wert graffed in among them, and with them partakest of the root and fatness of the olive tree.  THOUGHT  he great ancient people of God was likened to an olive tree, whose roots, trunk and branches were Jewish in nature but when the Israel rejected Christ their Saviour and crucified Him and persecuted the Christians, the Gospel went out and was extended to the Gentile world, fulfilling the great commission given by Christ Himself after His resurrection. The Jew's loss was the Gentile's gain. The Gospel the Jews rejected, the Gentiles embraced. The Gospel found its foothold in the Gentile world so \"that the blessing of Abraham might come on the Gentiles through Jesus Christ; that we might receive the promise of the Spirit through faith\" [Galatians 3:14]. The unbelieving Gentile world is likened to a wild olive tree, unprofitable to God, but when they believed in Christ, they were added to God's great family. The unbelieving Jews were like branches broken off from the olive tree and believing Gentiles, the branches of a wild olive tree, grafted into the good tree, receiving the covenant blessings promised to the Jewish forefathers. Yet in this great family of God, \"there is neither Greek nor Jew, circumcision nor uncircumcision, Barbarian, Scythian, bond nor free: but Christ is all, and in all\" [Colossians 3:11]. What wonder! That the precious and priceless Gospel, given freely, which things the angels desire to look into, first to the Jewish nation, was despised and rejected; and to us non-Jews, undeserving and undone, should be embraced and treasured. I know not why God's wondrous grace To me He hath made known, Nor why, unworthy, Christ in love Redeemed me for His own. But I know whom I have believed, And am persuaded that He is able To keep that which I've committed Unto Him against that day. - D. W. Whittle",
        "part8": [
            "2 SAMUEL 12",
            "2 CORINTHIANS 7"
        ]
    },
    "19 SEPTEMBER": {
        "part1": "Romans 11:17",
        "part2": "Spiritual Grafting",
        "part3": "VERSE 17",
        "part4": "",
        "part5": "T",
        "part6": "THOUGHT",
        "part7": "And if some of the branches be broken off, and thou, being a wild olive tree, wert graffed in among them, and with them partakest of the root and fatness of the olive tree.  THOUGHT  he unbelieving Jews were like branches broken off from a good olive tree and the believing Gentiles (broken branches from a wild olive tree) grafted in. This is an illustration from the horticultural technique of cutting a young shoot of a tree and joining it into another, thus enabling it to receive nutrients from the new tree. The ingrafted shoot grows and brings forth fruits after the new tree, not according to the tree it was taken out of. The wild olive tree is uncultivated and therefore wild and unprofitable. The unregenerated are unprofitable to God and therefore to be cast away. But when they are grafted into the cultivated olive tree whose husbandman is God, it receives all the goodness and blessing under His watchful and loving care. How are we grafted in? God the husbandman grafts us in, for we are just helpless branches from a wild olive tree. He gave us faith in Christ under the sound of the Gospel, for faith comes by hearing, and hearing by the Word of God. The Holy Spirit then reproves (convicts) us of sin, of righteousness, and of judgment to come. He then quickens (makes alive) us and leads us to seek refuge, safety, security, and salvation in the Lord Jesus Christ. Upon believing, He baptizes us into the great family of God. The faith that worked effectually in the Jews, works the same in us Gentiles, turning us to faith in Christ and trusting Him as Saviour and Lord of our lives.  Therefore if any man be in Christ, he is a new creature: old things are passed away; behold, all things are become new. - 2 Corinthians 5:17",
        "part8": [
            "2 SAMUEL 13",
            "2 CORINTHIANS 8"
        ]
    },
    "20 SEPTEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 18 to remind them that they should not boast against",
        "part4": "",
        "part5": "I",
        "part6": "",
        "part7": "Boast not against the branches. But if thou boast, thou bearest not the root, but the root thee.  THOUGHT  n Romans 11:17, Paul described how the Gentiles were like the branches cut from the wild olive tree and grafted onto a good tree, whose own branches were broken off. They became partakers of the root and the fatness of the cultivated olive tree. Thus, Gentiles could receive the grace and mercy of the Lord Jesus Christ, through the working by the Holy Spirit in their hearts, and adopted into the family of God. However, Paul continues in verse 18 to remind them that they should not boast against the branches (that were broken off). Why? Because one's salvation is not by one's own strength, but it is God who chooses to save. It is a reminder to all of us, Jew and Gentile, that election is of God, and not by the works of man's hands [Ephesians 2:8-9]. What does this then mean for Christians? We should walk humbly with God [Micah 6:8] knowing that we bear the name of Christ in our daily lives. Our salvation is not a trophy we put on display to feed our pride. Rather, it is to be our answer to any man that asks the reason of the hope that is in us [1 Peter 3:15]. Beware the sin of pride. It was pride which brought down the devil, who exalted himself above God [Isaiah 14:13-14]. The world looks at our conduct as Christians, and judges us accordingly. We cannot win others to Christ if we have pride in our hearts.  And you, being dead in your sins and the uncircumcision of your flesh, hath he quickened together with him, having forgiven you all trespasses. - Colossians 2:13",
        "part8": [
            "2 SAMUEL 14",
            "2 CORINTHIANS 9",
            "THOUGHT And you, being dead in your sins and the",
            "uncircumcision of your flesh, hath he quickened",
            "together with him, having forgtven you all",
            "trespasses. -- Colossians 2:13"
        ]
    },
    "21 SEPTEMBER": {
        "part1": "Romans 11:19",
        "part2": "Grafted in",
        "part3": "VERSE 19",
        "part4": "",
        "part5": "I",
        "part6": "THOUGHT",
        "part7": "Thou wilt say then, The branches were broken off, that I might be graffed in.  THOUGHT  n horticulture, farmers employ the technique of grafting to join together two different plants for beneficial results. In grafting, parts such as a bud or a stem are taken from a plant and joined together with another plant such that the nutrients from the main plant nourishes the part that is grafted in. In this way, the new branch grows and yields desirable characteristics such as better fruits or flowers. One of the reasons for grafting may be that the grafted plant has weak roots, and this procedure provides a strong root-stock to sustain the fruit-bearing or flower-producing part of the desired plant. This is a good analogy for the Christian believers and Romans 11:19 uses this analogy to describe the relationship between Christ and the believer. Christ being the root, and the believer the branches thereof. In the process of grafting, some of the original branches are broken off, so that the new branch can be grafted in its place. In Jesus' parable in Matthew 22, the original wedding guests refused to attend the wedding celebrations. Therefore, the king bid his servants to invite as many as they could find from the highways and byways to attend the wedding dinner instead. Similarly, when the Jews refused the preaching of the Gospel, Paul brought it to the Gentiles instead. Let us rejoice, therefore, that the Gospel was made available to all. Just like the plants, we are all grafted into the root which is Jesus Christ, so let us draw our strength from Him.  But now in Christ Jesus ye who sometimes were far off are made nigh by the blood of Christ. - Ephesians 2:13.",
        "part8": [
            "2 SAMUEL 15",
            "2 CORINTHIANS 10"
        ]
    },
    "22 SEPTEMBER": {
        "part1": "Romans 11:20",
        "part2": "The danger of unbelief",
        "part3": "VERSE 20",
        "part4": "",
        "part5": "I",
        "part6": "THOUGHT",
        "part7": "Well; because of unbelief they were broken off, and thou standest by faith. Be not highminded, but fear.  THOUGHT  n Romans 11:20, Paul noted that those (Jews) who were broken off the root were broken off because of unbelief. The Scriptures contain many accounts of unbelief, both in the Old and New Testament. Because of unbelief, the children of Israel made themselves an idol of a golden calf to worship, instead of worshipping the one true God; because of unbelief, they wandered in the wilderness for forty years; because of unbelief, Achan took for himself the spoils of war against God's command. So, what is unbelief ? Biblical unbelief is not trusting in the one true and living God and everything that He has revealed to us in His Holy Scriptures. A Christian believes the Bible to be God-breathed, and therefore the only reliable source of truth that man has about God; he believes what the Bible says about man's sinful condition, our eternal destination and His plan to reconcile us back to Him. A believer, therefore, realises the danger his soul faces because of his sinful condition, and this leads to trust and obedience in God's commandments. On the contrary, unbelief leads to a life of disobedience, of living in blatant disregard of the fact that there is an eternity in hell awaiting the unbelieving soul. Have you considered your heart today and search it to see if there is unbelief lurking within? Know that the danger of unbelief is real, and you can only be reconciled to God by believing in Jesus Christ, who died for your sins.  Take heed, brethren, lest there be in any of you an evil heart of unbelief, in departing from the living God. - Hebrews 3:12",
        "part8": [
            "2 SAMUEL 16",
            "2 CORINTHIANS 11"
        ]
    },
    "23 SEPTEMBER": {
        "part1": "Romans 11:20",
        "part2": "Be not highminded",
        "part3": "VERSE 20",
        "part4": "",
        "part5": "I",
        "part6": "THOUGHT",
        "part7": "... Be not highminded, but fear.  THOUGHT  n Romans 11:18, Paul reminded his readers not to boast against the branches. In verse 20, he again admonished the Gentiles not to be high-minded or arrogant. The fact that they were \"grafted\" into the faith, does not give them the license to be arrogant, but rather, as Paul says, they should fear, lest God spare them not also [v. 21]. Essentially, Paul is telling the Gentiles not to think too highly of themselves. They were saved not because of anything they had done, nor was it because of any goodness God sees in them. It is only by God's grace they were saved. In his letter to the Philippians, Paul told his flock to \"work out your own salvation with fear and trembling. For it is God which worketh in you both to will and to do of His good pleasure\" [Philippians 2:12-13]. Indeed, our faith and the salvation we have been given is not a status symbol. We are saved to be servants of the Most High God. Having been redeemed from our sins through the atoning death of Christ on the cross, our lives are now His, and we should spend the rest of it in His service and ministering to His flock, in whichever area He has called us to serve. Dear readers, are you living today to serve your Lord? \"And whatsoever ye do, do it heartily, as to the Lord, and not unto men; Knowing that of the Lord ye shall receive the reward of the inheritance: for ye serve the Lord Christ.\" [Colossians 3:23-24]  And whosoever of you will be the chiefest, shall be servant of all. For even the Son of man came not to be ministered unto, but to minister, and to give his life a ransom for many. - Mark 10:44-45",
        "part8": [
            "2 SAMUEL 17",
            "2 CORINTHIANS 12"
        ]
    },
    "24 SEPTEMBER": {
        "part1": "Romans 11:20",
        "part2": "Standing by Faith",
        "part3": "VERSE 20",
        "part4": "",
        "part5": "P",
        "part6": "THOUGHT",
        "part7": "Well; because of unbelief they were broken off, and thou standest by faith. Be not highminded, but fear.  THOUGHT  aul reminded his readers that while those who rejected the Gospel of Christ were broken off because of their unbelief, those who were received into God's family do so by faith. We recall from Hebrews 11:1 that faith is the \"substance of things hoped for, the evidence of things not seen\". This verse alludes specifically to God's promises for the believer - his eternal life in heaven with the Lord Jesus Christ. Truly, the ultimate promise the Bible gives the believer is the everlasting life that he will spend with his Lord. It is fitting analogy then that, because of unbelief, those who reject Christ do not have the hope of eternity with Him and they are cast off. In their place, those who believe in the promises of Christ are saved and redeemed by virtue of their faith in those promises. This faith in Christ also means that the believer can trust in the grace of God to see them through any trials and temptations in this present life because he is in Christ's hands and nothing can pluck him out of His hands [John 10:28]. Rejoice, therefore, Christians, because we stand by faith in the promises of God. Promises of life in heaven with Him, as well as the blessedness of knowing that He will sustain us with His grace as we sojourn here on earth. No matter what trials we may be undergoing, cling to the blessed truth that no man can pluck us out of His hands.  My sheep hear my voice, and I know them, and they follow me: And I give unto them eternal life; and they shall never perish, neither shall any man pluck them out of my hand. - John 10:27-28",
        "part8": [
            "2 SAMUEL 18",
            "2 CORINTHIANS 13"
        ]
    },
    "25 SEPTEMBER": {
        "part1": "Romans 11:21",
        "part2": "Take Heed",
        "part3": "VERSE 21",
        "part4": "",
        "part5": "P",
        "part6": "THOUGHT",
        "part7": "For if God spared not the natural branches, take heed lest he also spare not thee.  THOUGHT  aul warns the Gentiles sternly against spiritual presumption because God's impeccable justice applies to Jews and Gentiles alike. The Jews were the natural branches who received the blessings of the promises of God to Abraham and David, yet they were not spared. What ruined them was taking for granted the dignity they had obtained, despising God's grace. Paul therefore declares to the Gentiles that if they become arrogant, they too will not be spared. We cannot forget that God, in His kindness, grafted in wild Gentile branches. For Christ is the \"true vine\", and \"as the branch cannot bear fruit of itself, except it abide in the vine; no more can ye, except ye abide in me\" [John 15:1-5]. While we have received the benefit of God's promises through receiving Jesus Christ, we stand only by faith. What then shall be done to us, who are outsiders, if we become arrogant? We should never think of the rejection of the Jews without being struck with dread and terror that the same may happen to us. Whether Jew or Gentile, it is fatally easy to assume that all is well with our souls, when we are actually perishing. There is nothing more precious today than the state of our souls. Have you given way to unbelief ? Is Christ your solid rock in life and your hope? Today, \"give diligence to make your calling and election sure\" [2 Peter 1:10]. Today, \"work out your own salvation with fear and trembling\" [Philippians 2:12]. Today, \"take heed lest he also spare not thee\".  The wise man built his house upon the rock. And the rains came down and the floods came up. And the house on the rock stood firm.",
        "part8": [
            "2 SAMUEL 19",
            "GALATIANS 1"
        ]
    },
    "26 SEPTEMBER": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 22 not consumed, because his compassions fail not\"",
        "part4": "",
        "part5": "T",
        "part6": "",
        "part7": "Behold therefore the goodness and severity of God: on them which fell, severity; but toward thee, goodness, if thou continue in his goodness: otherwise thou also shalt be cut off.  THOUGHT  o \"behold\" a matter is not to briefly acknowledge it or skim through it. It has the connotation of looking intently, taking note of and appreciating the thing's significance. Consider how God withholds His wrath daily, and graciously gives us a new morning. When we stumble and sin, is it not a wonder that we are not instantly destroyed in His righteous judgment? It is marvellous when we realize that \"it is of the Lord's mercies that we are not consumed, because his compassions fail not\" [Lamentations 3:22]. When Moses beheld how God is \"merciful and gracious, longsuffering, and abundant in goodness and truth, keeping mercy for thousands, forgiving iniquity and transgression and sin,\" he responded by falling down in worship [Exodus 34:6-8]. Moses worshipped in awestruck wonder. God's goodness is beyond our understanding and description. God loved people even in their sins, and He gave Himself up for their deliverance. And still He waits in longsuffering patience upon man's repentance, not willing that any should perish, but desiring the salvation of all. The incomprehensible, radical goodness of God is meant to lead us to repentance [Romans 2:4]. Do we, like Moses, fall down in worship when we think of His goodness? Meditate on the Word which is God-breathed and profitable for doctrine [2 Timothy 3:16]. Recognise the Bible as words from God to us and live by them. Give diligence to make our calling and election sure [2 Peter 1:10].  In tenderness He sought me, Weary and sick with sin, And on His shoulders brought me, Into His flock again. - W. Spencer Walton",
        "part8": []
    },
    "27 SEPTEMBER": {
        "part1": "Romans 11:22",
        "part2": "The Severity of God",
        "part3": "VERSE 22",
        "part4": "",
        "part5": "T",
        "part6": "THOUGHT",
        "part7": "Behold therefore the goodness and severity of God: on them which fell, severity; but toward thee, goodness, if thou continue in his goodness: otherwise thou also shalt be cut off.  THOUGHT  he word \"severity\" is apotomia, which literally means \"sharpness\" or \"steepness\" and could be translated as \"harshness\" or \"sternness\". Most translations use \"severity,\" perhaps an apt wordplay between \"severe\" and \"sever\". Indeed, the severity of God would result in the cutting off of disobedient people from His lovingkindness. It brings out the consequences of going against the true and living God. However, the context of this verse is not personal salvation. Rather, God is speaking to the Jews and Gentiles as two groups of people, and the fellowship they could have with God. Because of the hard-heartedness of the Jews, the Gospel was opened to the Gentiles. God then warns the Gentiles that if they prove to be as unteachable, they shall also be cut off; they will face the same severity as the Jews. This is not to say that our God is a passive God who reacts to our responses to the Gospel. Our sovereign God is outside time but has chosen to work within it. Outside time, God sees everything in an instant - past, present, and future. Yet God, when relating to us who live in time, reveals things in a way we can understand. In God's sovereign plan, the ends of the Jews and the Gentiles have already been ordained. God's instruction is clearly made known in the Gospel to all, both Jews and Gentiles: the severity of God points to separation and judgment, but the goodness of God shows us salvation and righteousness. But all is not lost, for verse 23 will tell us, God is able to graft in the branches that were pruned. While there is still time, trust in the Lord Jesus and be saved. The Lord is not slack concerning his promise, as some men count slackness; but is longsuffering to us-ward, not willing that any should perish, but that all should come to repentance. - 2 Peter 3:9",
        "part8": [
            "2 SAMUEL 21",
            "GALATIANS 3"
        ]
    },
    "28 SEPTEMBER": {
        "part1": "Romans 11:23",
        "part2": "God is Able",
        "part3": "VERSE 23",
        "part4": "",
        "part5": "T",
        "part6": "THOUGHT",
        "part7": "And they also, if they abide not still in unbelief, shall be graffed in: for God is able to graff them in again.  THOUGHT  he Jews occupy a special place in God's plan. The historical account of the Old Testament is largely a chronicle of Jewish history. God the Son was born a Jew when He first came to this world. Yet like all sinful men in this fallen world, the Jews stood against God when they rejected the Messiah. Paul used the analogy of a branch cut off from a tree to show the broken fellowship between them and God. Because of their disobedience, the Gospel of Christ was given to the Gentiles. What will happen to the Jews then? Today's verse tells us there is still hope of salvation for this precious group of people. If they do not remain in unbelief, God is able to graft them back to the tree. Grafting is a technique in botany where a cutaway branch is bound to a living tree, and receiving nutrients and water from it, grow and bear fruit. God's desiderative will is for every man, Jew and Gentile, to know Him and to be saved. The mercy He showered upon Gentiles could provoke the Jews to also believe in Him. If they were to repent and trust in Jesus, it is akin to the branch once cut off and bound for burning, to be given life again. Our omnipotent God is able to do that. Just as He was able to give life to the dry bones in the valley [Ezekiel 37:1-14], He is able to give life to all who are dead in sin and trespasses. All praise and glory will be to God for the branch cannot rejoin itself to the tree on its own accord. The gracious God has to hold it and bind it to the tree.  For I am not ashamed of the gospel of Christ: for it is the power of God unto salvation to every one that believeth; to the Jew first, and also to the Greek. For therein is the righteousness of God revealed from faith to faith: as it is written, The just shall live by faith. - Romans 1:16-17",
        "part8": [
            "2 SAMUEL 22",
            "GALATIANS 4"
        ]
    },
    "29 SEPTEMBER": {
        "part1": "Romans 11:24",
        "part2": "Wild by Nature",
        "part3": "VERSE 24",
        "part4": "",
        "part5": "W",
        "part6": "THOUGHT",
        "part7": "For if thou wert cut out of the olive tree which is wild by nature, and wert graffed contrary to nature into a good olive tree: how much more shall these, which be the natural branches, be graffed into their own olive tree?  THOUGHT  hen you see a beautifully manicured plant you can be sure someone has shaped it. By the laws of nature, plants grow wild. New shoots will grow towards unblocked space, and the branches will eventually look messy. If you do not tend to your garden, plants will soon grow wild, and it will turn into an unrecognizable plot. The tasty fruits we buy are not harvested from the wild because wild free-growing trees bear little good fruits. In this verse, God uses the olive tree as an example and lesson for the Jews as well as Gentiles. Like the olive tree, man is also by nature wild. We will do things that are right in our own eyes. We will do what we like regardless of whether it hurts others or offends God. We are not interested to look for God or to please Him. In fact, we are often hostile towards Him. Selfishly, we want to please ourselves. We are unfruitful. We see in the Bible that man rebelled against God. Adam ate the fruit despite God telling him not to. Cain killed his brother Abel for a selfish reason. Disobedient and without God in mind, the people built the tower of Babel to reach the heavens (but it failed miserably). Instead of being grateful, the Israelites complained that the manna (which fell from the sky freely) was boring food. There are many examples for us to learn from, yet man disbelieves God's Word. This is the wild nature of man. Yet in spite of our rebelliousness, God deals with us according to His grace and mercy. He did not write us off. We can only thank God for His love.  Every way of a man is right in his own eyes: but the LORD pondereth the hearts. - Proverbs 21:2",
        "part8": [
            "2 SAMUEL 23",
            "GALATIANS 5"
        ]
    },
    "30 SEPTEMBER": {
        "part1": "Romans 11:24",
        "part2": "Grafted Contrary to Nature",
        "part3": "VERSE 24",
        "part4": "",
        "part5": "G",
        "part6": "THOUGHT",
        "part7": "For if thou wert cut out of the olive tree which is wild by nature, and wert graffed contrary to nature into a good olive tree: how much more shall these, which be the natural branches, be graffed into their own olive tree?  THOUGHT  od has a remedy for the olive tree that grows wild by nature. Like a good farmer, He grafted the wild olive branch to a very good stock, a perfect one you may say. Mankind falls short of God's glory and can never enter heaven. But thanks be to God, we are grafted into Jesus the incorrupt branch and as the new branch takes over, we surrender our will to God. We are no longer wild-willed. We are transformed into a new tree. \"Therefore if any man be in Christ, he is a new creature\" [2 Corinthians 5:17a]. We no longer live according to the dictates of the old self but live a regenerated life. Our priorities change and we become fruitful. We are now joined to the incorruptible tree as the great family of God. We are to bear spiritual fruits since we are transformed and no longer wild. The Bible reminds us to bear the fruit of the Spirit, which is love, joy, peace, longsuffering, gentleness, goodness, faith, meekness, temperance and be a faithful and obedient servant. The grafting of the olive tree is an object lesson. The tree was originally meant for the Jews but they rejected Christ and were cut off. In their place was grafted the wild olive branch (Gentiles like us). Do not despise the Jews or be proud of yourselves for being selected. It is solely by God's grace we were chosen.  For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord. - Romans 6:23",
        "part8": [
            "2 SAMUEL 24",
            "GALATIANS 6"
        ]
    }
}