{
    "30 DECEMBER": {
        "part1": "2 Samuel 24:18-19",
        "part2": "God's instructions for worship",
        "part3": "VERSE 19",
        "part4": "And David, according to the saying of Gad, went up as the LORD commanded.",
        "part5": "Imagine that to honour mother on Mother's Day, you decided to treat her to a meal at a fancy restaurant. It would be selfish if the selection of cuisine was according to your preference and not hers. The same principle applies to our worshipping God. Worship is for God, not man. And God has not left us in the dark as to how we should worship Him, but He has showed us His desire.\n\nThe operative phrase in verse 19 is \"as the LORD commanded\", not as David commanded and not as Gad commanded. The incident of the golden calf exemplifies for us that worship cannot be according to our preferences. Worship that deviates from Scripture is termed as \"strange fire\" [Leviticus 10:1]. God's Word should dictate our worship.\n\nThe \"regulative\" principle of worship is worship that is founded upon the instructions of Scripture. We know from Scripture that worship contains the \"reading, (and) exhortation\" of God's Word [1 Timothy 4:13]; and the singing of \"psalms and hymns and spiritual songs\" [Ephesians 5:19]. Although Scripture is silent on the circumstances of worship (length of time, start time, order of worship etc ...) we should follow the principle given to the church at Corinth that \"all things be done decently and in order\" [1 Corinthians 14:40]. When we worship as God instructed, then our worship will rise as a sweet-smelling savour.",
        "part6": "THOUGHT",
        "part7": "If our whole life is to be lived according to the rule of Scripture, why should our worship be any different?",
        "part8": [
            "2 CHRONICLES 35",
            "REVELATION 21"
        ]
    },
    "31 DECEMBER": {
        "part1": "2 Samuel 24:20-25",
        "part2": "Worship that costs something",
        "part3": "VERSE 24",
        "part4": "And the king said unto Araunah, Nay; but I will surely buy it of thee at a price: neither will I offer burnt offerings unto the LORD my God of that which doth cost me nothing. So David bought the threshingfloor and the oxen for fifty shekels of silver.",
        "part5": "Picture yourself returning home from a restaurant meal with a full belly and leftovers in hand, and you meet a homeless man on the streets. There you sacrifice your leftovers and hand the extra food to him. What did it cost you? Did you suffer hunger because you gave away your leftovers? Did you have to pay extra for the leftovers? No. Your \"sacrifice\" came at no cost. They were mere leftovers.\n\nDavid, however, knew that all genuine sacrifice comes at a price. To offer the Lord burnt offerings that cost him nothing would have been to David a sign of the deepest ingratitude. Although the owner offered them to David for free, he paid for the threshing floor, oxen and wood so that he could build a worthy altar to God. The woman who broke the costly jar of perfume and anointed the Lord Jesus in Mark 14 did so in worshipping Him. The wise men that travelled from afar came bearing valuable gifts of gold, myrrh and frankincense.\n\nIndeed, genuine worship comes at a price. It may require our time and commitment in service. It may require our money for the furtherance of the Gospel work. It may require our gifts and talents in the ministry. Worship is costly and requires our personal sacrifice not because God needs our sacrifice and money but because God is worth it. David worships God because in Him there is forgiveness and mercy in the abatement of the pestilence. Likewise, we worship God because in Him there is eternal life and victory over sin for us at the cross.",
        "part6": "THOUGHT",
        "part7": "What have you \"sacrificed\" in worship?",
        "part8": [
            "2 CHRONICLES 36",
            "REVELATION 22"
        ]
    }
}