{
    "1 JANUARY": "<b><u>1 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:1&version=KJV\">2 Samuel 2:1</a>\n\n<b>LESSON</b>\nTroublesome transition\n\n<b>VERSE 1</b>\n<i>And it came to pass after this, that David inquired of the LORD, saying, Shall I go up into any of the cities of Judah? And the LORD said unto him, Go up. And David said, Whither shall I go up? And he said, Unto Hebron.</i>\n\nWith the deaths of Saul and crown prince Jonathan, David was next in line to be king. He had been anointed by Samuel \"in the midst of his brethren\" [1 Samuel 16:13]. While the LORD had prepared and ordained David to be the next king of Israel, the transition would not be easy. There were Israelites still loyal to Saul. There was going to be prolonged battle between the house of Saul and the house of David [2 Samuel 3:1].\n\nThe civil war would pit brother against brother, friend against friend. There were few who could put aside kinship for the sake of truth. And this resulted in the conflation of political allegiances and personal vengeances. Grievances between individuals became the reason for dissension.\n\nIt would have been less heart-breaking if the fight were taken to the real enemy. But it is tragic when brothers take up arms against one another. But that is how it is also with conflicts within the local church. Parties are formed not on the grounds of truth but on personal friendships.\n\nAre there legitimate reasons to leave a church? Absolutely, when the church has deviated from the Word of God and preaches another Gospel. But more often than not, the source of conflict within the church is selfish ambition. The Corinthian church was divided because there were people who said, \"I am of Paul; and I of Apollos; and I of Cephas; and I of Christ\" [1 Corinthians 1:12]. Factionalism did not arise because of Paul, Apollos, or Cephas. It was the \"I\" that was the cause of the dissension.\n\nAs we begin a new year, let every God-fearing Christian resolve to \"keep the unity of the Spirit in the bond of peace\" [Ephesians 4:3].\n\n<b>THOUGHT</b>\nThou shalt love thy neighbour as thyself. But if ye bite and devour one another, take heed that ye be not consumed one of another. - Galatians 5:14b-15\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 1&version=KJV\">GENESIS 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 1&version=KJV\">MATTHEW 1</a></b>",
    "2 JANUARY": "<b><u>2 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:1&version=KJV\">2 Samuel 2:1</a>\n\n<b>LESSON</b>\nSeeking God's will\n\n<b>VERSE 1</b>\n<i>And it came to pass after this, that David inquired of the LORD, saying, Shall I go up into any of the cities of Judah? And the LORD said unto him, Go up. And David said, Whither shall I go up? And he said, Unto Hebron.</i>\n\nAs a fugitive on the run and leading a group of \"misfits\" [1 Samuel 22:2], things were simpler for David. Survival then was the chief objective. But now that he was thrust into leading a country, the work was more complex. It was no longer living from day to day, having enough to eat and finding a place to rest for the night. Now David had the responsibility to care for his people and to protect them from foreign enemies.\n\nSo, David rightly \"inquired of the LORD\". This has been David's practice before he ascended to the throne and while he was king [1 Samuel 23:2, 4; 2 Samuel 2:1; 5:19, 23; 21:1]. There is no doubt David had a possible course of action in mind. Perhaps he would have been urged to make the move to secure the throne. But David would not rely on his own judgement.\n\nThere were other occasions when David did not inquire of the LORD, as when he fled to Gath and had to feign madness there.\n\nThere is a difference between inquiring and not inquiring of the LORD. The latter is marked by an unsettled hastefulness of spirit accompanied by turmoil and uncertainty. It is like a drowning man grasping at any and every thing. The former is characterised by unhurried poise and quiet restfulness.\n\nThat is what prayer and waiting on the LORD does. It is not inertness; it is active dependence. It is not inaction; it is living faith. David makes no effort to secure the throne other than to \"inquire of the LORD\", and the LORD directed his steps forward.\n\n<b>THOUGHT</b>\nTrust in the LORD with all thine heart; And lean not unto thine own understanding. In all thy ways acknowledge Him, And He shall direct thy paths. - Proverbs 3:5-6\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 2&version=KJV\">GENESIS 2</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 2&version=KJV\">MATTHEW 2</a></b>",
    "3 JANUARY": "<b><u>3 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:2-3&version=KJV\">2 Samuel 2:2-3</a>\n\n<b>LESSON</b>\nHebron\n\n<b>VERSE 3</b>\n<i>And his men that were with him did David bring up, every man with his household: and they dwelt in the cities of Hebron.</i>\n\nDavid had in mind a general direction he should take. He asked the LORD, \"Shall I go up into any of the cities of Judah?\" [2 Samuel 2:1]. It was wise on his part to head toward Judah. It was the tribe he belonged to. It was home. He could be certain of the support of friends and the elders of Judah [1 Samuel 30:26].\n\nWhen David further inquired which of the cities in Judah he should go, the LORD directed him toward Hebron. Formerly known as Kirjatharba [Genesis 23:2], the city of Hebron was situated some thirty kilometres south of Jerusalem. Hebron was well suited to be the temporary capital of David's reign for geographical, historical and sacred reasons. Geographically, Hebron was located in a strong position in the Judean mountains [Joshua 20:7]. David would be among friends there. Historically, Hebron was the place where Abraham bought a burial plot for Sarah [Genesis 23]. Hebron was also the place given to Caleb for an inheritance after he drove out the Anakims [Joshua 14:12-13]. Additionally, Hebron was a city of the priests, and later designated a city of refuge [Joshua 21:13]. The choice of Hebron as the capital would set the right tone to the start of David's reign, and it was the LORD's doing.\n\nDavid's situation is quite similar to Abraham's servant who was tasked to find a wife for Isaac. When he had found Rebekah, the servant prayed, \"I being in the way, the LORD led me ...\" [Genesis 24:27]. David was being in the right way, and the LORD led him exactly, and so will He do the same for you.\n\n<b></b>\nThe path of righteousness is the general direction that believers should take; the exact route is determined by the will of God, and we can be sure that the destination is always glorious.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 3&version=KJV\">GENESIS 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 3&version=KJV\">MATTHEW 3</a></b>",
    "4 JANUARY": "<b><u>4 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:4&version=KJV\">2 Samuel 2:4</a>\n\n<b>LESSON</b>\nDavid's coronation\n\n<b>VERSE 4</b>\n<i>And the men of Judah came, and there they anointed David king over the house of Judah. And they told David, saying, That the men of Jabesh-gilead were they that buried Saul.</i>\n\nThis would be David's second anointing. The first was private, witnessed only by his brothers [1 Samuel 16:13]. The second at Hebron was public. The men of Judah came and anointed David. In so doing, they remembered the last blessings of Jacob upon Judah that \"the sceptre shall not depart from Judah, nor a lawgiver from between his feet\" [Genesis 49:10a].\n\nIn anointing David, the men of Judah were not king-makers; they were not putting the son of Jesse on the throne. The anointing was merely a recognition of the choice of the sovereign God and His will that David should be king after Saul's death.\n\nAnointing is a common Jewish practice of putting oil on the head. It is applied to guests as an act of hospitality [Psalm 23:5; Luke 7:46]; to dead persons [Mark 14:8; 16:1]. Anointing is also done on joyous occasions [Psalm 45:7, 92:10; Ecclesiastes 9:8; Hebrews 1:9], and to cease anointing is a mark of mourning [2 Samuel 14:2; Daniel 10:3; Matthew 6:17].\n\nAnointing as seen in our text is the act of consecration, to render a thing or person fit for holy use [Leviticus 4:3; Exodus 29:29, 30:26]. The high priest and the king are thus called \"the anointed\" [Leviticus 4:3,5,16; 6:20; Psalm 132:10]. The promised Deliverer is twice called the \"Anointed\" or Messiah [Psalm 2:2], and Jesus of Nazareth is this Anointed One [John 1:41; Acts 9:22, 17:2-3, 18:5], the Messiah of the Old Testament.\n\nAnointing is applied also to Christians as being consecrated, set apart for the service of God by the Holy Spirit [2 Corinthians 1:21; 1 John 2:27]. This act spells out our privilege (anointed by God) as well as our responsibility (anointed for God).\n\n<b>THOUGHT</b>\nIf any man have not the Spirit of Christ, he is none of His. - Romans 8:9b\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 4&version=KJV\">GENESIS 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 4&version=KJV\">MATTHEW 4</a></b>",
    "5 JANUARY": "<b><u>5 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:4&version=KJV\">2 Samuel 2:4</a>\n\n<b>LESSON</b>\nThe men of Jabesh-Gilead\n\n<b>VERSE 4</b>\n<i>And the men of Judah came, and there they anointed David king over the house of Judah. And they told David, saying, That the men of Jabesh-gilead were they that buried Saul.</i>\n\nThe first recorded act of David was to commend the men of Jabesh-gilead. They retrieved the mutilated bodies of Saul and his sons, cremated and buried them. The account of what they did is recorded in 1 Samuel 31:11-13.\n\nJabesh-Gilead was situated east of Jordan, located within the territory of the half tribe of Manasseh. The inhabitants of Jabesh-Gilead are first mentioned in connection with their refusal to join the rest of the tribes at Mizpeh in punishing the Benjamites. The entire sordid affair is recorded in Judges 20-21.\n\nThere, some men from Gibeah (which was part of Benjamin) committed a grave atrocity. When the rest of the tribes confronted the Benjamites, they refused to hand over the men of Gibeah who committed the dastardly act. As a result, a civil war ensued. The other tribes also made a vow that they would not allow their daughters to marry Benjamite men which would effectually lead to depletion of the Benjamites. To get out of this vow subsequently, the Israelites massacred the inhabitants of Jabesh- Gilead who had not participated in the war against the Benjamites, sparing only four hundred virgins found there, who were later given to the Benjamite remnant.\n\nThe next mention of Jabesh-Gilead was when Saul delivered them from the Ammonites [1 Samuel 11]. It was in response to this deliverance that the men of Jabesh-Gilead risked their lives to retrieve the bodies of Saul and his three sons from the walls of Beth-shan. David, upon coming to the throne, recognised the virtue of gratitude and commended the inhabitants of Jabesh-Gilead for their act of piety. It has been said that it is wise to have for our friends those who have shown themselves to be grateful and faithful to others.\n\n<b>THOUGHT</b>\nWhen gratitude dies on the altar of a man's heart, that man is well-nigh hopeless. - Bob Jones, Sr.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 5&version=KJV\">GENESIS 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 5&version=KJV\">MATTHEW 5</a></b>",
    "6 JANUARY": "<b><u>6 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:5-6&version=KJV\">2 Samuel 2:5-6</a>\n\n<b>LESSON</b>\nReciprocal kindness\n\n<b>VERSES 5-6</b>\n<i>And David sent messengers unto the men of Jabesh-gilead, and said unto them, Blessed be ye of the LORD, that ye have shewed this kindness unto your lord, even unto Saul, and have buried him. And now the LORD shew kindness and truth unto you: and I also will requite you this kindness, because ye have done this thing.</i>\n\nWhen the men of Jabesh-Gilead retrieved the bodies of Saul and his sons and gave them a proper burial, David could have regarded the actions of these men with suspicion, but he did not. Instead David commended them - a commendation that was well deserved because the men of Jabesh- Gilead returned kindness with kindness; they repaid faithfulness with faithfulness; and their act was one of respect, as John Gill pointed out \"to bury the dead, with the Jews, was always reckoned an instance of humanity and kindness, and indeed of piety; an act done in imitation of God, who buried Moses, and so it might be expected the divine blessing would attend it.\"\n\nThe men of Jabesh-Gilead could have absolved themselves of this reciprocal act of kindness, but they did not. Thus, David not only sent messengers to Jabesh-Gilead with a beatitude - \"Blessed be ye of the LORD, that ye have shewed this kindness unto your lord, even unto Saul, and have buried him\" [2 Samuel 2:5b], but he also took it upon himself to promise kindness to the people of Jabesh-Gilead.\n\nIf David would do that, how much more the greater David, our Lord Jesus. On one occasion, He commended the disciples for feeding Him when He was hungry, giving Him drink when He was thirsty and clothing Him when He was naked. The disciples were incredulous and asked when it was they showed kindness to Him, and Jesus replied, \"Verily I say unto you, Inasmuch as ye did it not to one of the least of these, ye did it not to me\" [Matthew 25:45]. To these are promised life eternal. Kindness merits kindness.\n\n<b>THOUGHT</b>\nBlessed are the merciful: for they shall obtain mercy. - Matthew 5:7\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 6&version=KJV\">GENESIS 6</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 6&version=KJV\">MATTHEW 6</a></b>",
    "7 JANUARY": "<b><u>7 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:7&version=KJV\">2 Samuel 2:7</a>\n\n<b>LESSON</b>\nMoving forward\n\n<b>VERSE 7</b>\n<i>Therefore now let your hands be strengthened, and be ye valiant: for your master Saul is dead, and also the house of Judah have anointed me king over them. MEDITATION</i>\n\nDavid was genuinely moved by what the men at Jabesh-Gilead had done, and his beatitude served both as an expression of his gratitude for their loyalty to Saul as well as a commendation of their noble act and a prayer for God's blessings upon them.\n\nDavid's beatitude was followed by a reminder to them of the change in leadership. David made it clear to the people of Jabesh-Gilead that with the death of Saul, he had been anointed king by the house of Judah [2 Samuel 2:7], and the people had to move on.\n\nDavid did not grovel for the loyalty of the people of Jabesh-Gilead; neither did he pressure them to serve him. David was merely pressing forward, stating to the people delicately but directly that they should accept him as their king. Just as they had been loyal to Saul, so were they to be loyal to David. And just as they had been strong and valiant in following Saul, so ought they similarly to be committed to David.\n\nChanges are often hard to accept, especially changes in leadership. There will always be some who are so enamoured with former leaders that serving the new leaders seem to be an act of betrayal. This feeling is wrong. As the mantle of leadership passes from one generation to another, we must be strong and valiant in our ministry regardless who is at the helm. Our ultimate allegiance must be to Christ.\n\n<b>MEDITATION</b>\nWherefore seeing we also are compassed about with so great a cloud of witnesses ... Looking unto Jesus the author and finisher of our faith. - Hebrews 12:1-2a\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 7&version=KJV\">GENESIS 7</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 7&version=KJV\">MATTHEW 7</a></b>",
    "8 JANUARY": "<b><u>8 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:8&version=KJV\">2 Samuel 2:8</a>\n\n<b>LESSON</b>\nAbner\n\n<b>VERSE 8</b>\n<i>But Abner the son of Ner, captain of Saul's host, took Ish-bosheth the son of Saul, and brought him over to Mahanaim.</i>\n\nNow with Saul gone, Abner, in a power-play, crowned Ish-bosheth, one of Saul's son, king of Israel. There are at least three possible reasons for Abner's move - kinship ties, personal gain, and blind patriotism. First, Ner, Abner's father, was Saul's uncle [1 Samuel 14:50, 20:25, 26:5]. That meant Abner was the cousin of Saul and uncle of Ish-bosheth. The throne must be kept in the house of Saul.\n\nSecond, Abner was a general of Saul's army. If none of Saul's sons succeeded him, Abner's position as general of his army was also at stake - a position that he coveted.\n\nThird, blind loyalty that drove Abner to see his loyalty to the house of Saul as more important than his obedience to the will of God. It has been said that virtues cease to be virtues when they are exercised apart from the Word of God. While Abner's loyalty to his king and his desire to see Saul's house continue were commendable, he failed to follow the higher law and obey the supreme will of God. Abner's error was that he failed to see it was God's will that David would be the next king, and that his loyalty to the throne must be rendered to the man whom God has chosen.\n\nWe are duty bound to love our country. Our Lord Jesus told the disciples that they are to render \"unto Caesar the things which are Caesar's; and unto God the things that are God's\" [Matthew 22:21]. However, Peter saw no contradiction when he told the Sanhedrin, \"We ought to obey God rather than men\" [Acts 5:29]. The reason is that we are bound to obey God and submit to His supreme will.\n\n<b></b>\nWe must exercise our devotion to men within the expressed will of God; if not, it would be a violation of the First Commandment.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 8&version=KJV\">GENESIS 8</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 8&version=KJV\">MATTHEW 8</a></b>",
    "9 JANUARY": "<b><u>9 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:9-11&version=KJV\">2 Samuel 2:9-11</a>\n\n<b>LESSON</b>\nIsh-bosheth -- the puppet king\n\n<b>VERSE 10</b>\n<i>Ish-bosheth Saul's son was forty years old when he began to reign over Israel, and reigned two years. But the house of Judah followed David.</i>\n\nDavid was crowned king of Judah in Hebron; however, his coronation was not well received by those still loyal to Saul. With support for David's reign not firm yet, Abner, the general of Saul's army, took Saul's remaining son and made him king over Gilead.\n\nIsh-bosheth was the fourth and last son of Saul. Three other sons - Jonathan, and Malchi-shua, and Abinadab - were killed in battle together with Saul. At the time of the battle against the Philistines, Ish-bosheth would be in his thirties; that he did not follow his father and brothers into battle was perhaps a sign of his weak physical constitution. His name bears that out as well. Ish-bosheth means \"man of shame\". In 1 Chronicles 8:33, he was originally known as Esh-baal (see also 1 Chronicles 9:39), which also means \"man of Baal\" or \"man of the master\". Baal was replaced with \"Bosheth\" only later when it became associated with the Phoenician deity.\n\nThe personalities of Ish-bosheth, Abner and David are examples of three kinds of people whom we see in political and business domains, and even in Christian circles. Ish-bosheth is the weak one, lacking in character and courage. He is the one who gets to where he is because of his connections. His \"strengths\" are his birth and heritage. Abner is the king-maker. He is the power behind the facade. He is the one who knows how to manipulate others for his own personal profit, and he has no qualms in switching sides as long as it is to his advantage. David is the man whose heart is after God. While he was called and anointed to serve God, he got to where he was from the bottom rung - from shepherd to king. The Judean wilderness was his training ground not just for his kingship but also for his service to God.\n\n<b>THOUGHT</b>\nGod puts us through the fires of tribulation to burn up the dross so that we may shine for Him.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 9&version=KJV\">GENESIS 9</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 9&version=KJV\">MATTHEW 9</a></b>",
    "10 JANUARY": "<b><u>10 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:9-11&version=KJV\">2 Samuel 2:9-11</a>\n\n<b>LESSON</b>\nThe design of man and the appointment of God  VERSES 9-10 And made him Ring over Gilead, and over the Ashurites, and over Jezreel, and over Ephraim, and over Benjamin, and over all Israel. Ish-bosheth Sauls son was forty years old when he began to reign over Israel, and reigned two years. But the house of Judah followed David.  To COMPLETE THE BIBLE\n\n<b></b>\n<i>And made him king over Gilead, and over the Ashurites, and over Jezreel, and over Ephraim, and over Benjamin, and over all Israel. Ish-bosheth Saul's son was forty years old when he began to reign over Israel, and reigned two years. But the house of Judah followed David.</i>\n\nKingship comes by family heredity. Thrones are usually passed from father to son. Thus, when Abner took Ish-bosheth to Mahanaim and made him king over Israel, there is no doubt who the man that wields the power is.\n\nThe reign of Ish-bosheth over Israel, and that of David over Judah is a contrast between the work of the flesh and the work of the Spirit. Ish-bosheth became king by the design and machinations of man. David was king by the sovereign appointment of God. The differences in the outcomes are obvious. Ish-bosheth's two-year reign over Israel was like a flash in the pan. Not only was it transient, it was also inconsequential and ending in utter failure. David ruled a united Israel for forty years [2 Samuel 5:4], and God promised the throne of David's kingdom would be for ever [2 Samuel 7:12-13].\n\nWe must also have an eternal perspective in our service for God. On one occasion, the disciples returned to our Lord Jesus, rejoicing because of their momentary successes, but He said to them, \"Rejoice not, that the spirits are subject unto you; but rather rejoice, because your names are written in heaven\" [Luke 10:20]. On another occasion, they failed, and our Lord reminded them that the work of God \"goeth not out but by prayer and fasting\" [Matthew 17:21]. Thus, we must take heed - as Paul reminds us - how we build, with \"gold, silver, precious stones (or) wood, hay, stubble\" [1 Corinthians 3:10-12]. The means by which we serve God will determine the outcomes of our service. The arms of flesh will not produce lasting results; it is only the Spirit of God that yields everlasting fruit.\n\n<b>THOUGHT</b>\nNot by might, nor by power, but by My Spirit, Saith the LORD of hosts. - Zechariah 4:6b\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 10&version=KJV\">GENESIS 10</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 10&version=KJV\">MATTHEW 10</a></b>",
    "11 JANUARY": "<b><u>11 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b></b>\n<i>And Abner the son of Ner, and the servants of Ish-bosheth the son of Saul, went out from Mahanaim to Gibeon. And Joab the son of Zeruiah, and the servants of David, went out, and met together by the pool of Gibeon: and they sat down, the one on the one side of the pool, and the other on the other side of the pool.</i>\n\nThe meeting of Abner and Joab set off alarm bells of a potential conflict. They were servants to different masters. Abner served Ish-bosheth the son of Saul. Joab served David. Abner, Saul's general, made Ish-bosheth king over all Israel [v. 8]. He knew from experience the many attempts by Saul to destroy David failed because God protected David. He knew it was God's revealed will to transfer the kingdom of Israel from Saul to David, yet he crowned Ish-bosheth. He acted in rebellion against divine will using Ish-bosheth for his self- centred ends. What about Joab? He was David's nephew, the son of Zeruiah. Joab served David, king of Judah as military commander. It was his duty to protect the interests of David. Both men acted with authority of their kings.\n\nThe setting was confrontational. That phrase \"went out\" [v. 12b, 13b] was used \"to go out to war\" [1 Samuel 18:30]. Why did Abner take his men to Gibeon, a city in the territory of Benjamin? While it seemed he wanted to re-establish Saul's former kingdom by garnering support from his tribe, it would also serve his own ends for the people to see him. There across the pool, Abner and Joab faced off drawing their battle lines.\n\nEvery man serves either Christ or Satan. Those who submit to Christ are children of light and those who reject Him are children of darkness serving their self-interests in bondage to Satan. These two are in conflict. If you belong to Christ, heaven is your eternal home. If not, judgement and hell awaits. Turn now to Him and He will set you free from the power of sin to live victoriously for God now and gloriously ever after.\n\n<b></b>\nFor ye were sometimes darkness, but now are ye light in the Lord: walk as children of light. - Ephesians 5:8\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "12 JANUARY": "<b><u>12 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:14-17&version=KJV\">2 Samuel 2:14-17</a>\n\n<b>LESSON</b>\nHelkathhazzurim\n\n<b>VERSE 16</b>\n<i>And they caught every one his fellow by the head, and thrust his sword in his fellow's side; so they fell down together: wherefore that place was called Helkathhazzurim, which is in Gibeon.</i>\n\nThe battle line was set and bloodshed was waiting to happen. Abner the aggressor suggested representative combat between them [v. 14] and his challenge was accepted. \"Then there arose and went over by number twelve of Benjamin, which pertained to Ish-bosheth the son of Saul, and twelve of the servants of David\" [v. 15]. This twelve-on-twelve engagement resulted in the death of twenty-four men so the place where they fell was called \"Helkathhazzurim\" meaning \"field of swords\". There was no victor.\n\nIt was a sad day with meaningless loss of life. Nothing was settled but passions were aroused. It had started with a challenge and it only takes a spark to start a fire. What was the purpose of this duel? On hindsight, Joab suggested that if Abner had not raised the challenge, everyone would have gone home alive in the morning [v. 27]. Abner's motive was self-serving. Emboldened by his crowning of Ish-bosheth, Abner wanted to pit his military might against Joab's.\n\nTo watch twenty-four men killing each other is like \"enjoying\" gladiators killing each other savagely. It fans hatred and cruelty in man's sin-nature. Taking pleasure in such displays only agitates one's personal vendetta against his enemy whether real or imagined. Today you may not be in the arena battling \"gladiators\" but if you think it is alright to enjoy watching revenge killing in its many forms, are you not an accomplice to evil in your heart? May the Lord grant holy discernment in what we watch in social media lest we sin by proxy.\n\n<b>THOUGHT</b>\nHatred stirreth up strifes: but love covereth all sins. - Proverbs 10:12\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 12&version=KJV\">GENESIS 12</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 12&version=KJV\">MATTHEW 12</a></b>",
    "13 JANUARY": "<b><u>13 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 17 God's Word in Proverbs 18:19 forewarns, \"A</b>\n<i>And there was a very sore battle that day; and Abner was beaten, and the men of Israel, before the servants of David.</i>\n\nThe tragedy of \"Helkathhazzurim\" did not decide the winner. Neither did it stop there. The spilling of blood did not solve the purpose of the challenge. Instead it escalated into a fierce battle between their larger forces. Abner and the men of Israel were defeated. A civil war had now started with more loss of lives. Judah lost 20 men and Israel lost three hundred sixty men [v. 30-31].\n\nGod's Word in Proverbs 18:19 forewarns, \"A brother offended is harder to be won than a strong city: and their contentions are like the bars of a castle.\" With hearts driven by rage and vengeance, Judah and Israel were locked in a devastating civil strife with domino effects as we shall see.\n\nOne immediate effect of this civil war was the benefit to their common enemy. You can imagine the reaction of the Philistines - \"Oh, this is great! They are killing each other\". It reminds us to be sober and careful. The enemy of our soul is out to exploit any instance of discord among God's people, to attack and overcome them [1 Peter 5:8]. \"And if a house be divided against itself, that house cannot stand\" [Mark 3:25].\n\nHence, to keep the unity in our relationship with one another that we already have in Christ, we must be right with God in our hearts. \"Let all bitterness, and wrath, and anger, and clamour, and evil speaking, be put away from you, with all malice. And be ye kind one to another, tenderhearted, forgiving one another, even as God for Christ's sake hath forgiven you\" [Ephesians 4:31-32]. The Lord is our Peace.\n\n<b></b>\nThese six things doth the LORD hate: yea, seven are an abomination unto him: a proud look, a lying tongue, and hands that shed innocent blood, an heart that deviseth wicked imaginations, feet that be swift in running to mischief, a false witness that speaketh lies, and he that soweth discord among brethren. - Proverbs 6:16-19\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "14 JANUARY": "<b><u>14 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 18 23:18-19].</b>\n<i>And there were three sons of Zeruiah there, Joab, and Abishai, and Asahel: and Asahel was as light of foot as a wild roe.</i>\n\nJoab, Abishai and Asahel were David's nephews, the sons of his sister Zeruiah. They were mighty warriors. Joab was the army general who would become commander-in-chief [1 Chronicles 11:6]. Abishai was the brave-hearted who accompanied David into Saul's camp when David had the opportunity to kill the envious king [1 Samuel 26:6]. He was honoured as one who single-handedly killed three hundred men with a spear [2 Samuel 23:18-19].\n\nLikewise, Asahel their brother was named among the valiant men of the armies [1 Chronicles 11:26]. Courageous in the face of danger, and likened to the wild gazelle, Asahel was young, strong and swift \"... light of foot as a wild roe\" [2 Samuel 2:18]. It is little wonder that David appointed Asahel captain over the fourth division of the army [1 Chronicles 27:7]. Even at the end of his reign when David recorded a list of mighty men who had been faithful to him when he was a fugitive, 2 Samuel 23:24a tells us he remembered \"Asahel the brother of Joab was one of the thirty\". It is interesting that David omits Joab the elder brother from recognition for reasons given in later chapters.\n\nIt is also notable that Asahel did not disappoint every time he was called to discharge a duty. It speaks of loyalty. He did not waver in accomplishing his mission. This resonated with David's heart of how one should relate to God - with loyalty and faithfulness in service. The vital characteristics of a young man like Asahel would have reminded David how God had used him to destroy Goliath armed only with faith and obedience. May we all, the young and the old, give of our best to serve the Lord our God and Eternal King.\n\n<b></b>\nIf any man serve Me, let him follow Me; and where I am, there shall also My servant be: if any man serve Me, him will My Father honour - John 12:26\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "15 JANUARY": "<b><u>15 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:19-22&version=KJV\">2 Samuel 2:19-22</a>\n\n<b>LESSON</b>\nAbner and Asahel\n\n<b>VERSE 22</b>\n<i>And Abner said again to Asahel, Turn thee aside from following me: wherefore should I smite thee to the ground? how then should I hold up my face to Joab thy brother?</i>\n\nTrue to his character and loyalty, Asahel pursued Abner like a wild gazelle. He did not waver but homed in on his target. Abner looked and affirming it was Asahel warned him to back off or take the life of one of his men for a victory prize instead of risking himself being killed. In spite of the ultimatum Asahel persisted. Again Abner challenged Asahel to consider the anguish of his brother Joab should he be killed. Abner realised the consequences of facing Joab but there was no way out but to save himself by killing his unrelenting pursuer. Here is a lesson \"... they that plow iniquity, and sow wickedness, reap the same\" [Job 4:8b]. We reap what we sow.\n\nWhy did Asahel pursue Abner with such dogged determination? There was no doubt in his mind he could overtake Abner and have him for \"breakfast\". Asahel was not satisfied with killing a lesser soldier as Abner had suggested. He was going for the king-maker of Israel himself and that would be the end of the northern kingdom and David's problem.\n\nOvertaken with a sense of self-glory and recklessness Asahel became blind to his own vulnerability. He persisted in pursuing the goal of a great prize. Imagine the heroic fame he would receive. Here is the lesson - persistence is not a good thing if it is for personal glory. We must realise when we put confidence in ourselves and not in the Lord that we are most susceptible to fall. \"Pride goeth before destruction, and an haughty spirit before a fall\" [Proverbs 16:18].\n\n<b>THOUGHT</b>\nNot unto us, O LORD, not unto us, but unto Thy name give glory, for Thy mercy, and for Thy truth's sake. - Psalm 115:1\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 15&version=KJV\">GENESIS 15</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 15&version=KJV\">MATTHEW 15</a></b>",
    "16 JANUARY": "<b><u>16 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:23-24&version=KJV\">2 Samuel 2:23-24</a>\n\n<b>LESSON</b>\nDeath of Asahel\n\n<b>VERSE 23</b>\n<i>Howbeit he refused to turn aside: wherefore Abner with the hinder end of the spear smote him under the fifth rib, that the spear came out behind him; and he fell down there, and died in the same place. and it came to pass, that as many as came to the place where Asahel fell down and died stood still.</i>\n\nWhat a gruesome end to a valiant venture for David's mighty soldier, Asahel. Known for fleet-footedness, he could outpace Saul's fleeing general but not outfight him. Asahel's insistence on the pursuit, his pride and ambition to gain the trophy of Joab's armour ended badly. And this has been the downfall of many a godly man.\n\nWe are wont to think of pride in such characters as boastful Nebuchadnezzar [Daniel 4:30] or the self-righteous Pharisee [Luke 18:11]. We know it is epitomized by \"the son of the morning\" and \"anointed cherub\" Lucifer [Isaiah 14:12-14; Ezekiel 28:14-15] cast out of heaven on account of his lustful ambition. Even righteous David was not spared, being prompted to number and exult in his military might [2 Samuel 24].\n\nBut how often do we consider the pride that lurks within our hearts, influencing our thoughts and actions? Consider, do we not covet man's commendation more than the praise of God? Do we not desire the prominent seats and the robe of honour? Are we not easily offended by others' words and actions? We yearn for respect and take umbrage when it is not forthcoming. We want things done our way because we know best. Pride in us, in the congregation of God's people, even in the carrying out of His work is alive and well, so be on constant guard to root out this sin and avoid its stumbling.\n\nChrist-likeness is the antidote for pride. \"Let nothing be done through strife or vainglory; but in lowliness of mind let each esteem other better than themselves. Look not every man on his own things, but every man also on the things of others. Let this mind be in you, which was also in Christ Jesus:\"\n\n<b>THOUGHT</b>\nHumble yourselves in the sight of the Lord, and He shall lift you up. - James 4:10\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 16&version=KJV\">GENESIS 16</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 16&version=KJV\">MATTHEW 16</a></b>",
    "17 JANUARY": "<b><u>17 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:25-26&version=KJV\">2 Samuel 2:25-26</a>\n\n<b>LESSON</b>\nTaking sides for war\n\n<b>VERSE 25</b>\n<i>And the children of Benjamin gathered themselves together after Abner, and became one troop, and stood on the top of an hill.</i>\n\nDavid had been anointed king over Judah [v. 4], but Abner had installed Ishbosheth king over the rest of Israel [v. 9] succeeding Saul. This action of Abner made him in effect a powerful kingmaker but it would cost the nation greatly. Israel would be divided and the people forced to take sides. Lives would be lost in the ensuing conflict and God's chosen nation would suffer much anguish. More tragically they would be in rebellion against the expressed and revealed will of their Sovereign LORD. Saul was a Benjamite and the affinity of his tribe was strong. Now fleeing in the face of defeat from the men of Judah, they rallied behind their commander to make a stand.\n\nAs long as we live and interact and work with others, occasions will arise requiring us to take sides. This world we live in is also the domain of its devilish master, the prince of the power of the air, and for sure the Christian pilgrim will often need to choose his side. Moses asked, \"Who is on the Lord's side?\"; Joshua challenged Israel, \"Choose you this day whom ye will serve\"; Elijah's ultimatum was \"if the Lord be God, follow Him: but if Baal, then follow him.\"\n\nThe natural and worldly man may base his decision on considerations of kith and kin, on what is least costly and troublesome, and what is most expedient and advantageous to himself. The redeemed and regenerate man however, must base his choice on what is righteous, God-honouring and in accord with God's Word regardless of the cost, by seeking the Spirit's help in prayer. In so doing, we can be sure we have made a wise choice that is pleasing to our Lord.\n\n<b>THOUGHT</b>\nFear God, not man. Obey Him rather than man. \"...the LORD saith, Be it far from Me; for them that honour Me I will honour, and they that despise Me shall be lightly esteemed.\" [1 Samuel 2:30b]\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 17&version=KJV\">GENESIS 17</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 17&version=KJV\">MATTHEW 17</a></b>",
    "18 JANUARY": "<b><u>18 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:26&version=KJV\">2 Samuel 2:26</a>\n\n<b>LESSON</b>\nThe danger of bitterness\n\n<b>VERSE 26</b>\n<i>Then Abner called to Joab, and said, Shall the sword devour for ever? knowest thou not that it will be bitterness in the latter end? how long shall it be then, ere thou bid the people return from following their brethren?</i>\n\nThis was a struggle between two houses - David's and Saul's; and two wills - man's versus God's. God had willed that David would be king over Israel but the men of Saul's house would not acquiesce. And the conflict would result in death and sorrow in the end if they continued this fight.\n\nOn that point at least, Abner though self-serving in the face of probable defeat, was right. To carry on fighting now between their two factions who were essentially \"brethren\" in God's family, would only claim more lives and cause great bitterness in both.\n\nThis thought is certainly pertinent to us today. Contention is costly. It fractures relationships, fosters strife and destroys unity. The bitterness that ensues will often outlive its cause. Un-dealt with, it poisons our heart, soul and mind. The wounds may heal but its scars remain forever. More sorrowful however is the discord it brings into Christ's body, the undermining of His work and the shame to His name.\n\nInstead, Jesus commands His followers to \"love your enemies, bless them that curse you, do good to them that hate you, and pray for them which despitefully use you, and persecute you.\" Apostle Paul exhorts us to \"let nothing be done through strife or vainglory; but in lowliness of mind let each esteem other better than themselves\". We are to \"do all things heartily, as to the Lord and not unto men,\" because it is God's will for us and we contend with it to our detriment. This is impossible to do in our own strength but with resolve and the Spirit's help, by God's promised grace we will overcome that old nature and our natural tendencies.\n\n<b>THOUGHT</b>\nBitterness defiles! Don't let its roots sink deep. \"Looking diligently lest any man fail of the grace of God; lest any root of bitterness springing up trouble you, and thereby many be defiled.\" [Hebrews 12:15]\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 18&version=KJV\">GENESIS 18</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 18&version=KJV\">MATTHEW 18</a></b>",
    "19 JANUARY": "<b><u>19 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:27-28&version=KJV\">2 Samuel 2:27-28</a>\n\n<b>LESSON</b>\nGood sense prevailed\n\n<b>VERSE 27</b>\n<i>And Joab said, As God liveth, unless thou hadst spoken, surely then in the morning the people had gone up every one from following his brother.</i>\n\nThe Benjamites were beaten and on the run. Now they made ready for a last stand. Many men from both sides were already dead [v. 31] and one of the three heroic brothers Asahel had been killed. The death toll looked set to rise. But Abner calls for a truce. Enough blood had been shed that day. To continue would only inflict more hurt and bitterness for both. Their allegiances were to different kings but they were still brethren after all in the nation of God's people and the Lord Jehovah was their true Sovereign. At that moment, a twinkling of realisation seemed to dawn upon the two opposing commanders for they stayed their hands. Sense prevailed and they parted ways in peace that day.\n\nThis applies well to us in family, in society and in the church. We disagree with our spouse, hurt simmers and eventually both stop talking. A grievance with a friend becomes a quarrel and soon others, even families become embroiled. In church, a difference of personal conviction escalates into conflict as both refuse to budge. Friends take sides, view each other with suspicion and a divide forms. Good sense and objectivity go up in smoke. Bitterness spreads like a cancer and erstwhile friends become enemies as all around are hurt. Christian testimony is wrecked and the brethren stumbled. God's work is hindered and our Lord's name utterly profaned.\n\nChristian, be afraid of grieving your heavenly Father and disgracing the name of Christ you bear. Pray, submit unreservedly to the Holy Spirit's control and so live, not only with good sense but \"God-sense\" always.\n\n<b>THOUGHT</b>\nAnd the fruit of righteousness is sown in peace of them that make peace. - James 3:18\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 19&version=KJV\">GENESIS 19</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 19&version=KJV\">MATTHEW 19</a></b>",
    "20 JANUARY": "<b><u>20 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:29-31&version=KJV\">2 Samuel 2:29-31</a>\n\n<b>LESSON</b>\nLosses on both sides  VERSES 30-31 And Joab returned from following Abner: and when he had gathered all the people together, there lacked of David' servants nineteen men and Asahel. But the servants of David had smitten of Benjamin, and of Abner' men, so that three hundred and threescore men died.  To COMPLETE THE BIBLE\n\n<b></b>\n<i>And Joab returned from following Abner: and when he had gathered all the people together, there lacked of David's servants nineteen men and Asahel. But the servants of David had smitten of Benjamin, and of Abner's men, so that three hundred and threescore men died.</i>\n\nAbner and his men defeated by Joab retreated to the hill Ammah. Unable to escape, he called out to Joab for peace on the grounds that they were all \"brethren\" [2 Samuel 2:26] and that a continuing feud would only cause prolonged bitterness and animosity within the nation. While Joab rightfully chided Abner for being the aggressor, he called off the pursuit. Abner and his men retreated eastwards crossing the Jordan to Mahanaim and Joab returned to Hebron. This conflict had resulted in loss of lives on both sides - three hundred and sixty on Abner's and nineteen and Asahel on Joab's.\n\nThroughout Israel's history, there were wars - some, sanctioned by God as in the conquest of Canaan and some in self-defence against enemies. The internal wars like the great inter-tribal Benjamite war and wars between the Northern and the Southern tribes arose due to the sin of the whole nation forsaking God and His commandments. These were in fact fratricidal wars as brothers of the family of Abraham slaughtered one another.\n\nThe sinful mistakes of Israel's children should remind us that as sinners redeemed by the precious blood of our Lord Jesus, we have become God's children and belong to the same household of faith, united in one body, one Spirit, one Lord, one faith, one God and Father [Ephesians 4:4-6]. We are to forebear (bear with) one another in love [Ephesians 4:2b]. \"Endeavouring to keep the unity of the Spirit in the bond of peace\" [Ephesians 4:3], always bearing a good testimony and shining for the Lord.\n\n<b>THOUGHT</b>\nA new commandment I give unto you, That ye love one another; as I have loved you, that ye also love one another. By this shall all men know that ye are My disciples, if ye have love one to another. - John 13:34-35\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 20&version=KJV\">GENESIS 20</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 20&version=KJV\">MATTHEW 20</a></b>",
    "21 JANUARY": "<b><u>21 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 2:32&version=KJV\">2 Samuel 2:32</a>\n\n<b>LESSON</b>\nBurial of Asahel\n\n<b>VERSE 32</b>\n<i>And they took up Asahel, and buried him in the sepulchre of his father, which was in Bethlehem. And Joab and his men went all night, and they came to Hebron at break of day.</i>\n\nAsahel had been slain by Abner. The loss of a brother would have brought great sorrow to Joab and aroused great anger and hatred toward Abner, the perpetrator of the conflict. Although having the upper hand in the fight and militarily superior, Joab could easily have pressed on and wiped out Abner to avenge the death. But Joab restrained himself, for to push on would mean further bloodshed and loss of lives especially to the Northern soldiers who in obedience to their commander Abner, were innocently drawn into battle. Joab extended mercy to his adversaries. He was cognizant of David's desire to avoid further bloodshed.\n\nIt is inevitable in life that one will experience injustice, unfairness and hurt inflicted by others. The natural man's response is to retaliate and desire revenge. As children of God however, we are rather to exercise temperance [Galatians 5:23], seek the Lord, put our trust in Him [Proverbs 3:5- 6] and submit to His sovereign will. Vengeance has no place in the heart of the redeemed. God's Word through Paul exhorts us \"Dearly beloved, avenge not yourselves, but rather give place unto wrath: for it is written, Vengeance is mine; I will repay, saith the Lord. Be not overcome of evil, but overcome evil with good.\" [Romans 12:19, 21] Any wrong to be made right must only be accomplished through lawful and honourable means. As God's people we are, as much as possible, to \"live peaceably with all men\" [Romans 12:18]. True justice will only come when the One true and Righteous Judge - our Lord Jesus - returns.\n\n<b>THOUGHT</b>\nIt is of the LORD'S mercies that we are not consumed, because His compassions fail not. They are new every morning: great is Thy faithfulness. - Lamentations 3:22-23\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 21&version=KJV\">GENESIS 21</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 21&version=KJV\">MATTHEW 21</a></b>",
    "22 JANUARY": "<b><u>22 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 3:1&version=KJV\">2 Samuel 3:1</a>\n\n<b>LESSON</b>\nCivil war continued\n\n<b>VERSE 1</b>\n<i>Now there was long war between the house of Saul and the house of David: but David waxed stronger and stronger, and the house of Saul waxed weaker and weaker.</i>\n\nAlthough Joab acceded to Abner's appeal to suspend their fight - there was no ensuing peace. Abner retreated to Mahanaim where he continued in his treachery of resisting David's ascent to the throne. Being the most powerful man after Saul's death, he installed Saul's son Ish- bosheth as puppet king over Israel, marshalling the Northern tribes to his side [2 Samuel 2:8-9]. However, his secret ambition for the throne was exposed when Ish-bosheth rebuked him for having taken his father's concubine [2 Samuel 3:7]. Abner's greed prolonged the civil war. The causes of war and strife are often greed, lust, and self-centredness [James 4:1-2] Strife and conflict can result among brethren too if we do not suppress such passions of lust in our hearts for which we need daily to seek God's help. Through the conflict between their two houses, David the man of God manifested godly wisdom to rise above the intrigues, revenge and personal vendettas. He mourned and honoured Saul and Jonathan in their deaths [2 Samuel 1:17-27]. He disavowed himself from the murder of Abner for whom he declared a national mourning [2 Samuel 3:31-33]. As king, he made great efforts to heal the wounds of war and reunite the nation. The northern tribes were won over and finally accepted David's rule over them [2 Samuel 3:36-37]. David's reverence for and submission to God, his sincere character and leadership is exemplary for spiritual leaders. Having risen up from minding sheep and though now the King, he regarded himself as the shepherd of the flock which God had placed under his care - to oversee, feed, protect and guide.\n\n<b>THOUGHT</b>\nThe fear of the LORD is the beginning of wisdom: and the knowledge of the holy is understanding. - Proverbs 9:10\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 22&version=KJV\">GENESIS 22</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 22&version=KJV\">MATTHEW 22</a></b>",
    "23 JANUARY": "<b><u>23 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 2a Coming of Christ. Nothing can change it.</b>\n<i>And unto David were sons born in Hebron...</i>\n\nThe Westminster Shorter Catechism states - Question 7: \"What are the decrees of God?\" Answer: \"The decrees of God are, his eternal purpose (emphasis writer's), according to the counsel of His will, whereby, for His own glory, He hath foreordained whatsoever comes to pass\".\n\nThis is what theologians define as the \"Decretive\" \"Sovereign\" Will of God as in the Creation ordinance and the promised Second Coming of Christ. Nothing can change it.\n\nQuestion 39: \"What is the duty which God requireth of man?\" Answer: \"The duty which God requireth of man (emphasis writer's) is, obedience to His revealed will - which is the Moral Laws embodied in the Ten Commandments\".\n\nTheologians describe this as God's \"Preceptive\", or \"Revealed\" or 'Permissive\" will of God.\n\nWhile God requires man to obey His law, yet He allows him also to exercise his free will, even to sin. The absence of immediate divine judgement does not mean divine sanction of the sin. God's laws cannot change. The Decretive Will and Preceptive Will of God can never be in conflict (Charles Hodge). Polygamy is sin and inevitably brings about unmitigated disaster, heart break and familial disaster. God's Word in the last book of the Old Testament condemns sinful unions and re- asserts the covenantal monogamy as His required norm [Malachi 2:14-15].\n\n<b></b>\nBut be ye doers of the word, and not hearers only, deceiving your own selves. But whoso looketh into the perfect law of liberty, and continueth therein, he being not a forgetful hearer, but a doer of the work, this man shall be blessed in his deed. - James 1:22,25\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 23&version=KJV\">GENESIS 23</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 23&version=KJV\">MATTHEW 23</a>\n<a href=\"https://www.biblegateway.com/passage/?search=THOUGHT But be ye doers of the word, and not hearers only,&version=KJV\">THOUGHT But be ye doers of the word, and not hearers only,</a>\n<a href=\"https://www.biblegateway.com/passage/?search=deceiving your own selves. But whoso looketh into&version=KJV\">deceiving your own selves. But whoso looketh into</a>\n<a href=\"https://www.biblegateway.com/passage/?search=the perfect law of liberty, and continueth therein,&version=KJV\">the perfect law of liberty, and continueth therein,</a>\n<a href=\"https://www.biblegateway.com/passage/?search=he being not a forgetful hearer, but a doer of the&version=KJV\">he being not a forgetful hearer, but a doer of the</a>\n<a href=\"https://www.biblegateway.com/passage/?search=work, this man shall be blessed in his deed.&version=KJV\">work, this man shall be blessed in his deed.</a>\n<a href=\"https://www.biblegateway.com/passage/?search=-- James 1:22,25&version=KJV\">-- James 1:22,25</a></b>",
    "24 JANUARY": "<b><u>24 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 3:2-5&version=KJV\">2 Samuel 3:2-5</a>\n\n<b>LESSON</b>\nDavid's children\n\n<b>VERSE 3</b>\n<i>And his second, Chileab, of Abigail the wife of Nabal the Carmelite; and the third, Absalom the son of Maacah the daughter of Talmai king of Geshur.</i>\n\nScripture records that David had six wives who bore him six sons and one daughter. He obviously went against the commandment of God, for God had instructed man to take only one woman to be his wife [Genesis 2:24; Deuteronomy 17:17]. Having more wives may be a man's selfish boost to his ego to express his power and status.\n\nThe Bible mentions David's polygamy but that does not mean God condones the multiple wives he had. David would later reap the penalty for his sin of going against God's ordinance. Everyone is responsible for his own sins and will eventually face its consequences.\n\nThis was the sad state of David's chaotic household for years to come: Amnon raped his half-sister Tamar. Absalom killed Amnon in revenge for his sister. Later, Absalom attempted to kill David, took over his concubines and started a civil war. Absalom would usurp the throne for a time. Absalom would be killed by David's captain, Joab. Solomon was crowned king but his half- brother Adonijah would scheme to be king instead and was finally executed by Solomon.\n\nWe too are disobedient like David. We may not have many wives like him but we have many idols in our hearts. Our idols are anything that we prioritise over God. This is sin and causes us to fall short of the Glory of God. We are answerable for our sins which destine us to hell. But thank God for salvation through Jesus Christ. He took the punishment on our behalf and redeemed us. He paid for our sins. As a result, those who trust Him as their Saviour are now destined for Heaven instead.\n\n<b>THOUGHT</b>\nBe not deceived; God is not mocked: for whatsoever a man soweth, that shall he also reap. - Galatians 6:7\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 24&version=KJV\">GENESIS 24</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 24&version=KJV\">MATTHEW 24</a></b>",
    "25 JANUARY": "<b><u>25 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 3:6-7&version=KJV\">2 Samuel 3:6-7</a>\n\n<b>LESSON</b>\nAccusation against Abner\n\n<b>VERSE 6</b>\n<i>And it came to pass, while there was war between the house of Saul and the house of David, that Abner made himself strong for the house of Saul.</i>\n\nDespite God having chosen David to be king, one of Saul's sons wanted his father's crown. This led to war between the two families: that of David and Saul. At that time, Abner was the military commander of King Saul. He supported a weak Ish-bosheth's bid to be king, thus becoming the power behind the throne.\n\nIn time, as Abner became stronger and more influential in Saul's house, he took one of Saul's concubines in arrogance to demonstrate his status and influence. Ish-bosheth would not condone that and accused Abner of treason. Saul was dead but the concubine was still his. To take possession of a royal concubine was to imply taking over the king's place.\n\nThe action of Abner taking Saul's concubine can be an object lesson for the church. Scripture refers to the church as the bride and Jesus as our bridegroom. As the bride, we are to be pure. We should not and cannot take others as the bridegroom except Jesus Christ. As in marriage, there are responsibilities a wife (in this case, referring to all believers) has for her husband (Christ). The church as \"wife\" must be faithful to the \"husband\", Jesus Christ. Christians who walk in sin and preach false doctrines [2 John 1:9] are committing spiritual adultery.\n\nWe are to be faithful to Jesus and live according to His Word. We are spiritually married to Him and thus ought to spend time with Him in prayer and reading His Word. Jesus as our spiritual husband will never forsake and will remain forever faithful to us. Thank God for keeping His promise.\n\n<b>THOUGHT</b>\nWhosoever transgresseth, and abideth not in the doctrine of Christ, hath not God. He that abideth in the doctrine of Christ, he hath both the Father and the Son. - 2 John 1:9\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 25&version=KJV\">GENESIS 25</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 25&version=KJV\">MATTHEW 25</a></b>",
    "26 JANUARY": "<b><u>26 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 3:8&version=KJV\">2 Samuel 3:8</a>\n\n<b>LESSON</b>\nAbner's response\n\n<b>VERSE 8</b>\n<i>Then was Abner very wroth for the words of Ish-bosheth, and said, Am I a dog's head, which against Judah do shew kindness this day unto the house of Saul thy father, to his brethren, and to his friends, and have not delivered thee into the hand of David, that thou chargest me to day with a fault concerning this woman?</i>\n\nIsh-bosheth confronted Abner for taking his father's concubine. Perhaps he felt threatened by Abner showing off his power and dominance. Abner was furious at the rebuke and retorted he could have supported David instead. Abner is an example of those who know things to be true, but do not live as if they were true. Many like Abner, are not above committing base sins but are too proud to hear reproof or even bear the suspicion of guilt.\n\nIn an about turn, Abner now pledged his allegiance to David. Abner knew God had chosen David to be king. Abner was right in joining David, but his reason and motivations were wrong. He joined David because he was offended by Ish- bosheth, not because he sought to obey God. While men go on in sin, and apparently without concern, they are often conscious that they are fighting against God. They serve their own purposes; and will betray those who trust them, when they can get any advantage.\n\nOftentimes we are like Abner. We decide what we are going to do for God, instead of submitting to Him by being obedient to what He wants us to do. Pray that we do not follow Abner's example in \"serving\" God with his own selfish interests at heart. Serving God is never about us or personal benefits. We serve Him in response to His love toward us and in obedience to Him. He loved us so much that He sent His Son Jesus to die for us. We serve Him for His Glory not our own. So check your motives in serving Him.\n\n<b>THOUGHT</b>\nHe that followeth after righteousness and mercy findeth life, righteousness, and honour. - Proverb 21:21\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 26&version=KJV\">GENESIS 26</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 26&version=KJV\">MATTHEW 26</a></b>",
    "27 JANUARY": "<b><u>27 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 3:9-11&version=KJV\">2 Samuel 3:9-11</a>\n\n<b>LESSON</b>\nAbner's threats\n\n<b>VERSE 9</b>\n<i>So do God to Abner, and more also, except, as the LORD hath sworn to David, even so I do to him.</i>\n\nAbner, in wrathful anger, when confronted with his immoral conduct, lashed out furiously at Ish-bosheth - firstly, invoking divine judgement upon himself, even utter ruin and destruction, for outrightly opposing God's explicit decree; then, hypocritically expressing repentance for his selfish ambition, in order to comply with the divine order.\n\nWith utmost arrogance and insolence, he lets Ish-bosheth know he had raised him up and could also put him down and that he would indeed do so. This was Abner's arrogance in boasting such great things of himself, as if he carried the king in his pocket. In this light, the shameful treatment of Ish- bosheth by Abner appears extremely cruel.\n\nThough Abner's rebuke was openly treasonous and one spoken with violence, yet Ish-bosheth did not venture to bring the matter to a head. He was too feeble to accost his powerful general who had the army at his command and could dethrone him as he pleased.\n\nMan sometimes unintentionally unveil their hidden immoral secrets while trying to justify their questionable actions to those around him; thus exposing their true inner life to be distasteful and disgusting, which otherwise would have presented itself as respectful and exemplary. \"Some men's sins are open beforehand, going before to judgment; and some men they follow after\" [1 Timothy 5:24]. Such shocking and shameful self-revelation ought to warn and humble us to search our souls before God, cleansing ourselves from all filthiness of the flesh and spirit, perfecting holiness in fearing Him who knows our hearts.\n\n<b>THOUGHT</b>\nLet us hear the conclusion of the whole matter: Fear God, and keep His commandments: for this is the whole duty of man. For God shall bring every work into judgement, with every secret thing, whether it be good, or whether it be evil. - Ecclesiastes 12:13-14\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 27&version=KJV\">GENESIS 27</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 27&version=KJV\">MATTHEW 27</a></b>",
    "28 JANUARY": "<b><u>28 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 3:12-13&version=KJV\">2 Samuel 3:12-13</a>\n\n<b>LESSON</b>\nDavid's condition\n\n<b>VERSE 13</b>\n<i>And he said, Well; I will make a league with thee: but one thing I require of thee, that is, Thou shalt not see my face, except thou first bring Michal Saul's daughter, when thou comest to see my face.</i>\n\nAbner had sent messengers to David to negotiate a league or covenant whereby he would bring the Northern tribes under David's government. Abner's offer was accepted on one condition - David demanded the return of Michal, who was his lawful wife, purchased and dearly bought. It was evident that he loved her [1 Samuel 25:44] and Saul, out of envy and threat, gave her to another man to publicly dissolve the royal bond, thus destroying any link and possible claim David may have to Saul's throne and making him a fugitive.\n\nBesides David's affection for Michal, there were perhaps, domestic as well as political reasons for demanding her. David had already six wives at Hebron and none of them could have such pretensions to legitimacy as Michal being the king's daughter, whom David had been robbed of. In light of all this, he sought to make right straightaway that which was wrong as the opportunity presented itself.\n\nIn practical living, we are often confronted with many duties and responsibilities that demand our attention and action. We are often slow to react and inclined to procrastination. Soon, things pile up and the burden becomes unbearable. We are overwhelmed. Perhaps, there were too many distractions.\n\nOne thing is needful, and we must choose that good and weighty part which shall not be taken away from us. Let God be the Centre and Lord of our life, then shall all things be done decently and in order. If in the workplace, SAFETY FIRST is mandatory without compromise; then in life it behooves on us to SEEK FIRST the kingdom of God, and His righteousness, and all the other needful things will be added unto us.\n\n<b>THOUGHT</b>\nDefer not till tomorrow to be wise; Tomorrow's sun to thee may never rise. - Pulpit Commentary\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 28&version=KJV\">GENESIS 28</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MATTHEW 28&version=KJV\">MATTHEW 28</a></b>",
    "29 JANUARY": "<b><u>29 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 16 another man's wife; and if he was weeping now,</b>\n<i>And her husband went with her along weeping behind her to Bahurim. Then said Abner unto him, Go, return. And he returned.</i>\n\nThe scene here is pathetic. Michal was conducted forth, attended by her husband but following behind her, weeping along as they walked towards Bahurim. Phaltiel had been Michal's husband for eight or nine years, and his sorrow at losing her excites sympathy. Their marriage bond was about to be permanently broken. Painful may be his plight, he himself was to be blamed in marrying another man's wife; and if he was weeping now, David could have felt the same anguish when Michal was torn from him and given to another.\n\nOn the borders of Judah, Abner contemptuously ordered Phatiel to part with Michal, and he meekly submitted, returned in bitter disappointment, grief, and shame. What can he do? On one hand is a most powerful General who had the king at his mercy and too fearful to offend, and any disobedience or rebellion may cost him his life. On another hand is an upcoming powerful king soon to take over the whole kingdom. He fearfully retreated for self- preservation and perhaps, to continue a reasonably good life being honoured by the late king for marrying her daughter (Adapted from Pulpit Commentary).\n\nPhaltiel's love for Michal was not a sacrificial love. Weeping Phaltiel lacked courage and went no further and his history ended there. But the Lord Jesus Christ, as the Son of Man, whose love for His chosen Bride was \"strong as death; where the coals thereof are coals of fire, which hath a most vehement flame\" [Song of Solomon 8:6]. He sacrificed His life for her! He endured the cross, despised the shame and died a cruel and humiliating death just to redeem her and to secure her as His bride.\n\n<b></b>\nWe fear men so much, because we fear God so little. One fear cures another. When man's terror scares you, turn your thoughts to the wrath of God. - William Gurnall\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "30 JANUARY": "<b><u>30 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 3:17-18&version=KJV\">2 Samuel 3:17-18</a>\n\n<b>LESSON</b>\nBy the hand of David\n\n<b>VERSE 18</b>\n<i>Now then do it: for the LORD hath spoken of David, saying, By the hand of my servant David I will save my people Israel out of the hand of the Philistines, and out of the hand of all their enemies.</i>\n\nHaving resolved to transfer his allegiance to David, Abner here boldly and unashamedly proclaimed God's injunction and persuaded the elders of Israel to make David king over the whole land. Abner's statements go far beyond the text of anything recorded in Holy Scripture. Nevertheless, it was generally known throughout the kingdom that David was anointed by Samuel. Saul had declared that he knew the kingdom would go to him so that upon his death it was the general expectation and desire of the people that the government would pass on to him, as it doubtless would, if Abner had not set up one of Saul's house, and persuaded the Israelites to own him as their king.\n\nAbner here pretended religion, feigned these words of his own head for his own ends. He intended for the satisfaction of his own pride, malice, and fury against Ish-bosheth. Abner's speech was virtually an acknowledgment of failure. We may also be sure that he had found himself unable any longer to withstand against the Philistines' advance on the western side of the Jordan, especially after the death of Saul and his sons in the fierce battle [1 Samuel 31:1-7], and that Judah was the only tribe there to find safe refuge.\n\nIn order to achieve his objective, Abner made use of religion to win the heart of Israel, one he willfully resisted and disowned for a long time. Hypocrites make use of God's Name to achieve their own end and purpose when opportunity arises. In lips they profess Him but in heart they are far away from Him. Nothing is more odious than to make use of God's Name to achieve one's own selfish ambition.\n\n<b>THOUGHT</b>\nIt is not the being seen of men that is wrong, but doing these things for the purpose of being seen of men. The problem with the hypocrite is his motivation ... The approbation of men matters more to him than the approval of God (Augustine).\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 30&version=KJV\">GENESIS 30</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 2&version=KJV\">MARK 2</a></b>",
    "31 JANUARY": "<b><u>31 JANUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 3:19-21&version=KJV\">2 Samuel 3:19-21</a>\n\n<b>LESSON</b>\nSealing the deal\n\n<b>VERSE 21</b>\n<i>And Abner said unto David, I will arise and go, and will gather all Israel unto my lord the king, that they may make a league with thee, and that thou mayest reign over all that thine heart desireth. And David sent Abner away; and he went in peace.</i>\n\nAbner garnered the support of Benjamin and the other Northern tribes by reminding them that God promised Israel victory and success through David. If they would unite with their brothers in Judah and have David as their king, they could be confident of victory over their common enemies. Abner did not initiate this because he had received any special revelation from God that David was the anointed king of Israel. Neither was he suddenly convicted of his sin of opposing God and His anointed, nor was he trying to obey God. He was an ambitious, self-seeking man who wanted revenge for Ish-bosheth's rebuke of him. Just as he had previously installed Ish-bosheth on the throne to promote his self interest, now he abandoned him and threw in his lot with David. Abner was a hypocrite riding on God's will for his own purpose. He needed the leaders of the Northern tribes, especially Saul's tribe Benjamin, to agree to his plan so that his pre-eminence in David's kingdom was assured. Abner's inner thoughts were revealed when he insinuated David's kingship sprang from his own ambition and desire. David agreed to Abner's plan to put an end to war between the Northern tribes and Judah, and place the Lord's anointed on the throne. Let us beware our motives and desires when doing God's work. God will only bless those who do the right thing with the right motives. Are we obeying God sincerely because we desire only to glorify His name?\n\n<b>THOUGHT</b>\nDepart from evil, and do good; seek peace, and pursue it. - Psalm 34:14\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 31&version=KJV\">GENESIS 31</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 3&version=KJV\">MARK 3</a></b>",
    "1 FEBRUARY": "<b><u>1 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 3:22-25&version=KJV\">2 Samuel 3:22-25</a>\n\n<b>LESSON</b>\n\"What hast thou done?\"\n\n<b>VERSE 24</b>\n<i>Then Joab came to the king, and said, What hast thou done? behold, Abner came unto thee; why is it that thou hast sent him away, and he is quite gone?</i>\n\nDavid had welcomed the Northern delegation warmly. He and Abner conducted their peace negotiations in Joab's absence after which Abner was sent off in peace. On returning from a successful raid, Joab was livid when he heard about their agreement. In no uncertain terms, he made it clear David had made a grave mistake in striking this treaty with Abner.\n\nThere were reasons for Joab feeling this way. Firstly, like Abner he desired a pre-eminent role in the united kingdom. He regarded Abner as a rival and feared David might replace him as commander of the army. Indeed, such plans may well have been afoot [2 Samuel 3:12,13]. Secondly, Joab had a personal vendetta to settle against Abner for the killing of his brother. If David had apprehended Abner, Joab could conveniently avenge Asahel's death. Now that Abner had left in peace, that opportunity was lost.\n\nJoab was selfish and clearly did not share the same motives and desires as his king. Similarly, the disciples could not comprehend the mind of Christ and often questioned His methods. Peter chided our Lord Jesus for talking about His death and resurrection only to be rebuked as one aligning himself with Satan and those who sought to prevent Jesus from fulfilling his earthly mission [Matthew 16:21-23]. Because of our imperfect understanding of God's will and His ways, let us not question God when things do not go our way. Be humble in submission to Him and let Him work in our lives for His glory and pleasure.\n\n<b>THOUGHT</b>\nAnd we know that all things work together for good to them that love God, to them who are the called according to His purpose. - Romans 8:28\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 32&version=KJV\">GENESIS 32</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 4&version=KJV\">MARK 4</a></b>",
    "2 FEBRUARY": "<b><u>2 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 3:22-25&version=KJV\">2 Samuel 3:22-25</a>\n\n<b>LESSON</b>\nJoab's attitude\n\n<b>VERSE 25</b>\n<i>Thou knowest Abner the son of Ner, that he came to deceive thee, and to know thy going out and thy coming in, and to know all that thou doest.</i>\n\nJoab spoke as though David was accountable to him and had to seek his consent for his decisions and actions. He implied David was a fool for what he did.\n\nJoab had previously seen David refusing to kill Saul because Saul was God's anointed [1 Samuel 24, 26] and how David prayed and sought God's wisdom before undertaking major decisions. David was content to let God reveal His will at the right time. Despite this close-up view of David's heart and mind, Joab displayed a lack of respect for David and lack of fear for his authority. He refused to subdue his feelings and surrender himself to the will of his king because he thought he was wiser than David. For his subordination he could have been dismissed. Joab failed to see that all of David's authority was derived from God so opposing David was tantamount to disobeying God. As a result, Joab's worldly spirit boiled over and his displeasure for his king, as well as his desire to assert his power over him, led him to conceive an evil plot.\n\nEven our Lord Jesus had to deal with followers who could not enter into his mind and submit to His divine authority. The wife of Zebedee asked for her sons to be given positions of pre-eminence in God's kingdom when he was teaching them about His death [Matthew 20:18-23]. May God teach us to banish personal ambition and submit to His authority, and those whom He has appointed above us as we serve Him.\n\n<b>THOUGHT</b>\nSubmit yourselves to every ordinance of man for the Lord's sake: whether it be to the king, as supreme; Or unto governors, as unto them that are sent by Him. - 1 Peter 2:13-14a\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 33&version=KJV\">GENESIS 33</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 5&version=KJV\">MARK 5</a></b>",
    "3 FEBRUARY": "<b><u>3 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 3:26-27&version=KJV\">2 Samuel 3:26-27</a>\n\n<b>LESSON</b>\nJoab's secret plot\n\n<b>VERSE 26</b>\n<i>And when Joab was come out from David, he sent messengers after Abner, which brought him again from the well of Sirah: but David knew it not.</i>\n\nConsumed by jealous ambition and hatred, Joab lured Abner to return to Hebron seemingly for further talks between the two military commanders. Abner did not suspect foul play since David had sent him away in peace. When Abner returned, Joab promptly murdered him.\n\nThis was a deceptive and treacherous act that revealed the man's true character. Not only was Joab willing to commit such sin to further his ambition and seek revenge for his brother, he was willing to sacrifice David's reputation with the Northern tribes and Judah. This act delayed the unification of the nation and the Northern tribes' recognition of David as their king. Joab showed how jealousy breeds hatred, which causes a person to harbour more sinful thoughts, leading to deception and murder. Abner, with his own desire for greatness and treachery against Ish-bosheth was not guiltless either. Evidently, it was not God's will for Abner to be David's top general and God used Joab to be his executioner. However, Joab was still responsible for his sins of jealousy and murder.\n\nIt was the sovereign will of God the Father that His only begotten Son should be crucified on Calvary's cross to save mankind from their sins. Only the holy and righteous Son of Man could atone for our sins once and for all. Yet our Lord Jesus said that Judas Iscariot His betrayer and the Jewish religious leaders who delivered Him to be crucified would be held accountable for their sins [Matthew 26:24; John 19:11]. May God teach us to beware of feelings of jealousy for they surely lead only to more sin.\n\n<b>THOUGHT</b>\nThou shalt not avenge, nor bear any grudge against the children of thy people, but thou shalt love thy neighbour as thyself: I am the LORD. - Leviticus 19:18\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 34&version=KJV\">GENESIS 34</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 6&version=KJV\">MARK 6</a></b>",
    "4 FEBRUARY": "<b><u>4 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 3:26-30&version=KJV\">2 Samuel 3:26-30</a>\n\n<b>LESSON</b>\nDeaths of Asahel and Abner\n\n<b>VERSE 27</b>\n<i>And when Abner was returned to Hebron, Joab took him aside in the gate to speak with him quietly, and smote him there under the fifth rib, that he died, for the blood of Asahel his brother.</i>\n\nAbner had been received and sent off peacefully by David. He thus assumed that in calling their meeting, Joab would deal with him in a similar manner. After all David was the anointed king and in authority. In calling Abner to meet, Joab exploited this maximally in a deceitful manner for his own selfish and evil purpose.\n\n\"Cursed be he that smiteth his neighbour secretly\" [Deuteronomy 27:24a]. Joab wanted Abner dead. Firstly, Abner had killed his brother Asahel, albeit in warfare [2 Samuel 2:22-23]. Secondly, if Abner joined David's forces, there was a likelihood of his being promoted above Joab for he was an experienced soldier and general, with an intimate knowledge of the opposition's strengths and weaknesses. Joab's actions were especially heinous. Abner had killed Asahel in self-defence reluctantly, after warning him to turn aside, and it was an open fair fight. In stark contrast, Joab's actions were shrouded in deceit, under the pretence of a peaceful meeting and it was committed at the gate of Hebron.\n\n\"The words of his mouth were smoother than butter, but war was in his heart: his words were softer than oil, yet were they drawn swords\" [Psalm 55:21].\n\nHebron was a city of refuge. These were cities appointed by God, where perpetrators of accidental manslaughter would be afforded protection from avengers of the blood, before their case appeared at trial [Joshua 20:1-8]. Joab was in rebellion against God's laws, against God's anointed king, and therefore against God Himself.\n\n<b>THOUGHT</b>\nBut if ye have bitter envying and strife in your hearts ... This wisdom descendeth not from above, but is earthly, sensual, devilish. - James 3:14a-15\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 35-36&version=KJV\">GENESIS 35-36</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 7&version=KJV\">MARK 7</a></b>",
    "5 FEBRUARY": "<b><u>5 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 3:28-30&version=KJV\">2 Samuel 3:28-30</a>\n\n<b>LESSON</b>\nDavid's response\n\n<b>VERSE 28</b>\n<i>And afterward when David heard it, he said, I and my kingdom are guiltless before the LORD forever from the blood of Abner the son of Ner.</i>\n\nOn hearing the news, David immediately disavowed any knowledge of premeditated murder. Godly wisdom dictated this\n\nthis\n\n<b>THOUGHT</b>\nfor Joab was under his command and the inevitable conclusion by the people would be that David had ordered it. It would mar his kingship even before he had risen to the throne and furthermore, bring shame and dishonor to the LORD's name for he was Jehovah's anointed. \"A wise man feareth, and departeth from evil: but the fool rageth, and is confident\" [Proverbs 14:16]. David would not allow the glorious name of God blasphemed, and declared it publicly so that all would know he had nothing to do with Abner's cold-blooded murder. This required wisdom and courage for he was distancing himself from the actions of a trusted warrior of his who had served him well in time past. This action would surely strain their relationship. He was exhibiting faith in God and His ways rather than trusting in man and the wisdom of this world. Such must be the children of God. David cursed Joab and his family, that the blood of Abner is on their heads [v. 29]. He cursed them that they be : (a) ceremonially unclean by having a skin discharge/ leprosy [Leviticus 13:44-46]; (b) weak/effeminate or crippled (depending on whether the interpretation means having to use a spindle which was woman's work, or leaning on a crutch); (c) suffer military defeat (dying by the sword, that is, those spared the above would be killed in war); or (d) be impoverished in peacetime.    Mark the perfect man, and behold the upright: for the end of that man is peace. But the transgressors shall be destroyed together: the end of the wicked shall be cut off. - Psalm 37: 37-38\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 37&version=KJV\">GENESIS 37</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 8&version=KJV\">MARK 8</a></b>",
    "6 FEBRUARY": "<b><u>6 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 3:31-32&version=KJV\">2 Samuel 3:31-32</a>\n\n<b>LESSON</b>\nDavid's honour for Abner\n\n<b>VERSE 31</b>\n<i>And David, said to Joab, and to all the people that were with him, Rend your clothes, and gird you with sackcloth, and mourn before Abner. And king David himself followed the bier.</i>\n\nDavid ordered Joab the murderer and all the people to tear their clothes and put on sackcloth. This was a common expression of grief. David himself would follow the bier in mourning.\n\nDavid was a man of action who acted on his godly convictions. Having declared them, he followed it up with actions consistent with his words. There was visible consistency in his life. Is there such consistency in our lives? Would others observing our words and actions say that it is unmistakable that God has made a mark on our lives, that we live by the Word of God and this consistently seen in our speech and conduct? \"For a good tree bringeth not forth corrupt fruit; neither doth a corrupt tree bring forth good fruit. For every tree is known by his own fruit. For of thorns men do not gather figs, nor of a bramble bush gather they grapes\" [Luke 6:43-44].\n\nHe instructed them to mourn and led the procession himself, grieving such that all the people wept as well. The actions reveal the heart.\n\nDavid's sincere, open and consistent conduct was clearly visible to all. This would clearly demonstrate to the onlookers that he distanced himself from Joab's evil deed. \"Even a child is known by his doings, whether his work be pure, and whether it be right\" [Proverbs 20:11].\n\n<b>THOUGHT</b>\nLiving according to God's Word, especially in a consistent, contrasting response against sin, brings glory to God's name.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 38&version=KJV\">GENESIS 38</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 9&version=KJV\">MARK 9</a></b>",
    "7 FEBRUARY": "<b><u>7 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 3:33-34&version=KJV\">2 Samuel 3:33-34</a>\n\n<b>LESSON</b>\nDavid's lament\n\n<b>VERSE 34</b>\n<i>Thy hands were not bound, nor thy feet put into fetters: as a man falleth before wicked men, so fellest thou. And all the people wept again over him.</i>\n\nDavid lamented Abner's death. By declaring that Abner died as a fool, he is saying that though Abner was an experienced soldier, wise in conduct and the affairs of the world, he was fooled out of his life. He was caught unawares and killed because of the false veneer of peace that Joab appeared in. Such is deception! The wisest and most capable of men have no personal defence if they fall to lies and treachery. Abner's hands and feet were not bound thus he would have been able to defend himself. However, not suspecting treachery, he fell helplessly before that wicked man Joab, as one who was bound.\n\nThis incident has parallels to be drawn with sin, and comparisons to be made with salvation. Sin deceives so completely that mankind being born into sin does not understand or even know his own condition till he is told. Sin renders us incapable of knowing God or pursuing Him in our own ability [Romans 3:11]. Sin places a person in bondage to the grip of Satan, unable to save himself [Hebrews 2:14-15]. Thus, sinners are described as foolish, not knowing God, \"wise\" (skillful) to do evil but having no knowledge to do good [Jeremiah 4:22].\n\nPraise God for His grace in salvation through the Lord Jesus Christ! He is the fulfillment of God's promises, the Living Word. The truth of God's Word shines light and gives us understanding [Psalm 43:3]. He is the Light of the world who gives life [John 8:12].\n\n<b>THOUGHT</b>\nFor God, Who commanded the light to shine out of darkness, hath shined in our hearts, to give the light of the knowledge of the glory of God in the face of Jesus Christ.\" - 2 Corinthians 4:6\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 39&version=KJV\">GENESIS 39</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 10&version=KJV\">MARK 10</a></b>",
    "8 FEBRUARY": "<b><u>8 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 3:35-37&version=KJV\">2 Samuel 3:35-37</a>\n\n<b>LESSON</b>\nDavid reaffirmed his innocence\n\n<b>VERSE 35</b>\n<i>And when all the people came to cause David to eat meat while it was yet day, David sware, saying, So do God to me, and more also, if I taste bread, or ought else, till the sun be down.</i>\n\nTo mourn the tragic and despicable murder of Abner, David fasted all day and would not be persuaded to eat anything till nightfall. It was then the custom of mourners to refrain for a time from bodily refreshments. David swore that great evil should befall him if he broke his fast. David wanted the whole nation to know that he was not in any way complicit in the murder of Abner. It was not his intent, and he certainly did not give his approval for Abner to be slain.\n\nDavid's behaviour - not just his fasting and oath - but his whole conduct at Abner's funeral; the sorrow he expressed, his speech and his strong condemnation of the perpetrators of Abner's murder, pleased the people. They had a high opinion of him and approved his actions as the king. All Israel understood that day and accepted him.\n\nKnowing that he was \"in the midst of a people that God hast chosen, a great people\" [1 Kings 3:8], David sought to gain the trust and acceptance of his subjects. This was wise. With his hold on power still not fully consolidated, the king needed to win the people's approval. More importantly, the future king needed to be blameless before God. Likewise, God's people in the church, and especially the spiritual leaders, must be God-fearing and upright, seeking to please Him and to glorify Him in all that we do and say.\n\n<b>THOUGHT</b>\nMy flesh trembleth for fear of Thee; and I am afraid of Thy judgments. - Psalm 119:120\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 40&version=KJV\">GENESIS 40</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 11&version=KJV\">MARK 11</a></b>",
    "9 FEBRUARY": "<b><u>9 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 3:38-39&version=KJV\">2 Samuel 3:38-39</a>\n\n<b>LESSON</b>\nDavid's final lament\n\n<b>VERSE 39</b>\n<i>And I am this day weak, though anointed king; and these men the sons of Zeruiah be too hard for me: the LORD shall reward the doer of evil according to his wickedness.</i>\n\nAquestion arises in our mind as we view the actions and words of David in the preceding verses. Why did David not execute Joab for his crime and put an end to the messy state of affairs in the kingdom at this time. As \"bearer of the sword\" and \"the minister of God, a revenger to execute wrath upon him that doeth evil\" [Romans 13:4], it was his duty to punish murderers. Why leave it to Solomon to do so only after David's death? [1 Kings 2:5-6]\n\nThree reasons are possible. (1) Joab and Abishai were his nephews being his sister's sons, (2) David might have taken into consideration Joab's loyalty; and (3) He was too weak politically to risk such a huge upheaval in the newly planted kingdom. Though anointed, he was not yet king over all Israel and Judah. The influence of Joab and Abishai was great both in the court and in the camp. One was general of the army, and the other a considerable officer in it; and both were highly respected among the people for their achievements in war.\n\nThe wise thing for a God-fearing man in such a situation, was to leave the retribution and its timing to God. \"The LORD shall reward the doer of evil according to his wickedness\" was both an imprecation of evil upon Joab and a prediction that sooner or later, God would render righteous judgement; which He did as we shall read in 1 Kings 2:29-34. We too can learn a lesson from David's wisdom and patience.\n\n<b>THOUGHT</b>\nFor evildoers shall be cut off: but those that wait upon the LORD, they shall inherit the earth. - Psalm 37:9\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 41&version=KJV\">GENESIS 41</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 12&version=KJV\">MARK 12</a></b>",
    "10 FEBRUARY": "<b><u>10 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 4:1&version=KJV\">2 Samuel 4:1</a>\n\n<b>LESSON</b>\nIsh-bosheth's feeble hands\n\n<b>VERSE 1</b>\n<i>And when Saul's son heard that Abner was dead in Hebron, his hands were feeble, and all the Israelites were troubled.</i>\n\nThe news of Abner's death brought dismay to both the king and people of Israel. Not knowing that David had nothing to do with his death, they probably assumed that David would now send his armies north to seize the throne by force. The citizens were terrified, and their king was a picture of helplessness. \"His hands were feeble\" means he lost heart. The military strongman who had propped him up was dead and the future looked hopeless.\n\nThere are two lessons that we can learn here. Lesson one: Do not put your trust in man. Ish- bosheth put his trust in Abner to secure his position as king. Ish-bosheth's power was a power that came from man; and with Abner gone, Ish-bosheth was too weak to retain his throne.\n\nKing Hezekiah was in an even more 'hopeless' situation when faced with the impending invasion of the superpower of his day, Sennacherib and his one hundred and eighty thousand strong Assyrian army. But he did not lose hope. He did not turn to his own army or sought help from his allies. Instead he turned the matter over to God who spectacularly delivered as recorded in 2 Kings 18- 19.\n\nThe second lesson: We must humbly submit to God's will no matter how painful it seems. That God had already given the kingdom to David was certainly known to Ish-bosheth and his people. If they would only come before Him in humble submission, God would certainly bless, and they would not need to fear or fret.\n\n<b>THOUGHT</b>\nSome trust in chariots, and some in horses: but we will remember the name of the LORD our God. - Psalm 20:7\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 42&version=KJV\">GENESIS 42</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 13&version=KJV\">MARK 13</a></b>",
    "11 FEBRUARY": "<b><u>11 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b></b>\n<i>And Saul's son had two men that were captains of bands: the name of the one was Baanah, and the name of the other Rechab, the sons of Rimmon a Beerothite, of the children of Benjamin: (for Beeroth also was reckoned to Benjamin: And the Beerothites fled to Gittaim, and were sojourners there until this day.)</i>\n\nIsh-bosheth was about to discover a second time how utterly futile and foolish it is to put trust in men. Abner, the powerful general who supported his rule over Israel had been killed. Now two captains of his guards, men who were supposed to protect him, would betray him in a most heinous way. To borrow a famous line from Shakespeare, this was in fact \"the most unkindest cut of all\", because these men were also from his tribe of Benjamin.\n\nBaanah and Rechab were sons of Rimmon a Beerothite. This place, Beeroth, originally belonged to the Gibeonites, and fell to the lot of Benjamin during the division of the land. At Saul's death, when many Israelites deserted their cities and left them to the Philistines, [1 Samuel 31:7], the inhabitants of Beeroth too forsook their city, which was near the Philistines, and moved to Gittaim, a city of the same tribe, a further distance away.\n\nThis account reminds us how our Lord was forsaken by those closest to him, even betrayed by one of his own disciples for thirty pieces of silver and cruelly murdered by His own people. But there is one big difference. The Lord could easily have destroyed His enemies with just a word from His mouth but did not. Why? Because, even though \"His soul was exceeding sorrowful, even unto death\" [Mathew 26:38], He pressed on with His mission, motivated by love to redeem lost sinners like you and me.\n\n<b></b>\nToday the Lord asks you the same question He asked Peter by the Sea of Galilee: \"Lovest thou Me?\" [John 21:15-17]\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 43&version=KJV\">GENESIS 43</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 14&version=KJV\">MARK 14</a>\n<a href=\"https://www.biblegateway.com/passage/?search=THOUGHT Today the Lord asks you the same question He&version=KJV\">THOUGHT Today the Lord asks you the same question He</a>\n<a href=\"https://www.biblegateway.com/passage/?search=asked Peter by the Sea of Galilee: \"Lovest thou&version=KJV\">asked Peter by the Sea of Galilee: \"Lovest thou</a>\n<a href=\"https://www.biblegateway.com/passage/?search=Me?\" [John 21:15-17]&version=KJV\">Me?\" [John 21:15-17]</a></b>",
    "12 FEBRUARY": "<b><u>12 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 4:4&version=KJV\">2 Samuel 4:4</a>\n\n<b>LESSON</b>\nMephibosheth\n\n<b>VERSE 4</b>\n<i>And Jonathan, Saul's son, had a son that was lame of his feet. He was five years old when the tidings came of Saul and Jonathan out of Jezreel, and his nurse took him up, and fled: and it came to pass, as she made haste to flee, that he fell, and became lame. And his name was Mephibosheth.</i>\n\nAquick reading of this chapter, which is essentially about the death of Ish-bosheth, might lead us to ask why the writer had inserted this verse about Jonathan's son, Mephibosheth. It is probably because he as the only other heir to the throne was weak and helpless, and this would have emboldened the two evil Beerothites we read about previously to betray their master.\n\nMephibosheth was five years old when his father and grandfather were killed in battle. His nurse, hearing of the Philistines' victory, was fearful that they were about to ransack Saul's house and kill off his descendants. In haste and panic, she fled with the child in her arms, but he fell and was severely injured and permanently crippled, making him unfit to assume the throne. What happens to this poor child after this? Certainly, he would grow up in misery and constant fear that the next king would come for his life.\n\nIn a sense, we are all like Mephibosheth. We inherited a spiritual injury that has no cure. Subjected to the threat of death that can befall anyone of us at any time, we live our lives in a world full of darkness. But praise God for His marvellous grace. Just as there was a happy ending for Mephibosheth, we too can look forward to a grand inheritance and the joy of dining at the king's table all the days of our lives - that is if we embrace Christ as our Lord and Saviour. Would you?\n\n<b>THOUGHT</b>\nThou preparest a table before me in the presence of mine enemies: Thou anointest my head with oil; my cup runneth over. - Psalm 23:5\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 44&version=KJV\">GENESIS 44</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 15&version=KJV\">MARK 15</a></b>",
    "13 FEBRUARY": "<b><u>13 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 4:5-8&version=KJV\">2 Samuel 4:5-8</a>\n\n<b>LESSON</b>\nMurder of Ish-bosheth\n\n<b>VERSE 8</b>\n<i>And they brought the head of Ish-bosheth unto David to Hebron, and said to the king, Behold the head of Ish-bosheth the son of Saul thine enemy, which sought thy life; and the LORD hath avenged my lord the king this day of Saul, and of his seed.</i>\n\nIsh-bosheth was a weak leader and did not have the followership of his late father's troops. The moment Saul's captains Rechab and Baanah saw that Ish-bosheth had no chance of keeping the throne, and hoping to gain David's favour, they assassinated and beheaded him while he slept. Both these men were Saul's tribesman and they had murdered their king and a fellow Benjaminite. Saul and Ish-bosheth had put their trust in the support and loyalty of their kinsmen instead of trusting God, but ironically, he would be betrayed by his own.\n\nThe murderers hoping to claim credit took Ish-bosheth's head to David as a gift, thinking he would be delighted to be rid of his opponent and the rival claimant to the nation's throne. They even said, \"The Lord hath avenged\", insinuating as it were that God had a hand in this. Thus, Rechab and Baanah blasphemously cast themselves as channels of God's vengeance in their heinous act. This is a grave reminder we must be very careful about our motivations. It is always too easy to use God as an argument or manipulate theology for our convenience. Beware not to be like these who deceitfully attributed their abominable actions to a holy God.\n\nBe mindful of our thoughts, words and actions. Pray for the Holy Spirit to guide us and help us stay away from any temptation to sin. Grow in the fruit of the Spirit and follow the path led by the Lord to joy and peace.\n\n<b>THOUGHT</b>\nO Lord, keep my heart always true to you. Let me always be mindful that others are watching me. Let me be more like Christ and be a good testimony... use me to be your channel of blessing to others.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 45&version=KJV\">GENESIS 45</a>\n<a href=\"https://www.biblegateway.com/passage/?search=MARK 16&version=KJV\">MARK 16</a></b>",
    "14 FEBRUARY": "<b><u>14 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 4:9-10&version=KJV\">2 Samuel 4:9-10</a>\n\n<b>LESSON</b>\nRetribution\n\n<b>VERSE 10</b>\n<i>When one told me, saying, Behold, Saul is dead, thinking to have brought good tidings, I took hold of him, and slew him in Ziklag, who thought that I would have given him a reward for his tidings:</i>\n\nRechab and Baanah committed the sin of murder, yet they exulted in what they had done. They plotted to gain favour since they had \"helped\" David remove the final threat from Saul's family. They pretended concern for David's life but actually sought David's indebtedness to them. But David knew who his protector was as he declared 'As the Lord liveth, who hath redeemed my soul out of all adversity', thus ascribing his deliverance to the one and only Lord God. David was thankful for Almighty God's protection to keep him alive and deliver him from perils and anxieties. David relied on God's help rather than man's.\n\nDavid remembered these blessings from God and penned some of his thanksgiving in the Psalms. His record of God's deliverance and providence in his life is an action we can emulate. Not only can we reflect on His goodness to us, but we can also mediate on His Word and sing praise to Him [Psalm 103].\n\nGod is our shelter and our refuge. The Lord whom we trust will protect us when we are in danger, deliver us when we are in trouble and grant us peace when we are in fear. Instead of relying on man, focus our eyes on Christ. Call upon the Lord and entrust ourselves entirely to Him. \"Be not afraid, only believe.\" Be strong in the Lord. In God we have the help of divine power to fight our battles and gain the victory.\n\n<b>THOUGHT</b>\nDo not fear for He shall give His angels charge over thee, to keep thee in all thy ways. Read Psalm 91.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 46&version=KJV\">GENESIS 46</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 1:1-38&version=KJV\">LUKE 1:1-38</a></b>",
    "15 FEBRUARY": "<b><u>15 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 4:11-12&version=KJV\">2 Samuel 4:11-12</a>\n\n<b>LESSON</b>\nJustice carried out\n\n<b>VERSE 12</b>\n<i>And David commanded his young men, and they slew them, and cut off their hands and their feet, and hanged them up over the pool in Hebron. But they took the head of Ish-bosheth, and buried it in the sepulchre of Abner in Hebron.</i>\n\nDavid reminded Rechab and Baanah that he put the Amalekite to death in Ziklag when he had brought news of Saul's death, thinking it would be welcomed by David [2 Samuel 1:16]. He called Ish-bosheth 'righteous' because he was innocent. David had no intention to kill him and was in fact very upset with the two wicked brothers' cowardly act of assassinating him.\n\nTo David, a grave crime had been committed against Saul's son. His desire was to unite Israel and not divide the people between his followers and Saul's. He ordered justice to be meted out and Rechab and Baanah put to death. Their hands and feet were cut off and their corpses hanged. He then gave Ish-bosheth a proper burial. David would redress the wrong committed.\n\nFor David, God is faithful and will fulfil His promise to make him the king. Sin would have no part in its fulfilment. Likewise as believers in Christ, we are to hold fast to God's promises and the hope of our eternal salvation. In these end times, we are to be steadfast in our faith despite mounting pressure, persecution and temptation from the world. In discouragement, let us place our hope in God. \"And be not conformed to this world: but be ye transformed by the renewing of your mind, that ye may prove what is that good, and acceptable, and perfect, will of God\" [Romans 12:2].\n\n<b>THOUGHT</b>\nRead Job 5:8-16.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 47&version=KJV\">GENESIS 47</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 1:39-80&version=KJV\">LUKE 1:39-80</a></b>",
    "16 FEBRUARY": "<b><u>16 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 5:1-2&version=KJV\">2 Samuel 5:1-2</a>\n\n<b>LESSON</b>\nSupport for David (I)\n\n<b>VERSE 2</b>\n<i>Also in time past, when Saul was king over us, thou wast he that leddest out and broughtest in Israel: and the LORD said to thee, Thou shalt feed My people Israel, and thou shalt be a captain over Israel.</i>\n\nThe elders of Israel received David's leadership, because he was like them, a son of Israel. They also accepted David as king because of his proven track record. The phrase \"leddest out and broughtest in\" reflects his leadership in battle. David led them out against their enemies and brought them back safe and victorious.\n\nPrior to this, only his tribe Judah, recognised David as the king. The others sided with Ish- bosheth, Saul's son. But after Ish-bosheth's murder [2 Samuel 4] they now turned to David. It is sad that the tribes resorted to David only after their earlier choice was gone. Likewise, it is sad when Christians only really recognise Jesus as King when other choices fail. Christ the Lord deserves to be our first choice and not our last resort.\n\nWhy did Israel now accept David? The short answer is that they came to their senses. They recognised and acknowledged their hard-hearted rebellion against God. At long last, the nation's elders embraced David as their saviour. If only they had regarded God's Word first, so much hardship would have been avoided.\n\nWe can learn from Israel's mistake. Submit to the primacy of authority in God's Word for all of life's decisions. We want Jesus to be our Saviour. We come to Him with desire for a personal relationship with him. We seek Jesus to be our representative, and indeed through faith in Him, Jesus represents us to the Heavenly Father.\n\n<b>THOUGHT</b>\nIs Jesus your king?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 48&version=KJV\">GENESIS 48</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 2&version=KJV\">LUKE 2</a></b>",
    "17 FEBRUARY": "<b><u>17 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 5:2b&version=KJV\">2 Samuel 5:2b</a>\n\n<b>LESSON</b>\nSupport for David (II)\n\n<b>VERSE 2b</b>\n<i>...and the LORD said to thee, Thou shalt feed My people Israel, and thou shalt be a captain over Israel.</i>\n\nThe leaders of Israel acknowledged that David was God's choice to be king. Through all that David had done for Israel even while Saul was king, they realised he was a man called and appointed of God. This was David's third anointing - Prophet Samuel first anointed him in his father's house in Bethlehem, and the men of Judah had anointed him at Hebron.\n\nOur God who called David also called us. God calls all of us to His ministry. God calls us to serve him. Every Christian is to be a minister of the Gospel. We are called to build up the Body of Christ, to encourage and nurture the faith of other believers. We are called to repentance, to live a holy life, to be salt and light in the world. The call of God has power. When we put ourselves in the centre of His will, in the place where He calls us to be, we have power from Him and we will see God's power exercised in our life. It is unmistakable.\n\nWhat is God calling you to do today? Do you have a ministry? Is there a place in your life where you are serving Him? Are you sharing the good news of God's love and grace? How are you blessing the body of Christ's disciples? How are you expressing the justice, mercy and love of God to the world around you? God's call on our lives is as real today as it ever has been. Listen to Him. Make the choice. We either listen to His call and obey or turn our backs and reject Him.\n\n<b>THOUGHT</b>\nHave you seen God move in a supernatural way in your life?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 49&version=KJV\">GENESIS 49</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 3&version=KJV\">LUKE 3</a></b>",
    "18 FEBRUARY": "<b><u>18 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 5:3-5&version=KJV\">2 Samuel 5:3-5</a>\n\n<b>LESSON</b>\nDavid's coronation\n\n<b>VERSE 3</b>\n<i>So all the elders of Israel came to the king to Hebron; and king David made a league with them in Hebron before the Lord: and they anointed David king over Israel.</i>\n\nThe road to the throne for David was difficult and rocky. It wound its way through some tragic and dark byways. David did not rise swiftly to the top; in fact, he suffered his way to the top. But eventually, he ended up where the Lord had promised: the throne of an united Israel. Everything David had gone through was divinely guided. David knew that he walked in the power and presence of God.\n\nMost of the time, we only think of the destination God has for us and overlook to consider the pathway there. David's journey had included praise and persecution, friendships and enemies, but through it all, God was moving David's life toward the goal He had set for him. While we are trying to figure out how God is going to answer our prayers or fulfil His promises, He is quietly and powerfully working out His plans behind the scenes and in ways and for reasons that we usually do not comprehend.\n\nAre the promises of God being fulfilled in you? He is ever faithful and true to His word. He will always accomplish His will. He can make faith and love flow out of stony hearts like life-giving milk and sweet honey. Out of God's fullness, He gives. Be revived, encouraged and comforted; Submit and let God fulfil His purposes for you. His reasons may elude us, and His methods surprise us, but in the end, God always does what He says He will.\n\n<b>THOUGHT</b>\nGod is faithful. That is never the question. The bigger question is, will we trust Him?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=GENESIS 50&version=KJV\">GENESIS 50</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 4&version=KJV\">LUKE 4</a></b>",
    "19 FEBRUARY": "<b><u>19 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 5:6&version=KJV\">2 Samuel 5:6</a>\n\n<b>LESSON</b>\nThe Jebusites\n\n<b>VERSE 6</b>\n<i>And the king and his men went to Jerusalem unto the Jebusites, the inhabitants of the land: which spake unto David, saying, Except thou take away the blind and the lame, thou shalt not come in hither: thinking, David cannot come in hither.</i>\n\nThe account of David's conquest of Jerusalem reveals that the city was a stronghold of the Jebusites, a people of the families of Canaan. They are one of the seven nations God commanded the Israelites to destroy completely. The Jebusites' hostility to Israel is obvious from their taunting of David when he came to the city. They ridiculed and discredited his authority, but David was not intimidated. He fought and overcame them. Intimidation has no place in the believer's life. He is to resist intimidation and fight discouragement.\n\nThe battle for Jerusalem is a picture of the spiritual battle against the forces of darkness. This spirit of the world has taken up residence in so many homes today and mocks us in our complacency. It seeks to bring the believer to the point of despair and defeat. Discouraging remarks and hurting words injure much more and for much longer than physical wounds. To linger in discouragement saps us of energy and vision. And it can be contagious, weakening the faith of others' around us.\n\nWhat is tempting you to discouragement today? Are you having a hard time believing that God is working all things together for good when everything looks so bad to you? It is amazing how cruel people can be with their words, but do not be discouraged by what they say. Remember those who bring hurtful words toward you are not your judge. It is what the Lord thinks that matters. So, bring them before the Lord and let Him decide. What He says matters most.\n\n<b>THOUGHT</b>\nDon't let your hearts be ruled by what you see or hear - let them be ruled by what Jesus your Lord has promised you.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 1&version=KJV\">EXODUS 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 5&version=KJV\">LUKE 5</a></b>",
    "20 FEBRUARY": "<b><u>20 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 7 David would rule from Jerusalem, the capital city</b>\n<i>Nevertheless David took the strong hold of Zion: the same is the city of David.</i>\n\nOne of the first things David did after being crowned king was to conquer Jerusalem. Jerusalem was a significant city because it was the city where Melchizedek, a man who was both king and the priest of God, ruled in the past [Genesis 14:18]. Just as Melchizedek was a type of Christ, David too would be an earthly representation of the coming Messiah. It was thus significant that David would rule from Jerusalem, the capital city of God.\n\nHowever, Jerusalem was not an easy city to take. It had been a city that was part of the lot of the Benjamites, but they were unable to drive out the Jebusites dwelling therein [Joshua 15:63; Judges 1:21]. It was a city that had great defensive capability, strongly fortified, and naturally situated atop a hill, which meant that attackers had to struggle uphill in any attempt to capture it.\n\nDespite these difficulties, David had determined to do this difficult task as one of his first acts of kingship. Because he was confident that God was with him and with the Israelites, he dared to undertake this for God's name.\n\nHow about us today? Are there ministries in which it seems every step forward is fraught with difficulty and resistance? Just as the Jebusites taunted David by saying that even the weakest and most disabled of their people could hold the Israelites off, do we face much disbelief and mockery as we attempt to serve God? Let us take courage and do valiantly.\n\n<b></b>\nThrough God we shall do valiantly: for He it is that shall tread down our enemies.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "21 FEBRUARY": "<b><u>21 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 5:11-12&version=KJV\">2 Samuel 5:11-12</a>\n\n<b>LESSON</b>\nGod set up David to be king\n\n<b>VERSE 12</b>\n<i>And David perceived that the LORD had established him king over Israel, and that He had exalted his kingdom for His people Israel's sake.</i>\n\nHere, we see a good demonstration of why David was a man after God's own heart. After a successful military campaign, David established a base of power and grew greater and greater [2 Samuel 5:9-10]. He received great building resources from Tyre. Nevertheless, these achievements did not puff David's heart up nor deceive him into thinking that he had achieved them by his own resourcefulness and strength. Instead, he viewed these wonderful achievements as indications of God's grace and blessings. He perceived God had done these things in order to establish him as king of Israel and had brought victory and glory to Israel not to elevate David, but for every Israelite's sake. Thus, David maintained a right heart before God and did not fall to pride.\n\nLet us contrast this with another king - Nebuchadnezzar, whom God had used as His instrument to punish Israel as well as other pagan nations for their sinful living. In Daniel 4:30, we see Nebuchadnezzar taking in the majestic sights of Babylon. By God's power and mercies, Babylon had grown great and had conquered many nations. However, unlike David, Nebuchadnezzar failed to see the hand of God in these things. As he strolled in his palace, he proudly owned himself as the reason for Babylon's success.\n\nGod will not let His glory go to another. Immediately, Nebuchadnezzar was struck down with madness and humbled miserably. When we experience success in our lives, let us recognise and remember to acknowledge God's hand in it.\n\n<b>THOUGHT</b>\nSoli Deo Gloria - How can I use my successes to glorify God more?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 3&version=KJV\">EXODUS 3</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 7&version=KJV\">LUKE 7</a></b>",
    "22 FEBRUARY": "<b><u>22 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 5:13-17&version=KJV\">2 Samuel 5:13-17</a>\n\n<b>LESSON</b>\nDavid's wives\n\n<b>VERSE 13</b>\n<i>And David took him more concubines and wives out of Jerusalem, after he was come from Hebron: and there were yet sons and daughters born to David.</i>\n\nOn the whole, we read of David's good character in 2 Samuel Chapter 5. It is only in verses 13 to 17 that we catch a hint of his weakness. \"Thus with increase of power came also the increased gratification of David's weakness and sin\" (Pulpit Commentary). Unlike Saul, David was not content with one wife. David's enlargement of his harem was a gradual process. All his sons born at Jerusalem are included in this list. Shammuah, Shobab, Nathan and Solomon were his children by Bathsheba. In later years, like father like son, King Solomon would commit the same sin. Deuteronomy 17:17a - \"Neither shall he multiply wives to himself, that his heart turn not away\" serves as a warning against a king taking on more wives. David wrongly thought in this way he could enlarge his family and strengthen his interest with other families and nations. \"Adam, by one wife, peopled the world, and Noah re-peopled it. David had many wives, and yet that did not keep him from coveting his neighbour's wife and defiling her; for men that have once broken the fence will wander endlessly\" - Matthew Henry. Like King David in this proud act, King Nebuchadnezzar had the same problem with pride. He was reduced to a mad man eating grass and restored only after realising the folly of sinful pride [Daniel 4:28-37]. It is a known fact that power corrupts. With more power comes greater corruption. Let us heed this sin in David's life and not allow pride and the desire for power and prestige to corrupt in any way our spiritual walk with the Lord.\n\n<b>THOUGHT</b>\nNeither shall he multiply wives to himself, that his heart turn not away. - Deuteronomy 17:17a\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 4&version=KJV\">EXODUS 4</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 8&version=KJV\">LUKE 8</a></b>",
    "23 FEBRUARY": "<b><u>23 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 22 these kinds of trials time and again. Unlike Saul,</b>\n<i>And the Philistines came up yet again, and spread themselves in the valley of Rephaim.</i>\n\nThe enmity between the Philistines and the Israelites was ongoing. Today we read of the Philistines approaching David's camp. They were determined to defeat their enemies. However, David met their challenge in the strength of the Lord. And we see God's different methods of handling the same enemy at different times.\n\nThe worth and mettle of any king is in the testing of his reign. Every ruler will experience these kinds of trials time and again. Unlike Saul, David sought the Lord's help prayerfully before going into battle, a testimony of his complete trust in God.\n\nThrough all his battles David acknowledged that God is the One in control of every circumstance and outcome. It is only because of God's love for Israel that He enabled David to be the king of His people. \"David owned it was for his people's sake God had done great things for him; that he might be a blessing to them, and that they might be happy under him\" (Matthew Henry).\n\nThe fact that the Lord is the Leveller and the Warrior shows His power over mankind. He is not a soft and namby-pamby being. On the contrary, we have a God Who is \"mighty in battle\" [Psalm 24:8b]. With God on our side, we are always on the winning side. Never had the nation of Israel appeared so great as it began now to be. Praise God that all believers have such a great and mighty God.\n\n<b></b>\nNay, in all these things we are more than conquerors through Him that loved us. - Romans 8:37\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 5&version=KJV\">EXODUS 5</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 9&version=KJV\">LUKE 9</a>\n<a href=\"https://www.biblegateway.com/passage/?search=THOUGHT Nay, in all these things we are more than conquerors&version=KJV\">THOUGHT Nay, in all these things we are more than conquerors</a>\n<a href=\"https://www.biblegateway.com/passage/?search=through Him that loved us. -- Romans 8:37&version=KJV\">through Him that loved us. -- Romans 8:37</a></b>",
    "24 FEBRUARY": "<b><u>24 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 5:19-21&version=KJV\">2 Samuel 5:19-21</a>\n\n<b>LESSON</b>\nDavid's strategy\n\n<b>VERSE 19</b>\n<i>And David inquired of the LORD, saying, Shall I go up to the Philistines? wilt thou deliver them into mine hand? And the LORD said unto David, Go up: for I will doubtless deliver the Philistines into thine hand.</i>\n\nDavid had just been blessed with two recent great advancements in his life. First, he had been anointed king of Hebron, and then king over all Israel. With these advancements, the resources at his disposal also multiplied. Compared to when he was the leader of a band of fugitives, David now had significantly more fighting men, advisors, and resources for war. Yet in all his conflicts we see that David's strategy never changed. Just as he was reliant on God to succour him in the wilderness, now in time of plenty David continued to remember that ultimately he had to rely on God and not the resources he had been blessed with.\n\nIs this true of us today? When we are going through lean times, we often cry out to God asking for His deliverance. However, when things become better and we have been blessed with much, there is a great temptation to rely on ourselves to resolve problems that arise. Could this be an indication that we have a wrong conception of who God is? He is not to be our last resort. We are to seek Him first in everything we do.\n\nDavid was able to avoid the temptation of self- reliance because he consistently focused on God and His glory, not on self. In verse 21, David put aside self-interest, not enriching himself with the Philistine idols, which were probably made of precious materials, but utterly destroyed them.\n\n<b>THOUGHT</b>\nDo I indulge myself too much such that I forget God in good times?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 6&version=KJV\">EXODUS 6</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 10&version=KJV\">LUKE 10</a></b>",
    "25 FEBRUARY": "<b><u>25 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 5:22-25&version=KJV\">2 Samuel 5:22-25</a>\n\n<b>LESSON</b>\nDavid's victory\n\n<b>VERSE 23</b>\n<i>And when David inquired of the LORD, He said, Thou shalt not go up; but fetch a compass behind them, and come upon them over against the mulberry trees.</i>\n\nDavid's second victory in the valley of Rephaim lay not just in the physical realm where he had before fought and won a victory against the Philistines, but now in the spiritual realm where he once again resisted the sin of presumption and self- reliance. After the first victory and under the exact same conditions (location, opponent etc), it would have been so easy to fall into the trap of thinking God would grant the Israelites another victory in the same way. Yet we see David sincerely seeking God's will. For each instance of trouble David faced, it was a fresh opportunity to present his supplications before God to seek His will. Instead of confronting the Philistines head on like before, God now gave him a new battle plan. Again, this resulted in a significant victory over the Philistines and David was able to drive them back to their own borders.\n\nLet us reflect on the various problems we face in our lives. There are some problems that crop up so regularly it feels very much like resolving these issues is part and parcel of daily life. We no longer worry about them too much but simply proceed mechanically to take the same steps as before to solve them. However, let us recall the first encounter we had and how we sought the Lord's help then. Even though we think we have the situation under control now, let us still seek God's will with the same fervour as before.\n\n<b>THOUGHT</b>\nHow can I be sincere in seeking God when I face a problem I deal with on a regular basis?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 7&version=KJV\">EXODUS 7</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 11&version=KJV\">LUKE 11</a></b>",
    "26 FEBRUARY": "<b><u>26 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 6:1-2&version=KJV\">2 Samuel 6:1-2</a>\n\n<b>LESSON</b>\nDavid's desire\n\n<b>VERSE 2</b>\n<i>And David arose, and went with all the people that were with him from Baale of Judah, to bring up from thence the ark of God, whose name is called by the name of the LORD of hosts that dwelleth between the cherubims.</i>\n\nWhen David was in the wilderness, he had expressed his fervent and sincere longing for public worship in God's presence. Even while in mortal danger, David had continued to seek God early in the morning and in the night watches [Psalm 63]. Now that he was king of Israel and able to worship God publicly without fear of persecution, we see David's continued desire for God's closeness. Since the ark was a representation of God's presence with his people, David therefore sought to bring it to his capital city - to be physically closer to him. During Saul's reign, the ark of the Lord had mainly been residing in Abinadab's house in Kirjarthbaal [1 Samuel 7:1], and perhaps only once been sought by Saul [1 Samuel 14:18]. In contrast to Saul's apathy for God's presence, we see David making great efforts to seek out God's blessing and continual presence in his life. Are we more like Saul or David? Let us examine our lives and consider this question. If God were physically present with us for a day, would we be able to go on gladly with our daily tasks rejoicing that He was with us in such a personal manner, or would we have to censor much of our behaviour and activity? If the latter, then like Saul, it seems we would prefer God to be a distant God. But as Christians who love our Lord, let us desire Him ever more and more.\n\n<b>THOUGHT</b>\nNearer, still nearer, close to Thy heart, draw me, my Savior, so precious Thou art.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 8&version=KJV\">EXODUS 8</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 12&version=KJV\">LUKE 12</a></b>",
    "27 FEBRUARY": "<b><u>27 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 6:3-5&version=KJV\">2 Samuel 6:3-5</a>\n\n<b>LESSON</b>\nDavid's misjudgement\n\n<b>VERSE 3</b>\n<i>And they set the ark of God upon a new cart, and brought it out of the house of Abinadab that was in Gibeah: and Uzzah and Ahio, the sons of Abinadab, drave the new cart.</i>\n\nDavid sincerely desired the nearness of God's presence. He also sincerely wanted to please God by giving Him the best he had to offer. He gathered a select group of thirty thousand and even prepared a new cart to transport the ark. However, the sad truth was that despite such sincerity, David was sincerely wrong. In Numbers 4:4-15, we see that God had ordained the means of moving the ark. Transporting the ark was the duty and privilege reserved solely for the sons of Kohath (the Levitical line). They were to bear it upon their shoulders with staves and carry the ark to their destination. As one who meditated on the Scriptures, this was surely something David knew. Yet here, David chose to ignore God's law and transport the ark in a way he thought best.\n\nPerhaps David was influenced by the fact that the Philistines had returned the ark to Israel on a bullock-drawn cart without coming to any harm. Nevertheless, he ought to have known better than the pagan Philistines, and David's first attempt to transport the ark would end in failure and God's displeasure.\n\nLet this remind us we are to serve God in spirit and in truth. We may come across many worldly ideas about how we can or ought to worship God. Yet let us be diligent in searching the Scriptures for principles that God Himself has ordained, to ensure that we do not err in being sincerely wrong and committing a presumptuous sin even in worship.\n\n<b>THOUGHT</b>\nBe like the Bereans. \"These were more noble than those in Thessalonica, in that they received the Word with all readiness of mind, and searched the Scriptures daily, whether those things were so. -Acts 17:11\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 9&version=KJV\">EXODUS 9</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 13&version=KJV\">LUKE 13</a></b>",
    "28 FEBRUARY": "<b><u>28 FEBRUARY</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 6:6-7&version=KJV\">2 Samuel 6:6-7</a>\n\n<b>LESSON</b>\nUzzah\n\n<b>VERSE 7</b>\n<i>And the anger of the Lord was kindled against Uzzah; and God smote him there for his error; and there he died by the ark of God.</i>\n\nAt Nachon's threshing floor, Uzzah put his hand to the Ark of the LORD in a spontaneous action to prevent it from falling off the cart when the oxen shook it. Uzzah's expedient irreverence evoked the righteous anger of the LORD. Immediately God struck him dead according to the divine precept recorded in Numbers 4:15. It was clear that only the sanctified priests and descendants of Aaron were permitted to handle the Ark. The violation here was similar to that which was recorded at Beth-shemesh [1 Samuel 6:19].\n\nAccording to 1 Chronicles 15:13, the Uzzah disaster occurred because the Levites did not participate in the transporting of the Ark. Uzzah was not a priest. The Ark ought to be borne on the shoulders of Levites [Numbers 7:9]. Perhaps Uzzah had no idea about the unapproachable holiness of the Ark, or had sinned through ignorance, presumptuousness, or inadvertency. The Ark had remained in his father's house for 20 years and he had ceased to regard it with due reverence. Whatever danger the Ark might have been in, handling it was a violation of the law and strictly forbidden. Uzzah assumed the ark was in danger, forgetting that it was the physical symbol of the God Who has all power.\n\nUzzah had to expiate his offence with his life, as a warning to all Israelites. The Lord used the severest measure to illustrate the sacredness of the Ark and the responsibility of each Israelite to respect and honour it. The example of Uzzah must have filled them with fear and holy reverence. The LORD is perfect in His love, mercy and compassion, but He is also perfect in His justice and holiness.\n\n<b>PRAYER</b>\nHumble me, O LORD, that I will always submit my life to Thy holy will, thus bringing glory to Thy name.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 10&version=KJV\">EXODUS 10</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 14&version=KJV\">LUKE 14</a></b>",
    "1 MARCH": "<b><u>1 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 6:8-9&version=KJV\">2 Samuel 6:8-9</a>\n\n<b>LESSON</b>\nDavid's displeasure\n\n<b>VERSE 8</b>\n<i>And David was displeased, because the Lord had made a breach upon Uzzah: and he called the name of the place Perezuzzah to this day.</i>\n\nThe swift divine judgement on Uzzah \"displeased\" David. This word has the idea of a mixed feeling of displeasure and anger. He expressed human anger because the Lord \"had made a breach upon Uzzah\" - God had struck him dead. David might have thought the LORD acted too harshly and unfairly. He might have wondered, what was Uzzah's transgression? As Matthew Henry wrote, \"His punishment for this offence seems very great; why was God this severe with him?\"\n\nDavid's anger stumbled him. David could not be reconciled to the fact that everything happens in accordance with God's perfect providence. David's heart might be even ready to rise up against the sovereign God for striking Uzzah dead in such a dishonourable manner. This lamentable event put a sudden end to the joyful service and occasion, and filled the Israelites with much fear, making them disperse in haste. In his burst of displeasure, David called the place Perez-uzzah (breach of Uzzah). It conveys to the Hebrews an idea of a great calamity [Judges 21:15] or a sudden attack upon a foe [2 Samuel 5:20].\n\nDavid was also afraid of the LORD that day. He asked himself the question, \"How shall the ark of God come to me?\" He really desired the ark of God in Jerusalem with him when he ruled but was frightened owing to the death of Uzzah. His fear eclipsed his faith. He should have cried to the LORD to strengthen his faith. \"What time I am afraid, I will trust in Thee\" [Psalm 56:3]. The fear of the LORD should lead to repentance - not avoidance.\n\n<b>THOUGHT</b>\nThe fear of the Lord tendeth to life: and he that hath it shall abide satisfied; he shall not be visited with evil. - Proverbs 19:23\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 11&version=KJV\">EXODUS 11</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 15&version=KJV\">LUKE 15</a></b>",
    "2 MARCH": "<b><u>2 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 6:10-11&version=KJV\">2 Samuel 6:10-11</a>\n\n<b>LESSON</b>\nSelf-pity stagnates God's work\n\n<b>VERSE 10</b>\n<i>So David would not remove the ark of the Lord unto him into the city of David: but David carried it aside into the house of Obededom the Gittite.</i>\n\nAlarmed by Uzzah's awful death, David was afraid to do anything further with the ark. He had to move the ark - but now chose not to bring it into Jerusalem. Self-pity robbed David of the blessings of God's presence.\n\nThe ark was brought to the house of Obededom the Gittite, a Levite of the family of Korah, and a man whose heart was right before the LORD. The presence of God was not a threat to him but a delight. He was totally comfortable living with the LORD in the midst of his home and God's presence blessed his whole household. \"For them that honour Me, I will honour\" [1 Samuel 2:30]. Those who held reverence for the ark as a symbol of the holy God enjoyed blessings; those who viewed it as a good luck charm flirted with disaster.\n\nDavid resented God's judgement. He threw up a fit of sullen temper as if it was impossible to please God. He abandoned the ark in the house of Obededom. Instead of correcting his fault, David forsook his own mercy. He should have accepted God's judgement humbly, lay aside the weight of self-pity, repent, and sought forgiveness for his erstwhile negligence. He should have waited on God for further light to have a clear view of God's will.\n\nGod's work must be done God's way if it is to have God's presence and His blessings. Self-pity stagnates God's work.\n\n<b>PRAYER</b>\nMay my decisions and actions, O LORD, be for the blessings of others and for the glory of God always.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 12:1-20&version=KJV\">EXODUS 12:1-20</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 16&version=KJV\">LUKE 16</a></b>",
    "3 MARCH": "<b><u>3 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 6:12&version=KJV\">2 Samuel 6:12</a>\n\n<b>LESSON</b>\nThe LORD's blessings\n\n<b>VERSE 12</b>\n<i>And it was told king David, saying, The Lord hath blessed the house of Obededom, and all that pertaineth unto him, because of the ark of God. So David went and brought up the ark of God from the house of Obededom into the city of David with gladness.</i>\n\nDavid received positive reports of the blessings to Obededom associated with the presence of the ark. God had honoured those who honoured Him. This would include physical as well as spiritual blessings for the family, their home and land, crops and livestock, health and peace of mind.\n\nThe ark of the LORD which brought sudden disaster and awful death among the Philistines in city after city [1 Samuel 5:1-7], at Bethshemesh [1 Samuel 6:19], and eventually to Uzzah at Nachon's threshing floor, brought abundant abiding blessings to the house of Obededom, because he was God- fearing and conscious of no other purpose but honouring God.\n\nToday, God's ark does not exist needing a physical lodging, but God's presence is found in His persecuted servants worldwide labouring for Him under great discouragement and these need our support. The house of Obededom which had a heart for God did not suffer but thrived because in taking care of God's things, God in turn took care of them.\n\nAfter delaying three months, David finally brought the ark from the house of Obededom to the city of David with gladness. Likewise, if we continue to worship and serve God and the interests of His kingdom, God will surely bless our efforts. \"The Lord bless thee, and keep thee: The Lord make His face shine upon thee, and be gracious unto thee: The Lord lift up His countenance upon thee, and give thee peace\" [Numbers 6:24-26].\n\n<b>THOUGHT</b>\nAnd let us not be weary in well doing: for in due season we shall reap, if we faint not. As we have therefore opportunity, let us do good unto all men, especially unto them who are of the household of faith. - Galatians 6:9-10\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 12:21-51&version=KJV\">EXODUS 12:21-51</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 17&version=KJV\">LUKE 17</a></b>",
    "4 MARCH": "<b><u>4 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 12 a catt instead of carrying it on the shoulders of</b>\n<i>And it was told king David, saying, The Lord hath blessed the house of Obededom, and all that pertaineth unto him, because of the ark of God. So David went and brought up the ark of God from the house of Obededom into the city of David with gladness.</i>\n\nDavid's previous attempt to bring the Ark of the Covenant to Jerusalem had met with a setback when Uzzah was struck dead upon touching the Ark. Hence, it was left in the household of Obededom for three months [v. 6-11]. But this brought God's blessings upon the house of Obededom. King David then realised it was not the moving of the Ark which had incurred God's wrath but the lack of reverence for God when transporting it - they had imitated the Philistines' method of moving their idols by using a cart instead of carrying it on the shoulders of the Levites as instructed in the book of the Laws [Numbers 4:15; 7:9].\n\nHence, when David moved the Ark the second time, it was done with much care in accordance with what the Lord had instructed [1 Chronicles 15:2, 13-15]. What great relief when no one was struck down. So joyful was he that the king paused the procession after only six paces and offered sacrifices of thanksgiving unto the Lord [v. 13].\n\nDespite the earlier setback, David had profited through his past error and humility to learn an important lesson. Now he stands stronger in godly zeal and affection according to the precepts of Scriptures. Not only was this merely a personal conviction, but it was also his desire to spread this gladness in service and pursuit of holiness to his people. By his own zeal for worshipping God so demonstrated [v. 13-15], a like zeal would be infused in the people of Israel.\n\n<b></b>\nFather in heaven, grant us hearts that are tender to submit to Your will. Renew our hearts that we may serve Thee with joy and gladness. In Jesus' Name, Amen.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "5 MARCH": "<b><u>5 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 6:16&version=KJV\">2 Samuel 6:16</a>\n\n<b>LESSON</b>\nMichal's contempt\n\n<b>VERSE 16</b>\n<i>And as the ark of the Lord came into the city of David, Michal Saul's daughter looked through a window, and saw king David leaping and dancing before the Lord; and she despised him in her heart.</i>\n\nAs the Ark was returned to Jerusalem, there was much rejoicing and celebration with the ritual of music, dancing, sacrifice and feasting [v. 16-19]. Despite the happiness of the occasion, we see the look of contempt on Michal's face - daughter of King Saul first given in marriage to David, but then in an unkind turn of events, given by Saul to Phalti, the son of Laish, for a wife [1 Samuel 25:44]. Michal now criticised David harshly for dancing in such an undignified manner.\n\nThere is something we can learn from Michal through her encounters with David. Her love for David in his youth was evident [1 Samuel 18:20, 28] especially after witnessing his heroic act of slaying Goliath. As a dowry to marry her, David even slew two hundred Philistines for their foreskins to be 'avenged of the king's enemies' [1 Samuel 18:25- 27]. Then, she loved the generous, heroic and manly character of David.\n\nHowever, at this moment when it involved David's fervour and joy for his faith and his God, her attitude of love and admiration changed to contempt. While this shows the inconsistency of her desires and affections, it is perfectly consistent with the behaviour of a carnal and worldly mindset - one which regards only the temporal things of the natural man, but does not appreciate the things that are spiritual and eternal. Where do our desires lie? Are we like Michal and Saul, merely loving the fleshly and outward things, holding only to a form of religion, but denying the power of true godliness [2 Timothy 3:5] or are we like David?\n\n<b>THOUGHT</b>\nWhile we look not at the things which are seen, but at the things which are not seen: for the things which are seen are temporal; but the things which are not seen are eternal. - 2 Corinthians 4:18\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 14&version=KJV\">EXODUS 14</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 19&version=KJV\">LUKE 19</a></b>",
    "6 MARCH": "<b><u>6 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 6:16&version=KJV\">2 Samuel 6:16</a>\n\n<b>LESSON</b>\nDavid danced\n\n<b>VERSE 16</b>\n<i>And as the ark of the Lord came into the city of David, Michal Saul's daughter looked through a window, and saw king David leaping and dancing before the Lord; and she despised him in her heart.</i>\n\nWhile Saul's reign was marked by indifference in the nation's religious life, David corrected this state of affairs. He did so by restoring the Ark, the symbol of God's presence, to its rightful position at the centre of Israel's spiritual and religious life. In contrast to Michal's disdain, David was leaping and dancing before the Lord with joy. David's rejoicing was particularly appropriate for this occasion because it marks a new chapter in the religious significance of Jerusalem and her spiritual influence which will eventually pervade not just Israel but the entire world with the spread of the Gospel.\n\nDavid's zeal and rejoicing ought not to be despised because it was the moving of the Holy Spirit and the outworking of God's redeeming love that caused the king to be so. A season of gladness as manifested by David's dancing \"before the Lord with all his might\" [v. 14] should not be neglected. It was not just David alone rejoicing, but together with the people's shouting and singing, the noise of musical instruments and the gifts of the people, the city was partaking of the joyful occasion.\n\nMost importantly, the centre of their celebration was marked by worship. Sacrifices were offered as a new page was opened for God's nation and kingdom. Praises were rendered to the Almighty as the procession made its way up to His city. When the ark had been placed in the tent prepared for it, \"David offered burnt offerings and peace offerings before the Lord\" [v. 17] and then David \"blessed the people in the name of the Lord of hosts\" [v. 18]. Indeed, it was a high point in the reign of king David.\n\n<b>THOUGHT</b>\nRejoice, the Lord is King: Your Lord and King adore! Rejoice, give thanks and sing, And triumph evermore. Lift up your heart, Lift up your voice! Rejoice, again I say, rejoice! - Charles Wesley\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 15&version=KJV\">EXODUS 15</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 20&version=KJV\">LUKE 20</a></b>",
    "7 MARCH": "<b><u>7 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 17 destroyed, rebels punished, the irreverent smitten</b>\n<i>And they brought in the ark of the Lord, and set it in his place, in the midst of the tabernacle that David had pitched for it: and David offered burnt offerings and peace offerings before the Lord.</i>\n\nThe return of the Ark to Jerusalem was a great event in the spiritual history of Israel. But it is not the physical presence of the Ark that really mattered. Of infinitely greater significance is God's Divine presence with His people.\n\nIn their long history, God's presence represented by the Ark had led the Israelites through the wilderness. Their enemies have been scattered, the waves of the Jordan arrested, the walls of Jericho toppled, the land subdued, false Canaanite deities destroyed, rebels punished, the irreverent smitten and the obedient blessed.\n\nNow rest had finally come to Israel as the people re-established their relationship with their Divine King affirmed by the Ark in their midst. The Israelites now acknowledged His sovereignty in worship as the twelve tribes unite under the banner of one nation Israel. It was a testament to the significance of the Divine Law, God's atoning mercies, Divine fellowship and His special favour upon them.\n\nThe work of God transcends the kingdom of Israel into our present day and His power is beyond human description. He has overcome not just the enemies of the past, but also our strongest spiritual foe! He has effected spiritual regeneration and reformation over the course of human history. As David 'blessed the people in the name of the Lord of hosts', pray that as God's people today, we may also be partakers of the assurance of this Divine blessing because the Lord is with us.\n\n<b></b>\nGuide me, O Thou great Jehovah, pilgrim through this barren land; I am weak, but Thou art mighty; hold me with Thy pow'rful hand. Bread of heaven, bread of heaven, feed me till I want no more! - William Williams\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "8 MARCH": "<b><u>8 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 6:20-23&version=KJV\">2 Samuel 6:20-23</a>\n\n<b>LESSON</b>\nMichal's worldview\n\n<b>VERSE 20</b>\n<i>Then David returned to bless his household. And Michal the daughter of Saul came out to meet David, and said, How glorious was the king of Israel to day, who uncovered himself to day in the eyes of the handmaids of his servants, as one of the vain fellows shamelessly uncovereth himself!</i>\n\nWhat a joyous occasion! David had successfully brought home the ark of the LORD, bringing blessing to Jerusalem, but instead of praise, he was met with sarcasm and slander from his own wife. Imagine coming back from a hard day's work, only to face an angry and moody loved one. It was much worse for David than this.\n\nMichal's name means \"who is like God\", but she was nothing like that on this occasion. In one sentence, Michal used the Hebrew verb for \"revealing\" or \"uncovering himself \" three times to stress how David had embarrassed himself in public. Considering the context, David was not naked, but the word used by Michal implied that the situation was so humiliating it was as if David was dancing naked in front of the slave girls. Imagine, the royal blooded but without royal regalia, leaping and cavorting before commoners and slaves. What shameful action! As we read three days ago, this remark came out of utter contempt in Michal's sinful heart. Michal thought that a king should always be acting like a king, especially in public. She cared only about his outward behaviour.\n\nComing from a traditional Bible-believing church, have we placed traditions before joyful expressions and wholehearted service for God? Are our hearts constricted to the extent that we scoff, judge or feel uneasy when we see others serving God with effusive joyfulness and exuberance but in our opinion without the proper decorum?\n\nRoyal king David was not behaving like a royal that day, but it was because he cared more about God rather than himself and we will explore more about this tomorrow in David's reaction.\n\n<b>THOUGHT</b>\nAre we more concerned with rules, traditions and decorum than serving God wholeheartedly and joyfully?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 17&version=KJV\">EXODUS 17</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 22&version=KJV\">LUKE 22</a></b>",
    "9 MARCH": "<b><u>9 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 6:21&version=KJV\">2 Samuel 6:21</a>\n\n<b>LESSON</b>\nDavid's worldview (I)\n\n<b>VERSE 21</b>\n<i>And David said unto Michal, It was before the LORD, which chose me before thy father, and before all his house, to appoint me ruler over the people of the LORD, over Israel: therefore will I play before the LORD.</i>\n\nDavid's reply was one that gave honour and glory to God. Despite the hurt David must have felt hearing such censorious words from his own wife, he turned the situation into an opportunity for glorifying God.\n\nIn David's reckoning, it was not the people of Judah who had chosen to anoint him as the nation's king. David knew that they were mere \"puppets\" in the hands of a righteous God. It was Yahweh who had appointed David king, so David brought the ark of the LORD back to Jerusalem for Him and it is before Yahweh he is playing. The Hebrew word for \"play\" refers to actions such as playing instrumental music, singing or dancing and we can tell from this that David was absolutely rejoicing before Yahweh upon his return to Jerusalem with the ark.\n\nWhen faced with hurting words or unfavourable situations, are we tempted to sin under pressure or do we see those moments as opportunities to bring glory to God's name and edify those around us? David's heart was filled with such joy that despite the hurting words of Michal, he chose to give credit and glory to his Father in heaven.\n\nThe author of 2 Samuel uses the words of David here to remind us it was Yahweh's plan that Michal's father Saul would be replaced by David. In the same way, Yahweh also has a plan for all of us and we ought to glorify Him in all that we do.\n\n<b>THOUGHT</b>\nWhat is our first reaction when faced with adversity or unpleasantness? Do we see them as opportunities to please and praise God?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 18&version=KJV\">EXODUS 18</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 23&version=KJV\">LUKE 23</a></b>",
    "10 MARCH": "<b><u>10 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 6:22&version=KJV\">2 Samuel 6:22</a>\n\n<b>LESSON</b>\nDavid's worldview (II)\n\n<b>VERSE 22</b>\n<i>And I will yet be more vile than thus, and will be base in mine own sight: and of the maidservants which thou hast spoken of, of them shall I be had in honour.</i>\n\nAfter giving glory to God, David goes further to say that his low standing is in his own sight and if he cannot be honoured by his own wife, he would be content to receive the honour of slave girls Michal referred to earlier. David was the king, the most important man in Israel, the \"numero uno\" and \"top dog\", yet before Yahweh, he would gladly devalue himself in order to magnify God's goodness towards him.\n\nDavid's humility is one reason why he is considered a type of Christ. Our Lord Jesus forsook his immortality in heaven, bore human flesh and came down as a lowly carpenter's son to fulfil the plans His Father had for us. Even though Jesus is humanity's one true King, He chose to be humiliated, tortured and killed at the hands of His own creation, so as to give us this gift of grace.\n\nMany of us have worldly achievements we are proud of. Perhaps we did well recently in our exams and graduated top of the class. Perhaps we have a job at a prestigious multi-national corporation or received a promotion. Perhaps we hold a leadership position in church. Regardless of what it is, we all have something we are proud of.\n\nBeloved, approach the cross and leave your achievements there before the Nail Pierced One, for even though they may be great in the eyes of this world, they mean nothing in eternity. The secret to humility is a constant reminder of who God is and what Christ has done for us.\n\n<b>THOUGHT</b>\nWhen we are tempted to be proud, remember what Christ has done so that we can continue to be humble and meek, for these shall inherit the earth (Matthew 5:5).\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 19&version=KJV\">EXODUS 19</a>\n<a href=\"https://www.biblegateway.com/passage/?search=LUKE 24&version=KJV\">LUKE 24</a></b>",
    "11 MARCH": "<b><u>11 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 23 said earlier in verses 21 and 22. When our God has</b>\n<i>Therefore Michal the daughter of Saul had no child unto the day of her death.</i>\n\nIf we are forgiven of our sins, then why can't Michal be forgiven too? Everyone is sinful, right? Was not God being a bit harsh on Michal for that one outburst at her husband? Are not arguments between husband and wife quite common? The clue to our answer lies in the word \"therefore\".\n\nThe translators of the KJV rightly translated the Hebrew conjunction as \"therefore\", indicating a connection between this verse and what David said earlier in verses 21 and 22. When our God has a plan, He carries out His plan fully and will ensure that His word does not return to Him void. Even though Michal was David's wife, God ensured that there was no intertwining of the family lines of Saul and David so that ultimately, Jesus the One True King, would come only from the line of David and not Saul.\n\nIn the overall scheme of things, it was probably not Michal's one remark or sin that caused her to be childless, but just a cumulative step in the outworking of God's master plan. From a small incident as this, we can see God's hand moving in the midst of His people for the good of their salvation.\n\nSimilarly, our lives are filled with many small seemingly isolated events. Be encouraged to thank God for every small blessing or trial that befalls you, for it is all part of His plan to do good for you, to keep you on the narrow path of righteousness so that one day you may enjoy eternity with Him forevermore.\n\n<b></b>\nChallenge yourself to take a moment during your busy day to thank God for all the small things He has blessed you with.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=forevermore.&version=KJV\">forevermore.</a>\n<a href=\"https://www.biblegateway.com/passage/?search=EXODUS 20&version=KJV\">EXODUS 20</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 1&version=KJV\">JOHN 1</a>\n<a href=\"https://www.biblegateway.com/passage/?search=THOUGHT Challenge yourself to take a moment during your&version=KJV\">THOUGHT Challenge yourself to take a moment during your</a>\n<a href=\"https://www.biblegateway.com/passage/?search=busy day to thank God for all the small things He&version=KJV\">busy day to thank God for all the small things He</a>\n<a href=\"https://www.biblegateway.com/passage/?search=has blessed you with.&version=KJV\">has blessed you with.</a></b>",
    "12 MARCH": "<b><u>12 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:1-2&version=KJV\">2 Samuel 7:1-2</a>\n\n<b>LESSON</b>\nWork and worship\n\n<b>VERSE 1</b>\n<i>And it came to pass, when the king sat in his house, and the LORD had given him rest round about from all his enemies.</i>\n\nIn this chapter, King David was found resting in his house, a respite from the military campaigns that he fought for the Lord. Notice it was the Lord who had given King David this rest. Indeed, there is a season, and a time to every purpose under the heaven ... and in David's case, a time of war and a time of peace [Ecclesiastes 3:1, 8b]. Work and rest have always been the norm for man, because man is not meant to work without rest. Even in a 24-hour day, man is not able to work round the clock, and if he attempted to do so, it would have unhealthy consequences. In some situations, perhaps of crisis, a person may be required to work for even much longer periods continuously, but eventually he will need to stop and rest. Rest is a non-negotiable fact of life.\n\nGod introduced the idea of rest to the Hebrews after He led them out of Egypt [Exodus 20:8-11, 35:2]. They were not to work on the seventh day, but to keep that day holy and the Lord would provide for them. Is this still applicable in today's modern world? The Lord has shown us by example how He had provided for the Israelites in the wilderness when they were supplied a double portion of manna on the sixth day [Exodus 16:22] to provide for the seventh.\n\nAs children of God, we can trust in the daily provision of the Lord instead of worrying about what and how we should bring food to the table every day. Keep the day of sabbath rest that God has commanded us to, and worship Him instead.\n\n<b>THOUGHT</b>\nCome unto Me, all ye that labour and are heavy laden, and I will give you rest. Take My yoke upon you, and learn of Me; for I am meek and lowly in heart: and ye shall find rest unto your souls. - Matthew 11:28-29.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 21&version=KJV\">EXODUS 21</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 2&version=KJV\">JOHN 2</a></b>",
    "13 MARCH": "<b><u>13 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:2&version=KJV\">2 Samuel 7:2</a>\n\n<b>LESSON</b>\nNathan\n\n<b>VERSE 2</b>\n<i>That the king said unto Nathan the prophet, See now, I dwell in an house of cedar, but the ark of God dwelleth within curtains.</i>\n\nAs King David took his rest from his wars, his thoughts were on the ark of God. It troubled him that while he was living in a luxurious palace made of beautiful cedar, the ark of God lay behind the curtains of the tabernacle made of common shittim wood boards and animal skins. King David, though resting was not wasting his time. Things of God occupied his mind and he shared them with Nathan the prophet.\n\nThe prophet Nathan is first introduced in the Scriptures in these few passages of 2 Samuel. As a prophet in the royal court, his task was to give spiritual advice to King David. A prophet is God's messenger, and thus respected for his position not just as the mouthpiece but at times also the channel for God's mighty working, as when the prophet Elijah resurrected a widow's son in 1 Kings 17:17- 24. Nathan the prophet is therefore a well-respected person in the kingdom, and he would be the one to confront David for his sin with Bathsheba [2 Samuel 12:7-14].\n\nA prophet had a vital role in the Old Testament, for God spoke to men through them. Today however, we do not have the ministry of prophets anymore, because God has spoken to man through His Son, Jesus Christ [Hebrews 1:1-2]. And He still speaks to us, through the Bible, which points all men to Christ for salvation. Let us therefore look to God through His Word alone, and not rely on any other extra-biblical sources.\n\n<b>THOUGHT</b>\nGod, who at sundry times and in divers manners spake in time past unto the fathers by the prophets, Hath in these last days spoken unto us by His Son, whom he hath appointed heir of all things, by whom also he made the worlds. - Hebrews 1:1-2.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 22&version=KJV\">EXODUS 22</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 3&version=KJV\">JOHN 3</a></b>",
    "14 MARCH": "<b><u>14 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:3&version=KJV\">2 Samuel 7:3</a>\n\n<b>LESSON</b>\nDo all that is in thine heart\n\n<b>VERSE 3</b>\n<i>And Nathan said to the king, Go, do all that is in thine heart; for the LORD is with thee.</i>\n\nWhen King David opened his heart to Nathan about the ark, the symbol of God's presence among the Israelites, dwelling in a tent, while he the king dwelled in a great house, Nathan immediately answered telling him to do what his heart prompted him to because the Lord was with him. We must realise that in these verses, the exchange between king and prophet was a conversation voicing aloud the personal thoughts of two men. It was a spontaneous exchange with no indication that Nathan had taken the time to consult with God on the king's desire.\n\nA casual reading of this passage may lead us to conclude that this was indeed God's will: the desire by David to elevate the housing of the ark sounded good, for the king certainly had the means to accomplish the plan and it was for God's glory. Humanly speaking, it was a lofty and commendable idea and Nathan was quick to endorse it. Disagreeing with the king on such a reasonable proposal may not look good for Nathan. But at the back of his mind, Nathan may surely be thinking that since this involved God's ark, it would be wise to wait and seek the Lord's blessings.\n\nWe have to be mindful even when our ideas seem good and sound. God may have other plans that we cannot foresee nor understand. The best human plans may fail, but God's plan never will, so lay all your plans, desires and thoughts before the Lord and wait for His leading.\n\n<b>THOUGHT</b>\nWho is he that saith, and it cometh to pass, when the Lord commandeth it not? - Lamentations 3:37\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 23&version=KJV\">EXODUS 23</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 4&version=KJV\">JOHN 4</a></b>",
    "15 MARCH": "<b><u>15 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:4-5&version=KJV\">2 Samuel 7:4-5</a>\n\n<b>LESSON</b>\nGod's response\n\n<b>VERSE 5</b>\n<i>Go and tell My servant David, Thus saith the LORD, Shalt thou build Me an house for Me to dwell in?</i>\n\nEven as the prophet advised King David to go ahead with his heart's desire, that same night, the word of the Lord came to Nathan with God's response. God asked David: \"Shalt thou build Me an house for Me to dwell in?\" It was clear that David was not God's candidate to build His house. God did not say, \"No, do not build an house for Me to dwell in\" but rather that David was not the one to build the house. God was correcting David's perspective on several levels. Firstly, God's house is not to be compared to the king's house. The purpose of God's house is not an abode for God to dwell in. God's purpose for His house is for His worship and to represent His glory and holiness to all the people and nations around them. Secondly, it is God that defines the terms of the building of His house on earth, not David. So whether or not, and when God's ark should move from behind the tabernacle's curtains into a house of cedar and gold, is entirely up to Him. Consider how we react when God says \"No\" or \"Wait\" instead of \"Yes\" to our plans? Do we humble ourselves and submit to His will or do we begin to doubt, grumble and object? We have been bought at a great price - the blood of Christ upon the cross. God's desire is always for our good. Therefore, we are to submit humbly to Him in all things.\n\n<b>THOUGHT</b>\nI am crucified with Christ: nevertheless I live; yet not I, but Christ liveth in me: and the life which I now live in the flesh I live by the faith of the Son of God, who loved me, and gave himself for me. - Galatians 2:20\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 24&version=KJV\">EXODUS 24</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 5&version=KJV\">JOHN 5</a></b>",
    "16 MARCH": "<b><u>16 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:6-7&version=KJV\">2 Samuel 7:6-7</a>\n\n<b>LESSON</b>\nGod's focus\n\n<b>VERSE 7</b>\n<i>In all the places wherein I have walked with all the children of Israel spake I a word with any of the tribes of Israel, whom I commanded to feed My people Israel, saying, Why build ye not Me an house of cedar?</i>\n\nDavid's intentions were pure and honest, but what he proposed was not what the Lord had willed. Perhaps out of a grateful heart, David wanted to do something for God, and relying on what his eyes told him, he saw the 'need' to build a house for the Lord. Yet the truth is, God does not need anything from anyone. The heavens and the earth and everything therein belong to Him. He is the transcendent God, yet He condescended to the level of man, to be with the children of Israel, leading them through the wilderness and their conquest of the Promised Land. If there was one important lesson His children should have learnt from those years of walking with God, it should be that of trust and obedience. We should see how our God through history is building up a people who acknowledge Him as the faithful and sovereign God. This is what God wants of His people. Even today, we need to recognise the snare that might come with a building project like what David was proposing. Looking at the finished work, will we indulge ourselves in presumptuousness over the good work we have done in the name of God's glory? Will we entertain thoughts that we were the ones who saw the 'need' in God's kingdom, and acted swiftly upon it? Be sure to guard our hearts against pride and deceit. It is better that we dwell with God in our hearts than merely putting up outward displays of devotion.\n\n<b>THOUGHT</b>\nBut one thing is needful: and Mary hath chosen that good part, which shall not be taken away from her. - Luke 10:42\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 25&version=KJV\">EXODUS 25</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 6&version=KJV\">JOHN 6</a></b>",
    "17 MARCH": "<b><u>17 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:8-9&version=KJV\">2 Samuel 7:8-9</a>\n\n<b>LESSON</b>\nGod's leading\n\n<b>VERSE 9</b>\n<i>And I was with thee whithersoever thou wentest, and have cut off all thine enemies out of thy sight, and have made thee a great name, like unto the name of the great men that are in the earth.</i>\n\nDavid was who he was because he had found grace in the eyes of God. We see how God preserved David from the pursuits of Saul, and how the way was paved for him to become king of Israel: Saul was killed in 1 Samuel 31 by the Philistines; Abner was killed by Joab in 2 Samuel 3, Ish-bosheth was assassinated in 2 Samuel 4. All these came to pass not because David had plotted them. In fact, David was presented with many opportunities to \"fast-forward\" history in his own interest, but he steadfastly chose not to take things in his own hands. We also see how God empowered David with strength and wisdom to defeat Israel's enemies. Though there were times when David succumbed to his own doubts and infirmities [1 Samuel 21; 27], God extended His mercies toward him. Everyone makes mistakes, but more important is to learn from them and sin no more. The truth is, the closer we walk with God, the better will we understand the extent of His lovingkindness.\n\n\"For unto whomsoever much is given, of him shall be much required.\" Certainly in the heart of David, there was much gratitude, and in return he would by God's grace do what he could to lead and protect God's people, not out of obligation, but with a willing heart. As Paul confessed, \"But by the grace of God I am what I am: and His grace which was bestowed upon me was not in vain; but I laboured more abundantly than they all: yet not I, but the grace of God which was with me\" [1 Corinthians 15:10].\n\n<b>THOUGHT</b>\nHe (God) chose David also His servant, and took him from the sheepfolds: From following the ewes great with young He brought him to feed Jacob His people, and Israel His inheritance. So he fed them according to the integrity of his heart; and guided them by the skilfulness of his hands. - Psalm 78:70-72\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 26&version=KJV\">EXODUS 26</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 7&version=KJV\">JOHN 7</a></b>",
    "18 MARCH": "<b><u>18 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:10-11&version=KJV\">2 Samuel 7:10-11</a>\n\n<b>LESSON</b>\nGod's promise of blessings\n\n<b>VERSE 11</b>\n<i>And as since the time that I commanded judges to be over My people Israel, and have caused thee to rest from all thine enemies. Also the Lord telleth thee that he will make thee an house.</i>\n\nWhen David aspired to build a house for God, he envisioned a building made out of the best wood available for it, but when God told David about building him a house, it was way beyond anything David could imagine.\n\nIn verse 9, we read that God would make Israel a great name. Because God was with His people, Israel would be known among men. In today's verses, we also see that God's people would be given a land to dwell in, as a lasting kingdom. The children of God would have a land they could call their own and free from harassment by their enemies.\n\nThese verses point us to God's covenant with His people, and His great salvation plan for us. With the coming of Christ, that which was concealed in the Old Testament, the mystery of the Gospel, would be revealed to God's people. Whosoever believes in Jesus will enter His kingdom of grace, and become part of spiritual Israel, awaiting that great day of consummation when Christ will return again to set up His kingdom of glory. The glorious kingdom of Christ would eventually be one where saints are given the final rest from all their spiritual foes and physical afflictions.\n\nHave you called upon Jesus to be your personal Lord and Saviour? Blessed indeed are they who have placed their trust in Him, for though there are still life's challenges to face, they know and can look and press forward to the day of glory. While we await the day of final rest, our Lord continues to lead us daily in our sojourn in this world.\n\n<b>THOUGHT</b>\nCome unto Me, all ye that labour and are heavy laden, and I will give you rest. Take My yoke upon you, and learn of Me; for I am meek and lowly in heart: and ye shall find rest unto your souls. - Matthew 11:28-29\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 27&version=KJV\">EXODUS 27</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 8&version=KJV\">JOHN 8</a></b>",
    "19 MARCH": "<b><u>19 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 13 He entered into covenants with man, and by His</b>\n<i>He shall build an house for My name, and I will stablish the throne of his kingdom for ever.</i>\n\nThe blessed covenant which we read in this chapter is known as the Davidic Covenant. Our God is a covenantal God Who makes His promises to man unilaterally and then binds Himself to them because man, by himself, is in no position to discuss terms with his Creator God, and all the more so in his depraved, fallen state - man does not deserve at all the blessings of God. Yet thank God for His love for us for in His mercy, He entered into covenants with man, and by His faithfulness, we are assured that what He promised will surely come to pass.\n\nGod told David his life will come to an end, but God's promises will continue through his descendants. The throne of David's kingdom will be established forever. This points us towards the kingdom in which our Lord Jesus Christ will reign eternally; God's will was such that when the Messiah came the first time, He would be born in the tribe of Judah, from the root of Jesse, as the seed of David.\n\nThe full impact of this covenant will only be made known when the mystery is revealed with the coming of our Lord, causing us to be in awe of God's manifold wisdom. Yet such is the beauty of prophecy - that there is also relevance even to the time when the prophecy was made, for David's son Solomon indeed would fulfil the denied wish of his father; he would build a house in God's name - the Temple which would become a witness pointing the people towards God's promise of establishing a permanent abode, where God dwells with His children in the glorious kingdom that is to come.\n\n<b></b>\nMoreover He refused the tabernacle of Joseph, and chose not the tribe of Ephraim: But chose the tribe of Judah, the mount Zion which He loved. And He built His sanctuary like high palaces, like the earth which He hath established for ever. - Psalm 78:67-69\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "20 MARCH": "<b><u>20 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:14&version=KJV\">2 Samuel 7:14</a>\n\n<b>LESSON</b>\nIntimate relationship\n\n<b>VERSE 14</b>\n<i>I will be his father, and he shall be My son. If he commit iniquity, I will chasten him with the rod of men, and with the stripes of the children of men.</i>\n\nIf we were David, we would probably be elated over God's blessings upon our descendants. Yet does that mean David would therefore be blessed with a blameless posterity? What will happen when they sin? Or worse, what if given their privileged positions, they abuse the grace granted to them and sin presumptuously against God?\n\nThe answer is clear. They will be disciplined. God's promise is unconditional, but this does not mean God will simply allow David's sons to do whatever they want without any consequences to them. He warns He will chastise those who do wrong. In fact, this is exactly what a loving parent will do - discipline his child so that he grows to become what he ought to be. \"He that spareth his rod hateth his son: but he that loveth him chasteneth him betimes\" [Proverbs 13:24]. Sometimes the discipline will be hard to bear - and God will even use His enemies to bring His children to their senses. He did that throughout the Bible, and surely will continue to do so with us today.\n\nLet us therefore strive to uphold a good testimony for His glory. Grieve not the Holy Spirit. Give the devil no foothold in our life. Let us not become an occasion of stumbling for the people around us. Walk worthy of the vocation wherewith we are called, and lead faithful, fruitful and victorious lives.\n\n<b>THOUGHT</b>\nFor the time is come that judgment must begin at the house of God: and if it first begin at us, what shall the end be of them that obey not the Gospel of God? - 1 Peter 4:17\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 29&version=KJV\">EXODUS 29</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 10&version=KJV\">JOHN 10</a></b>",
    "21 MARCH": "<b><u>21 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=&version=KJV\"></a>\n\n<b>LESSON</b>\n\n\n<b>VERSE 15 from the Hebrew word hesed. Although various</b>\n<i>But My mercy shall not depart away from him, as I took it from Saul, whom I put away before thee.</i>\n\nPaul and Silas had been stripped, beaten with rods, imprisoned and put in chains. Their backs were lacerated and bloody. We can only imagine the excruciating pain they were experiencing!\n\nAlthough God would chastise David's descendants for their iniquities, He would not remove His mercy from them as He had done to Saul. The word \"mercy\" in this verse is translated from the Hebrew word hesed. Although various English words like \"kindness\", \"steadfast love\", \"lovingkindness\", \"goodness\", and \"mercy\" have been used to translate this word, no single English word can adequately convey the richness of its meaning. It is a word that reveals the very character of God, a word which God used to describe Himself in Exodus 34:6-7: \" ... The Lord, The Lord God, merciful and gracious, longsuffering, and abundant in goodness (hesed) and truth, keeping mercy (hesed) for thousands ... \"\n\nHesed speaks of God's gracious and merciful nature. The hesed of God is not merely an abstract feeling of goodwill; it is a steadfast love that endures forever. God's love for His people does not depend upon their faithfulness or obedience. Rather, it is because of His hesed that He chose to enter into a covenant with His people and bound Himself to do good to them eternally. The fullness of His hesed is seen on the cross, where the Lord Jesus--the only truly faithful and righteous Son of God--was condemned for sin, so that we who are unfaithful may be made righteous in Him.\n\nAs God's covenant people, we may cry out to our loving God in times of trials. We can trust that He who is abundant in hesed will see us through the challenges of life and keep us till the end.\n\n<b></b>\nIt is of the Lord's mercies [hesed] that we are not consumed, because His compassions fail not. They are new every morning: great is Thy faithfulness. - Lamentations 3:22-23\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b></b>",
    "22 MARCH": "<b><u>22 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:16&version=KJV\">2 Samuel 7:16</a>\n\n<b>LESSON</b>\nForever kingdom\n\n<b>VERSE 16</b>\n<i>And thine house and thy kingdom shall be established for ever before thee: thy throne shall be established for ever.</i>\n\nVerse 16 concludes God's promises to David with an emphasis on the permanence of David's dynasty, kingdom, and throne. Because God Himself has undertaken to establish this kingdom, God's people can confidently look forward to a Davidic kingdom that will last forever. The Davidic king will represent God's rule on earth and reflect His righteousness.\n\nHow is the promise of a forever kingdom to be fulfilled? Many kings who succeeded David turned out to be unfaithful and wicked, resulting in the destruction of Jerusalem and the exile of the Israelites to Babylon. However, the Israelites knew that God's chastisement would not be forever. A descendant of David, a perfect King, would come. He would deliver God's people and restore God's rule on earth.\n\nThe true Davidic King has come in the person of the Lord Jesus Christ. He is the sinless Son of God who rules with perfect justice and righteousness. By His sacrificial death on the cross, He has redeemed His people and released them from the control of Satan. Christ's kingdom is now spiritual, consisting of all who repent and trust in Him as their Saviour and submit to His rule. One day, He will return to judge the world and destroy all evil. God's kingdom on earth will be restored to its full glory, and Christ will reign in His eternal kingdom forever.\n\nHave you submitted to Christ's rule over your life? If not, then repent and believe in the Lord Jesus Christ so you may be part of His glorious kingdom.\n\n<b></b>\nOur Father which art in heaven, Hallowed be Thy name. Thy kingdom come, Thy will be done in earth, as it is in heaven. - Matthew 6:9-10\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 31&version=KJV\">EXODUS 31</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 12&version=KJV\">JOHN 12</a>\n<a href=\"https://www.biblegateway.com/passage/?search=PRAISE&version=KJV\">PRAISE</a>\n<a href=\"https://www.biblegateway.com/passage/?search=VPM TaN Gin&version=KJV\">VPM TaN Gin</a>\n<a href=\"https://www.biblegateway.com/passage/?search=erse 16 concludes God's promises to David&version=KJV\">erse 16 concludes God's promises to David</a>\n<a href=\"https://www.biblegateway.com/passage/?search=with an emphasis on the permanence of&version=KJV\">with an emphasis on the permanence of</a>\n<a href=\"https://www.biblegateway.com/passage/?search=David's dynasty, kingdom, and throne. Because&version=KJV\">David's dynasty, kingdom, and throne. Because</a>\n<a href=\"https://www.biblegateway.com/passage/?search=God Himself has undertaken to establish this&version=KJV\">God Himself has undertaken to establish this</a>\n<a href=\"https://www.biblegateway.com/passage/?search=kingdom, God's people can confidently look&version=KJV\">kingdom, God's people can confidently look</a>\n<a href=\"https://www.biblegateway.com/passage/?search=forward to a Davidic kingdom that will last forever.&version=KJV\">forward to a Davidic kingdom that will last forever.</a>\n<a href=\"https://www.biblegateway.com/passage/?search=The Davidic king will represent God's rule on earth&version=KJV\">The Davidic king will represent God's rule on earth</a>\n<a href=\"https://www.biblegateway.com/passage/?search=and reflect His righteousness.&version=KJV\">and reflect His righteousness.</a>\n<a href=\"https://www.biblegateway.com/passage/?search=How is the promise of a forever kingdom to&version=KJV\">How is the promise of a forever kingdom to</a>\n<a href=\"https://www.biblegateway.com/passage/?search=be fulfilled? Many kings who succeeded David&version=KJV\">be fulfilled? Many kings who succeeded David</a>\n<a href=\"https://www.biblegateway.com/passage/?search=turned out to be unfaithful and wicked, resulting&version=KJV\">turned out to be unfaithful and wicked, resulting</a>\n<a href=\"https://www.biblegateway.com/passage/?search=in the destruction of Jerusalem and the exile of the&version=KJV\">in the destruction of Jerusalem and the exile of the</a>\n<a href=\"https://www.biblegateway.com/passage/?search=Israelites to Babylon. However, the Israelites knew&version=KJV\">Israelites to Babylon. However, the Israelites knew</a>\n<a href=\"https://www.biblegateway.com/passage/?search=that God's chastisement would not be forever. A&version=KJV\">that God's chastisement would not be forever. A</a>\n<a href=\"https://www.biblegateway.com/passage/?search=descendant of David, a perfect King, would come.&version=KJV\">descendant of David, a perfect King, would come.</a>\n<a href=\"https://www.biblegateway.com/passage/?search=He would deliver God's people and restore God's&version=KJV\">He would deliver God's people and restore God's</a>\n<a href=\"https://www.biblegateway.com/passage/?search=rule on earth.&version=KJV\">rule on earth.</a>\n<a href=\"https://www.biblegateway.com/passage/?search=The true Davidic King has come in the&version=KJV\">The true Davidic King has come in the</a>\n<a href=\"https://www.biblegateway.com/passage/?search=person of the Lord Jesus Christ. He is the sinless&version=KJV\">person of the Lord Jesus Christ. He is the sinless</a>\n<a href=\"https://www.biblegateway.com/passage/?search=Son of God who tules with perfect justice and&version=KJV\">Son of God who tules with perfect justice and</a>\n<a href=\"https://www.biblegateway.com/passage/?search=righteousness. By His sacrificial death on the cross,&version=KJV\">righteousness. By His sacrificial death on the cross,</a>\n<a href=\"https://www.biblegateway.com/passage/?search=He has redeemed His people and released them&version=KJV\">He has redeemed His people and released them</a>\n<a href=\"https://www.biblegateway.com/passage/?search=from the control of Satan. Christ's kingdom is now&version=KJV\">from the control of Satan. Christ's kingdom is now</a>\n<a href=\"https://www.biblegateway.com/passage/?search=spiritual, consisting of all who repent and trust in&version=KJV\">spiritual, consisting of all who repent and trust in</a>\n<a href=\"https://www.biblegateway.com/passage/?search=Him as their Saviour and submit to His rule. One&version=KJV\">Him as their Saviour and submit to His rule. One</a>\n<a href=\"https://www.biblegateway.com/passage/?search=day, He will return to judge the world and destroy&version=KJV\">day, He will return to judge the world and destroy</a>\n<a href=\"https://www.biblegateway.com/passage/?search=all evil. God's kingdom on earth will be restored&version=KJV\">all evil. God's kingdom on earth will be restored</a>\n<a href=\"https://www.biblegateway.com/passage/?search=to its full glory, and Christ will reign in His eternal&version=KJV\">to its full glory, and Christ will reign in His eternal</a>\n<a href=\"https://www.biblegateway.com/passage/?search=kingdom forever.&version=KJV\">kingdom forever.</a>\n<a href=\"https://www.biblegateway.com/passage/?search=Have you submitted to Christ's rule over your&version=KJV\">Have you submitted to Christ's rule over your</a>\n<a href=\"https://www.biblegateway.com/passage/?search=life? If not, then repent and believe in the Lord&version=KJV\">life? If not, then repent and believe in the Lord</a>\n<a href=\"https://www.biblegateway.com/passage/?search=Jesus Christ so you may be part of His glorious&version=KJV\">Jesus Christ so you may be part of His glorious</a>\n<a href=\"https://www.biblegateway.com/passage/?search=kingdom.&version=KJV\">kingdom.</a>\n<a href=\"https://www.biblegateway.com/passage/?search=Our Father which art in heaven, Hallowed be Thy&version=KJV\">Our Father which art in heaven, Hallowed be Thy</a>\n<a href=\"https://www.biblegateway.com/passage/?search=name. Thy kingdom come, Thy will be done in&version=KJV\">name. Thy kingdom come, Thy will be done in</a>\n<a href=\"https://www.biblegateway.com/passage/?search=eatth, as it is in heaven. -- Matthew 6:9-10&version=KJV\">eatth, as it is in heaven. -- Matthew 6:9-10</a></b>",
    "23 MARCH": "<b><u>23 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:18&version=KJV\">2 Samuel 7:18</a>\n\n<b>LESSON</b>\nDavid's prayer\n\n<b>VERSE 18</b>\n<i>Then went king David in, and sat before the Lord, and he said, Who am I, O Lord God? and what is my house, that thou hast brought me hitherto?</i>\n\nDavid was overwhelmed by the immensity of God's grace and the grandiose of God's plan that had just been revealed to him. After hearing those words, he went into the tent that contained the ark and prayed.\n\nDavid began his prayer by expressing his awe and his deep sense of unworthiness. \"Who am I... what is my house ...?\" he asked. He was just a lowly shepherd. Yet, God took him out of the sheepcote, from following the sheep, to be ruler over God's people, over Israel [v. 8]. Not only was it by God's grace he was chosen; it was also God's amazing grace that preserved him through ten years of trials, troubles, and treacheries, that protected him from the enemies, that made his name great on earth, that brought him to this point where he and his \"house\" could be part of God's majestic plan. By his rhetorical questions, David implicitly acknowledged God's mighty works in his life with humble gratitude.\n\nHow do you respond to God's promises in His Word? Do you humbly accept them in faith? Do you marvel at the immensity of His grace? Do you trust Him to do what He has promised and pray for their fulfilment? Do you show your gratitude through thanksgiving and obedience?\n\nWe will not know the veracity of God's Word until we live in obedience to it. May the Lord help us lay hold on His promises in humble faith and obedience, so that we may be able to see the glorious outworking of His will for our lives.\n\n<b>THOUGHT</b>\nTrue faith rests upon the character of God and asks no further proof than the moral perfections of the One who cannot lie. - A. W. Tozer\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 32&version=KJV\">EXODUS 32</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 13&version=KJV\">JOHN 13</a></b>",
    "24 MARCH": "<b><u>24 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:19&version=KJV\">2 Samuel 7:19</a>\n\n<b>LESSON</b>\nGod's eternality\n\n<b>VERSE 19</b>\n<i>And this was yet a small thing in Thy sight, O Lord God; but Thou hast spoken also of Thy servant's house for a great while to come. And is this the manner of man, O Lord God?</i>\n\nDavid was but a lowly shepherd and an undeserving sinner. Nevertheless, with tenderness and lovingkindness, God had protected him, provided for and preserved him. To David, the love and grace God had showered upon him in the past was immensely great. What more could he ask? Yet, this was but \"a small thing\" in God's eyes. So abundant was God's grace that what He promised to do for David in the future was immeasurably greater, for it pertained to a kingdom in David's line that would last forever.\n\nIndeed, who is able to promise an everlasting kingdom? Such a promise can only come from a God who is eternal, whose existence knows no beginning and end. Given the weakness and sinfulness of man, the promise must come from One whose mercies endures forever, whose faithfulness knows no bounds, and whose love knows no depth. Given the finiteness of man, He who promised must be One who is sovereign, omnipotent, and omniscient, whose word shall not pass away till they are fulfilled.\n\nThe Westminster Shorter Catechism aptly encapsulates God's attributes in one sentence: \"God is a Spirit, infinite, eternal, and unchangeable, in his being, wisdom, power, holiness, justice, goodness, and truth.\" God made a promise to David; He has made many promises to His people in the Bible. As His children, we can hold fast to His promises with assurance and hope, for such is the manner of our Lord God who promises!\n\n<b>THOUGHT</b>\nConsider Exodus 34:6-7.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 33&version=KJV\">EXODUS 33</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 14&version=KJV\">JOHN 14</a></b>",
    "25 MARCH": "<b><u>25 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:20&version=KJV\">2 Samuel 7:20</a>\n\n<b>LESSON</b>\nGod's omniscience\n\n<b>VERSE 20</b>\n<i>And what can David say more unto Thee? for Thou, Lord God, knowest Thy servant.</i>\n\nAfter briefly expressing his awe and profound sense of unworthiness, David said nothing more about his own feelings. Why couldn't David say more? Was he unable to express his feelings? Did he not know what to say? Not so. David did not need to say anything more for he knew that the Lord knows him through and through. Our Lord God is an omniscient God--One who searches the heart and examines the mind. Nothing can be hidden from Him. David acknowledges this in Psalm 139:1, when he said, \"O Lord, Thou hast searched me, and known me;\" and in Psalm 94:11, \"The Lord knoweth the thoughts of man, that they are vanity.\"\n\nIndeed, what can a servant say to the immeasurable grace of his Lord or to the unfathomable wisdom of His plan? Before God's grand design for His nation Israel, David knew that he was insignificant, and his feelings were trivial. The only fitting response is praise and worship.\n\nDo you sometimes find that you don't know what to say or how to express yourself in prayer? Thank God that He knows our thoughts and searches our hearts. We do not have to find the perfect words before He can understand us and know exactly what we want. Nor do we have to try too hard to explain ourselves. Even in silence, we can draw near to Him. And in stillness, we can listen to His answers and watch as He unfolds his manifold grace in our lives.\n\n<b>THOUGHT</b>\nFor there is not a word in my tongue, but, lo, O LORD, thou knowest it altogether. - Psalm 139:4\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 34&version=KJV\">EXODUS 34</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 15&version=KJV\">JOHN 15</a></b>",
    "26 MARCH": "<b><u>26 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:21&version=KJV\">2 Samuel 7:21</a>\n\n<b>LESSON</b>\nGod's sovereignty\n\n<b>VERSE 21</b>\n<i>For Thy word's sake, and according to Thine own heart, hast Thou done all these great things, to make Thy servant know them.</i>\n\nAs David prays he addresses the Lord eight times as \"LORD/Lord God/GOD\" [v. 18- 29]. This exalted compound title stresses God's sovereignty over His creation, over the nations and His covenant relationship with Israel. It is frequently used in prayer.\n\nIt was the Sovereign Lord Who took a little shepherd boy in David and set him as ruler over the great nation of Israel [v. 8]. It was the Sovereign Lord Who delivered David from all his enemies. And it is the Sovereign Lord Who will ensure the lasting continuance of David's family to the times of the coming Messiah.\n\nGod was sovereign when Joseph was thrown in jail. God was sovereign when Satan brought great trials upon Job. He is sovereign over the affairs of all that happens in this world.\n\nThis should lead firstly to praising God. David recognises that it is God who has \"done all these great things\" [v. 21]. As you look back at the accomplishments and milestones of your life, can you say that it was God Who has done all these great things?\n\nSecondly, God's sovereignty means that you do not need to worry about what may happen in the future. God is still on the throne and He is still sovereign over all things. He ordains all things according to his \"own heart\" and not according to the heart of Satan or his demons, nor chance or coincidence. There is none that rivals our Sovereign Lord and none that can thwart His plans.\n\n<b>THOUGHT</b>\nThe Lord of hosts hath sworn, saying, Surely as I have thought, so shall it come to pass; And as I have purposed, so shall it stand. - Isaiah 14:24\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 35&version=KJV\">EXODUS 35</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 16&version=KJV\">JOHN 16</a></b>",
    "27 MARCH": "<b><u>27 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:22&version=KJV\">2 Samuel 7:22</a>\n\n<b>LESSON</b>\nDavid's worship -- God's greatness\n\n<b>VERSE 22</b>\n<i>Wherefore Thou art great, O Lord God: for there is none like Thee, neither is there any God beside Thee, according to all that we have heard with our ears.</i>\n\nDavid continues to praise the character of God in His greatness. God is great both in power and in goodness, choosing a boy of humble beginnings to be raised to the throne. David marvels that God has made such promises to him and his family, for why did he deserve such honour? Unlike Saul, who became proud as king, David was not impressed with nor carried away by his own importance.\n\nWe should not ignore the fact that David himself was a great man. David was victorious in the battlefield. David was the ruler of the great nation of Israel. He was a man of great riches and resources. But David had nothing to say in praise of himself. Rather, he asks, \"Who am I?\" that he should deserve such honour and blessing. In praising God, David acknowledged that his legacy is minuscule compared to God's grandeur and uniqueness.\n\nGod is great in power. Oftentimes we think that God is in an unsettled tug-of-war with Satan, that Satan's power rivals God's. But nothing is further from the truth. God is great in power and \"there is none like [Him]\" [v. 22]. God was greater than the Pharaoh's magicians, and God was greater than the prophets of Baal [Exodus 7:11-12; 1 Kings 18:20- 39]. Likewise, God is greater than any circumstance in our lives. There is no problem too great for God.\n\n<b>THOUGHT</b>\nWhenever obstacles come your way, do you first seek God who is great in power and goodness to carry you through?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 36&version=KJV\">EXODUS 36</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 17&version=KJV\">JOHN 17</a></b>",
    "28 MARCH": "<b><u>28 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:23&version=KJV\">2 Samuel 7:23</a>\n\n<b>LESSON</b>\nDavid's worship -- God's redemption\n\n<b>VERSE 23</b>\n<i>And what one nation in the earth is like Thy people, even like Israel, whom God went to redeem for a people to Himself, and to make him a name, and to do for you great things and terrible, for Thy land, before Thy people, which Thou redeemedst to Thee from Egypt, from the nations and their gods?</i>\n\nDavid shifts the prayer from what God has done for David to what God has done for the people of Israel. Here, David recounts Israel's rescue from Egypt. Note that God is the subject and Israel is the object of this redemption. Israel did not redeem themselves, but it was God who did great and awesome things to save His people. Neither did Israel make God save them because of anything within themselves. God redeems Israel, not because of Israel's virtue, or Israel's merit, or Israel's strength, but because of His love.\n\nLikewise, God has redeemed us from eternal damnation through the atoning blood of our Lord Jesus so that we can have the forgiveness of sins. And this redemption is \"according to the riches of His grace\" [Ephesians 1:7]. Grace is the unmerited favour of God. We did not earn it because of our intellect, accomplishments, or our own righteousness. It is because of God's nature that He set His love upon us.\n\nThrough the work of the cross God has saved us from the penalty and the power of sin, but we are not as yet saved from the presence of sin. In our mortal bodies we still struggle with sin and temptation. But as His redeemed people we should walk in \"newness of life\" [Romans 6:4]. Just as a liver transplant recipient should not return to their old ways of damaging alcohol abuse, so must a child of God not return to the ways of the old sinful nature.\n\n<b>THOUGHT</b>\nHow are you walking in \"newness of life\" as a redeemed child of God?\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 37&version=KJV\">EXODUS 37</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 18&version=KJV\">JOHN 18</a></b>",
    "29 MARCH": "<b><u>29 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:24&version=KJV\">2 Samuel 7:24</a>\n\n<b>LESSON</b>\nDavid's worship -- God's election\n\n<b>VERSE 24</b>\n<i>For Thou hast confirmed to Thyself Thy people Israel to be a people unto Thee for ever: and Thou, Lord, art become their God.</i>\n\nThe subject of praise that follows in David's worship is the election of Israel as God's people. It encompasses all that the Lord had done for the establishment of Israel from the time of Moses till His promise of the eternal continuance of the throne of David. The pronouncement that the Lord \"[became] their God\" echoes the covenantal language when God made His covenant with Abraham. God has proven and attested to be their God.\n\nTake note that it is God who has confirmed to Himself the people of Israel, and not the people of Israel themselves. God's free election is the only reason why the Israelites were chosen to be His people. Likewise, it is by God's grace and His election that we are chosen to be His children. And it is God Who establishes us as His children. God does not look down the corridors of time to see if an individual would respond to His Gospel call. God chose us \"before the foundation of the world\" [Ephesians 1:4]. In our state of unbelief, there is neither inclination nor propensity to turn to God. Rather, it is all owing to the regenerating work of the Holy Spirit within our hearts.\n\nJust like David and Israel, there is nothing in us that sets us apart as ideal candidates of God's election. We were \"by nature the children of wrath\" so it should teach us humility that it is nothing within ourselves that made the difference, but the free-grace of God that made all the difference [Ephesians 2:3]. Praise God for His wondrous grace.\n\n<b>THOUGHT</b>\nThe Lord did not set His love upon you, nor choose you, because ye were more in number than any people; for ye were the fewest of all people: But because the Lord loved you... -Deuteronomy 7:7-8\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 38&version=KJV\">EXODUS 38</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 19&version=KJV\">JOHN 19</a></b>",
    "30 MARCH": "<b><u>30 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:25&version=KJV\">2 Samuel 7:25</a>\n\n<b>LESSON</b>\nGod's revelation, promises and faithfulness\n\n<b>VERSE 25</b>\n<i>And now, O Lord God, the word that Thou hast spoken concerning Thy servant, and concerning his house, establish it for ever, and do as Thou hast said.</i>\n\nIt is often sardonically remarked that \"promises are made to be broken\". Even a toddler knows from a tender age that promises are often forgotten. Perhaps it is human experience with broken promises that makes it natural for Christians to be ambivalent about God's promises to us.\n\nNot so for David. As he considered God's promises concerning his own house, concerning God's kingdom and the building of His temple, David prayed. He prayed boldly, asking God to do exactly as He promised. While humans are fallible, God is not \"a man, that He should lie\" [Numbers 23:19]. God never says one thing only to do another. He does exactly as He says. His promises to us which may seem (too) wonderful at times show that our God is mighty to give, even as He delights in keeping them.\n\nIt is notable also that David does not hesitate in his prayer. While we can look at this account with the benefit of hindsight knowing the Messiah would eventually descend from David's line, David himself only had the vaguest idea at that time how God would fulfil His Word. God's promises to him concerned matters that he would never see in his lifetime. Yet, David focused on none of that. His prayer showed his faith that God had \"heard the desire of the humble,\" \"wilt prepare their heart\" and would always \"hear\" their cries [Psalm 10:17].\n\nDo our hearts faint and prayers falter because we cannot understand God's promises? May we as Christians be as certain of God's promises to us and boldly claim them.\n\n<b>THOUGHT</b>\nStanding on the promises that cannot fail, when the howling storms of doubt and fear assail, by the living Word of God I shall prevail, standing on the promises of God! - R. K. Carter\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 39&version=KJV\">EXODUS 39</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 20&version=KJV\">JOHN 20</a></b>",
    "31 MARCH": "<b><u>31 MARCH</u></b>\n\n<b>BIBLE LESSON</b>\n<a href=\"https://www.biblegateway.com/passage/?search=2 Samuel 7:26&version=KJV\">2 Samuel 7:26</a>\n\n<b>LESSON</b>\nGod's glory\n\n<b>VERSE 26</b>\n<i>And let Thy name be magnified for ever, saying, The Lord of hosts is the God over Israel: and let the house of Thy servant David be established before Thee.</i>\n\nGod's promise to David was that his house would be established forever. In claiming God's promise, David desired not his own glory, or even the glory of his descendants, but God's glory.\n\nOur desire should never be for the temporal blessing of our own houses and kingdom to be established. God's blessings toward us are means for us to render greater glory to Him. As Jesus approached the cross in the ultimate act of self- sacrifice, it was not His own glory He sought. He said, \"Now is the Son of man glorified, and God is glorified in Him\" [John 13:31].\n\nWhat was David's secret? Certainly he could perceive that his God whom he was calling upon was not only the \"Lord of hosts ... over Israel\" who rules over the multitude of His heavenly armies but also the God who establishes earthly kingdoms and whose provision the line of David owed entirely to.\n\nIn 2 Kings 6, Elisha the prophet reacted very differently from his servant upon seeing that the city had been besieged by the multitude of the Syrian army. While the young man cried out in fear, Elisha prayed that his servant's eyes would be opened to see the dominion of God. God did so, and the servant saw the \"mountain was full of horses and chariots of fire round about Elisha\" [2 Kings 6:17]. May the Lord open our eyes to see that He is the Lord of hosts, so that we might desire only to glorify Him.\n\n<b>THOUGHT</b>\nMay we desire like David, that God be glorified in our lives.\n\n<i>TO COMPLETE THE BIBLE IN 2 YEARS, READ</i>\n<b><a href=\"https://www.biblegateway.com/passage/?search=EXODUS 40&version=KJV\">EXODUS 40</a>\n<a href=\"https://www.biblegateway.com/passage/?search=JOHN 21&version=KJV\">JOHN 21</a></b>"
}