{
    "1 APRIL": {
        "part1": "2 Samuel 7:27",
        "part2": "David's boldness in prayer",
        "part3": "VERSE 27",
        "part4": "For Thou, O LORD of hosts, God of Israel, hast revealed to Thy servant, saying, I will build thee an house: therefore hath Thy servant found in his heart to pray this prayer unto Thee.",
        "part5": "David's desire to build a house for the Lord was at first endorsed by prophet Nathan. But God's revealed will and message for David through Nathan was rather the opposite - \"The Lord telleth thee, that He will make thee an house\" [v. 11b]. It was not God's will for David to build the Temple. Instead, God promised David that He would build a house for him and establish the Davidic kingdom forever. The holy privilege to build the Temple was not David's but his seed's [v. 12-13]. Solomon was God's choice for the task.\n\nIn response to God's word, David poured out his soul in prayer [v. 18-26]. Expressing profound gratitude for the promised blessings, David did not presume the right to God's goodness. He did not take them for granted but expressed a sense of unworthiness in his prayer. David was bold in prayer because he knew God was faithful to every promise He makes.\n\nDavid's prayer boldness reminds us to pray confidently trusting in God's faithfulness in keeping His Word. God has given us exceeding great and precious promises by which we may plead with Him. God will fulfil His promises according to His written Word because God cannot deny Himself and He cannot lie. With confidence in His faithfulness \"let us therefore come boldly unto the throne of grace, that we may obtain mercy, and find grace to help in time of need\" [Hebrews 4:16]. Our Heavenly Father knows our need and will faithfully provide. Our part is to ask with humble, contrite and believing hearts.",
        "part6": "THOUGHT",
        "part7": "For all the promises of God in Him are yea, and in Him Amen, unto the glory of God by us. - 2 Corinthians 1:20",
        "part8": [
            "LEVITICUS 1",
            "PSALMS 1-2"
        ]
    },
    "2 APRIL": {
        "part1": "2 Samuel 7:28",
        "part2": "Reasons for David's boldness",
        "part3": "VERSE 28",
        "part4": "And now, O Lord GOD, Thou art that God, and Thy words be true, and Thou hast promised this goodness unto Thy servant:",
        "part5": "Not only is God faithful to provide, David cited three other infallible reasons to pray with boldness, which are for our instruction today.\n\nFirst - \"Thou art that God\" - by nature God is immutable. \"For I am the LORD, I change not therefore ye sons of Jacob are not consumed\" [Malachi 3:6]. God cannot and does not change. Hebrews 13:8 tells us that \"Jesus Christ the same yesterday, and today, and for ever\". People change, and things change in looks, values, qualities, but God never changes. He preserves us through the storms of life. Therefore, remembering His immutability, we can echo the confidence of Psalm 46:1. \"God IS our Refuge and strength, a very PRESENT help in trouble\" (emphasis added).\n\nSecond - \"and Thy words be true\" - David cast his hope on the Lord's Word because he believed them to be true. It reminds us of a greater David who was to come. Our Lord Jesus in His high priestly prayer declared - \"Thy word is truth\" [John 17:17b]. Truly we rejoice with the psalmist in praising God for the truthfulness of His Word - \"Thy word is true from the beginning: and every one of Thy righteous judgements endureth for ever\" [Psalm 119:160].\n\nThird - \"Thou hast promised this goodness unto Thy servant\" - David not only believed the promised goodness of God's Word, he also had confidence in the reliability of God's promises.\n\nThis is the message for us. Our God is immutable. He is good. His Word is absolutely reliable for our faith and daily practice. We can depend on it. So we echo the psalmist's prayer - \"Remember Thy word unto Thy servant, upon which Thou hast caused me to hope\" [Psalm 119:49].",
        "part6": "THOUGHT",
        "part7": "The Westminster Shorter Catechism says that \"God is a spirit, whose being, wisdom, power, holiness, justice, goodness, and truth are infinite, eternal, and unchangeable.\"",
        "part8": [
            "LEVITICUS 2-3",
            "PSALMS 3-4"
        ]
    },
    "3 APRIL": {
        "part1": "2 Samuel 7:29",
        "part2": "Just do it",
        "part3": "VERSE 29",
        "part4": "Therefore now let it please Thee to bless the house of Thy servant, that it may continue for ever before Thee: for Thou, O Lord GOD, hast spoken it: and with Thy blessing let the house of Thy servant be blessed for ever.",
        "part5": "David not only believed God, the blessings of His word, he was also confident of the reliability of His promises and their fulfillment. His closing words: \"Therefore now let it please Thee to bless the house of Thy servant\" - would confirm his earlier ones in verse 25: \"And now, O LORD God, the word that Thou hast spoken concerning Thy servant, and concerning his house, establish it for ever, and do as Thou hast said.\" By calling upon the Lord to carry out His promises, David believed the declaration: \"God is not a man, that He should lie; neither the son of man, that He should repent: hath He said, and shall He not do it? or hath He spoken, and shall He not make it good?\" [Numbers 23:19]. The answer is obvious. To call upon the Lord to fulfil His promises is asking Him to do it. It is not asking amiss but for His glory to be manifested.\n\nAt the same time, we should remember that God has His timing and plan in carrying out His promises. We learn from David's example to \"trust in the LORD, and do good ... rest in the LORD, and wait patiently for Him\" [Psalm 37:3a, 7a]. Our part is not only to anticipate the Lord fulfilling His promises, we are also to make sure we do good. That means we continue to submit ourselves to the Lord, wait upon Him in prayer and occupy ourselves by obeying His Word. To that end, David instructed us to \"delight thyself also in the LORD; and He shall give thee the desires of thine heart\" [Psalm 37:4]. Indeed, God will do it for His glory.",
        "part6": "THOUGHT",
        "part7": "And call upon Me in the day of trouble: I will deliver thee, and thou shalt glorify Me. - Psalm 50:15",
        "part8": [
            "LEVITICUS 4",
            "PSALMS 5-6"
        ]
    },
    "4 APRIL": {
        "part1": "2 Samuel 7:29",
        "part2": "Waiting for God's time",
        "part3": "VERSE 29",
        "part4": "Therefore now let it please Thee to bless the house of Thy servant, that it may continue for ever before Thee: for Thou, O Lord GOD, hast spoken it: and with Thy blessing let the house of Thy servant be blessed for ever.",
        "part5": "Up to this point, David's life had been eventful to say the least - from shepherd boy to giant- slayer; from being well-favoured by the people to a fugitive fleeing from the king. Though there were occasions when he could have killed Saul and seized the throne, he would not lay his hand against the \"anointed of the LORD\" [1 Samuel 24:6].\n\nWith the death of Saul, David's years of wandering and hiding in the Judaean desert had finally come to an end. He was first crowned king of Judah at Hebron in the south [2 Samuel 5:3]. However, a power struggle and civil war ensued between David and Ish-bosheth - youngest of Saul's four sons, and the only one who survived him. But the real power behind Ish-bosheth was his uncle, Abner. Ish-bosheth ruled Israel from his capital at Mahanaim, on the east of Jordan [2 Samuel 2:8-9]. His reign lasted only two years, and Ish-bosheth was brutally murdered by his guard.\n\nDavid was anointed king over Israel, and \"David went on, and grew great, and the LORD God of hosts was with him\" [2 Samuel 5:10]. After consolidating his position, and securing the nation by defeating the Philistines, David turned his attention to spiritual matters. The first thing on his mind was to relocate the Ark of the Covenant from Gibeah to Jerusalem. The event was black-marked when Uzzah was struck down by the LORD for handling the Ark. When it was finally brought back to Jerusalem, his joy was dampened by his wife, Michal, who despised him for his dancing, which perhaps in her eyes was unbecoming of a king.\n\nAfter years of ups and downs in David's life, there was finally peace [2 Samuel 7:1]. God would establish the Davidic covenant [2 Samuel 7:12-15].",
        "part6": "THOUGHT",
        "part7": "God is sovereign, and He is good. \"And we know that all things work together for good to them that love God, to them who are the called according to His purpose\" [Romans 8:28].",
        "part8": [
            "LEVITICUS 5",
            "PSALMS 7-8"
        ]
    },
    "5 APRIL": {
        "part1": "2 Samuel 8:1",
        "part2": "Tearing down strongholds",
        "part3": "VERSE 1",
        "part4": "And after this it came to pass, that David smote the Philistines, and subdued them: and David took Metheg-ammah out of the hand of the Philistines.",
        "part5": "2Samuel 8 records the victories of David in his wars against Israel's enemies. Without these decisive victories, David's reign could never be truly secure because these enemies surrounded Israel. The Philistines were located on the west, the Moabites [v. 2] to the east. The threats from the north came from the king of Zobah and Syrians [v. 3]. And to the south was Edom [v. 13-14].\n\nDavid set his sight first on the Philistines who were hardened enemies of Israel. The Philistines were constantly launching attacks into Israel, and although they were able to repel these, they could never completely put them down until David reigned. Before David, the Philistines were always the aggressor. But now, David launched the attack, entering their territory and conquering Metheg- ammah.\n\nIn the parallel account - 1 Chronicles 18:1 - Methegammah was actually, or a part of, the city of Gath. Gath was built upon the hill Ammah, and called Metheg-ammah, which means \"bridle of Ammah\" implying it was a well-fortified city, which served as a bridle upon the Israelites.\n\nGath's most famous citizen was Goliath; it was also the city of giants [2 Samuel 21:18-22]. And it was where David sought refuge in his early years as a fugitive [1 Samuel 21:10]. But now David \"smote the Philistines, and ... took Metheg-ammah out of the hand of the Philistines\", opening the way to decisively subdue them.\n\nThe same can be said of our breakthrough from sin to salvation. The strongholds of sin must be broken down so that God can have full rein on our lives. By His power, God destroyed the \"strong holds ... bringing into captivity every thought to the obedience of Christ\" [2 Corinthians 10:4-5].",
        "part6": "THOUGHT",
        "part7": "Take my life and let it be, consecrated, Lord, to Thee. Take my heart, it is Thine own, it shall be Thy royal throne. - Frances Havergal",
        "part8": [
            "LEVITICUS 6",
            "PSALM 9"
        ]
    },
    "6 APRIL": {
        "part1": "2 Samuel 8:2",
        "part2": "Mortifying the flesh",
        "part3": "VERSE 2",
        "part4": "And he smote Moab, and measured them with a line, casting them down to the ground; even with two lines measured he to put to death, and with one full line to keep alive. And so the Moabites became David's servants, and brought gifts.",
        "part5": "After defeating the Philistines, David turned east against Moab. The relationship between the Israelites and Moabites was bitter-sweet. Bitter because one of the most famous Moabite was Balak - the king of Moab - who bribed Balaam to curse Israel [Numbers 22:4-6; 25:1-3]. Despite that hostile act, God commanded them to \"distress not the Moabites, neither contend with them in battle: for I will not give thee of their land for a possession\" [Deuteronomy 2:9]. However, after the Israelites had conquered and settled in Canaan, the Moabites frequently attacked them [Judges 3:12-30; 1 Samuel 14]. Sweet because of David's personal relationship with them. First, he sought the help of the king of Moab to protect his parents when their lives were in danger [1 Samuel 22:3-4]. Second, there was actually Moabite blood flowing through David's veins. David's great-grandmother was Ruth who was a Moabitess [Ruth 4:20-22]. Yet David marched against Moab. The phrase \"he ... measured them with a line, casting them down to the ground\" refers to the defeated Moabite soldiers who were made to lie on the ground, and two thirds of them were executed. Why was the judgement so severe? According to Jewish tradition, it was David's revenge against Moab's king who had put David's parents to death. The severity of David's action was also intended to cripple and subjugate the Moabites, making it impossible for them to take up arms again, thus reducing Moab to a vassal state. Likewise, for our Christian walk to be victorious, we must also bring our flesh into subjection to the greater David, our Lord Jesus.",
        "part6": "THOUGHT",
        "part7": "Paul says, \"I keep under my body, and bring it into subjection: lest that by any means, when I have preached to others, I myself should be a castaway.\" [1 Corinthians 9:27].",
        "part8": [
            "LEVITICUS 7",
            "PSALM 10"
        ]
    },
    "7 APRIL": {
        "part1": "2 Samuel 8:3-4",
        "part2": "Houghing the horses",
        "part3": "VERSE 3",
        "part4": "David smote also Hadadezer, the son of Rehob, king of Zobah, as he went to recover his border at the river Euphrates.",
        "part5": "David's third conquest brought him farther afield to Zobah, which was a Syrian province extending from the eastern slopes of Lebanon in the north and east toward the Euphrates. The history of hostilities between Zobah and Israel dated back to the reign of King Saul [1 Samuel 14:47].\n\nThis would be the first of two wars David fought against Zobah [2 Samuel 10:6]. Verse 3 tells us that the goal was to recover territory. In the first war, David faced off with Hadadezer, king of Zobah, and won a great victory, capturing \"a thousand chariots, and seven hundred horsemen, and twenty thousand footmen: and David houghed all the chariot horses, but reserved of them for an hundred chariots\" [2 Samuel 8:4].\n\nTo hough (pronounced \"hock\") a horse is to hamstring it by severing the tendons of the hind legs thus rendering them useless for war. The word is also translated several ways \"digged down\" [Genesis 49:6]; \"pluck up\" [Ecclesiastes 3:2]; \"rooted up\" [Zephaniah 2:4]. By the houghing and uprooting processes, the life source of a thing and its ability to grow strong is cut off.\n\nGod had commanded the king of Israel not to \"multiply horses to himself, nor cause the people to return to Egypt, to the end that he should multiply horses\" [Deuteronomy 17:16]. The reason is so they would not rely on the power of horses and chariots for their strength. The spiritual lesson of houghing is to keep the people of God from placing confidence in anything or anyone other than the LORD [Psalm 20:7; 33:16-17].",
        "part6": "THOUGHT",
        "part7": "What do you trust? \"Some trust in chariots, and some in horses: But we will remember the name of the LORD our God.\" [Psalm 20:7]",
        "part8": [
            "LEVITICUS 8",
            "PSALMS 11-12"
        ]
    },
    "8 APRIL": {
        "part1": "2 Samuel 8:5-8",
        "part2": "Put up the garrisons",
        "part3": "VERSES 5-6",
        "part4": "And when the Syrians of Damascus came to succour Hadadezer king of Zobah, David slew of the Syrians two and twenty thousand men. Then David put garrisons in Syria of Damascus: and the Syrians became servants to David, and brought gifts. And the LORD preserved David whithersoever he went.",
        "part5": "As David and his army moved east toward the Euphrates, they encountered the Syrian army that had allied with Hadadezer, king of Zobah. The additional Syrian forces were, however, no match for David; the children of Israel routed the enemy. \"David slew of the Syrians two and twenty thousand men\" [v. 5]. Victory over the Syrians also gave David control over Damascus, and \"David put garrisons in Syria of Damascus\" [v. 6].\n\nGarrisons were units of military forces [1 Samuel 10:5; 1 Chronicles 11:16] that were stationed at strategic locations to prevent enemy incursions and protect a country's border. It is derived from the Hebrew verb \"to stand\".\n\nThere are a few connotations that can be derived from this word. First, a garrison is a picture of territorial boundaries that God has established. The Psalmist says God \"hast set all the borders of the earth\" [Psalm 74:17]. God \"divided to the nations their inheritance ... He set the bounds of the people according to the number of the children of Israel\" [Deuteronomy 32:8; Proverbs 15:25]. The lesson is that God has also set the moral boundaries for His people. There are lines - marked out by the Law of God - that believers must not cross.\n\nSecond, a garrison is also a picture of firmness - physical health as well as spiritual vigour. In Psalm 39:5, David says that \"every man at his best state is altogether vanity.\" David is making the point that if we, even the best of us, are to stand on our own, our lives will be futile. But David adds, \"As for me, Thou upholdest me in mine integrity, and settest me before Thy face for ever\" [Psalm 41:12]. It is the LORD who enables us to stand.",
        "part6": "THOUGHT",
        "part7": "God has given us the means - the whole armour of God - so \"that ye may be able to withstand in the evil day, and having done all, to stand\" [Ephesians 6:13].",
        "part8": [
            "LEVITICUS 9",
            "PSALMS 13-14"
        ]
    },
    "9 APRIL": {
        "part1": "2 Samuel 8:6-10",
        "part2": "The key to victory",
        "part3": "VERSE 6",
        "part4": "Then David put garrisons in Syria of Damascus: and the Syrians became servants to David, and brought gifts. And the LORD preserved David whithersoever he went.",
        "part5": "Hamath was named after one of the sons of Canaan [Genesis 10:18], which meant that it was one of the oldest cities in the world. It was one of the cities the 12 spies came to when they went out to survey the land [Numbers 13:21]. A fortified city in the north, near Mount Hermon [Joshua 13:5; Judges 3:3], Hamath was one of the few places in Syria that retained a certain degree of importance from the earliest times to David's time.\n\nAs the news of David's conquest over the Philistines, Moabites and the Syrians spread, Toi, king of Hamath, had to make a decision - go to David with a peace offering and become a vassal state, or go to war against the powerful Israelite army and face certain defeat. He wisely chose the former. \"Toi sent Joram his son unto king David, to salute him, ... And Joram brought with him vessels of silver, and vessels of gold, and vessels of brass\" [v. 10].\n\nVerses 6 and 14 give the key to David's success - \"The LORD preserved David whithersoever he went.\" The word \"preserved\" is translated in several ways - \"helped\" [Exodus 2:17], \"saved' [Exodus14:30], \"delivered\" [Judges 2:16], and also as \"being victorious\" as in Psalm 98:1, where the Psalmist praises the LORD because \"He hath done marvellous things: His right hand, and His holy arm, hath gotten Him the victory.\"\n\nDavid had proven himself to be a mighty warrior, unmatched in warfare and courageous in battle. However, the key to his success was not his natural qualities of leadership, but that \"the LORD preserved David whithersoever he went\". As long as we are walking with God and doing His will, we will be watched and guarded by the LORD whom we serve.",
        "part6": "THOUGHT",
        "part7": "As we serve God, we are surrounded by the impenetrable shield of His grace. Consider Psalm 37:23-24, 28.",
        "part8": [
            "LEVITICUS 10",
            "PSALMS 15-16"
        ]
    },
    "10 APRIL": {
        "part1": "2 Samuel 8:10b-12",
        "part2": "Dedication to the LORD (I)",
        "part3": "VERSES 10b-11",
        "part4": "And Joram brought with him vessels of silver, and vessels of gold, and vessels of brass: which also king David did dedicate unto the LORD, with the silver and gold that he had dedicated of all nations which he subdued.",
        "part5": "The spoils of war are often tempting. David was presented with \"vessels of silver, and vessels of gold, and vessels of brass\" [v. 10b] but he kept none for himself. He dedicated the treasures unto the LORD.\n\nTo dedicate something is to hallow it; to make it holy. It is also translated \"to sanctify\" [Exodus 13:2]. It is mostly used of things being set apart for use in the Lord's worship, such as the altar [Exodus 29:21, 37]. When something is dedicated to the LORD, it belongs to God, and cannot be used by any other.\n\nThe dedication of the gold and silver would mean that David placed the treasures in some sacred treasury for the present services in the tabernacles and perhaps for the future construction of the temple. While David was forbidden by God to build the temple [2 Samuel 7:4-12; 1 Chronicles 22:8; 28:3], he began to stockpile the materials which his son, Solomon, would use to build it [1 Chronicles 28:14-18; 29:1-5].\n\nIn dedicating the gold and silver to the LORD, David exemplified true piety and whole-hearted devotion. In Paul's sermon, he said David \"served his own generation by the will of God\" [Acts 13:36]. And while he did not live to see the completion of the temple, David had the long-term perspective of his calling. He saw that the work of God was larger than himself and would extend beyond his lifetime. Like David, we dedicate our all to the LORD, serve Him to our best in this present life, and leave a legacy for others to continue the work.",
        "part6": "THOUGHT",
        "part7": "We do not have to see in this life the fruit for which we labour. \"And he that reapeth receiveth wages, and gathereth fruit unto life eternal: that both he that soweth and he that reapeth may rejoice together. And herein is that saying true, One soweth, and another reapeth\" [John 4:36-37].",
        "part8": [
            "LEVITICUS 11-12",
            "PSALM 17"
        ]
    },
    "11 APRIL": {
        "part1": "2 Samuel 8:10b-12",
        "part2": "Dedication to the LORD (II)",
        "part3": "VERSES 10b-11",
        "part4": "And Joram brought with him vessels of silver, and vessels of gold, and vessels of brass: which also king David did dedicate unto the LORD, with the silver and gold that he had dedicated of all nations which he subdued.",
        "part5": "When David first proposed building the temple, Nathan said to him, \"Go, do all that is in thine heart; for the LORD is with thee\" [2 Samuel 7:3]. But David was not given the privilege to build God's temple because he was a man of war and had shed much blood [1 Chronicles 28:3]. Though disqualified from building it, and the actual construction was left to Solomon, the LORD took into account David's consecration. At the dedication of the Temple, Solomon said, \"The LORD said to David my father, Forasmuch as it was in thine heart to build an house for My name, thou didst well in that it was in thine heart\" [2 Chronicles 6:8].\n\nThe dedication of the heart is the first step to our service for the LORD; it is really the consecration of self. All true godliness must begin with the surrender of self - the will, mind, strength and affection of body and soul to God so that He can sanctify and use us for His glory. No other gift - regardless of material value - matters without dedication of the heart. No gift can be a substitute for heart dedication. No other gift will be acceptable without it.\n\nOur Lord Jesus compared the giving of the wealthy, who gave out of their abundance, to the poor widow who gave her two mites, He said, \"she of her want did cast in all that she had, even all her living\" [Mark 12:44]. Even though she could not give as much as the wealthy did in absolute terms, our Lord Jesus honoured her because it came from her heart. The wealthy gave their spare change; the widow's \"small\" gift was all she had.",
        "part6": "THOUGHT",
        "part7": "True offerings to God are the offerings of His true servants.",
        "part8": [
            "LEVITICUS 13",
            "PSALM 18"
        ]
    },
    "12 APRIL": {
        "part1": "2 Samuel 8:10b-12",
        "part2": "Dedication to the LORD (III)",
        "part3": "VERSES 10b-11",
        "part4": "And Joram brought with him vessels of silver, and vessels of gold, and vessels of brass: which also king David did dedicate unto the LORD, with the silver and gold that he had dedicated of all nations which he subdued.",
        "part5": "David dedicated the gold and silver to the LORD because he had first dedicated himself to the LORD. The former is a natural outflow of the latter. When we realise all that we are is the result of the LORD's doing, then we will also realise all that we have is of the LORD's giving. David demonstrated this truth when he prayed, \"Both riches and honour come of Thee ... But who am I, and what is my people, that we should be able to offer so willingly after this sort? for all things come of Thee, and of Thine own have we given Thee\" [1 Chronicles 29:12-14].\n\nWhen the believers in Jerusalem were suffering famine, Paul initiated a collection to help in the relief of the Jewish converts. The Macedonian Christians were the first and most eager to give, more than the wealthier Corinthians. In fact, Paul wrote that the Macedonians themselves were \"in a great trial of affliction\". However, \"their deep poverty abounded unto the riches of their liberality\" [2 Corinthians 8:2]. Paul testified that they were willing to give beyond their own means to the point that they were pleading with Paul to receive their gift so they might have a part in ministering to the saints.\n\nWhat was the reason for the generous giving by these poor Macedonians? Paul said they \"first gave their own selves to the Lord, and unto us by the will of God\" [2 Corinthians 8:5]. The lesson is that what we have gained by work and enterprise, what we have been given, and all that we are, must be dedicated to God for His glory.",
        "part6": "THOUGHT",
        "part7": "You are a steward who has all things and yet owns nothing. Read 1 Timothy 6:17.",
        "part8": [
            "LEVITICUS 14",
            "PSALM 19"
        ]
    },
    "13 APRIL": {
        "part1": "2 Samuel 8:13-14",
        "part2": "David's reputation",
        "part3": "VERSE 13",
        "part4": "And David gat him a name when he returned from smiting of the Syrians in the valley of salt, being eighteen thousand men.",
        "part5": "The exact location of the valley of salt is not known, but it was the place where Israel won two important victories over the Syrian and Edomite armies. The first, recorded in our text today, was David's army slaying 18,000 enemy soldiers. It seemed that the Edomites, seeing David engaged in a war with the Syrians, took the opportunity to invade Israel. But the allied Syrian-Edomite forces were no match for David [1 Chronicles 18:12]. The second victory happened some 200 years later when Amaziah, king of Judah, slew 10,000 Edomites and seized their capital Selah, changing its name to Joktheel [2 Kings 14:7; 2 Chronicles 25:11].\n\nThere are a number of publications entitled Who's Who, containing brief biographical information of prominent people in various fields - sports, business, politics, etc. David, in a sense, received mention in the Who's Who. From his victories, David \"gat him a name\", meaning he made a name for himself; his reputation and fame were greatly increased. Many names were made in war and conquests; example: Alexander the Great, Genghis Khan, Napoleon Bonaparte, etc. Some made theirs through achievements, others through notoriety. It is better to be unknown than to have an infamous name. Better still it is to be unknown by the world and known only by the Creator of this world.\n\nDavid was celebrated as a warrior by his admirers [1 Samuel 18:7], hated by his enemies for the same reason [1 Samuel 21:11]. But to God, David was \"a man after His own heart\". I wonder which of these David would want to be known by? What kind of name would you have?",
        "part6": "THOUGHT",
        "part7": "A good name is rather to be chosen than great riches, and loving favour rather than silver and gold. - Proverbs 22:1",
        "part8": [
            "LEVITICUS 15",
            "PSALM 20-21"
        ]
    },
    "14 APRIL": {
        "part1": "2 Samuel 8:13-14",
        "part2": "A good name",
        "part3": "VERSE 13",
        "part4": "And David gat him a name when he returned from smiting of the Syrians in the valley of salt, being eighteen thousand men.",
        "part5": "David \"gat him a name\" - he became famous. His son, Solomon, also got himself a name. He is known for his wisdom. The Queen of Sheba was so impressed after visiting Solomon she told him, \"Thy wisdom and prosperity exceedeth the fame which I heard\" [1 Kings 10:7b]. A good name must reflect reality. It is worthless for a person to have a name conferred by others through flattery. It is even worse for one to acquire a name for himself for the sake of vanity. And the worst of all is for one to present oneself as good and pious when one is not. The Pharisees made themselves known for their piety, they \"make broad their phylacteries, and enlarge the borders of their garments, and love the uppermost rooms at feasts, and the chief seats in the synagogues, and greetings in the markets, and to be called of men, Rabbi, Rabbi\" [Matthew 23:5-7], but our Lord Jesus called them hypocrites. They are like the Church at Sardis, which our Lord Jesus Christ says \"hast a name that thou livest, and art dead\" [Revelation 3:1b]. There is inestimable value in a good name, but only if there is evidence that testifies to its truth. As a Christian, we bear the Name of Christ. However, the reality and authenticity of the name is not by what we claim to be; rather it is proven by the content of our character. So, rather than trying to gain a name for ourselves, let us labour instead to be accepted of God in the Beloved, and He will take care of our reputation among men.",
        "part6": "THOUGHT",
        "part7": "Live up to the Name of Christ, and He will lift up our name for His glory.",
        "part8": [
            "LEVITICUS 16",
            "PSALM 22"
        ]
    },
    "15 APRIL": {
        "part1": "2 Samuel 8:15-18",
        "part2": "God's protection",
        "part3": "VERSE 15",
        "part4": "And David reigned over all Israel; and David executed judgement and justice unto all his people.",
        "part5": "The secret of David's success was because \"the LORD preserved David whithersoever he went\" [v. 14]. God surrounded him like a shield that no dart could pierce. In the past, all the javelins Saul hurled never came close to David. From David, we see that if we are committed to following God, giving ourselves over to Him, doing His will, serving Him, and having nothing but the thought of pleasing Him, the LORD will guard our every step [Psalm 37:23-24].\n\nAfter his wars and victories, David must now begin the work of ruling the country. He had gone through several years dealing with the house of Saul [2 Samuel 3:1]. The civil conflict revealed Israel really to be a loose confederation of tribes. The challenge before David was to unite the people. To his credit, David \"executed judgment and justice unto all his people.\" \"All his people\" would include his supporters as well as those who initially did not give him their whole-hearted support.\n\nDavid won them over not by forced submission but by judicious action. \"David executed judgement\" - this means that David was \"doing justice\". He was fair and equitable. He did not favour those who were for him, and turn against those who were not for him. Likewise, when we execute judgement, we treat every person as he is. David executed justice (righteousness) - this speaks of David's actions as well as his conduct.\n\nA righteous person will do the right thing the right way. Applying this truth to our salvation, God's righteousness not only means judgement on our sin, but also the gift of His only begotten Son as the solution to our sin problem.",
        "part6": "THOUGHT",
        "part7": "Give the king Thy judgments, O God, and Thy righteousness unto the king's son. He shall judge Thy people with righteousness, and Thy poor with judgement. - Psalm 72:1-2",
        "part8": [
            "LEVITICUS 17",
            "PSALM 23-24"
        ]
    },
    "16 APRIL": {
        "part1": "2 Samuel 9:1",
        "part2": "Background to David's kindness",
        "part3": "VERSE 1",
        "part4": "And David said, Is there yet any that is left of the house of Saul, that I may shew him kindness for Jonathan's sake?",
        "part5": "The friendship between David and Jonathan came about partly because of king Saul's envious hostility against David. Jonathan believed God had anointed David to be Israel's king. He knew it was wrong for his father to oppose God by trying to destroy David. Jonathan had a holy fear of God. He knew that God's kingdom through the house of David would soon replace Saul's line. Undoubtedly Jonathan loved his father and he was also concerned that his family and the descendents of Saul would not be preserved when David eventually took over the kingdom.\n\nHence, Jonathan made a covenant with David [1 Samuel 20:16]. The details are given in 1 Samuel 20:42: \"And Jonathan said to David, Go in peace, forasmuch as we have sworn both of us in the name of the LORD, saying, The LORD be between me and thee, and between my seed and thy seed for ever.\" They pledged loyalty to one another in a covenantal relationship between their two families. And David, the man after God's own heart, would honour his pledge. For Jonathan's sake, David was committed to show kindness to the house of Saul.\n\nAs believers we have a covenantal relationship of grace in our Lord Jesus Christ with one another. As brethren in the same household of faith we are duty bound to show love, kindness and care for one another. We are to eschew self-seeking, evil speaking, anger, hatred, bitterness and such. And where we have failed, we must repent, get right with God and continue to serve God together with joy.",
        "part6": "THOUGHT",
        "part7": "And be ye kind one to another, tenderhearted, forgiving one another, even as God for Christ's sake hath forgiven you. - Ephesians 4:32",
        "part8": [
            "LEVITICUS 18",
            "PSALM 25"
        ]
    },
    "17 APRIL": {
        "part1": "2 Samuel 9:2",
        "part2": "Picture of divine grace",
        "part3": "VERSE 2",
        "part4": "And there was of the house of Saul a servant whose name was Ziba. And when they had called him unto David, the king said unto him, Art thou Ziba? And he said, Thy servant is he.",
        "part5": "Following his ascension to the throne, David demonstrated his kindness to the house of Saul. The practice in those days was for the new king to massacre anyone related to the family of the erstwhile hostile monarch. Mephibosheth, son of Jonathan and natural heir to Saul would be in great danger of his life. But David instead of seeking to kill, sought to bless. He would show kindness to the household of Jonathan with whom he had a covenant.\n\nIt was David who took the initiative. He sought information concerning Jonathan's surviving kin. The search found Ziba who revealed to David that Mephibosheth, Jonathan's lame son, was in hiding. And David would show kindness to Mephibosheth for \"Jonathan's sake\" which was the \"kindness of God\" manifested through the king [v. 1b, 3a].\n\nThis reminds us of our helpless estate as wretched, depraved sinners undeserving of the least of God's mercies. Yet, God sovereignly sought us and saved us by His grace. At one time we were dead in sin and without hope. But we thank God that out of His covenantal loving-kindness, He sent His only begotten Son, our Lord Jesus Christ to save us. Our Lord gave His life on the cross as the perfect sacrifice for our sins. He called us to turn to Him through the Gospel and by the power of the Holy Spirit, we repented from our sins and were marvellously saved. We cannot thank God enough for His saving grace, His sustaining grace and His abundant grace that ensure we, His blood-bought children, are kept in His service for His glory and praise.",
        "part6": "THOUGHT",
        "part7": "According as He hath chosen us in Him before the foundation of the world, that we should be holy and without blame before Him in love. - Ephesians 1:4",
        "part8": [
            "LEVITICUS 19",
            "PSALMS 26-27"
        ]
    },
    "18 APRIL": {
        "part1": "2 Samuel 9:2-4",
        "part2": "Ziba, the servant",
        "part3": "VERSE 2",
        "part4": "And there was of the house of Saul a servant whose name was Ziba. And when they had called him unto David, the king said unto him, Art thou Ziba? And he said, Thy servant is he.",
        "part5": "Ziba, the servant of King Saul, had fifteen sons and twenty servants [v. 10]. With the demise of Saul's sons save for lame Mephibosheth now living under the patronage of Machir in Lo Debar, we can safely infer that Ziba had free rein over Saul's estates as its steward and overseer, and enjoyed much authority and privilege in the absence of any oversight. Furthermore it is evident he was an astute and capable man who had prospered, with many sons and even servants under him.\n\nNow summoned by King David for information about Saul's surviving family, the shrewd steward was able to perceive that his comfortable status quo could be threatened. And as the story unfolds, it will be seen that Ziba proves to be a crafty duplicitous schemer who manoeuvres his way into gaining what was rightfully Mephibosheth's [2 Samuel 16:3-4]. Ziba achieved what his covetous heart sought and certainly in society's eyes would be regarded a smart and successful man. \"The ends justify the means\" is the world's mantra.\n\nBut that is not the way of our Lord Jesus Christ. Honesty is the Christian's badge. He speaks the truth without prevarication. He tolerates neither guile nor deceit in his heart because it pollutes the temple of the Holy Spirit [1 Corinthians 6:19]. The ninth commandment is his rule which forbids him bearing false witness, misrepresenting truth or speaking lies to achieve his desired ends.\n\nZiba is an example of what a servant should not be, especially for us who are servants of the living God and ambassadors for our Lord Jesus Christ.",
        "part6": "THOUGHT",
        "part7": "To be truthful is to be most Christ-like, therefore \"... let your communication be, Yea, yea; Nay, nay: for whatsoever is more than these cometh of evil\" [Matthew 5:37].",
        "part8": [
            "LEVITICUS 20",
            "PSALMS 28-29"
        ]
    },
    "19 APRIL": {
        "part1": "2 Samuel 9:3a",
        "part2": "Kindness of God",
        "part3": "VERSE 3a",
        "part4": "And the king said, Is there not yet any of the house of Saul, that I may shew the kindness of God unto him?",
        "part5": "David held all power in his hand. Mephibosheth deserved nothing apart from the kindness of the king. And it is in the keeping of David's covenant with Jonathan that we are given a veiled look at the kindness of God toward undeserving man.\n\nWhat is the kindness of God? The word \"kindness\" here is the great Hebrew word of Old Testament grace - \"hesed\". Variously translated \"loving-kindness, mercy, goodness, steadfast love\", it encompasses all of these and more, for it speaks of the special covenant relationship undergirding all these elements which binds Jehovah to his chosen people. And it is an everlasting and unbreakable covenant made and upheld by the eternal, sovereign and faithful God.\n\nTo whom does He extend such kindness? In all ages, it has been to whomsoever who will receive it - any repentant and contrite sinner, unclean and unworthy who recognises his need to be saved from his sin and accepts Him alone who can save. \"But as many as received Him, to them gave He power to become the sons of God, even to them that believe on His name.\" [John 1:12]. Salvation is a free gift of God received only by faith. It is the gift of son-ship whereby the slave of sin becomes the child of God.\n\nMephibosheth dined henceforth at the king's table as his subject but those days would come to an end. We who are recipients of God's \"hesed\" will dine at the Father's table as sons and daughters for all eternity never to hunger or thirst again.",
        "part6": "THOUGHT",
        "part7": "This is a faithful saying, and worthy of all acceptation, that Christ Jesus came into the world to save sinners; of whom I am chief. - 1 Timothy 1:15",
        "part8": [
            "LEVITICUS 21",
            "PSALM 30"
        ]
    },
    "20 APRIL": {
        "part1": "2 Samuel 9:3",
        "part2": "Kindness of God's people",
        "part3": "VERSE 3",
        "part4": "And the king said, Is there not yet any of the house of Saul, that I may shew the kindness of God unto him? And Ziba said unto the king, Jonathan hath yet a son, which is lame on his feet.",
        "part5": "Mephibosheth merited no favours from his sovereign save for the promise that bound David and his father years before. Now Jonathan was gone and David held sway over Israel. Easy it would have been for him to forget and forgo the words of a distant past. But the king whom God had blessed much would now love much in his gratitude and obedience to God. So David sought out Mephibosheth.\n\nWe are all Mephibosheths at heart, full of flaws and defects, but God sought us out to show His kindness too. Like the crippled son, we have been shown the unmerited goodness and grace of God because the loving Father sent His beloved and sinless Son, the Greater David, to be our Saviour and satisfaction for divine holiness and justice, to accomplish what we, who were dead in sin and condemned, could not do for ourselves. What a sublime picture of God's covenantal love towards His chosen!\n\nWhat then are we to be, being such recipients of grace? We are to manifest God's love in turn by our love for others, even our enemy. We are to bless them, pray for and do good to them and overcome evil with good.\n\nKindness must be the adornment of God's people and the principle by which we live. Our every thought, word and deed must be the fruit of kindness. Paul enjoined the Colossians to \"put on therefore, as the elect of God, holy and beloved, bowels of mercies, kindness, humbleness of mind, meekness, longsuffering\" [Colossians 3:12]. Our Lord Jesus Himself told His disciples, \"Inasmuch as ye have done it unto one of the least of these My brethren, ye have done it unto Me\" [Matthew 23:40]. Let us so do.",
        "part6": "THOUGHT",
        "part7": "Every little act of kindness, even a cup of water given in our Lord's name, is recognised in heaven. Read Matthew 25:34-45.",
        "part8": [
            "LEVITICUS 22",
            "PSALM 31"
        ]
    },
    "21 APRIL": {
        "part1": "2 Samuel 9:5-6a",
        "part2": "Machir",
        "part3": "VERSE 5",
        "part4": "Then king David sent, and fetched him out of the house of Machir, the son of Ammiel, from Lo-debar.",
        "part5": "Machir was a wealthy sheikh of one of the Transjordanic (West of River Jordan) tribes living in Lo-debar in Gilead. By some accounts he was also a Benjamite.\n\nAfter Saul's death, his sole surviving but crippled son Mephibosheth would live under the roof and care of this benefactor. Scant mention is made of this man in Scripture but the little that is said reveals much about his heart. The only other place we meet Machir is when the fortunes of David had turned and he was in Gilead fleeing from his usurper son Absalom. In 2 Samuel 17: 27-29, we see another beautiful and spontaneous act of kindness by Machir in provisioning David and his followers unstintingly with implements for comfort and food from the rich produce of his land.\n\nMachir is an example of the compassion and kindness that should characterise God's people. There was certainly neither need nor gain for him to take Mephibosheth under his charge. There was nothing Mephibosheth could conceivably do for him, since Saul was dead and David was king. There was also no gain but only possible loss in succoring David, when Absalom looked to have the upper hand in his challenge for the throne.\n\nMachir's motivation to act was simply the recognition of need and the opportunity presented for him to do good. That must be all the more so with us who have received the Lord's goodness. The person in need is our neighbour to whom we must extend our Christian love and kindness. Did not our Lord Jesus say, \"Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy strength, and with all thy mind; and thy neighbour as thyself \" [Luke 10:27].",
        "part6": "THOUGHT",
        "part7": "And now abideth faith, hope, charity, these three; but the greatest of these is charity. - 1 Corinthians 13:13",
        "part8": [
            "LEVITICUS 23",
            "PSALM 32"
        ]
    },
    "22 APRIL": {
        "part1": "2 Samuel 9:6b-7",
        "part2": "David's promises to Mephibosheth",
        "part3": "VERSE 7",
        "part4": "And David said unto him, Fear not: for I will surely shew thee kindness for Jonathan thy father's sake, and will restore thee all the land of Saul thy father; and thou shalt eat bread at my table continually.",
        "part5": "With the kingdom now stabilised, David turned his attention to the welfare of Jonathan's remaining household. David's kindness to Mephibosheth was motivated by his gratitude for God's kindness and to honour the covenant he had made with Jonathan [1 Samuel 20:14-15]. Jonathan had protected David from his father and had been a loving and faithful friend when David was friendless in Saul's court.\n\nMephibosheth presented himself before David fearfully but the king addressed him with gentleness. He assured Mephibosheth his intention to show him kindness for Jonathan's sake. He would restore to him all the land his family had forfeited because of his uncle Ishbosheth's rebellion. Furthermore, Mephibosheth would be invited to eat continually at David's table. David promised Mephibosheth protection, possessions and provisions. Mephibosheth was crippled from childhood and now living in obscurity away from Jerusalem. Yet King David sought him and in kindness and mercy, restored him and treated him as a son.\n\nWe, at one time, were spiritually wretched, lame and helpless in our lost estate. The greater David, our Lord Jesus out of great love for us, left heaven's glory, came down to earth and sought after us. He suffered and died for our sins to gain for us salvation so rich and free and restored our fellowship - lost by our first earthly father, Adam in his rebellion - to God our Heavenly Father. He made us His children, \"heirs of God and joint heirs with Christ\" [Romans 8:17], and granted us peace, protection and provision. What marvellous love! Amazing Grace!",
        "part6": "THOUGHT",
        "part7": "Bless the LORD, O my soul: and all that is within me, bless His holy name. Bless the LORD, O my soul, and forget not all His benefits. - Psalm 103:1-2",
        "part8": [
            "LEVITICUS 24",
            "PSALM 33"
        ]
    },
    "23 APRIL": {
        "part1": "2 Samuel 9:8",
        "part2": "Mephibosheth's humility",
        "part3": "VERSE 8",
        "part4": "And he bowed himself, and said, What is thy servant, that thou shouldest look upon such a dead dog as I am?",
        "part5": "Though a prince in his own right, Mephibosheth had spent his childhood and young adult life in abject helplessness, obscurity and misery after the death of his father and grandfather, relying on the charity of Machir. Now, he found himself in the King's palace. Struck by the awesome sight of the King and palace surroundings, he bowed in reverence. David was touched by the humility of his dear friend's son and showered kindness upon him. Shocked and perplexed, Mephibosheth in humility and self-abasement wondered aloud why such a \"servant\" and \"dead dog\" as he should deserve such kindness. David the Psalmist on another occasion had similarly enquired this of God about himself [Psalm 8:4].\n\nGod in His sovereign will and counsel had allowed the things which had befallen Mephibosheth. When Divine power brings one down it is not without accompanying Divine grace. In due time God would lift up Mephibosheth again and restore him to his royal position.\n\nDavid himself had manifested humility. When Saul deceitfully offered his daughter Merab to be David's wife, David declared his own unworthiness [1 Samuel 18:18]. David had even bowed to Jonathan [1 Samuel 20:41]. God oftentimes humbles us for our own spiritual good. Mephibosheth, on seeing David's greatness, goodness and magnanimity, was greatly moved. It is only when we envision the height of Divine greatness and goodness, that we realise the depth of our own unworthiness and shame. And so it was with Isaiah when he saw the holiness of God and was ashamed of his own uncleanness and unworthiness [Isaiah 6:5]. \"By humility and the fear of the LORD are riches, and honour, and life.\" [Proverbs 22:4].",
        "part6": "THOUGHT",
        "part7": "Humble yourselves in the sight of the Lord, and he shall lift you up. - James 4:10",
        "part8": [
            "LEVITICUS 25",
            "PSALM 34"
        ]
    },
    "24 APRIL": {
        "part1": "2 Samuel 9:9-10",
        "part2": "David's charge to Ziba and Ziba's commitment",
        "part3": "VERSE 10",
        "part4": "Thou therefore, and thy sons, and thy servants, shall till the land for him, and thou shalt bring in the fruits, that thy master's son may have food to eat: but Mephibosheth thy master's son shall eat bread alway at my table. Now Ziba had fifteen sons and twenty servants.",
        "part5": "Having pronounced restoration of Saul's properties to Mephibosheth, David charged Ziba, his sons and servants to till the land and ensure that the whole household of Mephibosheth including the servants would be provided for. Ziba, a long-time servant of Saul would have accumulated much wealth and substance for himself as evidenced by his own large household. With much privileges, Ziba would now carry the responsibility to provide for the entire house. \"When goods increase, they are increased that eat them: and what good is there to the owners thereof, saving the beholding of them with their eyes?\" [Ecclesiastes 5:11]. Not only was Mephibosheth saved from his previous wretchedness, he was restored all that was rightfully his and more - a place in David's house.\n\nSalvation is paradise regained. We are reconciled to God our Heavenly Father once again. With salvation so great, rich and free, comes much blessings and privileges. We are justified and adopted into God's family. With privilege comes responsibility. We are called to holiness as God our Father is holy [1 Peter 1:15-16], to walk worthy of the vocation wherewith we are called [Ephesians 4:1], to put off the old man and put on the new, to care one for another [Ephesians 4:22-32]. We must bear the Fruit of the Spirit [Galatians 5:22] and cleanse ourselves to be fit vessels for the Master's use, as servants and ambassadors, bearing to the lost the good news of salvation and reconciliation [2 Corinthians 5:20]. We are called to be soldiers of our Lord Jesus Christ fighting a good fight for Him, contending earnestly for the faith, till He comes again.",
        "part6": "THOUGHT",
        "part7": "I beseech you therefore, brethren, by the mercies of God, that ye present your bodies a living sacrifice, holy, acceptable unto God, which is your reasonable service. - Romans 12:1",
        "part8": [
            "LEVITICUS 26",
            "PSALM 35"
        ]
    },
    "25 APRIL": {
        "part1": "2 Samuel 9:11-13",
        "part2": "David's favour to Mephibosheth",
        "part3": "VERSE 11",
        "part4": "Then said Ziba unto the king, According to all that my lord the king hath commanded his servant, so shall thy servant do. As for Mephibosheth, said the king, he shall eat at my table, as one of the king's sons.",
        "part5": "David not only restored to Mephibosheth all the confiscated properties of Saul, David decreed that Mephibosheth would eat at his table as one of his sons. Mephibosheth, orphaned from the age of five, was now taken into the family of David who would be like a father to him. Not only would Mephibosheth be assured of abundant food and provisions, he would be in constant communion with David, as a son communing with a father. He would enjoy the security, love and warmth of the family. Though lame and of no useful service, he would not be an embarrassment at the dinner table because the king welcomed him. Our Heavenly Father loved us with such a great love. In His compassion, mercy and grace, He gave us the matchless gift of His Son, our Lord Jesus, to reconcile us back unto Himself and made us His sons and daughters [2 Corinthians 6:18]. He sustains us by providing for all our needs. God has graciously given us His Holy Word upon which we can nourish our soul in faith, love, hope and holiness. As we eat of the bread and drink of the wine at the Lord's Supper in remembrance of our Lord Jesus, we look forward to the day when we will dine with Him, the King of kings, in Heaven even as He has promised [Revelation 3:20]. We shall see Him face to face [Revelation 20:4] and commune with Him. The feast will be one of perfect joy, peace and rest and we will be with Him forever. All who have accepted the invitation of the Gospel will be present at the King's table.",
        "part6": "THOUGHT",
        "part7": "Blessed is he that shall eat bread in the kingdom of God. - Luke 14:15",
        "part8": [
            "LEVITICUS 27",
            "PSALM 36"
        ]
    },
    "26 APRIL": {
        "part1": "2 Samuel 10:1-2",
        "part2": "David's reciprocal kindness",
        "part3": "VERSE 2",
        "part4": "Then said David, I will shew kindness unto Hanun the son of Nahash, as his father shewed kindness unto me. And David sent to comfort him by the hand of his servants for his father. And David's servants came into the land of the children of Ammon.",
        "part5": "The Ammonites were descendants of Lot through his incestuous relationship with his younger daughter after the destruction of Sodom and Gomorrah. They lived east of the Jordan River.\n\nThey had a reputation as cruel people known to slice open pregnant women in battle [Amos 1:13]. Ammon did not have a friendly relationship with Israel and even threatened to thrust out the right eye of every man in Jabesh-gilead [1 Samuel 11:1-2] to subjugate them as servants in exchange for peace. The people of Jabesh-gilead were saved when Saul led the Israelite army to defeat the Ammonites.\n\nNahash the King of Ammon had shown David kindness in an act that was unrecorded in the Bible. Upon Nahash's death, David would show his gratitude for that kindness, sympathy to the grieving family and congratulations to his son, the new king. The transition in political leadership brought uncertainty to the ties between Israel and Ammon. David hoped to continue the good relationship he had with the old king by comforting the new. Just as David had shown kindness and mercy to Jonathan's family by providing for Mephibosheth, David desired to show kindness to the family of Nahash. David, the man after own God's heart, sought to undergird his conduct of domestic affairs and foreign policy with mercy and kindness.\n\nGod's Word teaches us to treat others with kindness, mercy and honesty, to show our Christian love. Indeed, it is by such expressions and actions that we reflect God's love for mankind and perhaps win them to the Lord Jesus Christ.",
        "part6": "THOUGHT",
        "part7": "Put on therefore, as the elect of God, holy and beloved, bowels of mercies, kindness, humbleness of mind, meekness, longsuffering. - Colossians 3:12",
        "part8": [
            "NUMBERS 1",
            "PSALM 37"
        ]
    },
    "27 APRIL": {
        "part1": "2 Samuel 10:3",
        "part2": "Hanun's insecurity",
        "part3": "VERSE 3",
        "part4": "And the princes of the children of Ammon said unto Hanun their lord, Thinkest thou that David doth honour thy father, that he hath sent comforters unto thee? hath not David rather sent his servants unto thee, to search the city, and to spy it out, and to overthrow it?",
        "part5": "Hanun's national security council was staffed by evil men lacking in wisdom, love and magnanimity. Their hatred for Israel intensified after their earlier defeat by Saul. They felt insecure seeing David and Israel prosper and increase in strength. This made them distrust David and view his kind actions with great suspicion.\n\nThey jumped to the conclusion that Israel's king was sending ambassadors to spy out their land and city. They assumed these ambassadors were there to gather intelligence, valuable in helping them lay siege on their city in the future. This reflected their suspicious minds and contempt for King David, and the evil in their heart, which lead them to give their king bad advice.\n\nWe must not be conceited in thinking we have perfect understanding of every motive behind people's actions. The existence of any slightest dislike of a person will cause us to misjudge their friendly intentions. They may have meant us good, but we interpret their intent to be bad. Many a quarrel has erupted over such misunderstandings and many relationships have been broken. A careful examination of our opinions of others may reveal ungodly thoughts for which we must seek forgiveness.\n\nMay God teach us to resist the evil influence that blinds us to the good in people, to think evil of them and harbour ill-will towards another. Let us pray God will teach us to love others and bestow His wisdom upon us so we will respond in a God- honouring manner even if others think evil of us.",
        "part6": "THOUGHT",
        "part7": "Charity suffereth long, and is kind; charity envieth not; charity vaunteth not itself, is not puffed up, Doth not behave itself unseemly, seeketh not her own, is not easily provoked, thinketh no evil. - 1 Corinthians 13:4-5",
        "part8": [
            "NUMBERS 2",
            "PSALM 38"
        ]
    },
    "28 APRIL": {
        "part1": "2 Samuel 10:4-5",
        "part2": "Indignity",
        "part3": "VERSE 4",
        "part4": "Wherefore Hanun took David's servants, and shaved off the one half of their beards, and cut off their garments in the middle, even to their buttocks, and sent them away.",
        "part5": "Middle-eastern men grow beards as a sign of wisdom, gravity and manhood. To shave off one side of their beards is an indignity comparable to flogging and branding. Other than the priesthood, men in biblical times did not wear undergarments, so cutting their clothes down the middle to their buttocks would expose their nakedness. Hanun's actions were designed to cause maximum humiliation as his people ridiculed these ambassadors and drove them out of Ammon. The insults were not directed at these men alone but at Israel and her king. Hanun not only threw away the opportunity to strengthen his kingdom by aligning with David, his rejection of David's friendly gesture signalled defiance and a provocation to war.\n\nMankind's response to God's gift of His only begotten Son, our Lord and Saviour Jesus Christ, is no different. In the Parable of the Vineyard [Matthew 21:33-46], the husbandmen representing the Jewish religious leaders, rejected the servants (Old Testament prophets) and finally killed the son (our Lord Jesus Christ) of the vineyard owner (God the Father). Many people reject our Lord even though they hear in the Gospel message that He came in love and mercy to save them from their sins. In their pride and wilful hard-heartedness, they do not think they have sinned, nor do they need the Saviour. Like the Jewish religious leaders, they drove our Lord Jesus out of their lives and crucify Him, yet deny any wrong-doing.\n\nDo not treat God's gift of salvation with contempt. Do not reject our Lord Jesus. Come to Him in humility and repent of your sins. Only He can cleanse and forgive us of our sins.",
        "part6": "THOUGHT",
        "part7": "For the Son of man is come to save that which was lost. - Matthew 18:11",
        "part8": [
            "NUMBERS 3",
            "PSALM 39"
        ]
    },
    "29 APRIL": {
        "part1": "2 Samuel 10:6",
        "part2": "Counting of numbers",
        "part3": "VERSE 6",
        "part4": "And when the children of Ammon saw that they stank before David, the children of Ammon sent and hired the Syrians of Bethrehob, and the Syrians of Zoba, twenty thousand footmen, and of king Maacah a thousand men, and of Ishtob twelve thousand men.",
        "part5": "Ammon had become so odious in Israel's eyes, yet Hanun refused to make amends. He even thought it would be a good idea to go to war with them. The Bible does not reveal the size of the two armies, but it is clear that Hanun thought they stood a better chance of defeating Israel if they had help. Therefore, he enlisted the services of 33,000 Syrian mercenaries. The Syrians were no doubt eager to crush Israel which was increasing in strength since David's ascension to the throne. The combined Ammonite-Syrian army was a formidable force that would test the military capabilities of the Israelites and their faith in God. When we do the Lord's work, do we count on numbers as well? Are we discouraged that our church is small and our members less wealthy than others? Do we think souls can only be won when we have trendy programmes and charismatic leaders in our ministries to draw the crowds in? Do we surrender because our efforts do not bear much spiritual fruit? Let us not be misled by modern theories of church growth and worldly philosophies. Spiritual victories are not won by large armies of church-goers relying on their strength, intelligence and capabilities. Numbers do not guarantee or even indicate spiritual success. The Bible records how Israel won battles facing numerically superior enemies because they understood the need for God's work to be done in God's way, trusting Him wholly. May we learn to rely on God's wisdom and strength to do His work because His grace is sufficient for us [2 Corinthians 12:9].",
        "part6": "THOUGHT",
        "part7": "The Christian life is often a battle against Satanic opposition and all God's work is spiritual warfare, but the battle and victory is His, so that no flesh can claim any glory. \"And all this assembly shall know that the LORD saveth not with sword and spear: for the battle is the LORD'S, and He will give you into our hands\" [1 Samuel 17:47].",
        "part8": [
            "NUMBERS 4",
            "PSALMS 40-41"
        ]
    },
    "30 APRIL": {
        "part1": "2 Samuel 10:7-8",
        "part2": "David's strategy",
        "part3": "VERSE 7",
        "part4": "And when David heard of it, he sent Joab, and all the host of the mighty men.",
        "part5": "The men of Ammon having humiliated David's ambassadors, now hired Syrian mercenaries and arrayed themselves to do battle. David himself had only told his humiliated servants to tarry at Jericho. While the humiliation of his envoys was an affront to him, there is no indication he was planning a military operation against those evil men. He may have been willing to leave the matter in the hands of the Almighty God, to judge them in His time.\n\n\"O LORD God, to whom vengeance belongeth; O God, to whom vengeance belongeth, shew Thyself. Lift up Thyself, thou Judge of the earth: render a reward to the proud\" [Psalm 94:1-2].\n\nNow however, the Ammonites not only sought to go to war, but also assembled a formidable force, employing Syrian mercenaries to do battle alongside them. David's hand is now forced, and to ignore the clear and present threat, would be a foolish and irresponsible act, placing him and his people in danger of being annihilated. He was forced to respond.\n\nDavid sent Joab and his host of mighty men. Joab whose name means \"Jehovah is father\" was a trusted military commander and ardent supporter of David. He had his personal failings, but David could trust him with this military task. The phrase \"host of mighty men\" implies an organised army of able warriors. \"Host\" is also used to describe the angels and celestial bodies (sun, moon and stars) all of which are in the service of God.",
        "part6": "THOUGHT",
        "part7": "Look to God for wisdom to know when to be patient and when to act decisively. Look to God and He will direct your paths.",
        "part8": [
            "NUMBERS 5",
            "PSALMS 42-43"
        ]
    },
    "1 MAY": {
        "part1": "2 Samuel 10:9-11",
        "part2": "Cooperate to win",
        "part3": "VERSE 11",
        "part4": "And he said, If the Syrians be too strong for me, then thou shalt help me: but if the children of Ammon be too strong for thee, then I will come and help thee.",
        "part5": "Joab saw two battle lines formed against him: before and behind [v. 9]. He chose the best soldiers to be under his direct command against the Syrians who were in the field. It is likely these Syrians were formidable fighters and the reason why the Ammonites had employed them. The remaining host of Israel were put under his brother Abishai's command, and their primary task was to engage the Ammonite army assembled in front of their city (likely Rabbah). In the event of collapse of either Israelite force, the other would come to their aid. The fact that Joab had to divide his army suggests he recognised he was unable to maintain a prolonged battle on two fronts. He had to plan for contingencies, and being humble enough to realise this, turned to his brother for help.\n\n\"Two are better than one; because they have a good reward for their labour. For if they fall, the one will lift up his fellow: but woe to him that is alone when he falleth; for he hath not another to help him up\" [Ecclesiastes 4:9-10].\n\nWe see that while everyone must endeavour to do their best for God, we must also realise we are not alone. Often, God sends like-minded co- labourers to work alongside us. Be sensitive to the Holy Spirit's leading and be humble to acknowledge that cooperation with those whom God sends, is God's will to allow us to do well for His glory.",
        "part6": "THOUGHT",
        "part7": "And he that reapeth receiveth wages, and gathereth fruit unto life eternal: that both he that soweth and he that reapeth may rejoice together. And herein is that saying true, One soweth, and another reapeth. - John 4:36-37",
        "part8": [
            "NUMBERS 6",
            "PSALM 44"
        ]
    },
    "2 MAY": {
        "part1": "2 Samuel 10:12",
        "part2": "Resolve to win",
        "part3": "VERSE 12",
        "part4": "Be of good courage, and let us play the men for our people, and for the cities of our God: and the LORD do that which seemeth Him good.",
        "part5": "Joab and Abishai were about to fight a battle not of their choosing. The Ammonites had humiliated King David's envoys then arrayed their army together with Syrian mercenaries. Israel's army was facing a battle on two fronts against a numerically superior force. They resolve to be of good courage. To \"play the men for our people\" is to show themselves to be strong. They are in effect girding themselves spiritually for battle - knowing they must be strong and show themselves to be so. They spoke not just to themselves but to encourage their men. They were standing up in defence of their people and cities which were not just theirs, but God's. They were fighting to prevent Jehovah's people and cities falling under heathen oppression. They were resolved to win for they saw themselves as agents for a greater cause - God's glory.\n\n\"Whether therefore ye eat, or drink, or whatsoever ye do, do all to the glory of God\" [1 Corinthians 10:31]. Joab showed himself unscrupulous and unprincipled in other circumstances, yet recognised he was fighting for God here. He was able to declare that the outcome was in God's hands.\n\nWe see that both faith in God's sovereignty and wisdom must be present in His people to do His work. Joab made wise plans in splitting his forces, resolved to be strong and displayed strength in battle, and yet trust the outcome to God. Earnestly labour for God yet trusted Him for the outcome of our labour. This is the complementary operation of God's sovereignty and man's responsibility.",
        "part6": "THOUGHT",
        "part7": "I have planted, Apollos watered; but God gave the increase. So then neither is he that planteth any thing, neither he that watereth; but God that giveth the increase. - 1 Corinthians 3:6-7",
        "part8": [
            "NUMBERS 7",
            "PSALM 45"
        ]
    },
    "3 MAY": {
        "part1": "2 Samuel 10:13-14",
        "part2": "Enemy destroyed",
        "part3": "VERSE 13",
        "part4": "And Joab drew nigh, and the people that were with him, unto the battle against the Syrians: and they fled before him.",
        "part5": "The plan was conceived for a battle they had not sought, and to defend God's possession. The heart was resolved to be strong for God's people. Their eyes were looking to God in faith, entrusting Him with the outcome of the battle. The moment of action arrived, and Joab stepped forward to do the work. After every preparation and plan has been done, there is the need to act. Joab and his mighty men drew near the enemy in battle, and the Syrians \"fled before him\". They approached to engage, and their opponents took flight. This outcome could not have been predicted by any human reasoning or logic. When the Ammonites saw the Syrian mercenaries on the run, they too fled before Abishai's men into their city [v. 14]. Before Joab and his men moved, they had prepared and prayed calling on God for His blessing. Bless them He did, and in a manner far exceeding their hopes [Jeremiah 33:3]. It was by God's hand that the enemy was destroyed.\n\n\"How should one chase a thousand, and two put ten thousand to flight, except their Rock had sold them, and the LORD had shut them up?\" [Deuteronomy 32:30]\n\nThe Syrians fled like the hirelings they were, and while the Israelites were being faithful to God in this instance, it is God who is the ever faithful covenant- keeping God to His people. God is keeping His promise to the Israelites as they continued walking in His commandments [Leviticus 26:1-9]. Praise God for His promises are true!",
        "part6": "THOUGHT",
        "part7": "Now unto Him that is able to do exceeding abundantly above all that we ask or think, according to the power that worketh in us, unto Him be glory in the church by Christ Jesus throughout all ages, world without end. Amen. - Ephesians 3:20-21",
        "part8": [
            "NUMBERS 8",
            "PSALMS 46-47"
        ]
    },
    "4 MAY": {
        "part1": "2 Samuel 10:15-17",
        "part2": "One last stand",
        "part3": "VERSE 17",
        "part4": "And when it was told David, he gathered all Israel together, and passed over Jordan, and came to Helam. And the Syrians set themselves in array against David, and fought with him.",
        "part5": "When David learned that Hanun's father, Nahash king of Ammon died, he sent his servants to comfort Hanun out of goodwill. Instead of being grateful, Hanun shaved off half the beards, cut half the clothes of the delegates and ridiculed them. According to the customs then, in mistreating and humiliating David's men in that manner, Hanun in effect declared war unilaterally and unprovoked. What a way to repay kindness and concern! Hanun thought he would win because he engaged able Syrian mercenaries. David had no choice but to go to war. He led the fight together with Joab. And God delivered the victory to them.\n\nAs Christians, we desire to preach the Gospel, the Good News that our Lord Jesus saves. Like David's servants, we mean well. Our aim is to tell of the way to get to Heaven. Instead, many Christians are persecuted, scorned, ridiculed and some have even been put in jail or killed for just preaching and sharing the Gospel. The world spits in defiance at the Good News and spurns the great gift. In effect, many have declared war with God the Giver. And we are engaged in this spiritual battle but God fights alongside us. He will deliver the victory as He had to David.\n\nThis reminds us of our Lord Jesus Christ who came to save man. How was He treated? He was not welcomed. \"He came unto His own, and His own received Him not\" [John 1:11]. Instead, the world despised, persecuted, and finally crucified Him. But our Lord Jesus defeated His enemy, the Devil. He conquered death and rose from the dead. He is the Victor. Nobody can go up against God and expect to triumph.",
        "part6": "THOUGHT",
        "part7": "The horse is prepared against the day of battle: but safety is of the LORD. - Proverbs 21:31",
        "part8": [
            "NUMBERS 9",
            "PSALM 48"
        ]
    },
    "5 MAY": {
        "part1": "2 Samuel 10:18-19",
        "part2": "Real peace",
        "part3": "VERSE 19",
        "part4": "And when all the kings that were servants to Hadarezer saw that they were smitten before Israel, they made peace with Israel, and served them. So the Syrians feared to help the children of Ammon any more.",
        "part5": "The Ammonites and Syrians were no match for David because God was with the Israelites. The Syrians no longer wanted to help the Ammonites after being defeated. They now made peace with Israel and served them. Why did the Syrians do an about turn to make peace with Israel and not to continue helping the Ammonites? They knew that the Almighty God has been merciful and gracious to David and Israel. Although David had a strong and mighty army, it was God who gave the victory. As God told Paul, we only hurt ourselves if we kick against the pricks.\n\nIt is in the best interest for the Syrians to make peace with the Jews. Like the Syrians, we cannot struggle our way through and hope to win the battle against sin and death. We should stop, surrender our will to God and seek peace. Then God will give us real peace in our life. Do not wait until you lose a war to make peace with God. Our Lord Jesus gives this inner peace that nobody else can. There is peace of mind and there is peace in the heart. We have the assurance our Lord is with us at all times. He will guide every step in our walk with Him. We can face even terminal illness with confidence because we know that after we leave this earth, our Lord Jesus will be waiting for us in Heaven. He reserves a place there for everyone who believes and accepts Him as his Saviour. Turn to God and make peace with Him. Our Lord Jesus Christ is the Prince of Peace.",
        "part6": "THOUGHT",
        "part7": "Or let him take hold of My strength, that he may make peace with Me; and he shall make peace with Me. - Isaiah 27:5",
        "part8": [
            "NUMBERS 10",
            "PSALM 49"
        ]
    },
    "6 MAY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 1 gone with his army in the siege of Rabbah.",
        "part4": "And it came to pass, after the year was expired, at the time when kings go forth to battle, that David sent Joab, and his servants with him, and all Israel; and they destroyed the children of Ammon, and besieged Rabbah. But David tarried still at Jerusalem.",
        "part5": "David led the war against the Ammonites and Syrians. Though the Jews won that battle, the war was not over. The Israelites continued to besiege Rabbah. Instead of staying with the soldiers, David went back to his home in Jerusalem. As their leader and king, David should have stayed on to give the moral support and lead. However, he preferred the comfort of his home. David would not have been tempted by sin (which Scripture records) if he had gone with his army in the siege of Rabbah.\n\nChristians should be always busy for the Lord. We are to be grateful since God delivered us out of darkness and gave us eternal life. Is it too much for us to use our time and talents to serve Him? Both our time and talents are from Him. Without God, we have nothing.\n\nPerhaps David wanted to be with his soldiers, but his flesh was weak. \"Watch and pray, that ye enter not into temptation: the spirit indeed is willing, but the flesh is weak\" [Matthew 26:41]. Our Lord Jesus encourages us to watch and pray so we do not enter into temptation. If we are busy for the Lord, we are likely to have less opportunity for temptation to get the better of us. There are many ways and places to serve and be busy for the Lord. Like David, we may be willing to serve but our flesh is weak. We are to avail ourselves for God, to use our talents, time, and treasures for His Glory. The only question is - Are we willing?",
        "part6": "",
        "part7": "I beseech you therefore, brethren, by the mercies of God, that ye present your bodies a living sacrifice, holy, acceptable unto God, which is your reasonable service. - Romans 12:1",
        "part8": [
            "NUMBERS 11",
            "PSALM 50",
            "THOUGHT I beseech you therefore, brethren, by the mercies",
            "of God, that ye present your bodies a living",
            "sactifice, holy, acceptable unto God, which is your",
            "reasonable service. -- Romans 12:1"
        ]
    },
    "7 MAY": {
        "part1": "2 Samuel 11:2-3",
        "part2": "Entertaining temptation",
        "part3": "VERSE 3",
        "part4": "And David sent and enquired after the woman. And one said, Is not this Bathsheba, the daughter of Eliam, the wife of Uriah the Hittite?",
        "part5": "In this world, temptation lurks at every corner. Oftentimes, we may not even be actively seeking trouble, but trouble comes along and finds us. This was the case with David as well. He was doing something completely innocuous - strolling on his roof garden and viewing the scenery. However, temptation soon came knocking. He spotted Bathsheba bathing. This was when David sinned. Instead of fleeing the temptation, he allowed sin to gain a foothold in his heart. First, he passively remained on the roof and continued watching her. Next, he exacerbated the temptation by actively inquiring after the woman so he could indulge his sinful lust.\n\nThis negative example is for us to learn from. First, when put in situations where sin is lurking at the door, we should not remain passive. The Apostle Paul instructed Timothy, \"Flee ... youthful lusts\" [2 Timothy 2:22]. Likewise, we should take decisive action to flee and remove ourselves from that situation so that we do not allow sin to creep in and stay. We are to run away from sin.\n\nSecond, there should be a conscious effort to be \"simple concerning evil\" [Romans 16:19]. There is absolutely no need to \"find out more\" about the temptation that is beckoning us. While we may be curious, be reminded of the young man in Proverbs 7, who perhaps out of curiosity, passed by the strange woman's house and was subsequently ensnared in sin. We are to stay away from sin.\n\nFinally, instead of entertaining the tempting sights and sounds, let us remember to cleave to that which is good [Romans 12:9]. We are to run to God instead.",
        "part6": "THOUGHT",
        "part7": "It is not enough to flee from temptation. We need to run to God.",
        "part8": [
            "NUMBERS 12-13",
            "PSALM 51"
        ]
    },
    "8 MAY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 5 sin is to conceal it. Adam hid from God, and David,",
        "part4": "And the woman conceived, and sent and told David, and said, I am with child.",
        "part5": "David went from entertaining temptation to falling headlong into sin. As he allowed lustful covetousness to gain ground in his heart, the prospect of committing adultery with Bathsheba became more and more enticing. Soon he forgot about God and His call for holiness and succumbed.\n\nThe natural reaction of a person who falls into sin is to conceal it. Adam hid from God, and David, as we will read in following verses, would take elaborate measures to cover up his sin. The lesson for us is that no matter how well hidden it may be, \"your sin will find you out\" [Numbers 32:23; 1 Corinthians 4:5]. We may hide our sin from the people around us, but we will never be able to hide our sin from the all-seeing God.\n\nGod is omniscient Who knows our every thought, word, and deed. It is vanity and foolishness to think that we can indulge our sinful nature without His knowledge. More importantly, we have to realise that there are consequences to our sin. The direct consequence of David's adultery was Bathsheba's pregnancy. Now David had to cover that up and suffer the mental anguish of pretending that all was well.\n\nIn this manner, David's heart was being hardened. We must realise it is time to quickly and humbly seek forgiveness from the Lord, when it is obvious that we are facing the consequences of our sin. In trusting his own strength and devices to conceal his sin from God and man, David would eventually end up committing murder.",
        "part6": "",
        "part7": "If we confess our sins, He is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness. - 1 John 1:9",
        "part8": []
    },
    "9 MAY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 5 conquest of Rabbah. Instead of leading his army as",
        "part4": "And the woman conceived, and sent and told David, and said, I am with child.",
        "part5": "What a direct statement Bathsheba makes here. She had broken her marriage vow to her husband Uriah. Now she must face the unwanted consequence of her adultery.\n\nDavid had to face the consequences of his sin as well. How do you feel about David at this point? Not only was his weak human nature revealed, but his sinful nature was also exposed. David had chosen to remain behind in Jerusalem. He had sent Joab to lead the army against Ammon in the conquest of Rabbah. Instead of leading his army as he usually did, David stayed back and acted without seeking God's guidance.\n\nNow we see David and Bathsheba trying to figure a way out of this unwanted pregnancy. Bathsheba knew the penalty for adultery. David, as Israel's king, could not escape punishment too. In fact, it would be more severe for him as he was the one who sought out and enticed Bathsheba. Had he sought God for strength to overcome his lustful desire, this would not have happened.\n\nSin will always lead to more sin when we choose to persist unrepentantly down that path. It is a downward slide to more and more selfish misdeeds. One idle moment of watching Bathsheba led to lust, covetousness, adultery and murder. How true the inspired words of Scripture - \"But every man is tempted, when he is drawn away of his own lust, and enticed. Then when lust hath conceived, it bringeth forth sin: and sin, when it is finished, bringeth forth death\" [James 1:14-15].",
        "part6": "",
        "part7": "Idleness is the devil's workshop.",
        "part8": []
    },
    "10 MAY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 6 David's act would be covered up.",
        "part4": "And David sent to Joab, saying, Send me Uriah the Hittite. And Joab sent Uriah to David.",
        "part5": "We see David hatching his clever cover-up. Note the details of his elaborate and stealthy plan. Joab obeyed the king's order unquestioningly. David pretended to seek a report of the battle from Uriah, then sent him home to Bathsheba to spend the night with food and drink, expecting the battle-worn soldier to seek the company and loving arms of his wife. If that had transpired, then there would be a cause for Bathsheba's pregnancy and David's act would be covered up.\n\nBut as we shall see, one lie often leads to another in order to cover up the first. This is the downward slide of sin, and if a sinner does not stop what he is doing and turn back to God, he will sink deeper and deeper into sin's quagmire, which Bunyan in Pilgrim's Progress fittingly calls the Slough of Despond. The unrepentant sinner sinks hopelessly under the weight of his sin and guilt to a certain death. Hence James warned - \"But every man is tempted, when he is drawn away of his own lust, and enticed. Then when lust hath conceived, it bringeth forth sin: and sin, when it is finished, bringeth forth death\" [James 1:14-15].\n\nBetter it would have been for David to repent, confess and make right with God. Repentance leads to God's forgiveness and forgiveness leads to His restoration. The consequences of sin would have to be borne but they would be mitigated. And this is true for us as well when we fall into temptation and sin.",
        "part6": "",
        "part7": "Draw nigh to God, and He will draw nigh to you. Cleanse your hands, ye sinners; and purify your hearts, ye double minded. - James 4:8",
        "part8": [
            "NUMBERS 16",
            "PSALMS 56-57",
            "THOUGHT Draw nigh to God, and He will draw nigh to you.",
            "Cleanse your hands, ye sinners; and purify your",
            "hearts, ye double minded. -- James 4:8"
        ]
    },
    "11 MAY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 11 sin did not work. He feigned concern for Uriah the",
        "part4": "And Uriah said unto David, The ark, and Israel, and Judah, abide in tents; and my lord Joab, and the servants of my lord, are encamped in the open fields; shall I then go into mine house, to eat and to drink, and to lie with my wife? as thou livest, and as thy soul liveth, I will not do this thing.",
        "part5": "David wanted Uriah to spend the night with his wife. But the loyal and faithful soldier cared more for his men than his pleasure. What a contrast to David! Instead of going home to Bathsheba's arms, he chose to spend the night at the gate with the guards. The guards must have been delighted to see Uriah and receive updates about their friends at the battlefront.\n\nDavid was frustrated that his plan to conceal his sin did not work. He feigned concern for Uriah the next morning by asking why he did not return home to rest more comfortably since he had travelled a long way back to Jerusalem from the front.\n\nUriah explained he could not seek personal comfort knowing that the Ark was still in the tents, and his master Joab and his compatriots were still camping in the fields. His answer could have pricked David's heart in rebuke to him for personal indulgence and pleasure even by sleeping with Uriah's wife. David could have repented and turned from evil at that stage. But David's heart was already hardened as his sole purpose was to hide his sin from his people.\n\nBe mindful of our thoughts and actions. Once we commit a sin and refuse to admit, repent and stop, we will continue to backslide and sink deeper into the mud. We are to flee temptation, not flirt with it. We are not even to tangle or test ourselves with it because Satan is powerful and deceptive. Pray therefore for God to help us stay away from places, people and circumstances that may tempt us.",
        "part6": "",
        "part7": "Watch me, O Lord. Guard my heart and mind. Help me to flee from temptation and protect me against all evil. Amen.",
        "part8": []
    },
    "12 MAY": {
        "part1": "2 Samuel 11:12-13",
        "part2": "Second attempt",
        "part3": "VERSE 13",
        "part4": "And when David had called him, he did eat and drink before him; and he made him drunk: and at even he went out to lie on his bed with the servants of his lord, but went not down to his house.",
        "part5": "David's first attempt of covering his sin with Bathsheba did not work as Uriah refused to sleep with his wife. Instead of being positively influenced by Uriah's solidarity with his men and his devotion to the Lord's Ark, David hatched a second plan. He would drink with Uriah and get him drunk, thinking that Uriah would then return home and intoxicated, not even remember whether or not he had lain with his wife. But again, Uriah refused to go home.\n\nUriah was devoted to God and king, as evidenced by his soldier's discipline and concern about the Ark. He treated his military duty as service to the Lord. It could be that he was resolved to be in a state of ritual purity which included refraining from sexual contact. David's second attempt failed and he was distressed. He was losing control of the situation to influence the outcome because Uriah was resolute and unwavering.\n\nDavid's incident tells us that everyone can succumb to sin. In today's world, we are surrounded by many sin-inducing pressures and people with different value systems. As Christians, we need to be vigilant and remove ourselves from any tempting situation. As Paul advised Timothy, \"Flee also youthful lusts: but follow righteousness, faith, charity, peace, with them that call on the Lord out of a pure heart\" [2 Timothy 2:22]. Commit ourselves on a daily basis to the Lord to obey Him and ask Him to guard our hearts. God is faithful and He will not let us be tempted beyond what we can bear [1 Corinthians 10:13].",
        "part6": "THOUGHT",
        "part7": "\"Wherewithal shall a young man cleanse his way? By taking heed thereto according to Thy word. With my whole heart have I sought Thee: O let me not wander from Thy commandments. Thy word have I hid in mine heart, that I might not sin against Thee.\" Read Psalm 119.",
        "part8": [
            "NUMBERS 19",
            "PSALMS 60-61"
        ]
    },
    "13 MAY": {
        "part1": "2 Samuel 11:14-15",
        "part2": "Insidious plot (I)",
        "part3": "VERSE 15",
        "part4": "And he wrote in the letter, saying, Set ye Uriah in the forefront of the hottest battle, and retire ye from him, that he may be smitten, and die.",
        "part5": "David's scheme of getting Uriah to spend a night with Bathsheba failed twice. However, he refused to repent and turn to the Lord. Instead, he now devised an insidious plot, a deadly one. He signed Uriah's death warrant with the royal seal. David wrote a letter to Joab directing him to put Uriah in the front line of the fiercest battle. Then, the force would withdraw and abandon Uriah to the enemy. Joab would sacrifice a few good men together with Uriah. This scheme was so evilly plotted by David. Now David added murder to adultery. First, he coveted and seduced Uriah's wife, now he would take Uriah's and other innocent soldiers' lives. We can feel the added cruelty of this act in David sending the letter by the unwitting victim's own hand. It is unbelievable to see how such a commended servant of the Lord could fall so far and commit such deadly sins.\n\nDavid did not resort to the Lord to deal with and resolve his messy situation. He had satisfied his lusts, now he went his own way to save his own reputation with his people. He thought once Uriah was killed, he would marry Bathsheba and close the sordid chapter.\n\nThis serves a serious warning to us to keep close to the Lord, meditate on His Word day and night and pray unceasingly. We see how fleshly lusts led David to stray, sin against God, harden his heart, and deprive himself of all sense of decency. Proverbs 6:32 says \"But whoso committeth adultery with a woman lacketh understanding: he that doeth it destroyeth his own soul.\"",
        "part6": "THOUGHT",
        "part7": "Pray for the Lord to fill us with opportunities to grow in Him spiritually, serve Him and be productive. As we are weak in the flesh, pray for God's strength and wisdom to help us combat the temptations we will face.",
        "part8": [
            "NUMBERS 20",
            "PSALMS 62-63"
        ]
    },
    "14 MAY": {
        "part1": "2 Samuel 11:16-17",
        "part2": "Insidious plot (II)",
        "part3": "VERSE 17",
        "part4": "And the men of the city went out, and fought with Joab: and there fell some of the people of the servants of David; and Uriah the Hittite died also.",
        "part5": "Joab did exactly what David commanded. He followed the king's orders, and Uriah was killed. Though this happened in a raging battle, Uriah was murdered just as surely as if David had wielded the knife himself. David murdered one of his best soldiers to cover his despicable sin. And sin if not immediately confronted, will take its wretched course. When the consequences of adultery threatened to expose his deed, David covered it first with deception and then with murder. Satan could never tempt David with the entire package all at once, but the devil lured and deceived him bit by bit, one step at a time.\n\nThe account of David and Bathsheba is so well known it is easy for us to treat it casually. We pass over the story quickly because it seems we know everything about it. But the clear line that separates righteousness from sinfulness must never be blurred, and neither should we cursorily pass over the account of this sordid affair.\n\nGod does not mask the sins of the saints; or disguise the wickedness of His people; rather, God exposes us so that we are compelled to admit that we are redeemed and saved by grace. It provides opportunity to warn us against being presumptuous - \"Now all these things happened unto them for examples: and they are written for our admonition, upon whom the ends of the world are come\" [1 Corinthians 10:11]. If we fail to learn from the failures of others, then we shall surely fall to the same sins and suffer its consequences, just as others also suffered.",
        "part6": "THOUGHT",
        "part7": "God will not permit His people to sin with impunity.",
        "part8": [
            "NUMBERS 21",
            "PSALMS 64-65"
        ]
    },
    "15 MAY": {
        "part1": "2 Samuel 11:18-21",
        "part2": "Joab's report",
        "part3": "VERSE 18",
        "part4": "Then Joab sent and told David all the things concerning the war;",
        "part5": "Mission accomplished: Uriah was dead. Joab would send word to David, in a way that did not completely disclose the conspiracy; and did not make himself look like a murderer. Joab assumed David might possibly be angry at what had happened, the sacrifice of a number of his best soldiers through imprudently approaching too near the enemy's wall. He therefore figured that closing with the news of Uriah's death would settle David's anger and mitigate his displeasure over the deaths of the others. The effects of sin are rarely limited to just one person alone; they almost always involve the innocent who become its casualties. \"Thy servant Uriah the Hittite is dead also\", might be interpreted as meaning that it was without, or even in opposition to Joab's command, that Uriah went too far with his men, and that he was therefore chargeable for his own death. But Joab is as guilty as David in causing Uriah's death.\n\nWe should never allow ourselves to fall into a position where we are aiding and abetting someone's sin against God. Just as sin will be found out as Numbers 32:23 tells us, the one who defends a sin or helps in covering it up will one day stand in account for their bearing a false witness.\n\nBe not partaker in someone else's sin for that only brings judgement upon yourself. As the saying goes: \"Sin will take you further than you want to go, keep you longer than you want to stay and charge you more than you're willing to pay.\" You may well think the sin you have covered up is something you can manage but that's what David thought too.",
        "part6": "THOUGHT",
        "part7": "Those who attempt to cover up their sins, place others in danger.",
        "part8": [
            "NUMBERS 22",
            "PSALMS 66-67"
        ]
    },
    "16 MAY": {
        "part1": "2 Samuel 11:22-25",
        "part2": "Expedience rules",
        "part3": "VERSE 24",
        "part4": "And the shooters shot from off the wall upon thy servants; and some of the king's servants be dead, and thy servant Uriah the Hittite is dead also.",
        "part5": "Why did the messenger not wait for David to respond in anger as Joab had instructed? Why did he inform David that Uriah was killed, before the king even uttered a word in criticism or protest? Perhaps he knew David wanted to get rid of Uriah, and that Joab had accomplished this by the excuse of an offensive against the enemy. If David knew Uriah had been killed, he would not raise any objections to the needless slaughter. Rather than waiting to see if the king would become angry about the stupidity of such a move, the messenger gave David the \"good\" news with the bad.\n\nThroughout history, many attempts have been made to cover up incompetence, immorality, and crimes. Human attempts to cover up disobedience are futile. We all face decisions that make us wonder how important it is to stick to what is right rather than do what is easiest, least costly, least demanding, and most convenient at that moment. At times, doing what is expedient may be prudent, productive and perhaps the sensible thing. But when expediency displaces principled action and righteousness, we must re-examine our motives.\n\nDo you find yourself excusing sins which you consider to be trivial? The saying goes that \"small holes sink big ships\". If for expedience we ignore significant changes that are happening gradually, we will eventually suffer the worse for it. Expedient behaviour leads to undesirable results and negative consequences. Take time to ask God to examine your heart, and confess even your little sins to Him.",
        "part6": "THOUGHT",
        "part7": "All things are lawful for me, but all things are not expedient: all things are lawful for me, but all things edify not - 1 Corinthians 10:23",
        "part8": [
            "NUMBERS 23",
            "PSALM 68"
        ]
    },
    "17 MAY": {
        "part1": "2 Samuel 11:25",
        "part2": "Callousness to sin",
        "part3": "VERSE 25",
        "part4": "Then David said unto the messenger, Thus shalt thou say unto Joab, Let not this thing displease thee, for the sword devoureth one as well as another: make thy battle more strong against the city, and overthrow it: and encourage thou him.",
        "part5": "David received the report with a secret satisfaction. Once he learnt that Uriah was dead, instead of being concerned with reckless tactics and dead Israelites, he simply overlooked and minimised the losses, with indifference to those who had died.\n\nHe was so relieved to hear of Uriah's death that he did not even care other lives were wasted in the process. This is the deadly effect of sin. It causes a person to become insensitive to what is right, so long as one's wanton craving had been satisfied. David had been hardened by the deceitfulness of sin. It tells us how unhinged David had become at this point. He had totally forgotten who he was. God was certainly very far from his mind.\n\nWhen our hearts are callous to God, it makes it difficult to discern His voice and leading. Instead of steering clear of sin, we now tolerate and flirt with it. We casually allow it to coexist with godliness in our lives. Much of Christianity today does not reflect a healthy fear of God. It no longer influences the way many believers live. Have we become so inured to the presence of sin in this world that we are callous to it?\n\nThere is a giant lurking in our heart, and his desire is our demise. How are you dealing with this giant that is trying to destroy you? It is not the giant of sickness, suffering, sorrow, poverty, or pain. It is the giant of the old sinful self we carry around with us everyday that we need to fear most. Is our heart cold? Get it warm. Keep the fire for our Lord Jesus Christ burning in us.",
        "part6": "THOUGHT",
        "part7": "The problem we face in our Christian lives, is not that we don't have the Word of God; it is that we have become calloused to it.",
        "part8": [
            "NUMBERS 24",
            "PSALM 69"
        ]
    },
    "18 MAY": {
        "part1": "2 Samuel 11:26-27",
        "part2": "Sad condition",
        "part3": "VERSE 27",
        "part4": "And when the mourning was past, David sent and fetched her to his house, and she became his wife, and bare him a son. But the thing that David had done displeased the LORD.",
        "part5": "The death of Bathsheba's husband, Uriah, is one of the most regrettable events recorded, given his unreserved and unquestionable loyalty to his king, who duplicitously schemed and plotted his death because of the adultery with his wife. Though David would be forgiven, this heinous sin remained a stigma throughout his entire life [1 Kings 15:5]. While Bathsheba mourned her husband's death, inwardly she may have struggled with the guilt of her unconfessed adultery. Was there deep remorse in her heart? Or relief ? \"Captain Uriah husband is now dead, king David husband-to-be just ahead!\"\n\nAs soon as the days of mourning, which probably lasted seven days, were accomplished, David took her to be his wife. While her situation now to remarry was legitimate (her spouse being dead), yet this was a rushed marriage to cover up her unlawful pregnancy which would eventually bear them a son. On the surface, it seems to have worked out, but the thing that David did displeased the LORD. What a stinging thought! Men look on the outward appearance, but the LORD looks at the heart.\n\nScripture is a true and faithful witness. It will not connive with but will expose even the sins of the most celebrated saints. They are recorded, not for their humiliation nor our emulation but for our admonition, to the intent that he who thinks he is strong to withstand temptation must take heed lest he falls! As for the guilt-smitten ones, the panacea is to look to the Lord, for He is good, \"and ready to forgive; and plenteous in mercy unto all them that call upon Thee\" [Psalm 86:5].",
        "part6": "THOUGHT",
        "part7": "How sad our state by nature is, our sin how deep it stains; And Satan binds our captive minds fast in his slavish chains. But there's a voice of sov'reign grace sounds from the sacred Word, \"Ho! ye despairing sinners come, and trust upon the Lord.\" (Isaac Watts)",
        "part8": [
            "NUMBERS 25",
            "PSALMS 70-71"
        ]
    },
    "19 MAY": {
        "part1": "2 Samuel 12:1-6",
        "part2": "Nathan's parable",
        "part3": "VERSE 1",
        "part4": "And the LORD sent Nathan unto David. And he came unto him, and said unto him, There were two men in one city; the one rich, and the other poor.",
        "part5": "The holy and gracious Lord will not allow His beloved ones to continue in unconfessed sin. He sent the prophet Nathan to David with a parable. The parable was plain and evident. Its intent was to lead David to pronounce judgement upon himself, and realise the gravity of the evil committed, not only against his loyal servant, but also against his holy God.\n\nThe parable relates how a rich and powerful man oppressed a feeble and poor man. The rich man, unthinkably selfish (despite his wealth), pitiless and unreasonable, took away the poor man's only lamb to feed his guest. Hearing this account, David's anger was so greatly kindled that he declared the perpetrator unworthy of living in God's eyes and pronounced his victim to be restored fourfold.\n\nWhy did God send the prophet to confront David with a parable? Perhaps his kingly status and authority would make him defensive or even imperil Nathan's life in accusing and offending the king [1 Kings 13:4; 2 Chronicles 26:16-19]. A parable would cause David to look away from himself and deliver fair judgement.\n\nChrist in His earthly ministry frequently used parables when speaking to the multitudes about the kingdom of God, in order to discern the true seekers from the false, who \"seeing see not; and hearing they hear not, neither do they understand\" [Matthew 13:13]. Pray to God that our eyes may be opened to see, and our ears receptive to hear the truth of the heavenly kingdom, for often, the natural man is dull of hearing because the things of God are spiritually discerned [1 Corinthian 2:14].",
        "part6": "THOUGHT",
        "part7": "Earthly representations adroitly told, heavenly realities fascinatingly unfold.",
        "part8": [
            "NUMBERS 26",
            "PSALM 72"
        ]
    },
    "20 MAY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 6 neighbout's cattle, he shall be restored fourfold",
        "part4": "And he shall restore the lamb fourfold, because he did this thing, and because he had no pity.",
        "part5": "Agodly and righteous king till this point, David was familiar with the Mosaic law. God's Word directed that the king should keep a copy of it \"and it shall be with him, and he shall read therein all the days of his life: that he may learn to fear the LORD his God, to keep all the words of this law and these statutes, to do them\" [Deuteronomy 17:18-20].\n\nThe Mosaic law mandated that if a man was found guilty of stealing, killing or selling his neighbour's cattle, he shall be restored fourfold or fivefold, according to their value [Exodus 22:1]. David meted out a fourfold restoration judgement on the perpetrator, not realising he was pronouncing judgement on himself. He was guilty of stealing someone's wife, killing her husband and showing no pity. Fourfold restitution was to be made.\n\nZacchaeus, a chief publican and tax collector, reviled by his own people as a great sinner for cheating them in his trade, would meet the Lord Jesus and be convicted of his sins. In repentance, he declared, \"Lord; Behold, Lord, the half of my goods I give to the poor; and if I have taken any thing from any man by false accusation, I restore him fourfold\" [Luke 19:8].\n\nThis is true Scriptural repentance. Regret or sorrow without repentance, will never find favour with God. True repentance is more than just making a declaration. It is a decision driven by a change of heart, accompanied by forsaking the sin, satisfied by rightful restitution and manifested wholly in a new life perspective which is God- centered, delighting in His Word and doing what He commands.",
        "part6": "",
        "part7": "Sin forsaken is one of the best evidences of sin forgiven. - JC Ryle",
        "part8": []
    },
    "21 MAY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 7 confronted with his offence, to seek a scapegoat to",
        "part4": "And Nathan said to David, Thou art the man. Thus saith the LORD God of Israel, I anointed thee king over Israel, and I delivered thee out of the hand of Saul.",
        "part5": "Upon reacting to and pronouncing judgement on the rich man in the parable, Nathan's reply came as a thunderbolt to awaken David and convict him of his evil deeds - thou art the man! Suddenly, things took a drastic turn, and it became plainly clear to him. He was the guilty man with nowhere to hide. His sin had found him out. He had to face it and deal with it.\n\nIt is a natural tendency for a man when confronted with his offence, to seek a scapegoat to blame or minimise his actions by casting himself as a victim of unfortunate circumstances. Like Adam, who \"blamed\" God for giving him Eve, who caused his downfall. So swift at pointing to others, but slow to blame oneself!\n\nHow true and how contradicting that while before the all-seeing God, we confess our sinful failures, manifold human weaknesses, and woeful imperfections; when confronted with our own faults and offences by our fellowmen, we react with swift and angry defensiveness. Indeed, a paradox that we are broken and contrite before God but self-righteous and proud before men. This is pharisaical hypocrisy!\n\nDuring the Passover feast, the Lord said to His disciples, \" ... one of you shall betray Me.\" The response of His sorrowful disciples was, \"Lord, Is it I?\" [Matthew 26:20-22], not \"who, who is it?\". While the Adamic nature is still an integral part of us, the truly sanctified and humble man will be swift to self-examine, and slow to blame others when confronted by his wrongdoings.",
        "part6": "",
        "part7": "It is easier to cry against one-thousand sins of others than to kill one of your own. - John Flavel",
        "part8": []
    },
    "22 MAY": {
        "part1": "2 Samuel 12:7-8",
        "part2": "God's generous provision",
        "part3": "VERSE 8",
        "part4": "And I gave thee thy master's house, and thy master's wives into thy bosom, and gave thee the house of Israel and of Judah; and if that had been too little, I would moreover have given unto thee such and such things.",
        "part5": "After David was jolted out of spiritual callousness, Nathan began his prophetic announcement with \"Thus saith the LORD God of Israel\". The last time such an announcement was made, God had reminded David of His steadfast love and grace towards him and promised an eternal throne and kingdom to his descendants [2 Samuel 7:5-17].\n\nThis time round, circumstances were starkly different. David had committed some of the most heinous sins. Still God confronted him by reminding David of His covenantal faithfulness and generous provision. Be it power, protection, or possessions, God had graciously provided for David in abundance. But David had forgotten all these and chose to lust after and unscrupulously obtain what he had not been given. It is in the context of such abundant covenantal blessings that makes David's transgressions all the more treacherous and vile.\n\nIndeed, it is easy to forget God's grace towards us, especially when times are good, and everything is going smoothly. Even for those who may not have much materially, let us not forget that God's richest blessing is not in temporal things but in the eternal Lord Jesus. Through our Lord, we have forgiveness of sins, peace with God, the sure hope of eternal life, and all spiritual blessings besides.\n\nLet us cultivate this spirit of gratitude and thanksgiving, for when we lose sight of the Giver, we will stop relying on Him to provide us our needs and instead sin to satisfy our wants.",
        "part6": "PRAYER",
        "part7": "Bless the Lord, O my soul, and forget not all His benefits: Who forgiveth all thine iniquities; Who healeth all thy diseases; Who redeemeth thy life from destruction; Who crowneth thee with lovingkindness and tender mercies; Who satisfieth thy mouth with good things; so that thy youth is renewed like the eagle's. - Psalm 103:2-5",
        "part8": [
            "NUMBERS 29",
            "PSALMS 75-76"
        ]
    },
    "23 MAY": {
        "part1": "2 Samuel 12:9",
        "part2": "David's incomprehensible SINS",
        "part3": "VERSE 9",
        "part4": "Wherefore hast thou despised the commandment of the LORD, to do evil in His sight? thou hast killed Uriah the Hittite with the sword, and hast taken his wife to be thy wife, and hast slain him with the sword of the children of Ammon.",
        "part5": "After exposing the callousness of David's heart, Nathan set David's iniquities before him. First and foremost, David had \"despised the commandment of the Lord\". To despise a thing is to show contempt for it or take it lightly. The opposite is to treat it with honour and reverence.\n\nHow does one despise the commandments of the LORD? Numbers 15:30-31 tell us that we despise God's word when we wilfully break them - not so much because we hate them, but because we do not care enough about them to keep them. They are insignificant or of little value to us. When we despise the commandments, we are despising God Himself, for we do not esteem Him enough to give weight to His Word.\n\nIt is inconceivable that David, lauded as a man after God's own heart, whom God had so richly blessed, would despise God and His word. But he did. Consumed by lust, he abused his power and broke God's laws to get what he wanted. Satisfying his lusts took priority over obedience to God.\n\nHave we also despised the Lord's commandment? Our sins may not seem as grievous as David's. We may not think much of our 'little' sins because they seem harmless. But when we wilfully continue in these sins, we are despising God and His commandments. We ignore how offensive every sin is to our holy God. We minimise the fact that our Lord Jesus had to suffer and die to atone for even every \"little\" sin of ours.",
        "part6": "THOUGHT",
        "part7": "Whoso despiseth the Word shall be destroyed: but he that feareth the commandment shall be rewarded. - Proverbs 13:13",
        "part8": [
            "NUMBERS 30",
            "PSALM 77"
        ]
    },
    "24 MAY": {
        "part1": "2 Samuel 12:10-12",
        "part2": "Future troubles",
        "part3": "VERSE 10",
        "part4": "Now therefore the sword shall never depart from thine house; because thou hast despised me, and hast taken the wife of Uriah the Hittite to be thy wife.",
        "part5": "Next, Nathan prophesied David's future troubles. Because David had caused Uriah to die a violent death, his household would be plagued with violence for the rest of his life. This was fulfilled when internal strife and hatred led to the violent deaths of his sons, Amnon, Absalom, and Adonijah. Not only that, because David took another man's wife, his own wives would be openly violated, thus bringing shame and dishonour upon him and his family.\n\nThis episode reminds us that God hates sin; He will never let sin go unpunished. Some Christians think that as long as we confess our sins, we would be forgiven, and everything would be \"reset\" to normal. As God has promised, He would forgive us our sins as long as we truly repent and confess them [1 John 1:9]. However, when God forgives, it does not mean He simply dismisses or overlooks sin. A holy and just God must punish sin, but the punishment was borne by His Son, our Lord Jesus Christ, on the cross on our behalf.\n\nThen, even though our sins are forgiven, there will still be its consequences. We should not confuse consequences with punishment, lest we think we are paying the debt of sin because we suffer the negative consequences of our actions. For Christians, even when we suffer consequences for our own sins, we can endure because we know that behind every chastening is our heavenly Father, who lovingly disciplines His children to bring them back to the path of righteousness.",
        "part6": "THOUGHT",
        "part7": "Now no chastening for the present seemeth to be joyous, but grievous: nevertheless afterward it yieldeth the peaceable fruit of righteousness unto them which are exercised thereby. - Hebrews 12:11",
        "part8": [
            "NUMBERS 31",
            "PSALM 78:1-39"
        ]
    },
    "25 MAY": {
        "part1": "2 Samuel 12:13a",
        "part2": "\"| have sinned.\"",
        "part3": "VERSE 13",
        "part4": "And David said unto Nathan, I have sinned against the LORD. And Nathan said unto David, The LORD also hath put away thy sin; thou shalt not die.",
        "part5": "In response to Nathan's charge, David admitted he had sinned against the LORD. Immediately after he uttered these words, Nathan declared that the Lord had heard and forgiven, and David would not die.\n\nDavid did not try to defend himself or say more. Yet he was readily forgiven. On the surface, it seems like a simple acknowledgement that one has sinned is all that is necessary to receive forgiveness. However, it is interesting to note the phrase \"I have sinned\", which is but one word in Hebrew, has also been used by many others in the Bible - Pharaoh, Balaam, Achan, Saul, and others - to a different outcome. This is because few truly understood that word or meant what they said.\n\nFundamentally, sin is not so much about doing wrong to others; it is rebellion against God, an assault on His authority. This is why when Nathan confronted David, his primary charge against David was, \"Wherefore hast thou despised the commandment of the Lord?\" No doubt what David did to Uriah and Bathsheba was absolutely wrong, his sin was still essentially against God Himself.\n\nTrue repentance begins with recognising how serious and offensive every sin is to our holy God. Until we understand this, the words \"I have sinned\" will merely be an expression of regret, be it due to the consequences to oneself or to others. If we truly comprehend the seriousness of sin, then we will not only turn away from sin, but also turn to God and seek to restore our broken relationship with Him.",
        "part6": "THOUGHT",
        "part7": "Do you take sin seriously? Do you take Christ seriously? If not, pray and ask God to convict you of your sins, so that you may rediscover the glory of Christ's salvation.",
        "part8": [
            "NUMBERS 32",
            "PSALM 78:40-72"
        ]
    },
    "26 MAY": {
        "part1": "1 Samuel 15:24",
        "part2": "Contrast with Saul's response",
        "part3": "VERSE 24",
        "part4": "And Saul said unto Samuel, I have sinned: for I have transgressed the commandment of the LORD, and thy words: because I feared the people, and obeyed their voice.",
        "part5": "David admitted he had sinned against the LORD when Nathan confronted him. Saul had made a similar confession to Samuel. Both recognised they had sinned against God. However, the results of their confession were different for David and Saul - David was forgiven but Saul was rejected. Why? What constitutes true repentance?\n\nLet us study Saul's response. There were many signs that indicate his repentance was not genuine. First, he was not convicted of his sin. Saul was insistent he had obeyed God's commandment, even in the face of incriminating evidence. Apparently, he did not fully comprehend the seriousness of his offence against God. He was not appalled by what he had done.\n\nNext, he cared about his own honour and authority, not God's. Even after learning that God had rejected him, Saul was more concerned that Samuel should appear with him before the people so that he might continue to have the appearance of divine approval and authority.\n\nLastly, Saul did not accept sin's consequences. He tried to justify himself by giving excuses. Although he confessed, his actions showed his confession did not come from true repentance, but a desire to reverse the sentence and avoid the consequences of sin. He was sorry, not for his transgressions but for being found out.\n\nTrue repentance has no room for self- justification, or self-preservation, or self-pity. It is not directed towards self but towards God. If you are wondering whether you have truly repented, ask God to grant it to you. Ultimately, true repentance is the work of the Holy Spirit, a gift that only God can give.",
        "part6": "THOUGHT",
        "part7": "In meekness instructing those that oppose themselves; if God peradventure will give them repentance to the acknowledging of the truth. - 2 Timothy 2:25",
        "part8": [
            "NUMBERS 33",
            "PSALM 79"
        ]
    },
    "27 MAY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 4 forgiveness.",
        "part4": "Against Thee, Thee only, have I sinned, and done this evil in Thy sight: that Thou mightest be justified when Thou speakest, and be clear when thou judgest.",
        "part5": "Through prophet Nathan's denouncement, David's crime had been exposed and he was left with a crushing weight of guilt resulting in him writing this psalm. David dared not hide behind any excuses to justify his actions, nor did he cite any past merits and achievements to plead for leniency. He simply prostrated himself before His judge and appealed to God's character, His lovingkindness and tender mercies, and begged for mercy and forgiveness.\n\nDavid accepted full responsibility for his sin. Note the numerous personal pronouns he used: my sin, my transgressions, my iniquity, I have sinned, I have done this evil. He also used three different words to describe his wrongdoing. As one who knew God's laws and character, he knew that through his sin, transgression, and iniquity, he had wilfully rebelled against his God, wickedly violated His laws and fallen far short of His standards. By his actions, he had \"given great occasion to the enemies of the Lord to blaspheme\" [2 Samuel 12:14].\n\nDavid's prayer is more than a personal cry to God. It is a model of true repentance and holds powerful lessons for us. Even though we have not committed murder and adultery, we have all broken God's commandments in deed and thought, and have all sinned and fallen short of His glory. But because of the finished work of the Lord Jesus Christ on Calvary's cross, God will blot out our transgressions, wash us of our iniquity and cleanse us of our sin.",
        "part6": "",
        "part7": "Then Peter said unto them, Repent, and be baptized every one of you in the name of Jesus Christ for the remission of sins, and ye shall receive the gift of the Holy Ghost. - Acts 2:38",
        "part8": [
            "NUMBERS 34 us of our sin.",
            "PSALM 80",
            "THOUGHT Then Peter said unto them, Repent, and be baptized",
            "every one of you in the name of Jesus Christ for",
            "the remission of sins, and ye shall receive the gift",
            "of the Holy Ghost. -- Acts 2:38"
        ]
    },
    "28 MAY": {
        "part1": "Psalm 51:5-9",
        "part2": "Hope of a broken spirit",
        "part3": "VERSE 7",
        "part4": "Purge me with hyssop, and I shall be clean: wash me, and I shall be whiter than snow.",
        "part5": "David did not simply stop at confessing his sin and asking for forgiveness as we often do. He understood the depth of his sin, that it went beyond specific sinful actions all the way to a stubborn sin nature, one he was born with. As such, he asked God to change him on the inside, his \"hidden part\"; something that none of us can do ourselves, not even David was able to do himself. Only the God who created us, and who knows our hearts can do that.\n\nDavid asked God to purge (cleanse) him with hyssop. Hyssop was used to apply the blood of the Passover lamb [Exodus 12:22]. Hyssop was also used to sprinkle the priest's purifying water [Numbers 19:18]. He desired God to cleanse him through the blood of the perfect sacrifice anticipated by the animal sacrifices of the Old Testament. His hope was that his heavy burden of sin and guilt would be lifted and he would once again be able to experience joy and gladness. In verse 9, he again asked God to forgive him.\n\nAnd this is what God desires to do, not only for His dear servant David, but for all who fear Him. He is our Heavenly Father. He knows our frame and remembers that we are dust. As far as the east is from the west, so far will He remove our transgressions from us [Psalm 103:11-14]. But the Righteous God can only do so when we come by faith to the Cross and let our Lord Jesus Christ take on the punishment that we deserve.",
        "part6": "THOUGHT",
        "part7": "But He was wounded for our transgressions, He was bruised for our iniquities: the chastisement of our peace was upon Him; and with His stripes we are healed. - Isaiah 53:5",
        "part8": [
            "NUMBERS 35",
            "PSALMS 81-82"
        ]
    },
    "29 MAY": {
        "part1": "Psalm 51:10-13",
        "part2": "Plea for restoration of fellowship",
        "part3": "VERSE 12",
        "part4": "Restore unto me the joy of Thy salvation; and uphold me with Thy free spirit.",
        "part5": "David wanted more than a cleaned-up heart. He pleaded for God to create in him a new heart. Again, this is something only God can do. In Ezekiel 36:26, God promised His people that, under the New Covenant, He would take away their stony heart and give them a new heart and put a new spirit within them. To keep his new heart pure, David prayed for a \"right (or steadfast) spirit\" [v.10], God's \"holy spirit\" [v. 11], and a \"free (or generous) spirit\" [v. 12]. He was fearful that God's spirit might depart from him as he did from Saul [1 Samuel 16:14] and Samson [Judges 16:20]. He wanted to walk close to God and experience again the joy of the Lord which he dearly missed during those months of unconfessed sin and spiritual defeat.\n\nJoy is the result of God's work in people. Even as God's displeasure with sin brings judgement, so His pleasure brings joy of heart [v. 8, 12], This joy is more than an emotion. It is a contented resting in God; a blessed assurance of having been reconciled with the Lord and having peace with Him [Romans 5:1]. This is \"the joy of salvation\".\n\nDavid promised he would tell all who have committed sin that God forgives. He would pass on this knowledge to others that they might also be saved. All of us who name the name of our Lord Jesus Christ too can do this. In fact, it is the great commission of our Lord and Saviour Jesus Christ.",
        "part6": "THOUGHT",
        "part7": "\"Well done, thou good and faithful servant ... enter thou into the joy of thy lord\" [Matthew 25:21, 23]. When the Lord returns, will you hear these words from Him?",
        "part8": [
            "NUMBERS 36",
            "PSALMS 83-84"
        ]
    },
    "30 MAY": {
        "part1": "Psalm 51:14-17",
        "part2": "Plea for removal of guilt",
        "part3": "VERSE 14",
        "part4": "Deliver me from bloodguiltiness, O God, Thou God of my salvation: and my tongue shall sing aloud of Thy righteousness.",
        "part5": "Praise is the natural response to divine deliverance. The person who has tasted the grace of God in his life cannot but love Him and praise Him. During His encounter with the woman of sin in the home of Simon the Pharisee [Luke 7:36-48], the Lord remarked that those who have been forgiven much love much. David certainly had been forgiven much because his sin was especially vile, involving lust, treachery and shedding of innocent blood of one who was brave and loyal to him. Hence David resolved to praise God and sing aloud His righteousness. He wanted all that was within him to bless God's holy Name [Psalm 103:1]. Consequently, he penned numerous beautiful psalms of praise which have become a source of encouragement to millions of believers through the ages.\n\nThere are two important lessons that we can learn from today's reading. Firstly, we must recognise our sins and come before God with a broken heart and a contrite spirit. We cannot approach Him on our own merits and achievements. We can only approach Him on the merits of the great sacrifice that our Lord Jesus made for us at the Cross.\n\nSecondly, let us praise Him with grateful hearts all the days of our lives. Let us present our bodies a living sacrifice, holy, acceptable unto God, which is our reasonable service [Romans 12:1]. Let us go into this lost world and \"preach the Gospel of peace, and bring glad tidings of good things\" [Romans 10:15] to all who need to hear it.",
        "part6": "THOUGHT",
        "part7": "Jesus Christ can deliver us from the power of sin as well as from the guilt of sin. - Martyn Lloyd Jones, Walking with God Day by Day",
        "part8": [
            "DEUTERONOMY 1",
            "PSALM 85"
        ]
    },
    "31 MAY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 18 [Joshua 7], what more that of a king.",
        "part4": "Do good in thy good pleasure unto Zion: build thou the walls of Jerusalem.",
        "part5": "By the end of his prayer, David was confident that his relationship with God had been restored. Hence, he ended his psalm with an intercession for the nation. David was fearful his sin might have repercussions for Israel. When Achan sinned in the days of Israel's conquest of Canaan, the army of Israel could not conquer the tiny town of Ai until Achan's sin was judged. If the sin of a citizen like Achan could destroy the nation's effectiveness [Joshua 7], what more that of a king.\n\nSome Bible teachers believe verses 18 and 19 were added to Psalm 51 during the Babylonian exile because at that time, David was still in the process of repairing and building the city's walls; and the temple would only be built during the reign of his son, Solomon. There is no compelling reason for this hypothesis. It is likely that David was moving from prayer for himself to prayer for the people committed to him, something he did in other psalms such as Psalms 5, 25, 28 and 40. He prayed that God will do good to Zion and build the walls of Jerusalem. At that time, God would be pleased to receive the public sacrifices offered willingly by grateful hearts.\n\nChristians should also pray like David. If we truly repent of our sins, God is \"faithful and just to forgive us our sins, and to cleanse us from all unrighteousness\" [1 John 1:9]. We should also pray for our families, our church, and our nation.",
        "part6": "",
        "part7": "Words may be wanting, but prayer will ascend; for prayer is rather the language of heart than lip. - James Smith, Daily Remembrancer",
        "part8": [
            "DEUTERONOMY 2",
            "PSALMS 86-87",
            "THOUGHT Words may be wanting, but prayer will ascend; for",
            "prayer is rather the language of heart than lip.",
            "-- James Smith, Daz/y Remembrancer"
        ]
    },
    "1 JUNE": {
        "part1": "2 Samuel 12:13b-14",
        "part2": "Consequences of sin  VERSES 13b-14 And Nathan said unto David, The LORD also hath put away thy sin; thou shalt not die. Howbert, because by this deed thou hast given great occasion to the enemies of the LORD C/o blaspheme, the child also that 1s born unto thee shall surely due.  To CompPLeTE THE BIBLE",
        "part3": "",
        "part4": "And Nathan said unto David, The LORD also hath put away thy sin; thou shalt not die. Howbeit, because by this deed thou hast given great occasion to the enemies of the LORD to blaspheme, the child also that is born unto thee shall surely die.",
        "part5": "David lusted after Bathsheba, a married woman, planned the murder of Uriah her husband, and despised the commandments of the LORD. He was guilty on at least three counts, namely adultery (\"Thou shalt not commit adultery.\"); murder (\"Thou shalt not kill.\"); and covetousness (\"Thou shalt not covet.\").\n\nHe feigned ignorance for a year until he was woken up from his self-deception by God's prophet Nathan. He made no excuse for his sin and did not attempt to conceal his guilt any longer. In deepest contrition of heart, he instantly confessed and repented, \"I have sinned against the LORD.\" To which Nathan replied, \"The LORD also hath put away thy sin; thou shalt not die\" [v. 13b]. The legal penalty for adultery was death [Leviticus 20:10]. The full expression of David's confession can be studied in Psalm 51, which could be considered an important commentary for verse 13.\n\nNevertheless, Nathan also said \"the child also that is born unto thee shall surely die\" [v. 14b], to vindicate God's reputation for righteousness among the nations and to stop the mouths of the blasphemers [v. 14a]. Although God forgives sins, He does not wipe out the inescapable and painful consequences. David took Uriah's life and for this, he would lose four of his sons. The son conceived in sin with Bathsheba would die of sickness [2 Samuel 12:14, 18], and three of his oldest sons would meet violent deaths [2 Samuel 12:10]: Amnon [2 Samuel 13:28-29], Absalom [2 Samuel 18:14-15] and Adonijah [1 Kings 2:25].\n\nBy God's grace, David went through every of these consequences and endured them given the promise of God. Although God's forgiveness is boundless and accessible, we ought not to presume upon it. Sin is not something to be treated lightly.",
        "part6": "THOUGHT",
        "part7": "Repentant and forgiven sinners, always be sorry for sin and watchful against it.",
        "part8": [
            "DEUTERONOMY 3",
            "PSALM 88"
        ]
    },
    "2 JUNE": {
        "part1": "2 Samuel 12:15-17",
        "part2": "Plea for mercy",
        "part3": "VERSE 16",
        "part4": "David therefore besought God for the child; and David fasted, and went in, and lay all night upon the earth.",
        "part5": "The LORD struck the child whom Bathsheba bore for David with a terminal sickness. Though prophet Nathan had said that the child, the fruit of David's sinful union with Bathsheba, would surely die, David still pleaded with God to spare that life.\n\nWhy did David pray so hard, having been told the child would die? He was praying for God's grace. He gave this answer: \"Who can tell whether GOD will be gracious to me, that the child may live?\" [2 Samuel 12:22]. The LORD had forgiven and restored him, and David thought He might also grant his plea for mercy to let the child live.\n\nDavid prayed as earnestly as any man could pray, but God's clear answer was \"No\", and David was content with that. He accepted God's will and continued to worship Him in spite of the loss and pain. Sometimes we too must accept \"No\" from God as the answer to our pleas. Like David, we should accept His will and continue to worship Him and faithfully serve Him. How many of us praise God when he has said \"No\"? Life goes on. Look ahead and look upwards. Do not look behind and dwell in the past.\n\nGod had shown grace to David and Bathsheba far beyond what they could have hoped for or deserved. Bathsheba would conceive again and bear a second son who would bear a double name - Solomon, meaning \"peaceful\" and the LORD through Nathan named him Jedidah, which meant \"beloved of the LORD.\" The LORD loved the child, signifying His continued blessing upon David. Solomon was the chosen one to succeed David as Israel's next king. Even in His discipline, the LORD is gracious to His own. In wrath, He remembers mercy.",
        "part6": "THOUGHT",
        "part7": "I, even I, am He that blotteth out thy transgressions for Mine own sake, and will not remember thy sins. - Isaiah 43:25",
        "part8": [
            "DEUTERONOMY 4",
            "PSALM 89"
        ]
    },
    "3 JUNE": {
        "part1": "2 Samuel 12:18-19",
        "part2": "The wages of sin",
        "part3": "VERSE 19",
        "part4": "But when David saw that his servants whispered, David perceived that the child was dead: therefore David said unto his servants, Is the child dead? And they said, He is dead.",
        "part5": "The prophet confronted David regarding his heinous sin with Bathsheba and pronounced a judgement against him. Even though the LORD had graciously forgiven David, judgement came in the form of the death of the infant child [v. 14]. The newborn became seriously ill, and despite David's intense fasting, prayer and sincere petitions, died. God's chastisement stood. An innocent child died instead of the guilty pair. This infant, a member of David's family, would be the first to suffer the deadly wages of sin. The child did not die as punishment for his own sin; it was a disciplinary consequence of David's transgression.\n\nThe Greek word translated \"wage\" is opsonion. \"Wage\" is the word for salary or payment given to someone for his work and services rendered. Thus, the wages of sin refer to the reward which comes as a result of serving Satan. How does the Bible define sin? 1 John 3:4 says, \"Whosoever committeth sin transgresseth also the law: for sin is the transgression of the law.\" The answer to Question 14 of the Westminster Shorter Catechism tells us, \"Sin is any want of conformity unto, or transgression of the law of God.\"\n\nDavid had sinned against God, but he was not punished with death. Adultery and murder, both were sufficient cause for execution, even for a king. The genuine and contrite repentance which he expressed both to Nathan and fully to the LORD in Psalm 51 was more than sufficient to forgive and restore him. However, the impact of his sin remained and continued to work its sorrow in Israel, in his family and his life. Sin is sin and must be hated and shunned, for its wages is death [Romans 6:23].",
        "part6": "PRAYER",
        "part7": "I have sinned against Thee, LORD. Please forgive me.",
        "part8": [
            "DEUTERONOMY 5",
            "PSALM 90"
        ]
    },
    "4 JUNE": {
        "part1": "2 Samuel 12:20-23",
        "part2": "Go on living",
        "part3": "VERSE 20",
        "part4": "Then David arose from the earth, and washed, and anointed himself, and changed his apparel, and came into the house of the LORD, and worshipped: then he came to his own house; and when he required, they set bread before him, and he did eat.",
        "part5": "In times of great sadness and grief, it is not surprising if life seems to come to a standstill. When a loved one passes away, it may feel almost sacrilegious to be carrying on our business as usual. Perhaps we may be conveying the impression that the loss of the loved one was of little consequence. In this passage however, David sets us an example of how we ought to move on. Before his son's death, David fasted and besought God for mercy on behalf of the child. But when it became clear it was God's will that the child should die, David submitted himself to divine will, picked himself up and moved on with the matter of living.\n\nLet us also note David did not just tend to his physical needs. After washing himself and changing his clothes, he made sure God was worshipped before satisfying his physical hunger. His spiritual duties took precedence over his physical needs. This is an important principle in our Christian walk. Our Lord Jesus exhorts us to \"seek ye first the kingdom of God, and His righteousness; and all these things shall be added unto you\" [Matthew 6:33].\n\nAfter a tragic event in life, one of our most important need is to ensure our relationship with God is intact and not adversely affected. We may be tempted to feel bitterness or blame God. That puts us in danger of sinful pride - as though we know better than God and are unwilling to submit to His higher will. In contrast, by worshipping Him, we acknowledge His sovereignty over our lives, and remind ourselves of His covenanted goodness towards us.",
        "part6": "THOUGHT",
        "part7": "When sorrows like sea billows roll, whatever my lot, Thou hast taught me to say, \"it is well, it is well with my soul\". - Horatio G. Spafford",
        "part8": [
            "DEUTERONOMY 6",
            "PSALM 91"
        ]
    },
    "5 JUNE": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 23 David fasted and wept to show the depth of his",
        "part4": "But now he is dead, wherefore should I fast? can I bring him back again? I shall go to him, but he shall not return to me.",
        "part5": "As we read yesterday, David's behaviour appeared strange to his servants. It is not common for people to be able to move on quickly after the death of a loved one.\n\nToday, we examine David's explanation to his puzzled servants. We will focus on two aspects of David's answer. First, David demonstrated an understanding of God's graciousness and omniscience [v. 22]. While David's child yet lived, David fasted and wept to show the depth of his sorrow and repentance over his own sin of adultery. He knew God was merciful and gracious. In times past, God had pronounced judgement on Israel but then graciously withheld punishment because they repented. Furthermore, David also knew God does not look at outward appearances, but He examines one's heart. This meant God knew if David was truly repentant over his sin or just putting on an act to save his son.\n\nNext, we see David demonstrating absolute faith in God's goodness [v. 23]. When his child died, David understood fully it was God's will for this to come to pass. Instead of becoming bitter or being unable to accept God's will, David bowed himself down in humble submission. He would trust that all things work together for good to them that love God [Romans 8:28], and he was able to testify to his faith - that despite his sin and the tragic consequences, David had confidence God had forgiven him and one day he would be reunited with his son in heaven.",
        "part6": "",
        "part7": "God knows always and He knows best. Even before a great tragedy strikes, do we already have difficulty submitting to His will?",
        "part8": []
    },
    "6 JUNE": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 23 6:47]. David was able to get over his grief because",
        "part4": "But now he is dead, wherefore should I fast? can I bring him back again? I shall go to him, but he shall not return to me.",
        "part5": "Even among Christians, death tends to be a scary thing, and some may be tempted to call it a great unknown. Often, this fear stems from the notion that what happens when life ends is unclear and uncharted. Inherent in this fear is a lack of faith in and knowledge of God's Word. In the Bible, we have the clear, written promises from an omnipotent God that those who believe in Him will not perish but have everlasting life [John 3:16; 6:47]. David was able to get over his grief because he was confident that one day he would see his son again in heaven. He was confident there was life after death. It was not a great unknown. When we have faith in God's Word, we need not fear death for as the prophet has said, \"He (the Lord) will swallow up death in victory\" [Isaiah 25:8], and after Calvary, the apostle affirms it [1 Corinthians 15:54]. \"For if we have been planted together in the likeness of his death, we shall be also in the likeness of his resurrection\" [Romans 6:5].\n\nMany may also be wondering why David was confident his son would go to heaven. The Westminster Confession of Faith states that \"Elect infants, dying in infancy, are regenerated and saved by Christ through the Spirit, who worketh when, and where, and how He pleaseth ...\" (WCF 10:3). Even though babies are born with original sin, the sovereign God in His great mercy and wisdom will deal with them with loving graciousness. This would be consistent with Luke 18:15-16 where Christ explicitly tells His disciples, \"Suffer little children to come unto Me, and forbid them not: for of such is the kingdom of God.\"",
        "part6": "",
        "part7": "Is my fear of death a measure of my faith in God?",
        "part8": []
    },
    "7 JUNE": {
        "part1": "2 Samuel 12:24-25",
        "part2": "Birth of Solomon",
        "part3": "VERSE 24",
        "part4": "And David comforted Bathsheba his wife, and went in unto her, and lay with her: and she bare a son, and he called his name Solomon: and the LORD loved him.",
        "part5": "David's adultery had led to the death of his son. Now that he had repented and made right with God, David was blessed with another son - Solomon. Solomon would go on to become the next king of Israel and a distant ancestor of our Lord Jesus Christ. It is specifically described for us that \"the LORD loved him\".\n\nThis is indeed great encouragement. Christians may have been disobedient to God in such a way that they are now trapped in situations where they would not have been in, if they had been obedient to God's Word. Yet, to extricate themselves is also no longer possible because it would be committing another sin and displeasing God even more. For example, a Christian may have sinned wilfully in marrying a non-believer. Once married however, to seek a divorce to get out of the unequal union would be a further sin.\n\nDavid had truly repented of his adultery, and God chose no longer to remember that sin [Hebrews 8:12]. In His great mercy, God instead chose to love this child, and to use this child as an avenue to bring the promised Messiah into the world. Let us be encouraged that there is no sin too great for God to forgive. Even if you seem stuck in a situation you would not have gotten into if you had been fully obedient, there is still room at the cross for you.",
        "part6": "THOUGHT",
        "part7": "Can I remove myself from my sinful situation without incurring greater sin?",
        "part8": [
            "DEUTERONOMY 9",
            "PSALMS 95-96"
        ]
    },
    "8 JUNE": {
        "part1": "2 Samuel 12:26-28",
        "part2": "Victory in the frontlines  VERSES 27-28 And Joab sent messengers to David, and said, I have fought against Rabbah, and have taken the city of waters. Now therefore gather the rest of the people together, and encamp against the city, and take it: lest I take the city, and it be called after my name.  To CompLtete THE BiBLeE",
        "part3": "",
        "part4": "And Joab sent messengers to David, and said, I have fought against Rabbah, and have taken the city of waters. Now therefore gather the rest of the people together, and encamp against the city, and take it: lest I take the city, and it be called after my name.",
        "part5": "The account returns now to the battle against the Ammonites in Rabbah. This event took place after a two-year siege between David's fall into sin and his eventual repentance. It was also this very occasion that provided David with the opportunity to cover any traces of his grievous sin of adultery by being complicit in the death of Uriah [2 Samuel 11:1, 7, 15]. A short time after Uriah's death, in these verses, the Israelites have captured Rabbah's strongly defended area and cut off the city's water supply. They could now easily take the whole city, and Joab called David down from Jerusalem to have the honour of leading the triumphal entry. Also, the presence of a large army would completely subjugate the entire country after the capture of its capital.\n\nOn the cusp of seizing the city, it is interesting how 'Joab sent messengers to David' to give him the honour of entering it as the victor. This shows that despite Joab's infamy for his falsehoods, dubious and unworthy character, he had praiseworthy loyalty to David - even the worst of men have some good qualities, sometimes.\n\nThis account gives us a more important lesson: while David's army emerged victorious and the siege of Rabbah ended triumphantly, we find David overcome by temptation and fallen into grievous sin. He was troubled by a guilty conscience which would ultimately come to fore. Worldly success and prosperity are not true measure of moral worth, nor guarantee of inward peace and happiness. May the Lord remind us of this always.",
        "part6": "PRAYER",
        "part7": "Father in heaven, I pray that you may grant me a heart of chastity and holiness. It is my desire that my heart be right with Thee. In Jesus' name, Amen.",
        "part8": [
            "DEUTERONOMY 10",
            "PSALMS 97-98"
        ]
    },
    "9 JUNE": {
        "part1": "2 Samuel 12:29-31",
        "part2": "Assuming leadership",
        "part3": "VERSE 30",
        "part4": "And he took their king's crown from off his head, the weight whereof was a talent of gold with the precious stones: and it was set on David's head. And he brought forth the spoil of the city in great abundance.",
        "part5": "Having taken Rabbah, David now put on the king's crown as a symbol of his subjection of the Ammonites to his rule [v. 30]. From a beginning of contempt and pride [2 Samuel 10:1-4], the city with its king and inhabitants now suffered a disastrous end. They trusted Moloch their false god in vain.\n\nSadly, the retribution did not end here, but it was marked by further violence and bloodshed - the people put under saws, harrows of iron, axes or iron, and made to pass through the brick-kiln [v. 31]. While these acts of violence and retaliation were brutal and inhumane, they must be seen in the context of the historical age in which they took place, not with reference to modern times. Evidently, the Ammonites were themselves a savage and brutal nation [1 Samuel 11:1-2; 2 Samuel 10:1- 4; Amos 1:13], and this likely was the way they were accustomed to treating their vanquished foes. We could say that they faced the just deserts.\n\n\"To execute vengeance upon the heathen, and punishments upon the people\" [Psalm 149:7]. Indeed, David had been appointed here as the instrument of God's divine judgement. By the principle of lex talionis or the Law of Retaliation, the Ammonites justly deserved what they had meted out to others. On David's part however, we cannot defend these excessively severe atrocities David has committed. In the light of truth and righteousness, this perhaps may be a blot on David's renown as Israel's king.",
        "part6": "PRAYER",
        "part7": "Father in heaven, I thank You that You are our King. Unlike earthly dominions, You change not, and with You there is no variableness, neither shadow of turning. Watch over us in Your mighty sovereignty. In Jesus' name, Amen.",
        "part8": [
            "DEUTERONOMY 11",
            "PSALMS 99-101"
        ]
    },
    "10 JUNE": {
        "part1": "2 Samuel 13:1",
        "part2": "The fruits of sin",
        "part3": "VERSE 1",
        "part4": "And it came to pass after this, that Absalom the son of David had a fair sister, whose name was Tamar; and Amnon the son of David loved her.",
        "part5": "\"And it came to pass after this ...\" shows that these tragic events were connected to God's judgement against David's house as prophesied by Nathan in Chapter 12 for his sin of adultery followed by the murder of Uriah. God's sovereignty in no way mitigates man's responsibility [James 1:13-15].\n\nAt this time, David would have been king over all Israel for more than a decade. He had reached the zenith of his glory, and his kingship was well-established. His wars and struggles were over - Rabbah was captured, and his empire firmly established. Hereafter, he would sit upon his throne for another twenty years. However, despite the glory and honour of kingship, he was a guilty culprit, and he must bear the many sorrows resulting from his sin.\n\nThe account here is wrought with intense carnality and repugnant disgust, a complicated plot with involvement of multiple members in David's extended household. Amnon was David's firstborn, the son of Ahinoam of Jezreel. It has been conjectured Amnon would not have committed his shameless crime had not David's own sin and poor example loosened the bonds of parental authority. Amnon hesitated at first but was encouraged by his cousin Jonadab [v. 3].\n\nThe chastisement of God which David experienced came chiefly through the repercussions on his family and of their actions. The misconduct of his sons can largely be attributed to David's own sins and disobedience against God. As God's redeemed, the way we live can either be used to testify for the glory of God or to bring reproach to His Name.",
        "part6": "THOUGHT",
        "part7": "But if ye will not do so, behold, ye have sinned against the LORD: and be sure your sin will find you out. - Numbers 32:23",
        "part8": [
            "DEUTERONOMY 12",
            "PSALM 102"
        ]
    },
    "11 JUNE": {
        "part1": "2 Samuel 13:1",
        "part2": "Trouble in David's Family",
        "part3": "VERSE 1",
        "part4": "And it came to pass after this, that Absalom the son of David had a fair sister, whose name was Tamar; and Amnon the son of David loved her.",
        "part5": "As mentioned previously, the account in this chapter is intense, complicated and repugnant, with the chastisement of God which David experienced coming upon him chiefly through the complicated affairs within his family.\n\nThis chapter reveals the dark and filthy stain within David's family in its manifestations of sin - lust, anger, hatred, vengeance, selfish ambition, and rivalry. The characters involved were filled with deception and mired in intrigue. While David was such an admirable ruler of his kingdom, he had failed miserably as a ruler of his own household.\n\nDavid's personal testimony may well be the cause of these family feuds. While he was a man after God's own heart [1 Samuel 13:14] with many good qualities, his sins of adultery and murder would have great impact and consequences for him and his children.\n\nAnother cause of his family tragedy would arise from his failure in ruling the family well. As a father, David displayed favouritism, harbouring excessive tenderness of feeling towards his son Absalom [2 Samuel 13:39] and not dealing appropriately with wrongdoing. David's failure to correct and discipline his sons would lead only to further sorrow.\n\nDavid's sins and its punishment show that God's forgiveness does not remove sin's consequences in this life. This was painful chastisement upon David for taking the one \"ewe lamb\" [2 Samuel 12:4].",
        "part6": "THOUGHT",
        "part7": "O give us homes built firm upon the Savior, Where Christ is Head, and Counsellor and Guide; Where ev'ry child is taught His love and favor And gives his heart to Christ, the crucified. - Barbara Beyer",
        "part8": [
            "DEUTERONOMY 13-14",
            "PSALM 103"
        ]
    },
    "12 JUNE": {
        "part1": "2 Samuel 13:2",
        "part2": "The lust of Amnon",
        "part3": "VERSE 2",
        "part4": "And Amnon was so vexed, that he fell sick for his sister Tamar; for she was a virgin; and Amnon thought it hard for him to do anything to her.",
        "part5": "Amnon and Tamar were half siblings and yet he had fleshly desires for Tamar to the extent of being vexed. The Hebrew word for \"vexed\" shows us that Amnon was so desperate for Tamar he was distressed. The word \"virgin\" here means \"young woman of marriageable age\", thus Amnon was frustrated because she was both beautiful and sexually mature in his eyes, but he could not have her.\n\nWe recall yesterday's devotion that Amnon did not truly love Tamar but merely lusted after her. By fast forwarding to verse 15, Amnon's anger after lying with Tamar also confirms that Amnon was experiencing signs of lustfulness and not love. Incest was forbidden by God's law, but this fact did not appear to bother Amnon who was only concerned about fulfilling his own needs.\n\nSex is a gift from God, but this gift, as with all other gifts, can be abused. Have we often used the excuses that \"we are wired this way\" or \"it's only natural\" to justify our sins of lustfulness? Lustfulness stems from self-centredness because we only care about our own needs and not about others or what God wants for us. There is also an element of covetousness because we are tricked into believing we need to do something to fulfill that need. The devil wants us to believe that we will live far better lives if we obtain that thing or person we desire.\n\nWhen temptations visit us in our minds, quickly seek God in prayer while we still can. Pray and ask God for help to overcome and run away from our lustful thoughts.",
        "part6": "THOUGHT",
        "part7": "When temptations come, pray and persist in prayer until they go away.",
        "part8": [
            "DEUTERONOMY 15",
            "PSALM 104"
        ]
    },
    "13 JUNE": {
        "part1": "2 Samuel 13:3-5",
        "part2": "Jonadab",
        "part3": "VERSE 3",
        "part4": "But Amnon had a friend, whose name was Jonadab, the son of Shimeah David's brother: and Jonadab was a very subtil man.",
        "part5": "The Hebrew word for \"subtil\" is often translated in the Bible to mean \"wise\" or \"cunning\". The workmen who created items for use in the sanctuary [Exodus 36] were described by Moses to be \"wise\", meaning skillful. It is also mentioned that David was a wise and cunning man, but why is the same Hebrew word used here for Jonadab?\n\nWhen we read the entire account, we notice how 'wise' a plan it really was, because the plan allowed Amnon to achieve his goal. However, wisdom and success in this world does not necessarily equate to wisdom in God's eyes. Interestingly in Deuteronomy 32:6, we see the same Hebrew word being translated as \"unwise\".\n\nThe Bible recognises that there is also such a thing as worldly wisdom. Sometimes it would seem such wisdom is worth heeding, but we are warned that the end of the path that worldly wisdom leads is death in the strange woman's house [Proverbs 5].\n\nTrue wisdom comes from the fear of the LORD [Psalm 111:10] and it is only by seeking Him and studying His Word that we can attain the wisdom we need to navigate life on earth. When we receive advice from others, are we checking to see if it aligns with God's Word? Or is our judgement based purely on human logic or feeling or emotion?\n\nThe world is filled with wisdom, but it is in our best interests to seek godly wisdom by looking to God first and spending time with Him in His Word. So James counsels: \"If any of you lack wisdom, let him ask of God, that giveth to all men liberally, and upbraideth not; and it shall be given him.\" [James 1:5]",
        "part6": "THOUGHT",
        "part7": "Do we recognise the difference between godly and worldly wisdom? Or is it getting harder and harder for us to differentiate? Turn to the true source of wisdom!",
        "part8": [
            "DEUTERONOMY 16",
            "PSALM 105"
        ]
    },
    "14 JUNE": {
        "part1": "2 Samuel 13:6-10",
        "part2": "Jonadab's plot",
        "part3": "VERSE 6",
        "part4": "So Amnon lay down, and made himself sick: and when the king was come to see him, Amnon said unto the king, I pray thee, let Tamar my sister come, and make me a couple of cakes in my sight, that I may eat at her hand.",
        "part5": "Lustfulness is first conceived in the mind before any physical action happens. Amnon was likely contemplating this for some time and all that was needed was a \"good friend\" to give him a push in the right (or wrong) direction.\n\nAmnon had many opportunities to flee from this temptation, but he dived head in like a sheep to the slaughter. He could have told his father that he was well [v. 6]; he could have asked his servants to prevent Tamar from entering his house [v. 8]; he could have asked his servants to stay by his side [v. 9]; he could have asked for the cakes to be left outside his chamber [v. 10]; and he could have prayed for help to resist the temptation. Amnon was not at all interested to flee from it because the account tells us how smoothly the plan went. It was flawless.\n\nBeloved, beware the sin of lustfulness because if we do not ask God for His help to curb it, it will fester and grow. It starts with an unhealthy desire in the mind, then a few glances here and there, then a need to indulge in pornography, then when pornography lacks excitement, we move on to more 'exciting' and yet unlawful things like Amnon did.\n\nTo the singles out there, marriage is not the cure for your sin of lustfulness. Lustfulness stems from self-centredness, pride and covetousness, and the only cure is to constantly remember what our Lord Jesus Christ has done for our sins. We must be open and vulnerable before God to ask Him for help to escape this great trap.",
        "part6": "THOUGHT",
        "part7": "If you are struggling with lustfulness, find an accountability partner to share your struggles with and start praying to ask God for help to deal with it.",
        "part8": [
            "DEUTERONOMY 17",
            "PSALM 106"
        ]
    },
    "15 JUNE": {
        "part1": "2 Samuel 13:11-14",
        "part2": "Tamar's plea",
        "part3": "VERSE 12",
        "part4": "And she answered him, Nay, my brother, do not force me; for no such thing ought to be done in Israel: do not thou this folly.",
        "part5": "Right as Amnon was about to consummate his wicked plan, he received four appeals from Tamar which could have deterred him from going through with it. Tamar appealed for him to control his urges; reminded him that rape was a crime in Israel; pleaded to his conscience for she would be shamed and appealed for him to consider his reputation. Amnon could have stopped but did not. The damage has been done; might as well finish it. When we are on the verge of committing a grievous sin, the Holy Spirit within cries out for us to stop but our wicked heart spews out lies that it is too late, and we might as well go ahead. Our pride stops us from desisting.\n\nThere will always be an opportunity to resist and repent no matter how much or how far we have sinned. As long as someone reaches out with a branch, we are able to get out of the swamp, no matter how deep we have sunk. The wonder of the Cross is that the severity of our sin does not impact the effectiveness of God's forgiveness and grace towards us. His grace is ever abounding and it will cleanse every stain.\n\nTamar's pleas were the last line of defence for Amnon, but Amnon failed to see that and the consequence was severe. Before indulging in sin, do we listen to the pleas of our conscience and the Holy Spirit? Do we spare a thought about what our dreaded sin has done to our Saviour on the cross?",
        "part6": "THOUGHT",
        "part7": "Let us remind ourselves of what our Saviour has done for us and how grievous our sins are, so that we may be more consciously aware of the promptings of the Holy Spirit within us.",
        "part8": [
            "DEUTERONOMY 18",
            "PSALM 107"
        ]
    },
    "16 JUNE": {
        "part1": "2 Samuel 13:15-17",
        "part2": "Amnon's hatred for Tamar",
        "part3": "VERSE 15",
        "part4": "Then Amnon hated her exceedingly; so that the hatred wherewith he hated her was greater than the love wherewith he had loved her. And Amnon said unto her, Arise, be gone.",
        "part5": "As a result of Tamar's resistance to his advances, Amnon's hatred toward her grew to such an extent that it overshadowed his incestuous love for her. Now his lust was fulfilled, Amnon cast her out. Tamar told Amnon that sending her away after what he had done was more evil than forcing her to lie with him. However, Amnon would not hearken to her words and commanded his servant to put her out of his room and bolt the door after her.\n\nAmnon's feelings, his words and actions reveal that his \"love\" for Tamar was in fact just lust. We are commanded to love our wife as we love our own body. And no man ever hated his own flesh; but nourishes and cherishes it [Ephesians 5:28-29]. On the other hand, sinful lust, when it is satisfied, only leaves one empty, disappointed and guilty. And this often leads to hatred which in turn stirs up strife and other evil communications.\n\nLet us be wary of worldly lusts and flee them. In our sin-cursed world, the media promotes it much, and many are enticed and drawn to them. What is lust but a desire for that which is forbidden. But the Bible warns us that \"when lust hath conceived, it bringeth forth sin: and sin, when it is finished, bringeth forth death\" [James 1:15]. Christians, let us, therefore, walk in the Spirit, so that we will not fulfil the lust of the flesh.",
        "part6": "THOUGHT",
        "part7": "The wicked shall fall by his own wickedness. - Proverbs 11:5b",
        "part8": [
            "DEUTERONOMY 19",
            "PSALMS 108-109"
        ]
    },
    "17 JUNE": {
        "part1": "2 Samuel 13:18-19",
        "part2": "Tamar's shame",
        "part3": "VERSE 19",
        "part4": "And Tamar put ashes on her head, and rent her garment of divers colours that was on her, and laid her hand on her head, and went on crying.",
        "part5": "What a horrendous evening it turned out to be. When Tamar went to Amnon's room, thinking to ease him of his sickness by caring for and feeding him, little did she realise that she would be forcibly violated. Adding insult to injury, Amnon would throw her out coldheartedly after raping her. There was nothing left for her to do but lament her fate, throw ashes on her head in grief and rent her garment of divers colours, the princess's apparel signifying a maiden's chastity and purity.\n\nThe warning in today's reading is applicable to us especially in this day and age, where the world and its media are so filled with lustful images, sounds and provocative ideas. There was a time when a woman appearing with too little clothing, and exposing too much flesh, even on the television, would be frowned upon and even censored by the authorities. Today, the same is not only prevalent, but promoted and celebrated.\n\nAmnon's actions and the shame and pain it wrought on Tamar is a warning and reminder for us. Some things, once done cannot be undone. When we commit such a folly as Amnon did, there is no way of undoing it. There is no remedy for the shame and anguish it causes us, those around us and those who are its victims. Therefore, we must avoid such temptations at all costs.",
        "part6": "THOUGHT",
        "part7": "Every action has consequences. Think before you act. \"I counsel thee to keep the king's commandment, and that in regard of the oath of God. Be not hasty to go out of his sight: stand not in an evil thing\" [Ecclesiastes 8:2-3a].",
        "part8": [
            "DEUTERONOMY 20",
            "PSALMS 110-111"
        ]
    },
    "18 JUNE": {
        "part1": "2 Samuel 13:20, 22",
        "part2": "Absalom's hatred for Amnon",
        "part3": "VERSE 22",
        "part4": "And Absalom spake unto his brother Amnon neither good nor bad: for Absalom hated Amnon, because he had forced his sister Tamar.",
        "part5": "Filled with shame, Tamar fled to her brother Absalom's house, where he comforted her [v. 20]. There Tamar stayed, \"in solitude and sorrow, in token of her modesty and detestation of uncleanness\" (Matthew Henry). Nevertheless, we observe how Absalom kept his feelings toward his brother concealed by neither speaking good nor bad of him. Yet his hatred for Amnon was real, and he would plot his revenge for his sister.\n\nDear Christian, the Bible has much to say about vengeance. But vengeance is not for you. The apostle Paul, in writing to the Romans, said: \"Bless them which persecute you: bless and curse not.\" [Romans 12:14]. \"Recompense to no man evil for evil ... avenge not yourselves, but rather give place unto wrath: for it is written, Vengeance is Mine; I will repay, saith the Lord\" [Romans 12:17, 19]. The instruction is straightforward and clear: but it goes against every grain of human impulse and everything our natural sinful heart tells us to do, which is to avenge the wrong done against us. For Absalom, the right thing to do was to give place to God's wrath, which would surely have come to pass and allow His judgement against the wrong done to Tamar.\n\nLet us pray and ask God for grace to forgive those who have done wrong unto us, to take hatred and the desire for revenge out of our hearts and place it in His hands instead. \"Be not overcome of evil, but overcome evil with good\" [Romans 12:21].",
        "part6": "THOUGHT",
        "part7": "Better is a dinner of herbs where love is, than a stalled ox and hatred therewith. - Proverbs 15:17",
        "part8": [
            "DEUTERONOMY 21",
            "PSALMS 112-113"
        ]
    },
    "19 JUNE": {
        "part1": "2 Samuel 13:21",
        "part2": "David's inaction",
        "part3": "VERSE 21",
        "part4": "But when king David heard of all these things, he was very wroth.",
        "part5": "All these happenings did not go unnoticed by the king, and \"he was very wroth\". He heard how his daughter was violated by his son, and put out afterwards. He would have realised now how Amnon had deceived him with his feigned illness, and had gotten the king to send Tamar to his room. David also heard how Tamar now sheltered with her brother Absalom in shame, solitude and sorrow. It must have filled David with much anger and sorrow to hear all these things happening within his own family. Yet, the king did nothing to right the wrong that had been done.\n\nAs king and judge, David should have called Amnon to face the consequences of his deeds and thus alleviate Tamar's shame and sorrow and exonerate any guilt she felt. But this was not done: Amnon's crime went unpunished. David's failure left Tamar abandoned and gave Absalom motive to seek revenge against the perpetrator. David's inaction here can be likened to that of Eli, who neglected to take action against his sons for their sins in the Temple worship, thereby putting his love for them above God [1 Samuel 2:29].\n\nIt is important therefore, for those in positions of authority to do right in the eyes of the people, to stand for the oppressed and punish evil-doers. This is often not the case in our world today but as Christians, we look towards the glorious day, when our Lord Jesus Christ will return to establish His kingdom, to avenge those who have been wronged and punish the wicked.",
        "part6": "THOUGHT",
        "part7": "If thou forbear to deliver them that are drawn unto death, and those that are ready to be slain; If thou sayest, Behold, we knew it not; doth not He that pondereth the heart consider it? and He that keepeth thy soul, doth not He know it? and shall not He render to every man according to His works? - Proverbs 24:11-12",
        "part8": [
            "DEUTERONOMY 22",
            "PSALMS 114-115"
        ]
    },
    "20 JUNE": {
        "part1": "2 Samuel 13:23-27",
        "part2": "Absalom's plot",
        "part3": "VERSE 23",
        "part4": "And it came to pass after two full years, that Absalom had sheepshearers in Baal-hazor, which is beside Ephraim: and Absalom invited all the king's sons.",
        "part5": "Two years was a considerable time and David might have thought any wish for revenge would have by now subsided, but Absalom had not forgotten Amnon's dastardly act. It was sheep-shearing season and a time for celebration. Absalom was hosting a sheep-shearing festival at his house in Baal-hazor and Absalom sought his father's unwitting collaboration with his scheme just as Amnon had done [2 Samuel 13:5-7]. He first invited his father and his servants; but the king declined on account of the heavy expense which the reception of royalty would subject him. Absalom then scaled the invitation down to the king's sons to which David agreed.\n\nThe anger and ambition that brewed within Absalom led him to plot Amnon's murder. Likewise severe grudges harboured lead to hatred and murder: Cain murdered Abel, Herodias called for the head of John the Baptist, Joseph's brothers plotted his murder, the Pharisees plotted our Lord Jesus' death. Amnon was guilty by Levitical law but since their father did nothing, Absalom took matters into his own hands by determining the punishment for Amnon's sin. But we are told that \"there is a way that seemeth right unto a man, but the end thereof are the ways of death\" [Proverbs 14:12]. Later on, Absalom's insurgence against King David ended in his own death.\n\nThere is a saying that \"time heals all wounds\". This implies there is no active participation on the part of man. However, the Bible exhorts us to actively think on things that are true, honest, just, pure, lovely and of good report [Philippians 4:8]. Do not let anger consume you.",
        "part6": "THOUGHT",
        "part7": "Vengeance is Mine; I will repay, saith the Lord. - Romans 12:19b",
        "part8": [
            "DEUTERONOMY 23",
            "PSALM 116"
        ]
    },
    "21 JUNE": {
        "part1": "2 Samuel 13:28-29",
        "part2": "Murder of Amnon",
        "part3": "VERSE 28",
        "part4": "Now Absalom had commanded his servants, saying, Mark ye now when Amnon's heart is merry with wine, and when I say unto you, Smite Amnon; then kill him, fear not: have not I commanded you? be courageous, and be valiant.",
        "part5": "The narrative shifts to Baal-hazor. Absalom commanded his men to kill Amnon when he least expected it and most unable to prevent the evil. Although Amnon's sin was wicked and despicable, human life is sacred and precious.\n\nAt creation \" ... God created man in his own image\" [Genesis 1:27] and the image of God in man remains today, though not as perfect as it was at the creation. We are reminded that even fallen sinners bear God's image [Genesis 9:6; James 3:9]. This doctrine shapes Christian ethics because it teaches that all mankind has intrinsic value. We are not merely instruments that echo back praises to God in worship. We have value in the sight of God independent of social and economic factors simply because we bear His image. Unlike animals and plants which are not made in God's image, humankind was created with the capacity to have a personal relationship with God.\n\nAnd this has crucial implications on current issues such as the sanctity of human life, human rights, and bioethics. In the case of Amnon, the law prescribed that he should take Tamar as his wife [Exodus 22:16-17]. In pursuing his own agenda, Absalom took it upon himself to determine his course of action with Amnon. Absalom disregarded God's prescribed law, and ignored the wisdom of God and the sanctity of human life. Human life has transcendent value in God's eyes and must always be valued and respected as such.",
        "part6": "THOUGHT",
        "part7": "May the words of the children's song take on a deeper meaning, \"Red and yellow, black and white, they are precious in His sight.\"",
        "part8": [
            "DEUTERONOMY 24",
            "PSALMS 117-118"
        ]
    },
    "22 JUNE": {
        "part1": "2 Samuel 13:30-31",
        "part2": "David's response",
        "part3": "VERSE 31",
        "part4": "Then the king arose, and tare his garments, and lay on the earth; and all his servants stood by with their clothes rent.",
        "part5": "As soon as Amnon is dead, the narrative returns us to David's court to attend the news arriving from Absalom's house. The first report claimed that all the king's sons were dead. There were no survivors and therefore no successors to David's throne except Absalom. No parent wants to outlive their children, let alone have their children die prematurely. Although the first report was exaggerated and only Amnon was dead, David apparently still believed it to be true [v. 32] for he immediately initiated the mourning rituals for his dead sons.\n\nDavid would feel very much like Job when he learned that all of his children had been killed [Job 1:18-20]. It is like the death of his son with Bathsheba [2 Samuel 12:13-14]. It brings to our attention the deep sorrow one faces upon the loss of a loved one. It reminds us to show sympathy and compassion when our neighbour is undergoing such a sorrowful event in his life.\n\nDemonstrating compassion can be accomplished in a number of ways. It may simply be in the form of your presence. Just like David's servants [v. 31] and Job's friends [Job 2:11-13], may we be found alongside our neighbours comforting them in their time of loss. It may be through intercessory prayer with and for them. It may be expressed by means of material provisions and physical help. When we do these things, we are conformed more to the image of our Lord Jesus Who Himself looked at the sick and suffering of His time and \"was moved with compassion\" [Matthew 14:14].",
        "part6": "THOUGHT",
        "part7": "Rejoice with them that do rejoice, and weep with them that weep. - Romans 12:15",
        "part8": [
            "DEUTERONOMY 25",
            "PSALM 119:1-24"
        ]
    },
    "23 JUNE": {
        "part1": "2 Samuel 13:32-33",
        "part2": "Jonadab's double tongue",
        "part3": "VERSE 33",
        "part4": "Now therefore let not my lord the king take the thing to his heart, to think that all the king's sons are dead: for Amnon only is dead.",
        "part5": "The misinformation that all of David's sons were dead provides Jonadab an opportunity to speak, not only to rectify the earlier report, but also to persuade the king of Absalom's singular motivation. Remember that Jonadab is the same person who helped Amnon commit his vile sin. The text does not reveal how Jonadab knew Absalom's plans, perhaps it was only his theory, or perhaps he had overheard Absalom muttering threats.\n\nAlthough Jonadab was an accessory to the crime that fueled Absalom's vengeance, he took no responsibility. Instead, he used it as an opportunity to gain influence to further his own ends. Jonadab knew what Amnon had in mind with his sister, Tamar, but did nothing to stop it. It appears Jonadab knew Absalom was carrying a grudge, but he also did nothing to prevent Amnon's murder. And now he is found by David's side showing apparent sympathy in consoling him.\n\nThis reminds us to be careful of the company that we keep. Paul exhorted: \"Be not deceived: evil communications corrupt good manners\" [1 Corinthians 15:33]. We should surround ourselves with friends that care for us, not people who want to use us. Like Jonadab, Delilah deceived Samson and did not truly care for him. Keeping company with such will only lead to our destruction [Proverbs 13:20]. This proverb also encourages us to surround ourselves with wise men. Seeking out godly men and women full of biblical wisdom and morals will make one wise.",
        "part6": "PRAYER",
        "part7": "Dear God, give me discernment in choosing the company that I keep, and send me godly company that will help me grow more and more like our Lord Jesus.",
        "part8": [
            "DEUTERONOMY 26",
            "PSALM 119:25-48"
        ]
    },
    "24 JUNE": {
        "part1": "2 Samuel 13:34-36",
        "part2": "Mourning for Amnon's death",
        "part3": "VERSE 36",
        "part4": "And it came to pass, as soon as he had made an end of speaking, that, behold, the king's sons came, and lifted up their voice and wept: and the king also and all his servants wept very sore.",
        "part5": "We are presented with a sorrowful scene today. David's great shock at the false report of all his sons being murdered was replaced by heart-stopping suspense when Jonadab reported that only Amnon had been killed. The great rush of relief at the arrival of the king's grieving sons was quickly followed by the terrible certainty that Amnon had been murdered - and by no lesser than his own brother, Absalom.\n\nAs David was being rocked by the whirlwind of emotions, he may have recalled God's pronouncement that the sword would never leave his house [2 Samuel 12:10]. David may have recalled his own ill-example to his children and his murder of innocent Uriah, brought about by his base passions. The consequence? An innocent infant had died after birth. Now years later, his eldest son Amnon was dead, and his third son Absalom had fled into exile.\n\nWhen Amnon sinned grossly against his own sister, David as the head of the house was \"wroth\" but kept silent. David's passivity as a father and ruler made way for evil counsellors like Jonadab, whose words to David clearly showed that he had known for some time of Absalom's ill-intentions toward Amnon. We will see David continue to keep his silence after Absalom murdered his brother, and this would lead to even more waywardness in his household in the future.\n\nRulers and parents who show an unwise partiality in not adequately chastising evil doers only defer the day of trouble and increase its sorrows.",
        "part6": "THOUGHT",
        "part7": "Let not sin therefore reign in your mortal body, that ye should obey it in the lusts thereof. - Romans 6:12",
        "part8": [
            "DEUTERONOMY 27",
            "PSALM 119:49-72"
        ]
    },
    "25 JUNE": {
        "part1": "2 Samuel 13:37-38",
        "part2": "Absalom's flight",
        "part3": "VERSE 37",
        "part4": "But Absalom fled, and went to Talmai, the son of Ammihud, king of Geshur. And David mourned for his son every day.",
        "part5": "Absalom fled to the safety of his mother's father, the son of Ammihud, king of Geshur - a man called Talmai. There he hoped to find protection, safety, and he sought refuge for three years.\n\nDavid mourned bitterly for Amnon. But even that grief would fade with time and he once more longed for Absalom to return. As Matthew Henry expressed, \"Time wore off David's grief for Amnon, but it also wore off entirely too much of his detestation of Absalom's terrible sin\". Instead of loathing Absalom as a murderer, David now longed to find him. His longing would soon lead to Absalom being able to return home which led to a string of tragedy, rebellion, and sin.\n\nDavid's grief may reveal to us the depth of a father's love over the loss of a son and his deep regret for his own personal failures, which led the way to many family and national tragedies. Yet David's failure to exercise his duty as ruler and father to chastise Absalom may well have been the reason for Absalom's rebellion later.\n\nA father's love is not an unwise love that turns a blind eye to a child's every wrong and meets his sin only with affection. That is not the love of God. God desires that we are set apart for Him and relinquish sin. He longs not just for us to return to Him, but that we whom He has chosen before the foundation of the world, should be holy and blameless before him [Ephesians 1:4].",
        "part6": "THOUGHT",
        "part7": "For I am the Lord your God: ye shall therefore sanctify yourselves, and ye shall be holy. - Leviticus 11:44a",
        "part8": [
            "DEUTERONOMY 28",
            "PSALM 119:73-96"
        ]
    },
    "26 JUNE": {
        "part1": "2 Samuel 13:39",
        "part2": "David's response",
        "part3": "VERSE 39",
        "part4": "And the soul of king David longed to go forth unto Absalom: for he was comforted concerning Amnon, seeing he was dead.",
        "part5": "It is not difficult to put ourselves in the king's shoes. The sword had not only cut through his house [2 Samuel 12:10]; it had thrust deep into his heart. When Amnon was killed, David effectively lost two sons - one to death and another to exile.\n\nBut time heals. After three years, David had gotten over the incident. Some commentaries have pointed out that the verse could also be translated \"David ceased to go against Absalom\". The conclusion is the same - the heat of the incident had cooled - and perhaps some in the king's court might even feel that the time for reconciliation had come.\n\nIn fact, the matter was far from settled. David's lack of discipline toward his son Absalom - now the next in line to the throne - would lead to disastrous complications. It would cause David more trouble in the days to come. Absalom's unpunished transgression and unchecked pride would cause him to grow in arrogance. Even if he had continued to be in exile, he was an easy tool to be manipulated by opportunists who wished to usurp power from whoever was on the throne.\n\nHaving been king for so many years, David could have seen this impending threat, but he allowed his emotions to get the better of him. In the deepest recesses of his heart, he longed for this beloved son. As king, he was duty and morally bound to exact punishment for the murder especially of a prince, yet as a father, he was about to condone the abhorrent behaviour of his son. This marks the beginning of disaster.",
        "part6": "THOUGHT",
        "part7": "He that spareth his rod hateth his son: but he that loveth him chasteneth him betimes. - Proverbs 13:24",
        "part8": [
            "DEUTERONOMY 29",
            "PSALM 119:97-120"
        ]
    },
    "27 JUNE": {
        "part1": "2 Samuel 14:1",
        "part2": "Joab - the opportunist",
        "part3": "VERSE 1",
        "part4": "Now Joab the son of Zeruiah perceived that the king's heart was toward Absalom.",
        "part5": "In the king's court, some perhaps could perceive a reconciliation between David and his son. And though Absalom seemed to have lost David's favour, he was still after all be an heir and next in the line of succession. It would take an opportunist to seize this chance of ingratiating himself to advance his own interests. And such a person was none other than David's army commander, Joab.\n\nJoab is the ultimate example of the opportunistic pragmatist. His actions were not guided by morals or principles, but motivated by self-interest. His life history of violence and immorality was clear. In 2 Samuel 3:27, his murder of Saul's commander, Abner, under the guise of avenging his brother, had removed the greatest rival in his career path then. Though a great help to the king in their battles [1 Chronicles 11:6-9; 19:9-13], he was once also David's worst accessory to sin [2 Samuel 11].\n\nNow in the case of Absalom, getting this estranged son back for David would open many career options for him. But later when it turned out Absalom had failed (and given that Absalom trusted and made Amasa his commander - 2 Samuel 17:25), it was also Joab who would kill both Absalom [2 Samuel 18:9-15 - explicitly against David's order] and Amasa [2 Samuel 20:8-12 - conveniently in the chaos of another revolt].\n\nBy 2 Samuel 20:23, Joab was the most powerful man in Israel after David - so powerful that David was afraid to act against him and had instead beseeched his successor Solomon to kill him [1 Kings 2:5-6]. His death would be a most tragic one [1 Kings 2:28-33].",
        "part6": "THOUGHT",
        "part7": "All the ways of a man are clean in his own eyes; but the LORD weigheth the spirits. Commit thy works unto the LORD, and thy thoughts shall be established. The LORD hath made all things for Himself: yea, even the wicked for the day of evil. - Proverbs 16:2-4",
        "part8": [
            "DEUTERONOMY 30",
            "PSALM 119:121-144"
        ]
    },
    "28 JUNE": {
        "part1": "2 Samuel 14:1",
        "part2": "David's soft spot",
        "part3": "VERSE 1",
        "part4": "Now Joab the son of Zeruiah perceived that the king's heart was toward Absalom.",
        "part5": "Commentators on this verse vary widely in their reading of David's attitude towards Absalom at this point of time. Some think that \"toward\" in this verse should be translated as \"against\", as this would better account for why Joab needed to come out with a plan to convince David to recall Absalom, and also explain why David refused to meet Absalom for another two years even when the latter was back.\n\nYet we must also understand David's position. As king, David needed to show an example to his people. If he had welcomed his own son back with open arms, without any retribution whatsoever, it would make it difficult for him to judge any murder in future, especially one involving fratricide. But like most fathers, it is also \"natural\" that he has a soft spot for his son, especially one as beautiful as Absalom.\n\nWe often use \"natural\" as an excuse to condone wrongdoing. \"He shouldn't have done it, but given the situation, it is natural for him to do that.\" Granted when it comes to judging and meting out discipline, we can make room for exceptions that call for compassion, but we need to examine our motives, and be impartial. We should not allow our hearts to lead us astray - especially in the training of our children.\n\nIt is the same in our Christian walk. There may be compromises which the world deems quite \"natural\" but they may go against what God has taught. And if we acquiesce, often our deceitful heart will whisper that it is alright to close an eye to sin. In times like these, gird up our loins and stand firm. Guard our hearts and follow God's way.",
        "part6": "THOUGHT",
        "part7": "Now no chastening for the present seemeth to be joyous, but grievous: nevertheless afterward it yieldeth the peaceable fruit of righteousness unto them which are exercised thereby. - Hebrews 12:11",
        "part8": [
            "DEUTERONOMY 31",
            "PSALM 119:145-176"
        ]
    },
    "29 JUNE": {
        "part1": "2 Samuel 14:2-3",
        "part2": "Joab's plan",
        "part3": "VERSE 2",
        "part4": "And Joab sent to Tekoah, and fetched thence a wise woman, and said unto her, I pray thee, feign thyself to be a mourner, and put on now mourning apparel, and anoint not thyself with oil, but be as a woman that had a long time mourned for the dead:",
        "part5": "The king harbours a soft spot for his wayward son. Yet perhaps regarding public opinion, he did not make the call to get him back. Seeing this, the opportunist Joab grabbed this chance to ingratiate the king and perhaps also his presumptive heir. This would place him in a good political position.\n\nJoab sent for a woman in Tekoah, which was at the border of the wilderness southeast of Jerusalem. He must have heard the reputation of this cunning woman, or even used her in some of his past conspiracies. But she was someone he trusted to understand and deliver what Joab wanted done.\n\nShe would make great pretence as a mourner appealing to the king. And \"Joab put the words in her mouth\" [v. 3], telling her exactly what to say. The story spun would bring to David's mind the dilemma he himself faced, from which she would then present her remonstration.\n\nThe element of guile aside, this plan was a tactful one, which tells us of Joab's cleverness. The method of entreating the king in a gentle manner is not wrong. We could even say a similar strategy was used by prophet Nathan in confronting David with his sin [2 Samuel 12], except he had used a parable, not a lie. But it is the intention that makes all the difference. Nathan was used by God to rebuke David, whereas Joab, acting for his own interests, sought the help of a deceitful woman to manipulate David into a decision he would later regret.",
        "part6": "THOUGHT",
        "part7": "But if ye have bitter envying and strife in your hearts, glory not, and lie not against the truth. This wisdom descendeth not from above, but is earthly, sensual, devilish. For where envying and strife is, there is confusion and every evil work. - James 3:14-16",
        "part8": [
            "DEUTERONOMY 32",
            "PSALMS 120-122"
        ]
    },
    "30 JUNE": {
        "part1": "2 Samuel 14:4-7",
        "part2": "Justice versus family",
        "part3": "VERSE 4",
        "part4": "And when the woman of Tekoah spake to the king, she fell on her face to the ground, and did obeisance, and said, Help, O king.",
        "part5": "The woman of Tekoah presented her case, paying obeisance to the king. Her intention was to remonstrate, and she began with a moving expression of seeming humility and submission, pretending to seek the king's help.\n\nThe fabricated case was made to touch the heart of its hearer. She was a widow with two sons, and one slew the other. The whole family wanted the life of the murderer, according to levitical law. But this remaining son was her only support on earth, and the only son to continue the line of her husband. This then might be a case that calls for compassion and mercy.\n\nThe analogy the woman presented was apt and vivid: killing her son would \"quench my coal which is left\" [v. 7] - her flame of life was already reduced to simmering embers, and killing him would snuff it out completely.\n\nThe situation painted by the woman was not exactly that faced by David. Perhaps it was intended so David would not realise prematurely the woman's motive. But it did soften and prime his heart, suggesting to him there might be a way out of his dilemma between justice and family. All he needed then was for someone to justify his actions to recall his son, after which he hoped that no one would bring up the incident again. Granted that David would refuse to see Absalom for another two years, still they could be reconciled later. But Absalom would get away with a grievous crime, with no proper correction and no accountability.",
        "part6": "THOUGHT",
        "part7": "Foolishness is bound in the heart of a child; but the rod of correction shall drive it far from him. - Proverbs 22:15",
        "part8": [
            "DEUTERONOMY 33-34",
            "PSALMS 123-125"
        ]
    }
}