{
    "1 OCTOBER": {
        "part1": "Romans 11:25",
        "part2": "The Mystery of Israel's Blindness",
        "part3": "VERSE 25",
        "part4": "For I would not, brethren, that ye should be ignorant of this mystery, lest ye should be wise in your own conceits; that blindness in part is happened to Israel, until the fulness of the Gentiles be come in.",
        "part5": "God has chosen Israel \"to be a special people unto Himself, above all people that are upon the face of the earth\" [Deuteronomy 7:6]. To them \"were committed the oracles of God\" [Romans 3:2]. In spite of their privilege, they forsook God \"the fountain of living waters\" [Jeremiah 2:13]. Their disobedience and unbelief led to spiritual blindness and hardening of their hearts.\n\nThe mystery Paul wrote about in verse 25 was the Gospel reaching the Gentiles. The Old Testament had made it clear that Gentiles would be part of God's salvation plan [Genesis 12:1-3; Psalm 117:1; Isaiah 60:3]. But Jews could not accept that \"the Gentiles should be fellowheirs, and of the same body, and partakers of his promise in Christ by the gospel\" [Ephesians 3:6]. And by their rejecting the Gospel, they also rejected the Christ of the Gospel. They became wise in their own conceit and spiritual blindness set in.\n\nThe Jews were zealous, \"but not according to knowledge\" [Romans 10:2]. Having rejected God's righteousness, they set out to establish their own [Romans 10:3]. Their ignorance and defiance of God would lead to their destruction [Hosea 4:6].\n\nThis same danger faces the church today. There are people who sit under the faithful preaching of the Gospel; they hear God's Word taught week after week, but the Word has no lasting effect on them. God's Word to them is like a passing wind, leaving nothing but a tickling of the ears. If we are not careful, our own arrogance and defiance can also cause us to reject God and His Word, and the end result will be a hardening of our hearts to the things of God.",
        "part6": "THOUGHT",
        "part7": "Our hearts under the ministry of God's word can be like a piece of ice that melts under the sun, or like cement that hardens in its heat.",
        "part8": [
            "1 KINGS 1",
            "EPHESIANS 1"
        ]
    }
}