{
    "1 JANUARY": {
        "part1": "Romans 1:1",
        "part2": "Paul - from persecutor to preacher",
        "part3": "VERSE 1",
        "part4": "Paul, a servant of Jesus Christ, called to be an apostle, separated unto the Gospel of God.",
        "part5": "Paul affirmed that he was the author of Romans [Romans 1:1]. The personal references at the end of this letter [Romans 15] and its contents also leave no doubt this epistle came from his pen. He had come a long way from the time he was a persecutor of Christians - the people of the way [Acts 9:2] - to now a preacher of the Gospel of Christ. Before his conversion, Saul of Tarsus, as he was then called, was \"breathing out threatenings and slaughter against the disciples of the Lord, went unto the high priest, and desired of him letters to Damascus to the synagogues, that if he found any of this way, whether they were men or women, he might bring them bound unto Jerusalem\" [Acts 9:1-2]. After his conversion, Paul was willing to \"spend and be spent\" for the sake of the Gospel [2 Corinthians 12:15].\n\nPaul's conversion experience on the road to Damascus, his spiritual transformation, together with his training, were all reflected in his epistle to the Romans. He addressed this epistle to sinners - Jews and Gentiles alike. Romans is a theological discourse par excellence. As the Gospel spread beyond Judea to the uttermost part of the Roman Empire, an able apologist and polemicist was needed to defend the Christian faith. Paul was most suited for the task because of his background and training. He was a Jew, a Pharisee who sat under the tutelage of Gamaliel [Acts 22:3]. He was born in Tarsus, a thriving commercial and intellectual centre known as a \"university city\" that rivalled Athens and Alexandria in culture and learning. And Paul being born in Tarsus was exposed to the Greek classics. This is evidenced in his debates with the philosophers on Mars Hill [Acts 17:22-31].",
        "part6": "THOUGHT",
        "part7": "Paul was an instrument in his Master's hand. Think about what God will do with any man who is wholly yielded to Him.",
        "part8": [
            "EZRA 1",
            "MATTHEW 1"
        ]
    },
    "2 JANUARY": {
        "part1": "Romans 1:7",
        "part2": "The church in Rome",
        "part3": "VERSE 7",
        "part4": "To all that be in Rome, beloved of God, called to be saints: Grace to you and peace from God our Father, and the Lord Jesus Christ.",
        "part5": "Rome was the capital of the Roman Empire. It was the seat of Caesar, the centre of political power. Rome was also the place where Paul longed to go. He wrote: \"So, as much as in me is, I am ready to preach the Gospel to you that are at Rome also\" [Romans 1:15]. In the Acts of the Apostles, Luke recorded the places from where the people had gathered in Jerusalem to celebrate Pentecost. Among them were \"strangers of Rome\" [Acts 2:10]. It was also God's will that Paul would preach in Rome [Acts 23:11]. Paul was determined to go to Rome [Acts 28:14] and he did, at the expense of the Roman government.\n\nHowever, the beginnings of the church of Rome is shrouded in uncertainty. First, there is no record of its founding. The question is - did the Jews from Rome who went to Jerusalem for Pentecost, return to the capital and start the church? Second, the Bible record shows there were Christians in Rome before Paul's visit. Aquila and Priscilla were from Rome before they were expelled by imperial edict [Acts 18:2]. We can therefore infer that Paul was not the founder of the Roman church. Third, Paul wrote in Romans 15:20 that he \"strived to preach the Gospel, not where Christ was named, lest I should build upon another man's foundation\", meaning that he would not have gone to Rome if another apostle had already started a Gospel ministry there. By the time Paul arrived in Rome, there was a strong and vibrant community of believers whose \"faith is spoken of throughout the whole world\" [Romans 1:8].\n\nWhat a wonderful testimony that even without the leadership of an Apostle, the church in Rome was thriving!",
        "part6": "THOUGHT",
        "part7": "\"Ye also, as lively stones, are built up a spiritual house, an holy priesthood, to offer up spiritual sacrifices, acceptable to God by Jesus Christ\" [1 Peter 2:5]. You are a vital part of the church.",
        "part8": [
            "EZRA 2",
            "MATTHEW 2"
        ]
    },
    "3 JANUARY": {
        "part1": "Romans 1:1",
        "part2": "The theology of Romans",
        "part3": "VERSE 1",
        "part4": "Paul, a servant of Jesus Christ, called to be an apostle, separated unto the Gospel of God.",
        "part5": "Unlike his other epistles, which were written in response to problems arising in the local churches, Paul did not write this letter to address any particular issue. Paul had finished his missionary endeavours in the eastern provinces, and \"now having no more place in these parts, and having a great desire these many years to come unto you (the believers in Rome)\" [Romans 15:23], his plan was to visit Rome on his way to Spain [Romans 15:24].\n\nIn a sense, he was free to write an epistle as a statement of his theology. He was writing to ground the Roman believers in the faith because they lived in the capital city with immense potential for Gospel preaching. He was also writing to set forth the theology for a living faith. Romans is the most comprehensive statement of Christian truth. It is what the church needs to know.\n\nRomans - as one author puts it - is the epistle for every man. It is a book for the world [Romans 1:4- 2:16]; a book for the church [Romans 1:1-7]; for theologians [Romans 3:1-5:21]; for philosophers [Romans 1:1-2:16]; for believers of varying spiritual maturity [Romans 6:1-8:30; 8:12-14]; for unbelievers [Romans 1:1-2:16.]. In a nutshell, Romans is the truth needed by every person, whoever or wherever they may be.\n\nRomans is, in another sense, the church's last testament. Rome's strategic importance demanded that Paul gave the believers the essential doctrines they would need to help fulfil their potential for preaching the Lord Jesus Christ and disseminating His Gospel. When Paul was alive, all roads literally ran to and from Rome. When the Gospel is being considered, all roads of doctrine lead to Paul's epistle to the Romans.",
        "part6": "THOUGHT",
        "part7": "You cannot be saved apart from the Gospel message presented in Romans [Romans 10:17]. Read the Bible for your spiritual growth.",
        "part8": [
            "EZRA 3",
            "MATTHEW 3"
        ]
    },
    "4 JANUARY": {
        "part1": "Romans 1:1",
        "part2": "The influence and importance Of Romans",
        "part3": "VERSE 1",
        "part4": "Paul, a servant of Jesus Christ, called to be an apostle, separated unto the Gospel of God.",
        "part5": "It goes without saying that Romans occupies a prominent place in church history, which in turn attests to its importance. Here are a few examples. When we consider the 16th Century Reformation, it can be said Romans was used by God to bring about this great spiritual movement. As a Roman Catholic monk, Martin Luther struggled with understanding the statement - \"The just shall live by faith\" [Romans 1:17]. He thought that in order to live in the faith, he had to be just [or righteous]. But how could a sinner be righteous before a holy God. However, when God removed the scales from his eyes, Luther wrote: \"I grasped the truth that the righteousness of God is that righteousness whereby, through grace and sheer mercy, He justifies us by faith. Thereupon I felt myself to be reborn and to have gone through open doors into paradise. The whole of Scripture took on a new meaning, and whereas before 'the righteousness of God' had filled me with hate, now it became unto me inexpressively sweet in greater love. This passage of Paul became to me a gateway to heaven.\"\n\nAugustine was converted from his riotous life when he heard a child singing, \"Tolle, lege! Tolle, lege!\" (Take up and read! Take up and read!) He picked up the Scriptures, and by God's providence read Romans 13:13-14 - \"Let us walk honestly, as in the day; not in rioting and drunkenness ... But put ye on the Lord Jesus Christ, and make not provision for the flesh, to fulfil the lusts thereof.\" This passage changed Augustine forever.\n\nBut do not think that Romans is just for intellectuals. On the contrary, it is for everyone. For the unbeliever, you will find that Romans presents the clear way of salvation. For the believer, it sanctifies you toward Christ-likeness and deepens your awareness of God's majesty and glory.",
        "part6": "THOUGHT",
        "part7": "Read the Bible daily. Come with a humble heart to learn and be edified in your faith.",
        "part8": [
            "EZRA 4",
            "MATTHEW 4"
        ]
    },
    "5 JANUARY": {
        "part1": "Romans 1:1",
        "part2": "Servant and apostle",
        "part3": "VERSE 1",
        "part4": "Paul, a servant of Jesus Christ, called to be an apostle, separated unto the Gospel of God.",
        "part5": "Paul introduced himself as \"a servant of Jesus Christ, called to be an apostle\". The word translated \"servant\" can mean a \"minister\" - diakonos [Matthew 20:26 and 23:11]; or it can refer to a slave - doulous [Matthew 20:27]. In Romans 1:1, Paul identified himself as a slave. Slavery was common in Paul's time and he would have understood very well what it entailed when he said he was a servant of the Lord Jesus Christ.\n\nIt meant that Paul was purchased and possessed by the Lord Jesus Christ. When he was fettered by sin, the Lord loved him and bought him, and now he was the Lord's alone. It meant that he existed only for the Lord Jesus Christ. He lived only to serve Him. As a slave, Paul was completely subservient to the Lord Jesus Christ, and owed total obedience to the will of his Master.\n\nThe title \"slave of Jesus Christ\" is also a title of honour. It is the most noble calling a man can ever have. Great men in history have been called \"servants of God\" - Moses [Deuteronomy 34:5], Joshua [Joshua 24:29], David [2 Samuel 3:18; Psalm 78:70].\n\nPaul was also an apostle of God. The word \"apostle\" [apostolos] refers to a person who is sent forth. Paul added he was called to be an apostle. This means Paul was commissioned by the Lord Jesus Christ and endowed with spiritual gifts. That said, Paul was not in the Gospel ministry because he chose to be or thought he had the ability. Paul was an apostle because God had called him.\n\nWe are also endowed with spiritual gifts [1 Peter 4:10], and called to a ministry. Therefore, we are to \"walk worthy of the vocation [calling] wherewith ye are called\" [Ephesians 4:1].",
        "part6": "THOUGHT",
        "part7": "Every servant of God is called for two primary purposes - to serve, and to go forth and bear fruit.",
        "part8": [
            "EZRA 5",
            "MATTHEW 5"
        ]
    },
    "6 JANUARY": {
        "part1": "Romans 1:1",
        "part2": "Separated unto the Gospel of God",
        "part3": "VERSE 1",
        "part4": "Paul, a servant of Jesus Christ, called to be an apostle, separated unto the Gospel of God.",
        "part5": "\"Gospel\" literally means \"good spell\" - an old English word made up of \"good\" and \"spel\" (which means story or message). \"Gospel\" as we know it means \"good news\". In Greek, it is evangelion, meaning \"a message of victory\". It can refer to the sound of victory in battle. The concept of victory is seen in the words of our Lord Jesus when He quoted Isaiah, \"The Spirit of the Lord is upon me, because He hath anointed me to preach the Gospel to the poor; He hath sent me to heal the brokenhearted, to preach deliverance to the captives, and recovering of sight to the blind, to set at liberty them that are bruised\" [Luke 4:18].\n\nIn the New Testament, the Gospel refers generally to the teachings of our Lord Jesus, or more specifically, the message of victory of our Lord over sin and death, and the devil. Over time, the Gospel is taken to encapsulate all that the Lord Jesus Christ is and what He has done - His incarnation, His earthly life, His death on the cross, His resurrection, His ascension. The Gospel, then, is the proclamation of God's redemptive work through His Son Jesus Christ. The Gospel is what God has done to make our salvation possible.\n\nPaul describes the \"Gospel\" in various ways. It is \"the preaching of the cross\" [1 Corinthians 1:18]; it is \"the Gospel of your salvation\" [Ephesians 1:13], \"the power of God unto salvation\" [Romans 1:16], \"the unsearchable riches of Christ\" [Ephesians 3:8], \"the word of reconciliation\" [2 Corinthians 5:19], \"the word of faith\" [Romans 10:8], \"the word of life\" [Philippians 2:16]. In Romans 1:1, Paul qualifies it as the \"Gospel of God\" because God is the Author, His grace is the subject, and we are the blessed recipients.",
        "part6": "THOUGHT",
        "part7": "The Gospel is the message of our salvation. It is also the subject of God's mandate for us.",
        "part8": [
            "EZRA 6",
            "MATTHEW 6"
        ]
    },
    "7 JANUARY": {
        "part1": "Romans 1:1-2",
        "part2": "Separated unto the Gospel",
        "part3": "VERSES 1-2",
        "part4": "a servant of Jesus Christ, called to be an apostle, separated unto the Gospel of God, (Which He had promised afore by His prophets in the holy Scriptures)",
        "part5": "The word \"Pharisee\" is most likely derived from the Hebrew word parash, \"to separate, to set boundaries\". The word Pharisee in the Hebrew literally means \"separated one\" - one who had no linkages with anybody else, especially Gentiles. The Pharisees looked upon themselves as the ones keeping alive the true worship of God. Paul was an ardent Pharisee. He was separated from all things non-Jewish.\n\nAll that changed when our Lord Jesus stopped Saul of Tarsus on the Damascus Road. From that moment, Paul became \"a chosen vessel unto (our Lord Jesus), to bear [His] name before the Gentiles\" [Acts 9:15; Galatians 1:15]. Paul was not merely separated from the world in which he was raised, he was also \"separated unto the Gospel of God\". This means he was marked out and set apart for the preaching of the Gospel. That was his mission.\n\nWhen we consider the man, Paul was a most unlikely candidate for the Gospel work. By his own admission, he was \"a blasphemer and a persecutor\" [1 Timothy 1:13]. But he said, \"by the grace of God, I am what I am: and His grace which was bestowed upon me was not in vain\" [1 Corinthians 15:10a]. Undoubtedly, there were many social justice issues in his day that could have occupied Paul's mind - political oppression by Rome, societal inequality, slavery - to which he could devote his time and energy. However, the transformed Paul was single- minded in the work of the Gospel. The Lord Jesus Christ had so captured his heart that he wrote, \"Woe is unto me, if I preach not the Gospel!\" [1 Corinthians 9:16].\n\nLike Paul, we too are unlikely candidates for the Gospel work, but God is able to take the blunt instrument, sharpen it and use it for His glory.",
        "part6": "THOUGHT",
        "part7": "God not only called Paul unto salvation, but He also separated Paul unto service. Are you separated unto God to serve Him?",
        "part8": [
            "EZRA 7",
            "MATTHEW 7"
        ]
    },
    "8 JANUARY": {
        "part1": "Romans 1:3",
        "part2": "God's Son, the Seed of David",
        "part3": "VERSE 3",
        "part4": "Concerning His Son Jesus Christ our Lord, which was made of the seed of David according to the flesh.",
        "part5": "What is the Gospel? The Gospel is centred on the Person of the Lord Jesus Christ. It is the good news of salvation. It is of divine origin, not invented by man. It came to us by revelation \"...the Gospel of God, which He had promised afore by His prophets in the Holy Scriptures\" [v. 1b-2]. The Gospel is not something new. Following the fall of man, God said to the serpent, the seed of the woman shall bruise its head [Genesis 3:15b]. This is the protoevangelium (protos - \"first\" and evangelion - \"good news\" or \"Gospel\") and refers to the virgin birth of the Saviour Jesus Christ at His first advent.\n\n\"Concerning ... Jesus Christ\" tells us that the Gospel is about Him who was \"made of the seed of David according to the flesh\". The Lord Jesus was born of the virgin Mary, who conceived by the power of the Holy Spirit. The Lord Jesus had no biological father and therefore no sin nature inherited from Adam. In His flesh, He is fully man yet sinless. Yet Jesus is also fully God. Matthew's genealogy of the Lord Jesus Christ through the messianic line of David says in chapter 1, \"The book of the generation of Jesus Christ, the son of David, the son of Abraham ...\" then in verse 20, \"Joseph, thou son of David\". This means that the Lord Jesus' legal father Joseph (Mary's husband) from the line of king David [Matthew 1:16] gave the Lord Jesus the legal right to the Davidic throne as the Messiah King. THE LORD JESUS CHRIST IS GOD AND MAN SINLESS. By His perfect sacrifice for our sins He has reconciled us to God. Let us worship Him our Lord and our God.",
        "part6": "THOUGHT",
        "part7": "And the Word was made flesh, and dwelt among us, (and we beheld His glory, the glory as of the only begotten of the Father,) full of grace and truth. - John 1:14",
        "part8": [
            "EZRA 8",
            "MATTHEW 8"
        ]
    },
    "9 JANUARY": {
        "part1": "Romans 1:4",
        "part2": "Declared to be the Son",
        "part3": "VERSE 4",
        "part4": "And declared to be the Son of God with power, according to the spirit of holiness, by the resurrection from the dead:",
        "part5": "The central message of the Gospel is to declare who the Lord Jesus is. \"The Son of God ... according to the spirit of holiness\" speaks of His Deity. Even though the Lord Jesus is fully God, He came to us fully man without sin to save us from our sins \"by the resurrection from the dead\". The Lord Jesus fully satisfied the just wrath of God by offering Himself as the perfect sacrifice for our sins on the cross and rose again with power. The Gospel is the power of God to save sinners from hellfire judgment and to transform sinners to saints. Question is - are we faithful to declare the Lord Jesus Christ for who He is - the Holy Son of God?\n\nWe have the example of apostle Peter declaring the Lord Jesus Christ. When the people wanted to know how the lame man was healed, Peter gave them the Gospel. First, he debunked the false idea that the power to heal came from the apostles themselves: \"...why look ye so earnestly on us, as though by our own power or holiness we had made this man to walk?\" [Acts 3:12b]. Then Peter told them plainly about their sins - \"ye denied the Holy One and the Just, and desired a murderer to be granted unto you; And killed the Prince of life, whom God hath raised from the dead\" [Acts 3:14- 15a]. And \"Repent ye therefore, and be converted, that your sins may be blotted out ...\" [Acts 3:19a].\n\nWe declare the Christ of the Gospel for several reasons. First, it is the power of God to save sinners; second, rejecting The Lord Jesus Christ is rejecting God; third, without repentance, there is no forgiveness of sins, and finally, we must yield to the Lord to be saved and to grow in grace.",
        "part6": "THOUGHT",
        "part7": "But we preach Christ crucified ... Christ the power of God and the wisdom of God. - 1 Corinthians 1:23a, 24b",
        "part8": [
            "EZRA 9",
            "MATTHEW 9"
        ]
    },
    "10 JANUARY": {
        "part1": "Romans 1:4",
        "part2": "The risen Saviour",
        "part3": "VERSE 4",
        "part4": "And declared to be the Son of God with power, according to the Spirit of holiness, by the resurrection from the dead:",
        "part5": "If the Lord Jesus did not rise from the dead there is no hope for anyone who believes in Him. But He, the Eternal Son of God rose from the dead with power. He said, \"I lay down my life, that I might take it again. No man taketh it from me, but I lay it down of myself. I have power to lay it down, and I have power to take it again\" [John 10:17b-18a]. Jesus laid down His life for us wretched sinners in order to reconcile us to God. By His shed blood and death, He bore our sins and proved He is our Redeemer with power by RISING FROM THE DEAD. In John 11:25-26, the Lord Jesus said, \"I am the resurrection, and the life: he that believeth in Me, though he were dead, yet shall he live: And whosoever liveth and believeth in Me shall never die. Believest thou this?\"\n\nIf you say that you believe the Lord Jesus is alive today, the grave cannot keep Him, He conquered death and had victory over sin and Satan, and secured for believers eternal life, if you truly believe - How would you regard the Lord Jesus? Do you think of Him as He was here during His earthly ministry? Or do you think of Him as being resurrected from the dead? Just as He had opened the eyes of the two disciples on the Emmaus road, our risen Lord tells us where to go in order to see Him - \"And beginning at Moses and all the prophets, he expounded unto them in all the Scriptures the things concerning Himself \" [Luke 24:27]. Through the lenses of His revealed Word we meet Jesus Christ our Living Lord today! Praise Him!",
        "part6": "THOUGHT",
        "part7": "Search the Scriptures; for in them ye think ye have eternal life: and they are they which testify of Me. - John 5:39",
        "part8": [
            "EZRA 10",
            "MATTHEW 10"
        ]
    },
    "11 JANUARY": {
        "part1": "Romans 1:5",
        "part2": "Obedience to the faith",
        "part3": "VERSE 5",
        "part4": "By whom we have received grace and apostleship, for obedience to the faith among all nations, for His name.",
        "part5": "It is by God's grace that Paul and the other apostles are called to preach about the Lord Jesus Christ. The power of the Gospel to save sinners works through the obedience in faith on the part of the hearers. Faith is believing God's Word. Romans 10:17 tells us, \"So then faith cometh by hearing, and hearing by the Word of God.\" The intake of God's Word produces faith in the believing heart. This faith, however, is not alone. A person cannot say that he has faith in God but leads a life of disobedience to His Word. Genuine faith and obedience cannot be separated. We have the heroes of faith for our example. Hebrews 11:8 says, \"By faith Abraham, when he was called to go out into a place which he should after receive for an inheritance, obeyed; and he went out, not knowing whither he went.\" We read that \"he staggered not at the promise of God through unbelief; but was strong in faith, giving glory to God\" [Romans 4:20].\n\nThe purpose of preaching Christ is to build up believers in the faith through obedience of His Word. It moves us to give God the worship He deserves and to love and serve Him wholeheartedly. This is a far cry from today's charlatans who present a different Christ - one who will give you anything you want. Instead of calling sinners to the Lord Jesus Christ to obey His Word, they promise blessings of material things, enjoyment of good health, prosperity and success. And so, many \"flock\" to Him with no interest in His redemptive work, let alone obedience to His Word and bearing His cross. Genuine faith and obedience stand or fall together. Faith without obedience is dead.",
        "part6": "THOUGHT",
        "part7": "But now is made manifest, and by the Scriptures of the prophets, according to the commandment of the everlasting God, made known to all nations for the obedience of faith. - Romans 16:26",
        "part8": [
            "NEHEMIAH 1",
            "MATTHEW 11"
        ]
    },
    "12 JANUARY": {
        "part1": "Romans 1:5",
        "part2": "Worldwide vision",
        "part3": "VERSE 5",
        "part4": "By whom we have received grace and apostleship, for obedience to the faith among all nations, for His name.",
        "part5": "The apostle Paul declared it was by the Lord Jesus, the Son of God, that he and the other apostles received grace and were commissioned to preach about the Lord Jesus Christ. The Gospel message is salvation by grace through faith in the Lord Jesus Christ. The evidence of true faith is a changed life of obedience to God's Word. This good news of the Gospel is to be proclaimed among all nations; that all might have the opportunity to believe and be saved.\n\n\"Go ye into all the world, and preach the Gospel to every creature\" [Mark 16:15], is the Great Commission of our Lord to His disciples. The marching order of the early church was Acts 1:8, \"But ye shall receive power, after that the Holy Ghost is come upon you: and ye shall be witnesses unto me both in Jerusalem, and in all Judaea, and in Samaria, and unto the uttermost part of the earth.\" Since then, by God's grace, we too have received His Commission to proclaim the Gospel.\n\nWhat does it take for us to further the Gospel? We think of the love of God - how God the Father sent His only Begotten Son from heaven to earth to save us and make us true followers of Him. The Lord Jesus was the first missionary God sent to commission us to world missions so that by reaching out to the lost, the elect might be saved. There are only two kinds of people in the world - the saved and the unsaved. The late Corrie Ten Boom put it this way - \"A person is either a missionary or a mission field\". Let us do our part as faithful witnesses for the Lord while He tarries in His return.",
        "part6": "THOUGHT",
        "part7": "The Great Commission is not an option to be considered; it is a command to be obeyed. - Hudson Taylor",
        "part8": [
            "NEHEMIAH 2",
            "MATTHEW 12"
        ]
    },
    "13 JANUARY": {
        "part1": "Romans 1:6-7",
        "part2": "Called and beloved",
        "part3": "VERSE 6",
        "part4": "Among whom are ye also the called of Jesus Christ.",
        "part5": "Every true believer and disciple of the Lord Jesus Christ was first beloved and called. He was known and chosen by the infinite and eternal God before the worlds were created [Ephesians 1:4-5]. This is a great mystery impossible to comprehend with finite minds. Then in the fullness of God's timing, he was apprehended by the Gospel of saving grace through faith, called to repentance, enabled to believe, and accepted the atoning work of the Saviour for the forgiveness of his sins and confess Christ as his Lord.\n\nThis is all the work of the sovereign Creator God who in Adam, created man in His own image and in our mother's womb created us. Salvation is all God's work and nothing of ourselves. By grace are we saved through faith, not of works lest we be tempted to boast.\n\nBut what are we called to be? Saints; as blameless, pure and righteous in the eyes of God and man; as consecrated to the testimony and service of our Saviour and Lord who purchased us in love with His blood.\n\nLet us therefore offer our all as an acceptable offering to the Lord who saved and called us out of hell's darkness into heaven's glorious light. Let us serve Him in the earthly tabernacle of our bodies as His servant priests with clean hands and pure hearts, for we belong not to this world but to a holy heavenly nation as His own peculiar (purchased) people. What unimaginable favour! Amazing love! How can it be? That the Son of God should die to save a wretch like me.",
        "part6": "THOUGHT",
        "part7": "But ye are a chosen generation, a royal priesthood, an holy nation, a peculiar people; that ye should shew forth the praises of Him who hath called you out of darkness into His marvellous light. - 1 Peter 2:9",
        "part8": [
            "NEHEMIAH 3",
            "MATTHEW 13"
        ]
    },
    "14 JANUARY": {
        "part1": "Romans 1:7",
        "part2": "God's resources",
        "part3": "VERSE 7",
        "part4": "To all that be in Rome, beloved of God, called to be saints: Grace to you and peace from God our Father, and the Lord Jesus Christ.",
        "part5": "This often was Paul's greeting to those he addressed: with two superlative gifts which only the Sovereign God can bestow - grace and peace.\n\nGrace - God's unmerited favour toward guilty sinners. It is His free gift whereby man would experience God's goodness and mercies. Our salvation and our sustenance flow from God's grace. The apostle (also the murderer who became the missionary) spoke from experience. When Paul famously pleaded thrice for God to remove the \"thorn\" in his body, God instead promised His grace would abound sufficiently for him to endure the affliction, so God would be glorified. This same grace has worked to save and sustain every believer. It flows unabated to all who seek its Source; grace for grace is given [John 1:16b].\n\nPeace - the Lord Jesus is the Prince of Peace who came to this world to die for us. His blood was shed to secure our peace with God. His Spirit working in our hearts enables us to believe and appropriate God's promises and have peace. The Lord Jesus said, \"Peace I leave with you, My peace I give unto you: not as the world giveth, give I unto you. Let not your heart be troubled, neither let it be afraid.\" [John 14:27]\n\nAs God extended to redeem Israel of old, peace flowing like a river [Isaiah 66:12], so will He today grant His people the peace that transcends human understanding by keeping our hearts and minds in Christ Jesus. Be anxious about nothing, only seek His peace.\n\nChristians, God's resources are ever available. His ear is not heavy that He cannot hear our cries [Isaiah 59:1]. Our heavenly Father will supply all our needs and we will glorify Him.",
        "part6": "THOUGHT",
        "part7": "In times of testing, remember 2 Corinthians 12:9- 10; In times of turmoil, remember Philippians 4:6- 7.",
        "part8": [
            "NEHEMIAH 4",
            "MATTHEW 14"
        ]
    },
    "15 JANUARY": {
        "part1": "Romans 1:8",
        "part2": "Testimony of faith",
        "part3": "VERSE 8",
        "part4": "First, I thank my God through Jesus Christ for you all, that your faith is spoken of throughout the whole world.",
        "part5": "The faithfulness of the Roman Christians was a glowing witness for the Lord throughout the Roman empire which spanned far and wide from its centre in Rome.\n\nHow the Christian church there came to be is not known. At the time of Pentecost, there were visitors from Rome in Jerusalem, who heard the Gospel preached by Peter [Acts 2:10]. These converted visitors who returned, and other Jewish proselytes who migrated there, may have planted the church. Such was the reputation of the believers in Rome, that Paul desired to visit Rome to meet them [Acts 19:21].\n\nIt is instructive for us that no pedigree is recorded for the Roman church. Her origins were unknown, but her faith was not. That ought to be so with every church and every endeavour for our Lord. The Lord's forerunner, John the Baptist, succinctly declared, \"He must increase, but I must decrease\" [John 3:30]. And this is the humble spirit we must take to heart. The church was not started by man for his adulation, but every true church must claim without reserve the headship of the Lord Jesus Christ and fly His flag. A church does not belong to one man alone; yet everyone is an indispensable part of it. One plants, another waters but God gives the increase. Every man and woman is a steward in the service of the one true Head.\n\nLet us therefore strive for faithfulness in our service and witness as the Lord's local assembly of believers. He has called and placed us in our church so that collectively we may be torchbearers and shine brightly for Him as a city that is set on a hill.",
        "part6": "THOUGHT",
        "part7": "The light that shines farthest shines brightest nearest home. - C.T. Studd",
        "part8": [
            "NEHEMIAH 5",
            "MATTHEW 15"
        ]
    },
    "16 JANUARY": {
        "part1": "Romans 1:9a",
        "part2": "Marks of true spiritual service (1)",
        "part3": "VERSE 9a",
        "part4": "For God is my witness, whom I serve with my spirit in the Gospel of his Son ...",
        "part5": "In the eyes of Christians, Paul was the noted apostle and great missionary of the early church, but in his own eyes, he regarded himself as a slave (Gr. doulos) for His Lord and Saviour who had freed him from the bondage of Satan. So great a debt Paul felt he owed that he was willing to repay it with his life. What does a slave do if not to serve and obey his Master? And Paul would serve with body, mind and spirit in the ministry to which he had been saved for - to proclaim the Gospel of the Lord Jesus Christ to the Gentiles and to the children of Israel [Acts 9:15].\n\nA true mark of service is doing what the Master desires, not what we ourselves want. The Lord Jesus sets the example as He told the people, \"I seek not Mine own will, but the will of the Father which hath sent Me\" [John 5:30b]. This He would do even unto death for our sins.\n\nPaul would follow in his Master's footsteps as a faithful servant and disciple. He would do the will of his Heavenly Father to serve with his spirit in the Gospel of His Son. The apostle would offer his body as a living sacrifice, holy and acceptable unto God.\n\nWhat about us who have also been saved? Are we serving the Lord with zeal? Are we willing to be spent for Him who purchased our salvation? We may not be great preachers or missionaries, but we each can serve in our own little way and be His channel of blessing that others might know Him too. Did not the Lord Jesus say, \"Inasmuch as ye have done it unto one of the least of these My brethren, ye have done it unto Me\" [Matthew 25:40].",
        "part6": "THOUGHT",
        "part7": "And whosoever shall give to drink unto one of these little ones a cup of cold water only in the name of a disciple, verily I say unto you, he shall in no wise lose his reward. - Matthew 10:42",
        "part8": [
            "NEHEMIAH 6",
            "MATTHEW 16"
        ]
    },
    "17 JANUARY": {
        "part1": "Romans 1:9b",
        "part2": "Marks of true spiritual service (2)",
        "part3": "VERSE 9b",
        "part4": "... that without ceasing I make mention of you always in my prayers.",
        "part5": "\"Out of sight, out of mind\" is the popular saying of the world. This was not so with the apostle Paul. He was concerned for all the people he had ministered to in every city he travelled through on his missionary journeys. He remembered them, and was constant and consistent in praying for them. His prayer list would grow longer by the day as more churches were added, and more Jews and Gentiles converted. Some of these people he would meet only once and never again. Others he might not even have met and known personally. Yet Paul strove in prayer for them. He might not have been physically present to instruct and guide them in the Way, but still he was very much serving them in spirit, through his intercessory prayers, for their growth in grace, faith and knowledge of the Gospel, and for their perseverance in the trials they faced as followers of the Lord Jesus Christ.\n\nThe ministry of prayer is a powerful and effective weapon in the arsenal of God's people because the God we pray to is powerful. Furthermore, God the Son and God the Holy Spirit are mediating and interceding for us as our prayers soar heavenward. There may be many things we are unable to do in the Lord's service but every man and woman whether old or young, strong or weak, rich or poor, healthy or not, can pray.\n\nThe Lord Jesus said, \"Men ought always to pray, and not to faint\" [Luke 18:1]. And pray we must because that is what God desires, and what our Lord Himself did while He was on earth carrying out His redemptive service to mankind. Praying for others is another mark of true spiritual service.",
        "part6": "THOUGHT",
        "part7": "The real Lord's Prayer - The Lord's great high- priestly prayer in John 17.",
        "part8": [
            "NEHEMIAH 7",
            "MATTHEW 17"
        ]
    },
    "18 JANUARY": {
        "part1": "Romans 1:10",
        "part2": "By the will of God",
        "part3": "VERSE 10",
        "part4": "Making request, if by any means now at length I might have a prosperous journey by the will of God to come unto you.",
        "part5": "Paul, through his missionary journeys, preached the Gospel and planted churches in cities and towns throughout Asia Minor, Macedonia, Greece, the former Yugoslavia (Illyricum) and Albania [Romans 15:19]. Now that the missions work in the eastern part of the Roman Empire had ended, Paul set his sights on Rome and the West.\n\nPaul himself had never been to Rome. The church was started when the Gospel was brought to the capital by returning Roman believers who were present at Pentecost [Acts 2:10]. Believers travelling in and out of Rome would naturally bear news concerning the church. Paul would have known some of these people well. In his unceasing prayers for the Christians there, Paul prayed that in God's will, the way would be open for him to visit them. Paul now hoped that his long-cherished yearning to go to Rome [Acts 19:21; Romans 15:23] would be realized.\n\nPaul was unsure he would ever reach Rome as he could be killed by hostile Jews anytime [Romans 15:31]. He was constantly intimated by the Holy Spirit of impending perils [Acts 20:22, 23; 21:10, 11, 27]. His life was perpetually in danger. Paul's oft repeated words \"by God's will\" were not empty words. Though brilliant in intellect and strong of will, Paul was totally surrendered to God. His constant wholehearted submission to God's sovereign will had sustained him in all his trials [2 Corinthians 12:7-12]. He had complete hope and trust in God [Romans 8:28-39]. Paul's attitude was indeed Christ-like [Matthew 26:39, 42].\n\nIn all our prayers, endeavours and service for our Lord, may we, by His grace, submit ourselves wholeheartedly to His sovereign will.",
        "part6": "THOUGHT",
        "part7": "For that ye ought to say, If the Lord will, we shall live, and do this, or that. - James 4:15",
        "part8": [
            "NEHEMIAH 8",
            "MATTHEW 18"
        ]
    },
    "19 JANUARY": {
        "part1": "Romans 1:11",
        "part2": "Passion for God's people",
        "part3": "VERSE 11",
        "part4": "For I long to see you, that I may impart unto you some spiritual gift, to the end ye may be established.",
        "part5": "Paul's heart was much touched on hearing of the faith of the believers in Rome [Romans 1:18] whom he had not seen nor had they the privilege of Paul's teachings, which the other churches of Asia Minor, Macedonia, Greece and the Balkans had received. His heart burned with passion for God's people and even more with love for God who had saved him. He had a deep longing to see them. His intention of going to Rome was not to see the sights and attractions of the capital city of the Roman Empire but solely to give of himself to them.\n\nPaul's loving spirit towards God's people is best expressed in his first letter to the Thessalonians - \"But we were gentle among you, even as a nurse cherisheth her children: So being affectionately desirous of you, we were willing to have imparted unto you, not the Gospel of God only, but also our own souls, because ye were dear unto us\" [1 Thessalonians 2:7-8].\n\nThe \"gift\" Paul wanted to \"impart\" was spiritual, not physical, and had its source in the Holy Spirit. Writing to believers, he was not speaking of the free gift of salvation nor the \"charismata\" of healing, tongue-speaking and exorcism. Paul meant the spiritual benefits received from the preaching of God's Word, namely, the truths of the grace of God.\n\nThe spiritual blessings would establish the Roman believers in the most holy faith [Colossians 2:7], helping them grow in grace and knowledge of the Lord [2 Peter 3:18]. May the Lord grant us love for fellow-believers, that through the teaching, study and exhortation of God's Word, their faith too may be established.",
        "part6": "THOUGHT",
        "part7": "But speaking the truth in love, may grow up into Him in all things, which is the head, even Christ. - Ephesians 4:15",
        "part8": [
            "NEHEMIAH 9",
            "MATTHEW 19"
        ]
    },
    "20 JANUARY": {
        "part1": "Romans 1:12",
        "part2": "The mutual faith",
        "part3": "VERSE 12",
        "part4": "That is, that I may be comforted together with you by the mutual faith both of you and me.",
        "part5": "Paul assured the Romans they would not be the only ones blessed by his visit. Paul himself was blessed too. As the apostle preached and the believers came together sharing their common faith and spiritual blessings, Paul would be refreshed and invigorated in his faith. Besides being thankful, caring, submissive and loving, Paul also possessed a humble spirit. Though a man of keen intellect, a theologian and apostle extraordinaire, Paul never considered himself to be above being spiritually edified by others. Paul humbly sought strengthening from those younger in faith. John Calvin said of Paul, \"He says, too, for there is none so void of gifts in the church of Christ who cannot in some measure contribute to our spiritual progress. Ill will and pride however prevent our deriving such benefit from one another.\" Paul acknowledged that he had not attained spiritual perfection, but diligently strived for it [Philippians 3:12-14].\n\nThe apostle instructed the elders of the church not to lord over those God had put under their care but to be examples to them and \"when the chief Shepherd shall appear, ye shall receive a crown of glory that fadeth not away\" [1 Peter 5:4]. The younger and the older are to subject themselves one to another \"and be clothed with humility: for God resisteth the proud, and giveth grace to the humble\" [1 Peter 5:5].\n\nWhat great joy it is to hear from those returning from missionary trips that even as they minister to the brethren in the mission fields, they too were richly blessed themselves. May we continue to encourage one another in our mutual faith.",
        "part6": "THOUGHT",
        "part7": "Let the word of Christ dwell in you richly in all wisdom; teaching and admonishing one another in psalms and hymns and spiritual songs, singing with grace in your hearts to the Lord. - Colossians 3:16",
        "part8": [
            "NEHEMIAH 10",
            "MATTHEW 20"
        ]
    },
    "21 JANUARY": {
        "part1": "Roman 1:13",
        "part2": "My purpose, God's plan",
        "part3": "VERSE 13",
        "part4": "Now I would not have you ignorant, brethren, that oftentimes I purposed to come unto you, (but was let hitherto,) that I might have some fruit among you also, even as among other Gentiles.",
        "part5": "Paul longed to visit the brethren in Rome but circumstances had prevented it [Romans 15:22; Acts 19:21; 1 Thessalonians 2:18]. How true the saying that \"man proposes, God disposes\". His intention of visiting Rome was to see the fruit among the believers, both Romans and Gentiles whom he had ministered to. Paul's ministry had never been casual or aimless, but purposeful with holy intent. His ministry was an unending quest for spiritual fruit. Mindful of his Master's words - \"Ye have not chosen Me, but I have chosen you, and ordained you, that ye should go and bring forth fruit, and that your fruit should remain\" [John 15:16a], Paul conducted his ministry with great determination and purpose. The aim of all true ministry for God is to bear spiritual fruit in His name, through His power, and for His glory.\n\nThrough ministering God's Word and the work of the Holy Spirit, Paul hoped to see evidences of true conversion in the lives of the believers and the church - sanctified lives [Romans 6:22], holy and bearing the fruit of the Spirit [Galatians 5:22- 23], praising God continually [Hebrews 13:15] and ready to give to those in need [Philippians 4:16-17]. And as each believer grows in the faith, there would also be growth in the number of new converts. Paul would gladly report later in his letter to the Philippians that the Gospel had reached Caesar's household [Philippians 4:22].\n\nMay the Lord continue to sanctify our lives as we abide in Him and enable us to bear much fruit to the glory of His Name.",
        "part6": "THOUGHT",
        "part7": "I am the vine, ye are the branches: He that abideth in Me, and I in him, the same bringeth forth much fruit: for without Me ye can do nothing. - John 15:5",
        "part8": [
            "NEHEMIAH 11",
            "MATTHEW 21"
        ]
    },
    "22 JANUARY": {
        "part1": "Romans 1:14",
        "part2": "I am a debtor",
        "part3": "VERSE 14",
        "part4": "I am debtor both to the Greeks, and to the Barbarians; both to the wise, and to the unwise.",
        "part5": "Suppose you are desperate, hungry and wet. Your pockets are empty. Someone comes along, brings you to a warm, cosy place and provides you with a meal. You will feel greatly indebted to this person for his kindness.\n\nGod informs us that the penalty of sin is death. Sadly, both you and I are sinners. Everyone dies and the final destination is hell where there is burning and torment. How much are you willing to pay to go to Heaven in order to escape hell? God has provided a way to Heaven. There is no way to get to Heaven by our own efforts, but the Lord Jesus died for us and took the punishment for our sins. The offer to enter Heaven is free for everyone, because the Lord Jesus willingly paid the price for us through His death.\n\nThe penalty of sin is death and eternal damnation. But God loves us so much He sent His Son, our Lord Jesus Christ to atone for our sins. God also gives us life and supplies all our need. He protects us, blesses us with health, joy, peace and most of all eternal life. And He did this for no other reason than that He loves us. He desires for us to have eternal life and continual fellowship with Him in Heaven. Now that you know all the reason, I wonder what your reaction would be. Do you feel grateful for all that He has done? How much are you willing to pay for this debt of love?\n\nHere, the apostle Paul reminds us we are to reflect upon what God has done on our account. This is a debt we cannot fully repay however hard we try. Praise and thank God that our salvation is complete even though we are unable to settle this debt. Repayment by us is not a condition for a place in Heaven because the Lord Jesus has already paid it all.",
        "part6": "THOUGHT",
        "part7": "For ye are bought with a price: therefore glorify God in your body, and in your spirit, which are God's. - 1 Corinthians 6:20",
        "part8": [
            "NEHEMIAH 12",
            "MATTHEW 22"
        ]
    },
    "23 JANUARY": {
        "part1": "Romans 1:14",
        "part2": "Gospel obligations",
        "part3": "VERSE 14",
        "part4": "I am debtor both to the Greeks, and to the Barbarians; both to the wise, and to the unwise.",
        "part5": "Now that we know God paid for our sins and we are indebted to Him, we need to look at our obligations. Oftentimes we share our experiences with others. It can be a place we visited, a restaurant with nice food, a good recipe or any other subject. We hope that the listeners will pay attention so that they can avoid the unpleasant pitfalls we had experienced.\n\nBefore we became Christians, we had no joy and peace in our hearts, and we were afraid to die. We were fearful of death because of the deep dark hole awaiting us. We had no idea where we were headed. Then we heard the Gospel and accepted the Lord Jesus as our Saviour. Now we have joy and peace of mind, and death no longer has a hold on us.\n\nIn difficult times, we know we can \"unload\" our cares and worries to God in prayer. We have the assurance that God is in control of every situation. We cannot hide this blessing bestowed upon us. Would we not like to share it with our family members, relatives and friends? We should be telling others that the Lord Jesus saves.\n\n\"No man, when he hath lighted a candle, covereth it with a vessel, or putteth it under a bed; but setteth it on a candlestick, that they which enter in may see the light\" [Luke 8:16]. This is to say we are to share the light of the candle so that the others can find their path in the darkness.",
        "part6": "THOUGHT",
        "part7": "Go ye therefore, and teach all nations, baptizing them in the name of the Father, and of the Son, and of the Holy Ghost. - Matthew 28:19",
        "part8": [
            "NEHEMIAH 13",
            "MATTHEW 23"
        ]
    },
    "24 JANUARY": {
        "part1": "Romans 1:15",
        "part2": "I am ready",
        "part3": "VERSE 15",
        "part4": "So, as much as in me is, I am ready to preach the Gospel to you that are at Rome also.",
        "part5": "Two important items we pray for in our missions are: first, that people will respond to the preaching of the Gospel, and second, for more workers to be sent into the harvest fields. Have you considered being a messenger or a co-labourer in the mission field? The field is not necessarily overseas. It can be your own neighbourhood. However, the first decision to serve God is from the heart. This first step is the most difficult. God requires a willing heart more than anything else. This is the starting point. Once we commit to serve God, we must equip ourselves through training. We must count it a joy and honour to spend time in preparation and service. There will be many challenges, but God will enable us to do our heart's desire.\n\nGod blesses each person with different gifts so we can serve Him differently. We are like players in an orchestra. There are many avenues for service. No desire to serve is too small. Having then gifts differing according to the grace that is given to us [Romans 12:6], let us use them.\n\nGod called Moses to lead the Israelites out of Egypt. He bargained with God that he was not a good speaker. And God provided a mouthpiece through his brother Aaron. Later we see that Moses was able to command the masses on the journey to the Promised Land. Jonah was unwilling to preach in Nineveh. God had to make life unpleasant for him. Then Jonah went, preaching only a simple message but many came to repentance as a result of his warning.\n\nDo not hesitate but pray for a desire to serve God. He will honour and give you a suitable place and role.",
        "part6": "THOUGHT",
        "part7": "Also I heard the voice of the Lord, saying, Whom shall I send, and who will go for us? Then said I, Here am I; send me. - Isaiah 6:8",
        "part8": [
            "ESTHER 1",
            "MATTHEW 24"
        ]
    },
    "25 JANUARY": {
        "part1": "Romans 1:16",
        "part2": "I am not ashamed",
        "part3": "VERSE 16",
        "part4": "For I am not ashamed of the Gospel of Christ: for it is the power of God unto salvation to every one that believeth; to the Jew first, and also to the Greek.",
        "part5": "\"I am not ashamed of the Gospel\" [Romans 1:16]. If you have been a Christian for a while, you would have heard sermons extolling the Gospel in the grandest terms, which begs the question why anyone - much less an apostle - should declare that he is not ashamed of the Gospel. What is there in the Gospel that one could be ashamed of ?\n\nThe Christians in Paul's day were despised by society. To the Romans, Christians were no better than atheists; to the Greeks, they were foolish; and to Jews, the Christian faith was a stumbling block of offence. There was a united front against the followers of the Lord Jesus Christ. Believers were targets for persecution. Paul said he was \"made a spectacle unto the world ... despised ... made as the filth of the world, and are the offscouring of all things\" [1 Corinthians 4:9-13].\n\nIs the situation any better in our day? The answer is ostensibly no! In fact, the movement against the Christian faith is becoming increasingly militant and radical. In a world where religious tolerance is a right, it seems there is increasing intolerance against the Christian faith. The response from some Christians is to closet their faith, put the light under a bushel, remove our confession for the Lord Jesus Christ from the public domain.\n\nTo be sure, there were believers in Paul's day who were tempted to be ashamed. Timothy could be one, which is why Paul wrote to encourage him, \"Be not thou therefore ashamed of the testimony of our Lord, nor of me his prisoner\" [2 Timothy 1:8]. The chief reason to stand up and be counted, to wear the world's ostracism as a badge of honour, is because the Gospel is the power of God unto salvation.",
        "part6": "THOUGHT",
        "part7": "If you have never been ashamed of the Gospel, it could be that you have not clearly understood the meaning of the Christian message.",
        "part8": [
            "ESTHER 2",
            "MATTHEW 25"
        ]
    },
    "26 JANUARY": {
        "part1": "Romans 1:16",
        "part2": "The power of the Gospel",
        "part3": "VERSE 16",
        "part4": "For I am not ashamed of the Gospel of Christ: for it is the power of God unto salvation to every one that believeth; to the Jew first, and also to the Greek.",
        "part5": "There are several reasons Paul is not ashamed of the Gospel. First, the Gospel is \"good news\". Second, the Gospel is not just any good news; it is good news concerning our eternal destiny. The Gospel is the good news of salvation. We are sinners by nature and deed. Left to ourselves, we are condemned. Our future is worse than bleak. But God sent His only begotten Son to deliver us from our sins. Third, the Gospel is powerful good news. Paul wrote: \"For the scripture saith, Whosoever believeth on Him shall not be ashamed ... For whosoever shall call upon the name of the Lord shall be saved\" [Romans 10:11-13]. That is the efficacy of the Gospel. What God has promised and what Scriptures has stated, will be so.\n\nWe must take note that Paul is not saying the Gospel is the source of power that sinners can employ to save themselves. No! That can never be; rather Paul is saying that the Gospel itself is that power that saves. The Gospel is that means by which God accomplishes our salvation.\n\nTo the 21st century person who is raised on and so accustomed to popular modes of communication, the \"old-school\" method of preaching the Gospel is deemed dated and ineffective. The world at large cannot imagine sitting and listening to an hour-long sermon about sin and salvation. Many would consider this a waste of time. However, the preaching of the Gospel is precisely the means God uses. Paul writes that \"it pleased God by the foolishness of preaching to save them that believe\" [1 Corinthians 1:21b]. John Calvin maintains that it is in the preaching of the Gospel by \"word of mouth\" that the power of God's salvation is manifested.",
        "part6": "THOUGHT",
        "part7": "The preaching of the Gospel does not involve gimmicks and stunts, just plain preaching in the power of the Holy Spirit.",
        "part8": [
            "ESTHER 3",
            "MATTHEW 26"
        ]
    },
    "27 JANUARY": {
        "part1": "Romans 1:16",
        "part2": "The history of the Gospel",
        "part3": "VERSE 16",
        "part4": "For I am not ashamed of the Gospel of Christ: for it is the power of God unto salvation to every one that believeth; to the Jew first, and also to the Greek.",
        "part5": "The last part of verse 16 seems to imply that preference is given to Jews over Gentiles. There are some who comment that Paul, being a Jew, is revealing his ethnic prejudice. This cannot be further from the truth. What he says in Romans 1:16 is no different from what our Lord said to the Samaritan woman that \"salvation is of the Jews\" [John 4:22].\n\nThe phrase - \"to the Jew first, and also to the Greek\" - alludes to the systematic and chronological presentation of the Gospel. In the revelation of the Gospel, the Jewish people played a key role. Paul writes that to the Jews were \"committed the oracles of God\" [Romans 3:2], that our Lord Jesus was of Jewish descent and \"made under the law\" [Galatians 4:4; Romans 9:3-5]. The one who believes the Gospel and is saved must also accept the ethnic origin of our Saviour and the historical foundation of the Gospel.\n\nThe Gospel \"to the Jew first, and also to the Greek\" does not mean Jews are preferred over Gentiles. The word \"also\" clearly indicates that the Gospel is for the Jew, and \"also\" for the Gentile. The Gospel is for every believing and repentant sinner regardless of ethnicity and status.\n\nThe reason for the non-discriminatory offer of the Gospel is because \"it is the power of God unto salvation,\" and God is no respecter of persons. Our Lord Jesus says, \"whosoever believeth in Him should not perish, but have everlasting life\" [John 3:16], Peter says, \"whosoever shall call on the name of the Lord shall be saved\" [Acts 2:21; Romans 10:13]. The Holy Spirit also makes this invitation, \"Come. And let him that is athirst come. And whosoever will, let him take the water of life freely.\" [Revelation 22:17b]",
        "part6": "THOUGHT",
        "part7": "The Gospel of salvation is for the moral and self- righteous person as well as the vilest and the most desperate sinner.",
        "part8": [
            "ESTHER 4",
            "MATTHEW 27"
        ]
    },
    "28 JANUARY": {
        "part1": "Romans 1:17",
        "part2": "From faith to faith",
        "part3": "VERSE 17",
        "part4": "For therein is the righteousness of God revealed from faith to faith: as it is written, The just shall live by faith.",
        "part5": "In the Gospel is revealed \"the righteousness of God\". Biblical righteousness is different from the Greek philosophy of virtue and also the Jewish concept of righteousness that is merited by keeping the Law. \"Righteousness\" as used in the Scriptures applies to both man and God.\n\nIn reference to man, the works of righteousness [Ephesians 2:10] are to be understood as responses to God's forgiving grace and not as a means to attain His favour. It is an imputed righteousness in the Lord Jesus Christ, to be understood as a relationship to be desired [Matthew 5:6] and sought after [Matthew 6:33], although it is a gift of God which cannot be earned. This irked the Jews because they thought they could attain righteousness by keeping the law.\n\nIn reference to the righteousness of God, it has two aspects - His righteous judgment [Acts 17:31] as well as His justifying grace. God's righteous judgment is expressed in His abhorrence of sin and His wrath against sinners. However, God the Father \"hath made [His Son] to be sin for us, who knew no sin; that we might be made the righteousness of God in Him\" [2 Corinthians 5:21]. God's righteousness is also expressed in the substitutionary death of the Lord Jesus Christ on behalf of guilty sinners. The Lord Jesus did for us what no sinner can do, which is to keep the Law perfectly. He accomplished what the Law could not do, which is to make sinners righteous.\n\nThe righteousness of God imputed upon the sinner by faith means that God's justifying grace is opposed to His judgment. The blessed truth in all this is that - the righteousness of God is now on man's side, and we are able to stand in the presence of God because we stand in the confidence of what the Lord Jesus has given us - His righteousness.",
        "part6": "THOUGHT",
        "part7": "Having been freed from sin is to become \"servants to God\" [Romans 6:22] and \"servants of righteousness\" [Romans 6:18].",
        "part8": [
            "ESTHER 5",
            "MATTHEW 28"
        ]
    },
    "29 JANUARY": {
        "part1": "Romans 1:17",
        "part2": "The just shall live by faith",
        "part3": "VERSE 17",
        "part4": "For therein is the righteousness of God revealed from faith to faith: as it is written, The just shall live by faith.",
        "part5": "Paul adds that \"the righteousness of God revealed from faith to faith\" [Romans 1:17]. We can make several observations from this phrase. First, the Gospel is a matter of faith from start to finish. We often speak of having faith in God because sinners are saved by grace through faith in God and the atoning work of our Lord Jesus Christ. Second, this is the righteousness of God in that it meets all the demands of His justice. It is a \"God-righteousness\" because God is the source of it. Third, this God-righteousness must proceed from God, meaning this faith is not a human work, whether physical [the actual keeping of the Law or doing good works] or intellectual [the work of believing or having faith].\n\nThere are several interpretations to this phrase - \"faith to faith\". Some take it to mean that the righteousness of God is entirely of faith from the very beginning to the end - sola fide. Others take it to denote a comparison between the faith of the Old and the New Testaments. John Calvin offers a third view. He says the expression is used to describe the offer of the Gospel from the time it was revealed and received by believers by faith [that is, salvation], to its work in progress, \"so the righteousness of God increases\" [that is, sanctification]. Regardless, faith is the key to the righteousness of God, and it is \"revealed from faith to faith\" in the sense that God not only imputes the righteousness upon us through faith, He also \"bears savingly upon everyone who believes\" (John Murray). \"From faith ...\" focuses on our salvation by faith, and \"... to faith\" emphasizes God's sustenance of the faith that saves us. Thus, believers will never be without faith and the justifying righteousness of God.",
        "part6": "THOUGHT",
        "part7": "Not the labours of my hands, can fulfil thy law's demands; Could my zeal no languor know, could my tears forever flow, all for sin could not atone; Thou must save, and Thou alone. - Rock of Ages",
        "part8": [
            "ESTHER 6",
            "MARK 1"
        ]
    },
    "30 JANUARY": {
        "part1": "Romans 1:17",
        "part2": "Luther's Gospel",
        "part3": "VERSE 17",
        "part4": "For therein is the righteousness of God revealed from faith to faith: as it is written, The just shall live by faith.",
        "part5": "Romans 1:17 [quotation from Habakkuk 2:3] is considered one of the great texts of the Bible, and regarded by many to be the text that transformed the life of the 16th Century Reformer, Martin Luther. As an Augustinian monk, Luther struggled with this text. He read it as \"only those who are justified can live in faith\". And that drove him to adopt extreme means to justify himself - self-deprivation, self-flagellation and so on. But the thought that haunted Luther was how could his works - polluted at the very source - please the holy God.\n\nLuther was finally delivered from his torments, not within the cloistered walls of the monastery, but within the pages of Holy Scripture. By the grace of God, when the Holy Spirit opened Luther's spiritual eyes to see that in keeping his monastic vows, he was really living in fear and not in faith. He realised God had saved him [he was made just] not by what he did but what the Lord Jesus Christ had done and accomplished for him, namely the righteousness of God. Romans 1:17 reveals how a sinner can be a recipient of that Christ-righteousness. Luther describes the verse as \"the master of all doctrines ... the chief article from which all our other doctrines have flowed\" - the foundation of Reformed doctrine.\n\n\"The just shall live by faith\" not only liberates Luther and us from human works but it also becomes the mighty fortress that guarantees our salvation. Upon that truth, we are justified and made righteous; we can stand sinless before God; we can be assured of eternal life; we are freed from the frustration of trying to earn our way to heaven. All you need to do is to believe. Do you?",
        "part6": "THOUGHT",
        "part7": "The true church of God is built upon, preserved and kept strong by her adherence to Romans 1:17.",
        "part8": [
            "ESTHER 7",
            "MARK 2"
        ]
    },
    "31 JANUARY": {
        "part1": "Romans 1:18",
        "part2": "The wrath of God",
        "part3": "VERSE 18",
        "part4": "For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men, who hold the truth in unrighteousness;",
        "part5": "God's wrath is unlike the irrational outbursts of uncontrolled anger that we are prone to display. It is God's deep, intense indignation against sin which stems from His unchanging, perfect hatred for evil.\n\nSome Christians find the notion of God's wrath to be a stumbling block because they think it goes against His attributes of love and mercy. However, wrath is as much an attribute of God as holiness, righteousness and justice. God cannot tolerate sin, and wrath is the only just response He can have towards unrighteousness. The Old Testament is full of examples of God's wrath poured out against sin. In the New Testament, God's wrath was on full display when our Lord Jesus took upon Himself the sins of all mankind and was crucified on Calvary's cross. He bore our punishment and died for us so we can have forgiveness of sins and salvation.\n\nOur sins and rebellion against God deserve nothing but the penalty of death. That is the only fitting response from the holy and righteous God. We should have deserved His wrath, but God loved us so much that He sent us His only begotten Son, our Lord Jesus, to die in our place. God loves us as much as He hates sin. Only the sacrifice of the sinless Lamb of God could appease the wrath of God and atone for our sins. Truly, we can only fathom the magnitude of God's love, grace and mercy to us when we recognise the severity of His wrath against sin.",
        "part6": "THOUGHT",
        "part7": "He that believeth on the Son hath everlasting life: and he that believeth not the Son shall not see life; but the wrath of God abideth on him. - John 3:36",
        "part8": [
            "ESTHER 8",
            "MARK 3"
        ]
    }
}