{
    "1 APRIL": {
        "part1": "Romans 2:14",
        "part2": "Sinners Apart from the Law",
        "part3": "VERSE 14",
        "part4": "For when the Gentiles, which have not the law, do by nature the things contained in the law, these, having not the law, are a law unto themselves.",
        "part5": "One of the most common excuses that unbelievers put forth in rejecting the Gospel is - \"What about the heathen living in some dark part of the jungle who has never heard the good news? How can it be fair that he is condemned for not believing someone whom he has never heard of?\" Another objection is that the heathen has not been given the law. The argument goes - how can one be guilty of a law of which he is not informed. The Jews lived under the Law. The Gentiles, on the other hand, lived apart from the Law.\n\nPaul's answer is that although the Gentiles do not have the Law, they \"do by nature the things contained in the law\". This is what some theologians call the \"law of nature\" or the \"moral law\". Just as creation - natural revelation - is sufficient to condemn sinners for failing to worship the Creator God, so the sinner is justifiably condemned for failing to obey the moral law. The heathen may not have been given the Law of God, but they have a \"law unto themselves\" which is enough to condemn them. This is the moral argument for the existence of God. If such a moral code did not exist, there would be no need for such objections.\n\nSociety in general recognizes that there are behaviours which are acceptable and those which are not. When an unbeliever accuses another unbeliever of wrongdoing, he is appealing to some standard of right and wrong that is expected of every person in that society. The accused on the other hand tries to justify his deed by some excuse that grants him exemption from that standard. There would be no need for excuses if there is no universal moral code. The point is that both the accuser and the accused agree they have a \"law unto themselves.\"",
        "part6": "THOUGHT",
        "part7": "God is a God of order not just in creation but also in our morality. The person who rejects the Law of God is enslaved to sin.",
        "part8": [
            "SONG OF SOLOMON 5",
            "PROVERBS 1"
        ]
    },
    "2 APRIL": {
        "part1": "Romans 2:14",
        "part2": "The Law of Nature",
        "part3": "VERSE 14",
        "part4": "For when the Gentiles, which have not the law, do by nature the things contained in the law, these, having not the law, are a law unto themselves.",
        "part5": "The law of nature is often taken to refer to the laws that govern physical nature, such as the law of gravity or Newton's laws of thermodynamics. When Paul says Gentiles \"do by nature the things contained in the law\", he was referring to the \"law of human nature\". Just as the law of physical nature governs the operations of the natural world around us, the law of human nature governs the moral operations of man. There is, however, one difference. A person cannot choose to defy the physical laws of nature without immediate repercussions. He cannot reject the law of gravity, walk off the top of a tall building and not expect to fall to his death. But a man can choose to defy the law of human nature.\n\nWhat about the insane person? The fact some people are classified as insane means there is a standard of behaviour that is recognized as sane. And while we excuse the insane person who has committed a crime, we do not excuse the sane. The rest of society, who are sane, are expected to adhere to a particular moral standard.\n\nWhat about the people who live in a different culture - the old Indian custom of suttee in which a wife immolates herself on the funeral pyre of her dead husband, or cannibalism that was the practice of some early tribes? It must be pointed out that these and other inhumane acts are the more blatant examples of human depravity, recognized almost universally as dastardly and wrong.\n\nThe point still is that there is a law of human nature universally recognized by the world at large.",
        "part6": "THOUGHT",
        "part7": "But for the grace of God and the restraint of the Holy Spirit [2 Thessalonians 2:7], there is no telling the depth to which human depravity will drive us.",
        "part8": [
            "SONG OF SOLOMON 6",
            "PROVERBS 2"
        ]
    },
    "3 APRIL": {
        "part1": "Romans 2:15",
        "part2": "The Law of Conscience",
        "part3": "VERSE 15",
        "part4": "Which shew the work of the law written in their hearts, their conscience also bearing witness, and their thoughts the mean while accusing or else excusing one another.",
        "part5": "The law of nature is quite different from \"conscience\". The law of nature points to an objective standard recognized by all; whereas \"conscience\" is a person's moral sense of right and wrong, which serves as a guide to one's moral behaviour and choices. Conscience used in a legal context can refer to witnesses who share the same testimony; it can also denote an inner consciousness that has moral implications - the judgment of one's mind with regards to right and wrong.\n\nIn today's verse, Paul uses the word \"conscience\" in the former context, as an independent witness within an individual, which examines and passes judgment on his/her own conduct. Paul's point here is that a man's conscience bears witness to his deeds. If his deeds do not violate his conscience, he is at peace; if they do, he will be in a state of internal turmoil. This means every man approves or condemns his own acts, and thus pronounces judgment on his own moral character. This exercise of moral self-judgment implies that man has a knowledge of God's law.\n\nWhile it is true the believer's conscience is guided and enlightened by the Holy Spirit [Romans 9:1], it is also true that because of sin, man's conscience is warped, defiled [1 Corinthians 8:7; Titus 1:15], wounded [1 Corinthians 8:12] and seared [1 Timothy 4:2]. It means that our mistaken conscience can excuse our misdeeds when we should be condemned, or torment us mercilessly when such is uncalled for. Thus, in the day of reckoning when we come before the all-seeing God, our best hope is not to rely on our conscience. The best and only hope is our total reliance on the atoning work of our Lord Jesus.",
        "part6": "THOUGHT",
        "part7": "You should not believe your conscience and your feelings more than the Word which the Lord who receives sinners preaches to you. - Martin Luther",
        "part8": [
            "SONG OF SOLOMON 7",
            "PROVERBS 3"
        ]
    },
    "4 APRIL": {
        "part1": "Romans 2:15",
        "part2": "The Law Written in the Heart",
        "part3": "VERSE 15",
        "part4": "Which shew the work of the law written in their hearts, their conscience also bearing witness, and their thoughts the mean while accusing or else excusing one another.",
        "part5": "The law that is written in the heart denotes a sense of right and wrong that is inherent in every person. Albert Barnes writes that the law imprinted on our hearts is the means by which we \"distinguish between what is just and unjust, between what is honest and dishonest.\" The heart- imprinted law does not mean we will definitely seek and diligently pursue the law of God; it simply means that we cannot ignore the law. And man has this knowledge of the moral law well before it was formally written on tables of stone.\n\nThis Law was first written in the heart of Adam. It was obscured but not obliterated by his fall. That is why when God confronted Cain for the murder of his brother Abel [Genesis 4:10], Cain knew himself he had committed a dastardly crime even though the Ten Commandments was not yet given. The reason - the law was written in his heart.\n\nWhile the Gentiles did not have this Law given to them as had the Jews; nevertheless, they possessed knowledge of the law by the light of nature; that knowledge was deeply impressed on their minds which in turn was reflected in their conduct. The moral law would later be written on tables of stone [see Exodus 24:12; 31:18; 34:1; etc.]. But that did nothing to draw the people close to the Giver of the Law. On the contrary, the law exposed their sin and waywardness, and drove them away from the holy God.\n\nIt is only in regeneration that the law which exposes man's sinfulness is reinscribed on the hearts of God's people and works for our sanctification. And while we are not saved by the keeping of it, we are bound to order our lives by it for our good and for God's glory.",
        "part6": "THOUGHT",
        "part7": "Forasmuch as ye are manifestly declared to be the epistle of Christ ministered by us, written not with ink, but with the Spirit of the living God; not in tables of stone, but in fleshy tables of the heart. - 2 Corinthians 3:3.",
        "part8": [
            "SONG OF SOLOMON 8",
            "PROVERBS 4"
        ]
    },
    "5 APRIL": {
        "part1": "Romans 2:15",
        "part2": "Accusations and Excuses",
        "part3": "VERSE 15",
        "part4": "Which shew the work of the law written in their hearts, their conscience also bearing witness, and their thoughts the mean while accusing or else excusing one another.",
        "part5": "God gave to the Jews through Moses, the law inscribed on tables of stone. The Jews were privileged in that \"unto them were committed the oracles of God\" [Romans 3:2]. The Psalmist also made this distinction. God \"sheweth His word unto Jacob, His statutes and His judgments unto Israel. He hath not dealt so with any nation (i.e. Gentiles): And as for His judgments, they have not known them\" [Psalm 147:19-20].\n\nWhile Gentiles were not given the inscribed law to govern their lives, they nevertheless, \"shew the work of the law\" - meaning they demonstrated in their daily lives and interactions that they were morally conscious. They were governed by a moral code. This moral code under which the Gentiles lived might not be the same in letter to the law of Moses, but it was not contrary to the Mosaic law. It was this moral code imprinted on their hearts which would be the grounds for the Gentiles to accuse or excuse one another.\n\nThe fact that in the absence of an inscribed law, we can still pass moral judgments on the actions of another person in accusing him or vindicating him points to the innate and indestructible moral nature - the work of the law of God in our hearts.\n\nGod, in His mercy, has not made us indifferent to morality and ethics, right and wrong, truth and falsehood. That is the common grace that He gives His creatures so that we, being evil, \"know how to give good gifts unto (our) children\" [Luke 11:13]. But to believers, our heavenly Father has further given us the Holy Spirit to direct our lives so that we need not walk in the dimness of our own conscience but in the light of His Spirit [Galatians 5:16, 25].",
        "part6": "THOUGHT",
        "part7": "If we live in the Spirit, let us also walk in the Spirit. - Galatians 5:25",
        "part8": [
            "ISAIAH 1",
            "PROVERBS 5"
        ]
    },
    "6 APRIL": {
        "part1": "Romans 2:16",
        "part2": "The All-Knowing God",
        "part3": "VERSE 16",
        "part4": "In the day when God shall judge the secrets of men by Jesus Christ according to my gospel.",
        "part5": "God is omniscient; that means He is all-knowing. This incommunicable attribute of God is both a warning as well as an encouragement to us. It is a warning in that nothing can be hidden from Him. There is nothing that is \"not manifest in his sight: but all things are naked and opened unto the eyes of him with whom we have to do\" [Hebrews 4:13]. Our Lord Jesus said that sinners \"loved darkness rather than light, because their deeds were evil\" [John 3:19], like the proverbial ostrich that buries its head in the sand. To think God does not know what we do behind closed doors is utter foolishness because \"the darkness and the light are both alike to (God)\" [Psalm 139:12].\n\nBut God's omniscience is also an encouragement because we do not go through life alone. The Emmanuel knows our mind's thoughts and our heart's desires. When you think you are left alone to deal with the hardships of life, God is with you. When you think that you have no more strength to press on, He is with you. When your heart is willing, but your flesh weak, God knows, and He is with you.\n\nIn his hymn, Frank E. Graeff asked, \"Does Jesus care when my heart is pained too deeply for mirth or song; as the burdens press, and the cares distress, and the way grows weary and long?\" His answer was emphatic - \"O yes, He cares - I know He cares! His heart is touched with my grief; when the days are weary, the long nights dreary, I know my Savior cares.\" Our Lord Jesus took on the seed of Abraham, took on human flesh with all its infirmities so that \"He is able to succour them that are tempted\" [Hebrews 2:18]. What a blessing!",
        "part6": "THOUGHT",
        "part7": "For I know the thoughts that I think toward you, saith the LORD, thoughts of peace, and not of evil, to give you an expected end. - Jeremiah 29:11",
        "part8": [
            "ISAIAH 2",
            "PROVERBS 6"
        ]
    },
    "7 APRIL": {
        "part1": "Romans 2:16",
        "part2": "The Secrets of Man",
        "part3": "VERSE 16",
        "part4": "In the day when God shall judge the secrets of men by Jesus Christ according to my gospel.",
        "part5": "David confessed: \"O LORD, thou hast searched me, and known me. Thou knowest my downsitting and mine uprising, Thou understandest my thought afar off. Thou compassest my path and my lying down, and art acquainted with all my ways. For there is not a word in my tongue, but, lo, O LORD, thou knowest it altogether\" [Psalm 139:1-4].\n\nWhen David caught sight of Bathsheba bathing herself and called for her, whatever they did in his private chambers, he thought no one knew. But he had forgotten the words of Moses that when we sin against the LORD, \"be sure your sin will find you out\" [Numbers 32:23]. Likewise, what we have done in secret will come to light one day.\n\nThe LORD not only knows what we have done, He also knows our thoughts in the deepest recesses of our hearts (read Hebrews 4:12). Our secret sins therefore are not limited to what we do, but what we think. Our Lord Jesus says that \"whosoever looketh on a woman to lust after her hath committed adultery with her already in his heart\" [Matthew 5:27-28].\n\nOur hidden motivations are also known to Him. Our Lord Jesus said of the Pharisees that they draw nigh to God with their mouth and honour Him with their lips, but their act of worship is vain because \"their heart is far from (Him)\" [Matthew 15:8-9]. So as we worship and serve God, let us come with our hearts opened, our desires known, with total transparency for He knows all things.",
        "part6": "THOUGHT",
        "part7": "Apart from the saving grace of the Lord Jesus Christ, no man can stand aright under God's perfect and penetrating knowledge.",
        "part8": [
            "ISAIAH 3",
            "PROVERBS 7"
        ]
    },
    "8 APRIL": {
        "part1": "Romans 2:16",
        "part2": "Naked before God",
        "part3": "VERSE 16",
        "part4": "In the day when God shall judge the secrets of men by Jesus Christ according to my gospel.",
        "part5": "In the Garden of Eden, after Adam and Eve had disobeyed God and ate of the fruit from the tree of the knowledge of good and evil, \"the eyes of them both were opened, and they knew that they were naked; and they sewed fig leaves together, and made themselves aprons\" [Genesis 3:7]. Before they ate the forbidden fruit, Adam and Eve were naked, but they were not ashamed because they were completely open and transparent in the presence of God and before each other. They communed freely with God and with each other because they had nothing to hide and nothing to be ashamed of.\n\nAfter they sinned, they became conscious of their nakedness and were ashamed. Their physical nakedness was simply an extension of the exposure of their act of disobedience against God. Sin drove them away from God and caused them to hide from Him. Sin also exposed their betrayal of each other as they later did when Adam tried to shift the blame to Eve and to God, and Eve to the serpent. Sin exposed their deceit so they could no longer be open with each other.\n\nThat is what sin does to us as well. We lie. We put on a facade. We pretend to be what we are not. We behave one way for six days of the week, and put on a totally different front in church on the Lord's Day. We live a duplicitous life in order to project a sense of respectability. These attempts may fool some people some of the time, but they certainly do not fool God because we are naked before Him. God sees us for what we really are, not what we project ourselves to be.",
        "part6": "THOUGHT",
        "part7": "Honesty is not only the best policy, but it is also the easiest way to live.",
        "part8": [
            "ISAIAH 4",
            "PROVERBS 8"
        ]
    },
    "9 APRIL": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 16 4:5]. We will give an account of every word that",
        "part4": "In the day when God shall judge the secrets of men by Jesus Christ according to my gospel.",
        "part5": "The \"day\" in verse 16 is inextricably linked to \"the day of wrath and revelation of the righteous judgment of God\" in verse 5. The Bible is clear that we face an impending judgment. The writer of Hebrews states that \"it is appointed unto men once to die, but after this the judgment\" [Hebrews 9:27]. This is the inescapable reality. Our deeds will come to light. The Lord \"will bring to light the hidden things of darkness\" [1 Corinthians 4:5]. We will give an account of every word that comes forth from our lips [see Matthew 12:36]. Our secret motivations will be made known as God will make manifest the counsels of our hearts.\n\nThe Judge on that day will be our Lord Jesus Christ [2 Timothy 4:1]. Paul reminds us \"we must all appear before the judgment seat of Christ; that every one may receive the things done in his body, according to that he hath done, whether it be good or bad\" [2 Corinthians 5:10; Romans 14:10; Revelation 2:23].\n\nPaul reminds us the Lord Jesus Christ \"will judge the world in righteousness\" [Acts 17:31]. We cannot plead ignorance. We cannot defend ourselves on the grounds that sin is part of human nature, and everybody is doing it. Our day in heaven's court is certain, and if we were to appear in the rags of our own righteousness, the outcome will be dreadful. The only hope for sinners to settle the matter is not to plead our case in heaven's court but to bow at Calvary's cross, for there our sins were paid in full, and we are clothed in the righteousness of the Judge.",
        "part6": "",
        "part7": "Nothing in my hand I bring, simply to the cross I cling; Naked, come to thee for dress; helpless, look to thee for grace; foul, I to the fountain fly; wash me, Savior, or I die. - Augustus Toplady",
        "part8": [
            "ISAIAH 5 Judge.",
            "PROVERBS 9",
            "THOUGHT Nothing in my hand I bring, simply to the cross I",
            "cling; Naked, come to thee for dress; helpless, look",
            "to thee for grace; foul, I to the fountain fly; wash",
            "me, Savior, or I die. -- Augustus Toplady"
        ]
    },
    "10 APRIL": {
        "part1": "Romans 2:17",
        "part2": "Advantages of Jews (1)",
        "part3": "VERSE 17",
        "part4": "Behold, thou art called a Jew, and restest in the law, and makest thy boast of God.",
        "part5": "Sin is universal, and an equal opportunity contagion. The wise preacher tells us: \"For there is not a just man upon earth, that doeth good, and sinneth not\" [Ecclesiastes 7:20]. The apostle writes: \"For all have sinned, and come short of the glory of God\" [Romans 3:23]. In the preceding chapter, Paul tells us about the condition that affects all regardless of gender, socio-economic status, education. There is no man-made vaccine against or cure for sin. Man is \"without excuse\" [Romans 1:20], not even the Gentile who has not been given the inscribed law of God. \"For as many as have sinned without law shall also perish without law: and as many as have sinned in the law shall be judged by the law\" [v. 12].\n\nIn today's verse, the Jew steps forward and claims a special immunity against sin because of his race. The Jews are the chosen people of God [Deuteronomy 7:6]. To be sure, they were privileged. They were God's covenant people. They were given the mark of circumcision. To them was committed the oracles of God [Romans 3:1-2].\n\nPaul, himself a Jew, deflated their puffed-up thinking. These advantages counted for nothing if a Jew did not have a personal relationship with God. The proud Jew can be a picture of one who grew up in a Christian home. He could be one who uses a particular Bible translation or a Fundamentalist who holds ardently to a theological persuasion and condemns others who do not share his convictions. And while he proudly wears those labels like the Jew who boasts of his circumcision, he has no personal relationship with the Lord Jesus Christ. All he can claim is: \"I am born into a Christian home. I go to this particular church. I am called a Christian.\" It is utterly foolish to base our eternal destiny on labels we put on ourselves.",
        "part6": "THOUGHT",
        "part7": "The LORD seeth not as man seeth; for man looketh on the outward appearance, but the LORD looketh on the heart. - 1 Samuel 16:7b",
        "part8": [
            "ISAIAH 6",
            "PROVERBS 10"
        ]
    },
    "11 APRIL": {
        "part1": "Romans 2:17-18",
        "part2": "Advantages of Jews (2)  VERSES 17-18 Behold, thou art called a Jeu, and restest in the law, and makest thy boast of God, and knowest his will, and approvest the things that are more excellent, being instructed out of the law.  To CompPLETE THE BIBLE",
        "part3": "",
        "part4": "Behold, thou art called a Jew, and restest in the law, and makest thy boast of God, and knowest his will, and approvest the things that are more excellent, being instructed out of the law.",
        "part5": "In verses 17 to 19, Paul lists the advantages that a Jew claims would give him special privileges. First, he is \"called a Jew\", meaning he is a child of Abraham and claims racial privilege. This is akin to a person calling himself a Christian simply because he was born and raised in a Christian home.\n\nSecond, a so-called Jew \"restest in the law\", believing that the mere possession of the law assures his salvation. This is like the church-goer who thinks carrying the right Bible translation to church means he is saved. Paul reminded us in verse 13 that \"not the hearers of the law are just before God, but the doers of the law shall be justified\". As the cliche goes, if we talk the talk, we must walk the walk, or else we deceive ourselves [James 1:22].\n\nThird, a so-called Jew \"makest thy boast of God\", bragging of his being God's favorite, the true people of God, just as a church-goer who boasts of his association with a particular preacher or church.\n\nFourth, a so-called Jew claims he is \"instructed out of the law\" and boasts that he \"knowest (God's) will, and approvest the things that are more excellent\". The word \"instructed\" is the word from which we get \"catechize\". It is good and commendable that believers have the desire to be instructed in God's Word. But Paul also warns of \"knowledge (that) puffeth up\" [1 Corinthians 8:1].\n\nOur study and understanding of Holy Scripture should make us more discerning, able to distinguish between essentials and non-essentials and focus on the things that really matter. Sound doctrine - as Paul says - should teach us to deny ungodliness and worldly lusts, and to \"live soberly, righteously, and godly, in this present world\" [Titus 2:12].",
        "part6": "THOUGHT",
        "part7": "Knowledge puffeth up, but charity edifieth. - 1 Corinthians 8:1b",
        "part8": [
            "ISAIAH 7",
            "PROVERBS 11"
        ]
    },
    "12 APRIL": {
        "part1": "Romans 2:19",
        "part2": "Confidence of Jews",
        "part3": "VERSE 19",
        "part4": "And art confident that thou thyself art a guide of the blind, a light of them which are in darkness.",
        "part5": "From the advantages which a Jew was given [v. 17- 18], he claims a superiority in knowledge above all others. He was \"confident\" of himself, meaning he was persuaded of and promoted himself as \"a guide of the blind, a light of them which are in darkness, an instructor of the foolish, a teacher of babes\" [v. 19-20]. This self-confidence hoisted him to a pedestal from which he looked down on the rest with condescension and contempt.\n\nPaul describes the Jew (religious person) as a \"guide of the blind\". Just as physical blindness prevents a man from seeing the world around him and he needs help to move around, so a spiritually blind person needs a guide to lead him along the path of righteousness. However, the guide must be reliable. Moses gives this warning: \"Cursed be he that maketh the blind to wander out of the way\" [Deuteronomy 27:18]. Paul's point is that one who is so confident of his spiritual capability must first assess whether he is a reliable guide. If the guide is just as blind as the one he is leading, \"both shall fall into the ditch\" [Matthew 15:14].\n\nPaul further describes the religious Jew as \"a light of them which are in darkness\". The LORD had set the Jews - the people of the covenant - to be \"a light of the Gentiles\" [Isaiah 42:6]. The Jews understood that role and responsibility especially after the captivity (in Babylon), when they held up the worship of the true and living God against pagan polytheism in their midst. That said, light is best when it shines brightly. Our Lord Jesus warns: \"If therefore the light that is in thee be darkness, how great is that darkness\" [Matthew 6:23]. A dim and flickering light is of hardly any good to those who are seeking truth.",
        "part6": "THOUGHT",
        "part7": "In a world of darkness, light is most essential to making your way through life. Be a light that shines brightly for our Lord Jesus Christ [Matthew 5:16].",
        "part8": [
            "ISAIAH 8",
            "PROVERBS 12"
        ]
    },
    "13 APRIL": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 20 devoid of understanding or one who is defiantly",
        "part4": "An instructor of the foolish, a teacher of babes, which hast the form of knowledge and of the truth in the law.",
        "part5": "Paul describes the self-confident Jew as one who claims to be \"an instructor of the foolish (and) a teacher of babes\". The word \"instructor\" (paideutes) has the connotation of one who possesses great knowledge. The Jews, to whom had been \"committed the oracles of God\" [Romans 3:2], had the idea they alone possessed true knowledge. The rest - Gentiles - were fools. The \"fool\" as described in Holy Scripture denotes one who is devoid of understanding or one who is defiantly wicked. The Jews deemed themselves qualified to instruct those not having such knowledge.\n\nThe Jews also saw themselves as \"a teacher of babes\". The two descriptions - instructor and teacher - have a similar idea. The nuance is that whereas the \"instructor\" deals with the \"foolish\", the teacher (didaskalos) deals with \"babes\" - proselytes who possess some truth but have not come to full maturity. It is clear from Paul's description that the Jews arrogate to themselves the position of superior knowledge, claiming their qualification as guides, instructors and teachers. But we must not miss his sarcasm. He is saying to them, \"Before you claim superior wisdom and ability, should you not begin by examining yourselves if you have the truth, and are living out that truth?\" This was the failure of the Pharisees upon whom our Lord pronounced judgment, \"Woe unto you, scribes and Pharisees, hypocrites! for ye compass sea and land to make one proselyte, and when he is made, ye make him twofold more the child of hell than yourselves\" [Matthew 23:15]. James gives a similar warning to us who are teachers, \"My brethren, be not many masters (didaskalos), knowing that we shall receive the greater condemnation\" [James 3:1].",
        "part6": "",
        "part7": "\"For Ezra had prepared his heart to seek the law of the LORD, and to do it, and to teach in Israel statutes and judgments\" [Ezra 7:10]. You must study and live the word before you teach it.",
        "part8": []
    },
    "14 APRIL": {
        "part1": "Romans 2:21",
        "part2": "The Eighth Commandment",
        "part3": "VERSE 21",
        "part4": "Thou therefore which teachest another, teachest thou not thyself ? thou that preachest a man should not steal, dost thou steal?",
        "part5": "Thus far, we see Paul establishing the culpability of both Gentile and Jews in the matter of guilt before God. Now he takes a step further to address the presumptuousness of the Jews who possessed a superiority complex because they had been given the Law of Moses. They regarded themselves to be teachers to those they deemed ignorant and inferior in standing before Jehovah. God through Moses had commanded that man should not steal [Exodus 20:15]. Every Jew worth his salt knew this in their head. But knowing and doing are not the same thing. The interactions between the Lord Jesus and the Pharisees made this abundantly clear. By their cunning and disingenuous rationalization, they masked their dishonest practice and insincerity with a veneer of outward piety. They preyed upon the widows and downtrodden with their merciless and sharp practices. They took advantage of the poor and desperate, profiting through usury and greed [Matthew 23:14]. They neglected caring for the needy and avoided the costs of Temple sacrifices with clever words and reasoning [Mark 7:11]. In short, they were guilty of breaking the very law Moses commanded and what they preached.\n\nThis is pertinent to us who are Jesus' disciples to hold His Inspired Word as our rule of faith and life. Often, we are careless and selective in applying God's Word. It is not the big things our Lord looks at, but every little act and motivation. We do not rob banks, but do we keep the wrong change? Let us not presume upon our knowledge and possession of His Word but realize that while we abide in mortal corrupted bodies, we need the Spirit's help to guard against sin, so as to keep God's Word and glorify Him.",
        "part6": "THOUGHT",
        "part7": "It is not what we say but what we do. May our practice match our profession.",
        "part8": [
            "ISAIAH 10",
            "PROVERBS 14"
        ]
    },
    "15 APRIL": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 22A and distortion of the Hebrew Scriptures had made",
        "part4": "Thou that sayest a man should not commit adultery, dost thou commit adultery?",
        "part5": "Sin is a heart matter - our own hearts. We cannot blame our circumstances or our conditioning. We cannot blame the other person or society, and we cannot blame God. Our genes did not cause us to be predisposed to some of the most egregious sins as we often hear claimed today.\n\nThe act of adultery was as common in the days of Paul as it is in ours. The influence of pagan culture and practice, and the liberal interpretation and distortion of the Hebrew Scriptures had made room for adultery to proliferate among the Jews [Matthew 19:8-9].\n\nThe Lord Jesus, who knew man's heart, confronted this head-on and shone His searchlight into its dark recesses. \"But I say unto you, That whosoever looketh on a woman to lust after her hath committed adultery with her already in his heart\" [Matthew 5:28].\n\nThe lust of the eyes and the lust of the flesh has been the downfall of presidents and pastors. We are to guard our hearts because it is deceitful and desperately wicked [Jeremiah 17:9]. James warns \"But every man is tempted, when he is drawn away of his own lust, and enticed. Then when lust hath conceived, it bringeth forth sin: and sin, when it is finished, bringeth forth death\" [James 1:14-15].\n\nWhat does this warn against? Never presume we are so strong we will not fall. Never think because our wicked deeds cannot be seen, it is alright doing as we please. Our hearts are vulnerable, and Satan attacks it constantly and unrelentingly. Let God's Word guard our hearts and minds. Resort always to the Spirit's help. He is God in us, a very present help in trouble, our refuge and strength in the day of temptation [Psalm 46:1].",
        "part6": "",
        "part7": "Keep thy heart with all diligence; for out of it are the issues of life. - Proverbs 4:23",
        "part8": []
    },
    "16 APRIL": {
        "part1": "Romans 2:22",
        "part2": "The Seventh Commandment (Il)",
        "part3": "VERSE 22B",
        "part4": "Thou that abhorrest idols, dost thou commit sacrilege?",
        "part5": "The first commandment of the Decalogue was the touchstone of every Jew. Encapsulated in the Shema [Deuteronomy 6:4-9], it became the Jewish confession of faith recited twice daily by the devout and affirmed by the Lord Jesus Christ as the first and greatest commandment [Matthew 22:36-38]. Banished from the promised land by the Assyrians and Babylonians for their departure from God in idolatry, they were cured of this problem after their return from Babylonian captivity, or at least ostensibly so. The Jews abhorred the idols of pagan worship; what then was this indictment by Paul?\n\nThey did not bow to idols outwardly, but inwardly their hearts were cold and indifferent toward God - His Son, His name, holiness, Word, His messengers. The Jews treated with disdain God's sanctity and profaned (made common) His sacred things. Worship had become a formality and ritualism. They took advantage of the Temple worship system to enrich themselves.\n\nWe also are prone to this charge. We rob God of His due. We supplant His place in our heart with the trophies of society, and the pursuit and affection of earthly things. We profess faith in Him but profane His Name and character by trusting in material riches and possessions, and withholding from Him what is due - our wholehearted devotion and love. Beware lest we are so enamoured to the spirit of the world that we long for its approval and acceptance. Doing so is spiritual idolatry.",
        "part6": "THOUGHT",
        "part7": "These Jews have a form of godliness but without power. Is 2 Timothy 3:5 a description of your condition?",
        "part8": [
            "ISAIAH 12",
            "PROVERBS 16"
        ]
    },
    "17 APRIL": {
        "part1": "Romans 2:23",
        "part2": "Boasting in the Law, Living in the Lord",
        "part3": "VERSE 23",
        "part4": "Thou that makest thy boast of the law, through breaking the law dishonourest thou God?",
        "part5": "The law was a badge of pride worn by the Jews. They boasted of it as being given by God to His chosen people. Indeed, they had many reasons to feel so. Their lineage from Abraham, Isaac and Jacob, Jehovah's exclusive covenants with their forefathers, their miraculous exodus from Egypt and return to their promised land, all pertained to them alone. But their eyes were blinkered, and their hearts hardened by presumption, faithlessness and worldliness. The form of their faith became more important to them than its substance. The letter of the Law supplanted the spirit of it. Their traditions took the place of obedience and \"made the commandment of God of none effect\" [Matthew 15:6].\n\nThis is not just a problem with the Jews. We who are born again in Christ and profess Him as Lord and Saviour are people of immeasurable privilege. We were known, chosen and redeemed by holy blood to everlasting life. We belong to an eternal kingdom as God's children, delivered from sin's condemnation and peril. We are a totally different people from the world's citizens. Yet often we live our lives as though none of these things matter. We are not thankful or trusting. We take God's Word and our profession lightly. We treat our Lord's name with indifference. Our lives honour God as little as the Jews' who in treating the Law the way they did, dishonoured our very same God.\n\nThe remedy for us is to return again, seeking Him earnestly with humble and contrite hearts. Draw nigh to God and He will draw nigh to us [James 4:8]. That is His only desire for His people.",
        "part6": "THOUGHT",
        "part7": "When our hearts are right with God everything else falls into place. \"Let us draw near with a true heart in full assurance of faith, having our hearts sprinkled from an evil conscience, and our bodies washed with pure water\" [Hebrews 10:22].",
        "part8": [
            "ISAIAH 13",
            "PROVERBS 17"
        ]
    },
    "18 APRIL": {
        "part1": "Romans 2:24",
        "part2": "Blasphemy",
        "part3": "VERSE 24",
        "part4": "For the name of God is blasphemed among the Gentiles through you, as it is written.",
        "part5": "Blasphemy may well be expected of Gentiles, heathens and unbelievers. But it is a damning accusation when those who claim the special privileges and favour of God are guilty of it. The Jews of Paul's day by their hypocrisy and deceitfulness in their practice were blaspheming Jehovah's name among their Gentile neighbours. They caused that name so sacred to them as to be unutterable, to be mocked by unbelievers.\n\nHow is our Lord God blasphemed? When His people take His name in vain by unholy living, being untruthful in their words, dishonest in their dealings, by disobedience to His commandments and distrust in His promises and power; when Christians compromise God's Word to please others; when His people profane His name, His character, His Word, His church by bringing it down to the base levels of the world and treat it as something common and ordinary if not with disdain; when reverence and fear of offending Him are replaced by casual indifference and presumptuousness.\n\nOur Lord is grieved and offended when His name is brought to shame by those who profess to represent Him. When unbelievers look at the Christian and the church, and see little difference between themselves and the Christian, we are in grave danger of what Paul was telling the Jews here.\n\nOur calling is to live in such a manner our Lord Jesus Christ is honoured, and to conduct ourselves to be blameless and without reproach in God's eyes in the midst of a crooked and perverse world.",
        "part6": "THOUGHT",
        "part7": "That ye may be blameless and harmless, the sons of God, without rebuke, in the midst of a crooked and perverse nation, among whom ye shine as lights in the world. - Philippians 2:15",
        "part8": [
            "ISAIAH 14",
            "PROVERBS 18"
        ]
    },
    "19 APRIL": {
        "part1": "Romans 2:25",
        "part2": "Circumcision Is Made Uncircumcision",
        "part3": "VERSE 25",
        "part4": "For circumcision verily profiteth, if thou keep the law: but if thou be a breaker of the law, thy circumcision is made uncircumcision.",
        "part5": "The law Paul was referring to is recorded in Genesis 17:10-11. God commanded every Hebrew male to be circumcised as a sign of His special covenant with them. However, during Paul's time, the Jews had twisted this sacrament of circumcision into a confirmation of their salvation and the qualification for heaven. Paul stressed that being a Jew (being circumcised) did not qualify them as a member of God's kingdom if they did not obey God's laws in their heart. The Jews in Paul's day argued against Paul's gospel by claiming they 'possessed' the law. Paul asserted that possessing the law meant nothing and circumcision had zero value if they did not have a changed heart.\n\nThe Jews had the misconception they could continue to do all the wicked things but would not be judged by God because they were circumcised. Some people today may believe they are saved because they perform perfunctory Christian duties such as attending church or undergoing baptism. However, the mere act of being baptised without sincere repentance of sins will not lead to salvation. If one chooses not to accept God's grace and walk in the Lord's way, no sacred rite or religious ceremony or any other sacrament will render effective the grace of eternal salvation.\n\nGod has chosen us to be saved by grace through our faith in the Lord. He has called us to be consecrated and keep His law. God requires the obedience of our hearts, not merely our outward trappings.",
        "part6": "THOUGHT",
        "part7": "Know ye not that the unrighteous shall not inherit the kingdom of God? Read 1 Corinthians 6:9-10.",
        "part8": [
            "ISAIAH 15",
            "PROVERBS 19"
        ]
    },
    "20 APRIL": {
        "part1": "Romans 2:26",
        "part2": "Uncircumcision Counted Circumcision",
        "part3": "VERSE 26",
        "part4": "Therefore if the uncircumcision keep the righteousness of the law, shall not his uncircumcision be counted for circumcision?",
        "part5": "In verse 25, Paul condemned the Jewish people, who continued in their sins, declaring that their circumcision counted for nothing in God's eyes. In today's verse, Paul went a step further to shock the Jews, stating that those who were uncircumcised (meaning Gentiles) but who kept the law, would be approved and accepted by God. The sign of physical circumcision had been replaced by a faithful and consistent obedience to God's law. The Jews prided themselves on being God's chosen, but Paul called them hypocrites for knowing God's law, yet wilfully living in sin and wickedness. He stated that an uncircumcised Gentile who obeyed God was more favoured in His eyes than a circumcised Jew who broke the law.\n\nPaul is warning Christians today that we should not rely purely on sacramental participation, such as undergoing baptism and partaking the Lord's Supper, to be our claim on eternal salvation if we persist in sinful living. There is value and significance in observing these sacraments, but we need to ensure we are doing it with God-pleasing motives. We must not just read the Bible but must apply its principles. We need to meditate on God's Word daily, internalize and practise what God teaches, in our daily living. Let us always consider our ways [Haggai 1:7], examine our conduct, and strive to be sanctified.\n\nPaul will show in the next chapter that none of us can keep the law. We are saved not by our deeds but by repenting and trusting the Lord Jesus Christ. We please God when our lives conform to His will for us.",
        "part6": "PRAYER",
        "part7": "O Lord my God, I pray I will not be blinded by pride. Wash me thoroughly from my iniquities and cleanse me of my sins. Amen.",
        "part8": [
            "ISAIAH 16",
            "PROVERBS 20"
        ]
    },
    "21 APRIL": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 26 In the Old Testament, we see two corresponding",
        "part4": "Therefore if the uncircumcision keep the righteousness of the law, shall not his uncircumcision be counted for circumcision?",
        "part5": "There are two sacraments which Christians today observe: baptism and the Lord's Supper. These are outward signs of an inward grace. Baptism is a public profession of our faith in the Lord before the church, and the Lord's Supper is a remembrance of God's grace and love through the finished work of our Lord Jesus Christ on the cross.\n\nIn the Old Testament, we see two corresponding signs that were shadows of these two sacraments. Circumcision points towards baptism, and the Passover meal points towards the Lord's Supper. Circumcision is a sign showing that a person belongs to God's covenantal people, the same way baptism is a sign signifying a person being joined to the body of the Lord Jesus Christ. The Passover meal remembers God's mercy in preserving those whose homes were covered by the blood of the lamb, whereas the Lord's Supper remembers how the body and blood of the Lamb of God cover God's children from His wrath.\n\nAll these outward signs, however, are secondary to the work of God in our hearts. This is made especially clear with the institution of the two sacraments by our Lord in the New Testament. Thus, it is of utmost importance for a person who professes faith to know what he believes. Baptism is an outward sign of an inward regeneration. If one is baptised and continues in his wicked ways, then he ought to examine the genuineness of his profession.\n\nThe same goes for the Lord's Supper. The Bible tells us, \"for he that eateth and drinketh unworthily, eateth and drinketh damnation to himself, not discerning the Lord's body\" [1 Corinthians 11:29]. One needs to examine oneself in observing the sacraments.",
        "part6": "",
        "part7": "For godly sorrow worketh repentance to salvation not to be repented of: but the sorrow of the world worketh death. - 2 Corinthians 7:10",
        "part8": []
    },
    "22 APRIL": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 26 appease his conscience.",
        "part4": "Therefore if the uncircumcision keep the righteousness of the law, shall not his uncircumcision be counted for circumcision?",
        "part5": "Be it circumcision and the Passover meal in the Old Testament, or baptism and the Lord's Supper in the New Testament, both are outwards signs of an inward grace. Without the grace of God working faith in us, we are but miserable and perishing sinners deceiving ourselves and others. Beneath the religious facade is an unregenerated soul seeking comfort in rituals that serve only to appease his conscience.\n\nYet one may ask; if the heart is the only thing that matters when we observe the sacraments, why is there a need for us to go through these \"religious rituals\"? He may ask, \"As long as I know I have truly believed, why is there a need for me to profess my faith publicly? As long as I remember the Lord Jesus Christ every day, why is there a need for me to partake of the Lord's Supper?\"\n\nThe answer is that the sacraments are commanded by God, and they are also means of grace provided by God for our benefit. When we make a decision to be baptized, we take an important step in our lives, telling others, and more importantly ourselves, to live a life worthy of God's calling. We are also baptized into a local church, and thus the church formally welcomes us into its community. In witnessing our baptism, the church members are also reminded of their faith and first love for the Lord Jesus Christ and His people.\n\nThe same goes for the Lord's Supper. When we partake it together as a church, God uses the assembling of the saints to cause one to examine oneself, to remind us of our identity and unity with the body of believers, to build one another up in the most holy faith, in proclaiming the Lord's death until He returns.",
        "part6": "",
        "part7": "And of His fulness have all we received, and grace for grace. - John 1:16",
        "part8": []
    },
    "23 APRIL": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 27 if they practice the Law of God to the very letter",
        "part4": "And shall not uncircumcision which is by nature, if it fulfil the law, judge thee, who by the letter and circumcision dost transgress the law?",
        "part5": "Following the reasoning stated in verses 25 and 26, the apostle Paul made clear the significance and true value of circumcision over uncircumcision. God had instituted circumcision as a mark of His covenant with Abraham and his descendants [Genesis 17:10-12]. It is a reminder to the Jews of their covenant relationship with God. This, however, does not mean they are automatically saved. Circumcision is of value only if they practice the Law of God to the very letter and obey it perfectly. Here is where the Jews failed. They were slack in keeping the letter of the Law even though they had the external privileges of circumcision to remind them of obedience. So in today's verse, what Paul says is this - \"Shall not the uncircumcision (i.e non-Jew/pagan, Gentile) who does not have the external privileges of the Jews, but who keeps the law, not condemn you Jews for breaking the Law of God?\" Obviously so.\n\nTo be sure, no one, Jew or Gentile can keep the Law of God perfectly. The purpose of the letter of the Law is to convict us of sin so we may resort to the Lord Jesus Christ who not only kept God's Law perfectly but also became the perfect sacrifice for our sins so we might be reconciled to God. Galatians 3:24 - \"Wherefore the law was our schoolmaster to bring us unto Christ, that we might be justified by faith.\" We thank God that while the Law condemns us, in the Lord Jesus our Sin-Bearer, we are born again to walk in newness of life.",
        "part6": "",
        "part7": "The law of the LORD is perfect, converting the soul ... more to be desired are they than gold, yea, than much fine gold: sweeter also than honey and the honeycomb. - Psalm 19:7a, 10",
        "part8": []
    },
    "24 APRIL": {
        "part1": "Romans 2:28",
        "part2": "A Jew Outwardly",
        "part3": "VERSE 28",
        "part4": "For he is not a Jew, which is one outwardly; neither is that circumcision, which is outward in the flesh.",
        "part5": "While every Jew is circumcised, bearing the mark of God's Covenant with Abraham, but not every one of them is a true son of Abraham spiritually speaking. Not every Jew in the flesh is automatically a true believer in the heart of the God of Abraham. Jehovah is the One true living God who gave us His eternal Son, Jesus Christ to save sinners through His sacrifice on Calvary's cross. The Lord Jesus came to save sinners, both Jews and Gentiles, who turn to Him by faith in repentance for their sins. But sadly, the Jews rejected the Messiah even though they had Him in human flesh in fulfilment of the prophecies of their Scriptures. For that, a Jew is not a true Jew even though outwardly he is one. He is not a true believer in his heart even though he is circumcised. A Jew may have done many wonderful works as in Matthew 7:22-23, but the Lord said, \"Not every one that saith unto me, Lord, Lord, shall enter into the kingdom of heaven; but he that doeth the will of my Father which is in heaven\" [Matthew 7:21].\n\nHere is a stark reminder that not every professing Christian is a true believer. One may look like, sound like, even serve in the church, but only he and God knows the heart. May we examine ourselves with God's Word. Where we have strayed, let us repent and return to the Lord with humility and contrition. The Lord will forgive as He says in 1 John 1:9.",
        "part6": "THOUGHT",
        "part7": "Whosoever denieth the Son, the same hath not the Father: but he that acknowledgeth the Son hath the Father also. - 1 John 2:23",
        "part8": [
            "ISAIAH 20",
            "PROVERBS 24"
        ]
    },
    "25 APRIL": {
        "part1": "Romans 2:29",
        "part2": "A Jew Inwardly",
        "part3": "VERSE 29",
        "part4": "But he is a Jew, which is one inwardly; and circumcision is that of the heart, in the spirit, and not in the letter; whose praise is not of men, but of God.",
        "part5": "This verse examines the positives of the question - who is a true Jew? He is one who inwardly believes in his heart. We noted that a Jew (outwardly by birth) is endowed with the external privileges of circumcision and the law of God. However, following the letter of the law and even circumcision cannot save him. With unbelieving hearts, the Jews meticulously observed the act of circumcision and performed their spiritual rites looking for man's praise and expecting God's approval. \"Wherefore the Lord said, Forasmuch as this people draw near me with their mouth, and with their lips do honour me, but have removed their heart far from me, and their fear toward me is taught by the precept of men\" [Isaiah 29:13]. Who then is a Jew inwardly? He may be a circumcised Jew or an uncircumcised Gentile who is circumcised in his heart which is the working within us of the Holy Spirit.\n\nWe thank God even though we are not Jews by lineage, we are in a sense \"spiritual\" Jews by reason of the circumcision of our hearts in submission to our Lord and Saviour Jesus Christ. Romans 10:12- 13 tells us \"For there is no difference between the Jew and the Greek: for the same Lord over all is rich unto all that call upon him. For whosoever shall call upon the name of the Lord shall be saved\". Saved by grace, we praise God for giving us these holy privileges and blessings of the faithful remnant to worship Him and do His will, proclaiming the saving Gospel to the world.",
        "part6": "THOUGHT",
        "part7": "In Christ, Paul says, \"There is neither Jew nor Greek, there is neither bond nor free, there is neither male nor female: for ye are all one in Christ Jesus. And if ye be Christ's, then are ye Abraham's seed, and heirs according to the promise\" [Galatians 3:28- 29].",
        "part8": [
            "ISAIAH 21",
            "PROVERBS 25"
        ]
    },
    "26 APRIL": {
        "part1": "Romans 3:1",
        "part2": "The Benefit of aJew?",
        "part3": "VERSE 1",
        "part4": "What advantage then hath the Jew? or what profit is there of circumcision?",
        "part5": "In Romans 2:28, Paul states that a man is not a Jew who is one outwardly. In God's sight, a Jew is one who inwardly has faith in the Promised Messiah. It is not the knowledge or possession of the Law, not the rite of circumcision; it is not the claim to a special relationship with God on account of one's race or ancestry. The only thing that makes a man a Jew is faith in the Lord Jesus Christ. Being a Jew and a member of the chosen people of God, the heritage of being born of the seed of Abraham, with the legacy of the law and the sign of circumcision; these things bring no salvation. All these counts for nothing unless there is a change in the heart. The fact that Jews have the law and are even circumcised, will not keep them from answering to God for their personal sin.\n\nThe Jews had a greater opportunity to know and obey God than anyone else. They had been given the privilege of knowing and receiving so much from God, but if they refuse to make it personal in their hearts, there is no benefit in Jewishness. They had the advantage, but failed to make use of it, and therefore it does them no good at all. The light they were given had no illumination for them. They have no spiritual security unless their relationship with God is personalized. They were no better off than if they had never known the Law. Righteousness is not achieved through external factors like race and religious rituals. God at work in us is what matters most - a changed heart.",
        "part6": "THOUGHT",
        "part7": "Religious sacraments, labels, and other forms of good works are not what will save us.",
        "part8": [
            "ISAIAH 22",
            "PROVERBS 26"
        ]
    },
    "27 APRIL": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 1 the Lord Jesus Christ, by grace alone, through faith",
        "part4": "What advantage then hath the Jew? or what profit is there of circumcision?",
        "part5": "Many religions are centred on man, focusing on man's attempts to appease, find approval, gain a right standing, or reach a god by his own efforts. Christianity does not focus on man's effort but rather it is God making a way for people to have a relationship with Him. The essence of the Christian life is to live one's life in the presence of God, under the authority of God, to the honour and glory of God. Our Gospel relationship with the Lord Jesus Christ, by grace alone, through faith alone, is the foundation for our faith. This sets the Gospel apart. It sets Christianity apart from other religions because it is the good news of God's saving grace toward man.\n\nAs Christians, we have eternal life; we have peace and joy that is beyond anything the world can offer. In the Lord Jesus Christ, we have hope, and we have the strength to face whatever comes our way. Our lives are put into proper perspective. Our priorities, problems, and our outlook totally change when we discover God's purpose for our lives. We view people, ourselves, life and its circumstances differently, and the things that bother us and consume our thoughts diminish.\n\nChristians accept God's gift of salvation and put their faith in the Lord Jesus; accepting His death on the cross as payment for their sins and His resurrection as proof of His power over death [Ephesians 2:8-9]. A Christian is indeed a child of God, part of God's family, and one who has been given new life in our Lord Jesus Christ.",
        "part6": "",
        "part7": "In the visible church, true Christians are invisible.",
        "part8": []
    },
    "28 APRIL": {
        "part1": "Roman 3:2",
        "part2": "Oracles of God -- What It Is",
        "part3": "VERSE 2",
        "part4": "Much every way: chiefly, because that unto them were committed the oracles of God.",
        "part5": "The Oracles of God are the words uttered from the mouth of God [Acts 7:38; Hebrews 5:12; 1 Peter 4:11], that is, the Holy Scriptures. \"God, who at sundry times and in divers manners spake in time past unto the fathers by the prophets, Hath in these last days spoken unto us by his Son, whom he hath appointed heir of all things, by whom also he made the worlds;\" [Hebrews 1:1-2].\n\nThe Oracles of God were divinely inspired, recorded and preserved by human agents under the superintendence of God Himself. The Oracles recorded by forty men from different walks of life over some sixty generations and one thousand and five hundred years in three languages (Hebrew, Aramaic and Greek) constitute the Holy Scriptures divinely arranged in sixty-six books to form the Holy Bible - the progressive revelation of God's redemption plan for sinful man.\n\nThe Bible is divided into two major sections. In the Old Testament God reveals Himself, His works of creation, commandments, dealings with Israel, prophecies and the promise of the Messiah. The New Testament is the fulfilment of the Old Testament with God the Son, Jesus Christ incarnate; His ministry on earth and accomplishment of the redemption plan; His resurrection and prophecy of future things; and the inspired apostolic epistles which amplify the doctrines of the Christian faith.\n\nThe Oracles, preserved, first entrusted to the Jews - and now in our hands - containing God's commandments, promises, prophecy and warnings are to be accepted by faith, obeyed, held in honour and propagated for the saving of souls to the glory of God. Read it to know God, His redemptive plan, and the assurance of our hope in Him.",
        "part6": "THOUGHT",
        "part7": "For ever, O LORD, thy word is settled in heaven. - Psalm 119:89",
        "part8": [
            "ISAIAH 24",
            "PROVERBS 28"
        ]
    },
    "29 APRIL": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 2 inerrant and authoritative in all things pertaining to",
        "part4": "Much every way: chiefly, because that unto them were committed the oracles of God.",
        "part5": "The value of the Oracles is immeasurable and rests upon the attributes of God Himself. God is Holy, True, Wise, Righteous and Just, full of Love, Grace and Mercy. He is the Almighty God, Omnipotent, Omnipresent, Omniscient and Immutable. God's holy purpose, absolute truth and wisdom are settled. The Oracles of God are inscripturated in the Holy Bible written under the inspiration of the Holy Spirit, and thus infallible, inerrant and authoritative in all things pertaining to faith and practice [2 Timothy 3:16-17].\n\nOf the Holy Scriptures, the Westminster Confession Chapter 1 Section (1) teaches that:-\n\n1) God reveals Himself in two distinct ways to\n\nman: in nature [Psalm 19:1-6] and in Scripture\n\n[Psalm 19:7-11]\n\n2) No man can deny the existence of God\n\n[Romans 1:20]\n\n3) All men are without excuse for their ignorance\n\nand sinful condition [Romans 1:21]\n\n4) Scripture is necessary for true and saving\n\nknowledge of God because therein alone is\n\nrevealed God's redemptive provision. [G.I.\n\nWilliamson].\n\nThe Bible is unique in that, in no other book does the reader experience the presence of the author and hear His voice speaking to him. The Oracles of God enlighten man's eye and mind to know - \"As it is written, There is none righteous, no, not one:\" [Romans 3:10]. \"For all have sinned, and come short of the glory of God;\" [Romans 3:23]. \"For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord\" [Romans 6:23]. And that one day he must stand before the only True and Righteous God to be judged [Hebrews 9:27].\n\nDear reader, will you be ready?",
        "part6": "",
        "part7": "The statutes of the LORD are right, rejoicing the heart: the commandment of the LORD is pure, enlightening the eyes. - Psalm 19:8",
        "part8": []
    },
    "30 APRIL": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 2 the heart\" [Hebrews 4:12].",
        "part4": "Much every way: chiefly, because that unto them were committed the oracles of God.",
        "part5": "The mere knowledge that man is a sinner condemned, who requires his sins to be thoroughly cleansed, does not automatically gain him salvation. It requires such knowledge to pierce and convict his heart. \"For the word of God is quick, and powerful, and sharper than any two- edged sword, piercing even to the dividing asunder of soul and spirit, and of the joints and marrow, and is a discerner of the thoughts and intents of the heart\" [Hebrews 4:12].\n\nThe Oracles like a hammer, can breakdown the resistance of any heart - \"Is not My Word ... saith the Lord ... like a hammer that breaketh the rock in pieces?\" [Jeremiah 23:29]. It brings the sinner to his knees in repentance to seek forgiveness for his sins [Psalm 51; 139:23-24] even as it persuades the sinner to accept God's invitation to salvation [Isaiah 1:18-19; 55:6-7].\n\nThe Oracles being the Living Word, have the power to regenerate life - \"Being born again, not of corruptible seed, but of incorruptible, by the word of God, which liveth and abideth for ever\" [1 Peter 1:23]. Feeding on the pure milk of the Word, the newborn grows in faith. He keeps away from sin by hiding God's Word in his heart [Psalm 119:11] and is guided along the path of righteousness by the light of His Word [Psalm 119:105].\n\nThe Oracles of God give rest to the weary and heavy laden [Matthew 11:28-30] and strength to the weak [Isaiah 40:31; Philippians 4:13]. For the sorrowing and troubled, it grants comfort and peace [Isaiah 40:1; John 14:27]. It has the power to convict, break, regenerate, reveal, illuminate and nourish the Saint - authoritative in all things pertaining to faith and life.",
        "part6": "",
        "part7": "For I am not ashamed of the gospel of Christ: for it is the power of God unto salvation to every one that believeth; to the Jew first, and also to the Greek. - Romans 1:16",
        "part8": []
    },
    "1 MAY": {
        "part1": "Roman 3:3",
        "part2": "The Impact of Unbelief",
        "part3": "VERSE 3",
        "part4": "For what if some did not believe? shall their unbelief make the faith of God without effect?",
        "part5": "Unbelief is the rejection of the Oracles of God inscripturated in the Holy Scriptures. It is a sin [John 16:8-9]. The unbelievers' eyes are blinded, and their hearts hardened by the evil one. \"Therefore, they could not believe, because that Esaias said again, He hath blinded their eyes, and hardened their heart; that they should not see with their eyes, nor understand with their heart, and be converted, and I should heal them\" [John 12:39- 40].\n\nThe unbeliever rejects God's Word [Psalm 106:24] and despises His works [Psalm 78:32], and the miracles of the Lord Jesus Christ. \"But though He had done so many miracles before them, yet they believed not on Him\" [John 12:37]. He makes God a liar. \"He that believeth not God hath made Him a liar; because he believeth not the record that God gave of His Son.\" [1 John 5:10b]. His heart is evil, corrupt, proud and ungrateful, having rejected the love, mercy and grace of God.\n\nThe unbeliever is condemned [John 3:18] and the wrath of God will be upon him. God put to death those who despised Moses [Hebrews 10:28]. Unbelief, in essence, despises the atoning work of the Lord Jesus Christ. God warns - \"Of how much sorer punishment, suppose ye, shall he be thought worthy, who hath trodden under foot the Son of God, and hath counted the blood of the covenant, wherewith he was sanctified, an unholy thing, and hath done despite unto the Spirit of grace?\" [Hebrews 10:29]. The three indictments highlighted in this verse describe the horror and enormity of the sin of unbelief - which God Himself will avenge [Hebrews 10:30].",
        "part6": "THOUGHT",
        "part7": "It is a fearful thing to fall into the hands of the living God. - Hebrews 10:31",
        "part8": [
            "ISAIAH 27",
            "PROVERBS 31"
        ]
    },
    "2 MAY": {
        "part1": "Romans 3:4",
        "part2": "Let God Be True",
        "part3": "VERSE 4",
        "part4": "God forbid: yea, let God be true, but every man a liar; as it is written, That thou mightest be justified in thy sayings, and mightest overcome when thou art judged.",
        "part5": "\"God forbid\" answers the question raised in verse 3: \"For what if some did not believe? shall their unbelief make the faith of God without effect?\" Paul addresses here an apparent dilemma: If the Jews are God's covenantal people, then would their unbelief make God's promise of no effect? The answer is no. The Jews were given the privilege of bearing the sign of God's covenant (circumcision) and the oracles of God, but that did not mean all would be saved. The essential element is their faith in the Lord Jesus Christ.\n\nIn setting the question in verse 3 and answering it in verse 4, Paul, being one of the keenest thinkers in their community, was thinking of the questions a Jewish mind might generate. The Jews were proud of their status as God's covenantal people, and in that framework, they had claimed salvation through blood ties. The requirement of believing in the Lord Jesus would naturally set them thinking: would unbelieving Jews then be living contradictions of God's faithfulness to His own covenant?\n\nThe answer is no. As progressively revealed in His Word, God's covenant in the Old Testament points toward His promise in the New Testament. To be saved, saints before the Lord Jesus Christ's advent look forward to the cross, and saints after that look back towards it. God is the only Truth; every man, in his own wisdom and guile, is a liar if he doubts or distorts God's Truth. Paul's quoting of Psalm 51:4 tells us man has no excuse before God's judgment: \"Against Thee, Thee only, have I sinned, and done this evil in Thy sight: that Thou mightest be justified when Thou speakest, and be clear when Thou judgest.\"",
        "part6": "THOUGHT",
        "part7": "God is not a man, that he should lie; neither the son of man, that he should repent: hath he said, and shall he not do it? or hath he spoken, and shall he not make it good? - Numbers 23:19",
        "part8": [
            "ISAIAH 28",
            "ACTS 1"
        ]
    },
    "3 MAY": {
        "part1": "Romans 3:5",
        "part2": "We Are Bad So God Can Be Good?",
        "part3": "VERSE 5",
        "part4": "But if our unrighteousness commend the righteousness of God, what shall we say? Is God unrighteous who taketh vengeance? (I speak as a man).",
        "part5": "Paul then raised another question a Jew or for that matter anyone might ask. If God allows us to be unrighteous so that His righteousness could be manifested, then is it fair for God to judge us for our wickedness?\n\nIn its most profound extension, this is the philosophical question about how God's sovereignty is compatible to man's responsibility. But we will soon see that Paul wastes no time in engaging with sophisticated debates and detours, at least as far as this stage of his thesis is concerned. He puts it plainly in the next verse that God would indeed judge us for our unrighteousness.\n\nThis question suggests certain inclinations in man. We like to find excuses for our sins, and when we find a convenient opportunity of shirking our responsibilities, we jump at it. The truth is, most people are not interested in finding out how God's sovereign will goes hand in hand with man's free will, but are rather more eager to shift the blame to others, even to God, for the transgressions they have committed.\n\nPerhaps another underlying assumption in this question is that God's attributes, more specifically His righteousness, could not be manifested without the evil of mankind. To believe so is to reduce God to one who depends on man's faults, so that His goodness can be shown by contrast. This is obviously false. God is the all-sufficient and great I AM. To think our Creator Who created the heavens and the earth is dependent on us in order to glorify Himself, is being most presumptuous.",
        "part6": "THOUGHT",
        "part7": "I know all the fowls of the mountains: and the wild beasts of the field are mine. If I were hungry, I would not tell thee: for the world is mine, and the fulness thereof. - Psalm 50:11-12",
        "part8": [
            "ISAIAH 29",
            "ACTS 2"
        ]
    },
    "4 MAY": {
        "part1": "Romans 3:6-7",
        "part2": "God as the Righteous Judge",
        "part3": "VERSE 6",
        "part4": "God forbid: for then how shall God judge the world?",
        "part5": "Chapter 3 sees the apostle defending the Truth against objections by certain Jews who said, \"If our Jewish heritage and rituals such as circumcision and following the teaching of the Mosaic law do not make us righteous before God, then what advantage is there being a Jew?\" Paul explained there are indeed great blessings bestowed upon the Jews as a people set apart for God. But just being a Jew outwardly does not mean he is saved because he is a sinner unable to obey God's Law to perfection. The only way to be saved is to flee to the Messiah Jesus with a repentant heart and receive the inward mark of God's Spirit within his heart (circumcision of the heart). In other words, God is not partial in the way He deals with all sinners, whether Jews or Gentiles.\n\nGod is the Holy and Righteous Judge. Genesis 18:25 tells us that God is called \"the Judge of all the earth\". He is the final Judge of every sinner both living and dead. All men are accountable to Him. \"And as it is appointed unto men once to die, but after this the judgment\" [Hebrews 9:27]. This knowledge of God the Righteous Judge will have a sanctifying effect upon our lives. We read in Proverbs 8:13: \"The fear of the LORD is to hate evil: pride, and arrogancy, and the evil way, and the froward mouth, do I hate\". Are you trusting the Living and Just God to strengthen you in persecution and the world's mistreatment because you are living your faith in the Lord Jesus Christ? Are you casting your cares upon Him? If you are, you will enjoy the peace of God the Righteous Judge always.",
        "part6": "THOUGHT",
        "part7": "That be far from thee to do after this manner, to slay the righteous with the wicked: and that the righteous should be as the wicked, that be far from thee: Shall not the Judge of all the earth do right? - Genesis 18:25",
        "part8": [
            "ISAIAH 30",
            "ACTS 3"
        ]
    },
    "5 MAY": {
        "part1": "",
        "part2": "",
        "part3": "",
        "part4": "For if the truth of God hath more abounded through my lie unto his glory; why yet am I also judged as a sinner? And not rather, (as we be slanderously reported, and as some affirm that we say,) Let us do evil, that good may come? whose damnation is just.",
        "part5": "From the parenthesis \"(as we be slanderously reported, and as some affirm that we say)\" we know that false charges had been made against the apostle. The critics were accusing Paul in a series of lies they made up. First, they falsely claim that the more wicked a person is, the more he glorifies God by contrast. Second, that the more a person lies, the more he exalts God's truthfulness by comparison. These enemies of the Gospel were charging Paul with the devious accusation that his gospel of salvation by grace through faith was giving license to sinners to sin with impunity (exemption from punishment). They were twisting the Gospel of grace in saying that in God's eyes, doing evil was good because it amplified God's holiness.\n\nOne characteristic of man's sinful nature is his cunning ability to rationalize sin. Every sinner even children, are clever at giving good reasons for doing bad. The enemies of the Gospel were making excuses by rationalizing that their sins glorified God.\n\nWas not \"doing evil for good\" also our wayward thinking before we were saved by grace? Did we not try to wiggle out of sin when confronted? Even now the carnal desires of our old self are still there. Hence, to get right, we must yield to the Lord in humble prayer - \"Search me, O God, and know my heart: try me, and know my thoughts: And see if there be any wicked way in me, and lead me in the way everlasting\" [Psalm 139:23-24]. Then we go on to obey Roman 12:21 - \"Be not overcome of evil but overcome evil with good\".",
        "part6": "",
        "part7": "Woe unto them that call evil good, and good evil; that put darkness for light, and light for darkness; that put bitter for sweet, and sweet for bitter! - Isaiah 5:20",
        "part8": []
    },
    "6 MAY": {
        "part1": "Romans 3:7-8",
        "part2": "Faith, Justification and Good Works  VERSES 7-8 For if the truth of God hath more abounded through my he unto his glory; why yet am I also judged as a sinner? And not rather, (as we be slanderously reported, and as some affirm that we say,) Let us do evil, that good may come? whose damnation ts just.  To COMPLETE THE BIBLE",
        "part3": "",
        "part4": "For if the truth of God hath more abounded through my lie unto his glory; why yet am I also judged as a sinner? And not rather, (as we be slanderously reported, and as some affirm that we say,) Let us do evil, that good may come? whose damnation is just.",
        "part5": "The apostle Paul refuted the Jews who rejected the truth that salvation was by grace through faith in the Lord Jesus Christ. Paul explained that this truth is based on God's holiness. God is holy so there is no other way for sinners to approach Him except through the Lord Jesus Christ. But the unbelieving Jews argued that if salvation was by grace then it opened the way for sinners to sin freely and act lawlessly without restrain. Here Paul reminded them that to understand the grace of God they must realize that God is the holy Judge. Sinners will be judged for their sins. No one can avoid God's judgment for any sin of commission and omission. \"For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord\" [Romans 6:23].\n\nSalvation is a gift. No good work is good enough to deserve God's gift of His Son Jesus Christ who came into the world to save sinners. The Lord Jesus gave Himself to be the propitiation for our sins by His blood and death on Calvary's cross. How then can anyone be saved? By laying hold on what our Lord Jesus has done for him by faith. Faith is turning to the Lord with a repentant heart and trusting Him as your only Lord and Saviour. \"For by grace are ye saved through faith; and that not of yourselves: it is the gift of God: Not of works, lest any man should boast\" [Ephesians 2:8-9]. \"Therefore being justified by faith, we have peace with God through our Lord Jesus Christ\" [Romans 5:1]. Having God's peace, we labour on in works of faith and love.",
        "part6": "THOUGHT",
        "part7": "For we are his workmanship, created in Christ Jesus unto good works, which God hath before ordained that we should walk in them. - Ephesians 2:10",
        "part8": [
            "ISAIAH 32",
            "ACTS 5"
        ]
    },
    "7 MAY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 9 Indeed, Paul started out saying that the Jews",
        "part4": "What then? are we better than they? No, in no wise: for we have before proved both Jews and Gentiles, that they are all under sin.",
        "part5": "Paul started a series of questions in this chapter with: \"What advantage then hath the Jew?\" [v. 1]. Here, he is ready to summarize his answer: \"What then? are we better than they? No, in no wise.\" From verse 9 onwards, Paul presents the thrust of his argument: that no one, Jew or Gentile, is better than the other, for all have sinned and fallen short of the glory God intended all to have.\n\nIndeed, Paul started out saying that the Jews have certain privileges. As God's covenantal people, they could be said to have enjoyed a head start of thousands of years. They have God's sign of covenantal relationship, and the oracles of God - which by God's grace, has caused saints of old to look towards God's grace and faithfulness, and repent of their sinful ways. Yet man's sinful nature is the great equalizer. Before the holy and righteous God, no one can meet His standard; everyone is under sin and has to pay the penalty.\n\nTo realize we are sinful, we need to know Who God is, and who we are. Consider the vilest of sinners you can think of in history. If you were to put him and God at two ends of a continuum, do not be surprised to see an unregenerated 'good man' (by the world's standards) being placed next to the vilest sinner, and infinite light-years away from God. It is only by God's grace we are made right with Him, by our faith in our Lord Jesus.",
        "part6": "",
        "part7": "That at that time ye were without Christ, being aliens from the commonwealth of Israel, and strangers from the covenants of promise, having no hope, and without God in the world: But now in Christ Jesus ye who sometimes were far off are made nigh by the blood of Christ. - Ephesians 2:12-13.",
        "part8": [
            "ISAIAH 33",
            "ACTS 6",
            "THOUGHT That at that time ye were without Christ, being",
            "aliens from the commonwealth of Israel, and",
            "strangers from the covenants of promise, having",
            "no hope, and without God in the world: But now",
            "in Christ Jesus ye who sometimes were far off are",
            "made nigh by the blood of Christ.",
            "-- Ephesians 2:12-13. 39"
        ]
    },
    "8 MAY": {
        "part1": "Romans 3:10",
        "part2": "Man's Moral Nature",
        "part3": "VERSE 10",
        "part4": "As it is written, There is none righteous, no, not one.",
        "part5": "This verse is quoted from Psalm 14, where the Bible gives us a definition of what it means to be a fool. By the world's definition, a fool is a person who behaves unwisely. When one is said to \"make a fool of oneself \", he is deemed as a clown who does things that hurt his own reputation and interest. But a fool in God's eyes is one who denies Him: \"The fool hath said in his heart, There is no God. They are corrupt, they have done abominable works, there is none that doeth good\" [Psalm 14:1]. We are told God looked down from heaven upon the children of men and saying, \"They are all gone aside, they are all together become filthy: there is none that doeth good, no, not one\" [Psalm 14:3].\n\nIt is not difficult to find 'good people' in this world. In fact, the sad reality is that some non- Christians around us might even be better than some Christians according to man's standards. However, from God's vantage point, none of our good deeds is enough to make us righteous before the all-present and all-seeing God. We are totally depraved in that we are born with sin that affects all our faculties, making us unable to seek and to obey God.\n\nA sinner is led by his senses and the ways of this world. The Bible tells us the conscience of a sinner is seared with a hot iron [1 Timothy 4:2], dead in trespasses and sins [Ephesians 2:1]. If not for God's light in our Lord Jesus Christ that cuts through the callousness of our heart, we would be totally lost. There is no way we can save ourselves.",
        "part6": "THOUGHT",
        "part7": "But God, who is rich in mercy, for his great love wherewith he loved us, even when we were dead in sins, hath quickened us together with Christ, (by grace ye are saved). - Ephesians 2:4-5",
        "part8": [
            "ISAIAH 34",
            "ACTS 7"
        ]
    },
    "9 MAY": {
        "part1": "Romans 3:11a",
        "part2": "Mans Intellectual Nature",
        "part3": "VERSE 11A",
        "part4": "There is none that understandeth.",
        "part5": "Man is made in the image of God. We have a soul and can thus worship God in Spirit; we have a mind and can praise God in Truth. We are moral beings and can differentiate right from wrong; we are social beings and thus can commune with God and have fellowship with one another. But all these are tainted when sin came into this world. Indeed, it is of God's common grace we can still reason and think, and interact with one another. But without God's gracious regeneration and revelation, we are limited and can only do according to our own wisdom and understanding.\n\nIt is therefore absolutely true when Paul says, \"There is none that understandeth.\" Man in his presumptuousness may assume he has great knowledge. But it is one thing to know and another thing to understand. In fact, the more he knows, the less he realizes he knows (Socrates). The truth is, the heart of man, in his constant quest for wisdom, is restless, until it rests in God (Augustine).\n\nAnd when the answer to true wisdom comes, unregenerate man cannot accept it, because of the hardness of his heart. \"For the Jews require a sign, and the Greeks seek after wisdom: But we preach Christ crucified, unto the Jews a stumblingblock, and unto the Greeks foolishness; But unto them which are called, both Jews and Greeks, Christ the power of God, and the wisdom of God. Because the foolishness of God is wiser than men, and the weakness of God is stronger than men.\" [1 Corinthians 1:22-25]",
        "part6": "THOUGHT",
        "part7": "To open their eyes, and to turn them from darkness to light, and from the power of Satan unto God, that they may receive forgiveness of sins, and inheritance among them which are sanctified by faith that is in Me. - Acts 26:18",
        "part8": [
            "ISAIAH 35",
            "ACTS 8"
        ]
    },
    "10 MAY": {
        "part1": "Romans 3:11b",
        "part2": "Mans Will",
        "part3": "VERSE 11B",
        "part4": "There is none that seeketh after God.",
        "part5": "Man's volition is often controlled by his feelings and reasoning. Caught in the abyss of sin, he is unable to free himself from its bondage. He indulges in his own lusts and is inflated by his own ego, driving his stakes deep into this world, only to understand the vanity of life when he eventually faces his own mortality. His power to reason is also made captive by his own desires, and he cannot imagine life without the things he is pursuing in this world. He may be able to deceive himself, even the world, with a false impression of happiness and freedom, but the truth is that tragedy awaits him who is trapped in his own web of false hope.\n\n\"There is none that seeketh after God.\" If not for the grace of God working in the foolish heart of the sinner, man is working himself towards condemnation. But all praise to Him who sees us swimming in the miry pool of sin and lifts us up, cleanses us, so that we can see beyond our pathetic state. From then on, things are not the same anymore. We understand true joy and hope, and yearn to live each day fruitfully with the glory of everlasting life ahead of us. We find motivation to change for the sake of God's kingdom.\n\nIndeed, there will be times of weaknesses when our feelings pull us towards the world; there will also be times when our reasoning is impaired by difficult circumstances we are facing in life. But in times like these, we call upon God and continue seeking after Him, and He will hold us up to live from strength to strength, and from grace to grace.",
        "part6": "THOUGHT",
        "part7": "And ye shall seek Me, and find Me, when ye shall search for Me with all your heart. - Jeremiah 29:13",
        "part8": [
            "ISAIAH 36",
            "ACTS 9"
        ]
    },
    "11 MAY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 11 other words, the sinner, like a corpse, is unable to",
        "part4": "There is none that understandeth, there is none that seeketh after God.",
        "part5": "How bad is man's spiritual condition? It is only the extraordinarily arrogant person who has the temerity to claim he has no sin. Most people would admit that they are not perfect, but they are not all bad. Romans 3:10-18, however, paints a devastating portrait of the sinner. The sinner is hopelessly lost. In theology, this is known as the total depravity of man. Paul says that the sinner is dead in his trespasses and sins [Ephesians 2:1]. In other words, the sinner, like a corpse, is unable to respond.\n\nPaul has said that as far as man's moral nature is concerned, there is none who is righteous. With regard to the mind of the natural man, there is none who understands. This inability to understand is not due to a lack of intelligence. It also does not mean that the natural man cannot have a rational understanding of the Christian faith. And it certainly does not mean that the doctrines of the Christian faith are difficult to understand. Rather, man's inability to understand is due to his moral bankruptcy which in turn affects his ability to receive God's truth. Without concealing his sarcasm, Paul asks, \"Where is the wise? Where is the scribe? Where is the disputer of this world?\" [1 Corinthians 1:20]. The answer is that they are nowhere to be found, and the reason is - as Paul points out - \"the world by wisdom knew not God\" [1 Corinthians 1:21]. The sinner turns away from God's truth because it does not fit the scheme of his life.\n\nHere is the warning: in turning away from God's truth, we do not become more enlightened. Like a man who turns away from the light, his pathway will become increasingly darker, so sinners who reject God's truth will become \"vain in their imaginations, and their foolish heart (will be) darkened\" [Romans 1:21].",
        "part6": "",
        "part7": "Do you know the Lord Jesus or do you just know about Him?",
        "part8": []
    },
    "12 MAY": {
        "part1": "Romans 3:11",
        "part2": "There is none that seeketh after God",
        "part3": "VERSE 11",
        "part4": "There is none that understandeth, there is none that seeketh after God.",
        "part5": "The natural man is morally depraved; he is also intellectually defective. What about his will? How does sin affect one's will? Paul says that \"there is none that seeketh after God.\" Again, this statement appears to fly in the face of logic and common observation of the human race. Does not the fact that most people in the world are engaged in the worship of deities imply that the natural man seeks after a higher being?\n\nThis question of man's will in seeking after God dates back to the early days of the church. Pelagius - a fourth-century monk - argued that God could not command believers to do the impossible, and that man could not be held responsible for something for which he had no free will. As far as Pelagius is concerned, man is able to exercise his free will to seek or not seek after God.\n\nThe Bible teaches the opposite. The natural man is not only totally depraved, but he is also totally unable to save himself. The fallen man - as Augustine of Hippo puts it - cannot not sin. There is a proclivity of the natural man toward sin and not God. Faced with a choice between sin and God, the will of the sinner is bent toward the former. Our Lord Jesus said that the natural man \"loved darkness rather than light\" [John 3:19].\n\nIf God has not pursued us, we would never have come to God by ourselves. This truth exposes the desperate state of the sinner, but it should not drive us to despair. On the contrary, it reveals the essentialness of God's grace, and that the hope for us is not us, but a God who pursues us and His Son who died to redeem us.",
        "part6": "THOUGHT",
        "part7": "No man can come to me, except the Father which hath sent Me draw him. - John 6:44",
        "part8": [
            "ISAIAH 38",
            "ACTS 11"
        ]
    },
    "13 MAY": {
        "part1": "Romans 3:12",
        "part2": "Man's Waywardness",
        "part3": "VERSE 12",
        "part4": "They are all gone out of the way, they are together become unprofitable; there is none that doeth good, no, not one.",
        "part5": "Israel had forsaken the Lord, departed from His statues, abandoned His worship. Israel is now \"like any other man\" [Judges 16:17]. The natural man is filled with his own ways, doing that which is right in his own eyes. He delights not in God's ways, nor will he submit to His authority and commandments. His carnal mind is enmity against God and His commandments are grievous to him. He wants to be the captain of his own life. His mentality is that he can manage his own life and make his own decisions, and to depend on God is to be weak. Some even boast and label themselves as \"freethinkers\" - free from beliefs, free from bondage to anything, and freedom to do whatever they like according to the dictates of their hearts.\n\nThere are those who leave the paths of uprightness, to walk in the ways of darkness [Proverbs 2:13]. What fallen man does not realize is that \"there is a way which seemeth right unto a man, but the end thereof are the ways of death\" [Proverbs 14:12]. He is shorted-sighted and can neither see afar nor the dangers around. He is proud and conceited, stiff-necked and stubborn, refusing divine instruction to walk in the way of life. His thoughts are not God's thoughts, nor his ways God's way.\n\nGod in His mercy sometimes afflicts a man, that by his crisis, he may see his own helplessness and foolishness, and discern Him whom God has lifted up - the Way, the Truth, and the Life, the God-Man Christ Jesus.",
        "part6": "THOUGHT",
        "part7": "Prosperity and riches may lull us into spiritual sleep but affliction and crisis awaken us to our own spiritual poverty and helplessness, and our need for and dependence on God.",
        "part8": [
            "ISAIAH 39",
            "ACTS 12"
        ]
    },
    "14 MAY": {
        "part1": "Romans 3:12",
        "part2": "Mans Uselessness",
        "part3": "VERSE 12",
        "part4": "They are all gone out of the way, they are together become unprofitable; there is none that doeth good, no, not one.",
        "part5": "The Israelites turned away from the law and the prophets, abandoned and corrupted the worship of God, acting in direct contradiction to the truth which God had expressly revealed to them. Thus, they had become unprofitable which carries the idea of fruit becoming rotten and bad-smelling, or decomposing meat with a foul repulsive stench, not fit for intended consumption, unprofitable for its design and purpose.\n\nTheir revolt and apostasy, turning to idolatry had become offensive to God, making themselves useless and unfit for what they were designed for - to serve God, to promote His glory, their own good and the good of others. Disobedience and idolatry were evidently the cause of this rottenness. They were worse than filthy rags before God and He would turn away from them, much less use them to show forth His praise and glory.\n\nThe writer of the Epistle to the Hebrews wrote about repentance from dead works, that only the blood of our Lord Jesus Christ can purge our conscience from dead works to serve the living God [Hebrews 6:1; 9:14]. Only saving faith in the Lord Jesus, serving Him with our talents for His glory, can result in living and enduring good works. Every man's works shall be made manifest on the day of judgment, and they will be tested by fire to see their worth. Gold, silver and precious stones will withstand the fire, but hay, wood and stubble will all be burnt up [1 Corinthians 3:12-13].",
        "part6": "THOUGHT",
        "part7": "Till men have faith in Christ, their best services are but glorious sins. - Thomas Brooks",
        "part8": [
            "ISAIAH 40",
            "ACTS 13"
        ]
    },
    "15 MAY": {
        "part1": "Romans 3:12",
        "part2": "Man''s Badness",
        "part3": "VERSE 12",
        "part4": "They are all gone out of the way, they are together become unprofitable; there is none that doeth good, no, not one.",
        "part5": "After the fall of man to sin, every imagination of the thoughts of his heart was only evil continually [Genesis 6:5]. That was what God saw in the hearts of sinful man. \"The heart is deceitful above all things, and desperately wicked: who can know it?\" [Jeremiah 17:9]. Is it not true that out of the heart proceed evil thoughts, murders, adulteries, fornications, thefts, false witness, blasphemies [Matthew 15:19]? This filthiness of flesh and spirit are loathsome in the sight of God. If not for His restraining grace, wickedness in this world will go from strength to strength [Genesis 20:6].\n\nThe total depravity of man is explicitly and figuratively described in Isaiah 1:6: \"From the sole of the foot even unto the head there is no soundness in it; but wounds, and bruises, and putrifying sores: they have not been closed, neither bound up, neither mollified with ointment.\" Only in the mirror of God's word can we see our true sinful self.\n\nNote, Manasseh was a bad king of Judah. He practised what the heathen did - child sacrifices, observed times, used enchantments, witchcraft, the occult [2 Chronicles 33:6], yet Scripture says he did worse than the heathen [2 Chronicles 33:9]. Why so? Because he had the written word of God and the prophets to enlighten and warn him. Thus, the light he had was far clearer and his obligations to God far greater. Consequently, his sins though same in nature were unspeakably worse in light of these dreadful aggravations. Christian, be admonished!\n\nAmazingly, wicked as Manasseh was, he found forgiveness when he humbled himself, repented and turned to God. Plentiful grace with the Lord Jesus Christ is always found, grace to cover all our sins.",
        "part6": "THOUGHT",
        "part7": "We have three facets of personality - what others think of me, what I think of myself, and what God sees in me.",
        "part8": [
            "ISAIAH 41",
            "ACTS 14"
        ]
    },
    "16 MAY": {
        "part1": "Romans 3:13",
        "part2": "Evil words",
        "part3": "VERSE 13",
        "part4": "Their throat is an open sepulchre; with their tongues they have used deceit; the poison of asps is under their lips.",
        "part5": "Today, we look at what God's Word tells us about an organ that He has given to man for his use: the mouth (including the throat, tongue and all other parts therein). Firstly, we see that God in His wisdom gave us a mouth for multiple uses: to eat (and drink), speak, and even to breathe (we breathe through our mouth as well as nose). God has given us an efficient body which does not require separate organs for each of the functions mentioned above. We can extend this idea to the rest of our body, and indeed, God created man to be able to do multiple things with the same body.\n\nLet us focus on the words that come out of our mouths. Even words have multiple uses, and one thing is sure, words can be meant for good or for evil. Consider the words \"build\" and \"destroy\". A cursory look may make us think the former is good, and the latter bad, but consider Genesis 6:7 where God told Noah that He will destroy all that He had created.\n\nGod is holy and good in all He does and thus He meant it for good even in destroying His creation. The lesson, therefore, is twofold: firstly, we must be careful not to be hasty in reading into a word that is said to us. Secondly, we also need to be careful with our words, and ask ourselves: \"What is the intent in our hearts when we say those words?\" Do we intend them for good or do we mean it for evil?",
        "part6": "THOUGHT",
        "part7": "The heart of the righteous studieth to answer: but the mouth of the wicked poureth out evil things. - Proverbs 15:28",
        "part8": [
            "ISAIAH 42",
            "ACTS 15"
        ]
    },
    "17 MAY": {
        "part1": "Romans 3:13",
        "part2": "Deceitful words",
        "part3": "VERSE 13",
        "part4": "Their throat is an open sepulchre; with their tongues they have used deceit; the poison of asps is under their lips.",
        "part5": "Have you ever been told something that turns out to be untrue? Or have you said something that is untrue to deceive someone? Lying has been a common sin amongst us ever since the serpent lied to Adam and Eve in the Garden of Eden. The devil lied to Eve to deceive her into eating the forbidden fruit by painting a false picture of the benefits of eating the fruit. At the same time, he also lied about God's intentions, planting seeds of distrust in Adam and Eve. Such is the nature of lies, deceiving the hearer into believing the speaker, and changing the way one thinks about someone or something.\n\nIn this day and age, when information is easily disseminated through the digital media, it is all the more important to be aware of what is true and what is not. Fake news is abundant on the Internet and unsuspecting readers can be easily deceived into thinking what they are reading is true. Fake news even come knocking at our doors via chatgroups and mobile apps, so readers beware and do not be part of the web of lies by forwarding unconfirmed news when you receive them.\n\nWhile deceit is becoming more widespread today, we can take comfort in the knowledge that God is in control and He is the source of all truth. Let us be wise, pray for discernment, and may God guide us and prompt us when confronted with deceiving words.",
        "part6": "THOUGHT",
        "part7": "Wherefore putting away lying, speak every man truth with his neighbour. - Ephesians 4:25a",
        "part8": [
            "ISAIAH 43",
            "ACTS 16"
        ]
    },
    "18 MAY": {
        "part1": "Romans 3:14",
        "part2": "Bitter words",
        "part3": "VERSE 14",
        "part4": "Whose mouth is full of cursing and bitterness",
        "part5": "When God created the first garden and gave Adam and Eve all the fruits of the garden for food, God also gave them sweet-tasting food, not bitter ones. Similarly today, we enjoy good- tasting food, but when something tastes bad in our mouths, we know and immediately spit it out. The same applies to our other senses - whether something feels, looks and sounds good or bad, we can discern and accept or reject them accordingly. In the same manner, words can also be sweet or bitter to the hearer. In fact, we speak and listen to words more than we eat and drink daily.\n\nTherefore, words are a powerful means of communicating not just knowledge but also emotions and feelings of the speaker. Imagine two people quarrelling. What kind of words are normally exchanged? Certainly destructive and angry words, full of cursing and bitterness. Words that hurt not just the ears but pierce through the hearts of its hearers. A father who tells his child he is useless and will never do well in life may be even more hurtful to the child than physical punishment. Worse, the child learns to do the same to others, using hurtful and bitter words as he grows up.\n\nThus let us use our words wisely, being careful not to cause unnecessary hurt to others. Avoid bitter and hurtful words. Rather, use words that build each other up, to encourage one another. In so doing, we show forth God's love so that others may see the Lord Jesus Christ in us.",
        "part6": "THOUGHT",
        "part7": "Let us therefore follow after the things which make for peace, and things wherewith one may edify another. - Romans 14:19",
        "part8": [
            "ISAIAH 44",
            "ACTS 17"
        ]
    },
    "19 MAY": {
        "part1": "Romans 3:15",
        "part2": "Evil Deeds",
        "part3": "VERSE 15",
        "part4": "Their feet are swift to shed blood.",
        "part5": "From verses 15 to 17, we read further regarding the ways of the wicked - the character and behaviour of godless people who are without the Lord Jesus Christ in their lives. This is a metaphorical picture of a person's character. Paul is quoting from Isaiah 59:7-8 to illustrate man's sinful nature.\n\nLooking back at verse 13, the sin of the tongue is included to conclude the list of sins committed against God. We use our tongue too freely to backbite our fellow beings. The Bible warns us of misusing our tongue in James 3:8. In the same breath from the same person, that tongue is used to sing praises to God in church.\n\nIt is the same with the other body parts, as mentioned in verse 15 here. Our feet will go where the heart leads, which is so willing to do evil. Human beings are so ready to backbite and criticize one another. This only shows the person is not a believer, especially when he persists in his wrongdoing.\n\nWe should not be surprised at the unbeliever's persistence because he is under Satan's control. He is spiritually blinded and lured away by the lust of the flesh, the lust of the eyes and the pride of life [1 John 2:15-17]. Hence, he will continue in his wrong doings. Man's evil deeds may not be seen by his friends but nothing and no one can hide his actions from God. We may even escape their consequences now, but the day of final reckoning will catch up with us. Be warned that judgment is sure and certain.",
        "part6": "THOUGHT",
        "part7": "We are accountable to God for our deeds.",
        "part8": [
            "ISAIAH 45",
            "ACTS 18"
        ]
    },
    "20 MAY": {
        "part1": "Romans 3:16-17",
        "part2": "Results of Evil Deeds",
        "part3": "VERSE 17",
        "part4": "And the way of peace have they not known:",
        "part5": "To be expected, destruction and misery will follow the sinful way. Nothing good will result from any deed done with evil intentions. If one does not seek God's will, they will not have peace. Sadly, the unregenerate man does not seek to do God's will but just the opposite. And nothing good can come out of their evil deeds.\n\nEvery one of us is accountable for our own actions, no matter how harmless or unintentional they are. Hebrews 9:27 says, \"And as it is appointed unto men once to die, but after this the judgment.\"\n\nHave you ever been troubled by a guilty conscience over something you said in jest but was taken seriously by your friend? Surely, the misery you felt was terrible. No one and nothing could make you feel better. In fact, sometimes you even feel worse when that friend is so forgiving.\n\nThe evil deeds committed in verse 15 are much more serious, yet we are all equally guilty before God. Judgement is sure and certain for both Jews and Gentiles. It is pointless to say that the liar is better than the murderer because both are guilty of wrongdoing. It is useless to compare ourselves with others for all will face the same judgement one day. We need to confess our sin and ask the Lord to cleanse us and receive Him as our personal Lord and Saviour.",
        "part6": "THOUGHT",
        "part7": "As it is written, There is none righteous, no, not one. - Romans 3:10",
        "part8": [
            "ISAIAH 46",
            "ACTS 19"
        ]
    },
    "21 MAY": {
        "part1": "Romans 3:18",
        "part2": "No Fear of God",
        "part3": "VERSE 18",
        "part4": "There is no fear of God before their eyes.",
        "part5": "The godless have no peace simply because they do not have any fear for God. In this verse the word \"fear\" means \"respect\", \"reverence\". It does not mean \"terror\" or \"be frightened of \" as used today. Note that the three short verses preceding verse 18, when read in reverse, are interrelated and refer to the outcome of the lack of reverence for God. There are many references to God-fearing characters in the Bible. David for one sought to do God's will in obedience to His Word. The importance of Psalm 19:7-11 is a good reminder for us to respect God and His Word, thus staying close to Him. The fear and respect of God and His Word will result in knowing the peace of God. We are assured of this peace in Philippians 4:7: \"And the peace of God, which passeth all understanding, shall keep your hearts and minds through Christ Jesus\". What God promises here is true, inner peace of soul and spirit. Every child of God is a sinner saved by grace through faith in the Lord Jesus Christ. We are imperfect, but we are clothed in the righteousness of Christ. Let us live in thankful obedience and share the joy of our salvation with those who do not know Him. Do you have the peace of God in your heart? If not, delay no longer. Right this moment, pray the prayer of salvation to accept Jesus Christ as your personal Lord and Saviour. Then you will definitely experience the joy of inner peace in Him.",
        "part6": "THOUGHT",
        "part7": "Peace, peace, sweet peace! Wonderful gift from above! O, wonderful, wonderful peace! Sweet peace, the gift of God's love! - Peter P. Bilhorn",
        "part8": [
            "ISAIAH 47",
            "ACTS 20"
        ]
    },
    "22 MAY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 19 and reflect on our lives, we will have to admit we",
        "part4": "Now we know that what things soever the law saith, it saith to them who are under the law: that every mouth may be stopped, and all the world may become guilty before God.",
        "part5": "No one will be declared righteous in God's sight by His laws. God gives each of us a conscience to know that we are not able to fulfil the law of God. Our ego leads us to unbelief and to justify our goodness, that we are not that bad. Man chooses to be answerable to himself. We suppress the knowledge God has given us, that is, the knowledge we have broken His laws. If we are honest in measuring ourselves against God's law and reflect on our lives, we will have to admit we come up far short. We are guilty before God.\n\nThe penalty of sin is eternal death. Our effort and whatever good we try to do will not admit us to heaven because we are unable to achieve the standard set by God. In other words, we are guilty as charged. But our Lord Jesus came to redeem us. Instead of us dying for our own sins, our Lord took our punishment and died on the behalf of those who believe in Him. He gives us an opportunity to receive Him as our Saviour. When we face God after death, we can boldly say that the Lord Jesus paid for our sins. God grants all who have Jesus in their hearts a place in Heaven to dwell with Him forever. Why does God need to do this for man? He knows we will come short of His laws. It is solely out of love that our Lord Jesus came. It is out of His mercy and grace that we have the opportunity to listen to the Gospel and understand it. And we are to tell this good news that saves to others so that they too are able to dwell in Heaven forever.",
        "part6": "",
        "part7": "Therefore by the deeds of the law there shall no flesh be justified in his sight: for by the law is the knowledge of sin. - Romans 3:20",
        "part8": []
    },
    "23 MAY": {
        "part1": "Romans 3:19",
        "part2": "Guilty as charged",
        "part3": "VERSE 19",
        "part4": "Now we know that what things soever the law saith, it saith to them who are under the law: that every mouth may be stopped, and all the world may become guilty before God.",
        "part5": "What would your answer be when you die and face God? The question He will ask is \"What right do you have to be allowed into Heaven?\" You can justify that you have always been a good person and did not hurt anyone. You did not break the law of the land. Whatever good you have done is of no value unless you are perfect in keeping God's law to the minutest detail. You have sinned daily. No one is able to keep all of God's laws. In reality, there is nothing you can say because deep down in your heart you know you have sinned. The scripture records for us that Job kept silent when God asked him to justify himself [Job 38-41]. Isaiah dared not speak until the Lord cleansed his mouth with a piece of burning coal [Isaiah 6:6]. Habakkuk could not talk but trembled at what God revealed to him [Habakkuk 3:16]. John fell at the Lord Jesus Christ's feet \"as though dead\" and was in dead silence [Revelation 1:17]. Why did these great men of God keep silent? They knew that it was best to keep silent because God is the Almighty who demands we be sinless. Like everyone else; we are unable to keep all of God's law. We can only remain silent before the Almighty God.\n\nBut God sent the Lord Jesus to bear our sins. Jesus is the only sinless One who is also God. Therefore, all who accept Him as their Saviour will be justified and be counted sinless as their sins are forgiven and borne by Him. God will allow us into His Heaven only on the merit of our Lord Jesus Christ our redeemer.",
        "part6": "THOUGHT",
        "part7": "Knowing that a man is not justified by the works of the law, but by the faith of Jesus Christ, even we have believed in Jesus Christ, that we might be justified by the faith of Christ, and not by the works of the law: for by the works of the law shall no flesh be justified. - Galatians 2:16",
        "part8": [
            "ISAIAH 49",
            "ACTS 22"
        ]
    },
    "24 MAY": {
        "part1": "Romans 3:20",
        "part2": "Why Deeds of the Law  Cannot Justify (I)",
        "part3": "VERSE 20",
        "part4": "Therefore by the deeds of the law there shall no flesh be justified in his sight: for by the law is the knowledge of sin.",
        "part5": "Paul has exposed the unrighteousness of both Jews and Gentiles. All are guilty and condemned before God. There are no exceptions. \"Therefore,\" Paul concludes here, \"by the deeds of the law there shall no flesh be justified in his sight.\"\n\nThe \"deeds of the law\" refer to works of righteousness, done in obedience to God's law. Paul states unequivocally that no one will be justified (declared righteous in God's sight) by observing the law. There is nothing we can do to atone for our sins and be set free from the guilty sentence and condemnation. Put simply, no one will be saved by good works.\n\nBut good works are a necessary part of the Christian faith. Our Lord Jesus commands us to keep His commandments as evidence of our love for Him [John 14:15]. Good works, however, are not the basis of our salvation, but the result of it. We are saved for good works, not by good works. We can do nothing to merit our salvation. The deeds of the law cannot justify anyone.\n\nMaybe you think that you have done many good works, being kind and helpful to others, generous to the poor, even serving fervently in church ministries. None of these will make you good enough for heaven. All we can do is come before God with a humble and contrite heart, and seek His grace, remembering we are saved not by our works, but by God's grace through faith in our Lord Jesus Christ.",
        "part6": "THOUGHT",
        "part7": "Nothing in my hands I bring, simply to Thy cross I cling; naked, come to Thee for dress, helpless, look to Thee for grace: - Augustus M. Toplady",
        "part8": [
            "ISAIAH 50",
            "ACTS 23"
        ]
    },
    "25 MAY": {
        "part1": "Romans 3:20",
        "part2": "Why Deeds of the Law Cannot Justify (Il)",
        "part3": "VERSE 20",
        "part4": "Therefore by the deeds of the law there shall no flesh be justified in his sight: for by the law is the knowledge of sin.",
        "part5": "Why can't the deeds of the law justify? The problem does not lie with the law. Psalm 19:7 tells us that \"the law of the LORD is perfect, converting the soul\". Paul states in Romans 2:13 that \"doers of the law shall be justified\". All those who obey the law perfectly will be accepted as righteous before God.\n\nYet, in reality, no one will be justified by keeping the law because of mankind's fallen nature. Instead of pursuing God and trying to please Him, the entire human race actually tries to get away from God. Far from observing the law, human beings actually violate the law in all possible ways and are thoroughly wicked. This does not mean every human being is as wicked as he can possibly be. Rather, sin has corrupted every part of our being - our body, our mind, and our will. We are enslaved to the evil impulses and desires of the heart.\n\nAs Paul has demonstrated, no man has fulfilled the strict requirements of the law. Our best efforts are laced with sin, and our most \"righteous\" deeds fall far short of God's glory. Even if we observe the law outwardly, the attitudes and actions of our hearts often condemn us. There is none righteous [Romans 3:10]. All have sinned and stand guilty before God.\n\nRighteousness cannot come from the \"deeds of the law\" or any form of self-effort. We need the righteousness, which is found only in Christ Jesus, which can only be obtained by grace through faith in Him.",
        "part6": "THOUGHT",
        "part7": "But that no man is justified by the law in the sight of God, it is evident: for, The just shall live by faith. - Galatians 3:11",
        "part8": [
            "ISAIAH 51",
            "ACTS 24"
        ]
    },
    "26 MAY": {
        "part1": "Romans 3:20",
        "part2": "The Law's Function",
        "part3": "VERSE 20",
        "part4": "Therefore by the deeds of the law there shall no flesh be justified in his sight: for by the law is the knowledge of sin.",
        "part5": "The first part of verse 20 tells us what the law is unable to do - it is unable to justify sinful man. Nobody will be declared righteous by observing the law. God did not give the law as a means to salvation. It is not a checklist for us to earn our way to heaven.\n\nIn the second half of verse 20, Paul shows us what the law can do - it gives men the knowledge of sin. Apart from the law, we will not realise how sinful we are. We may think that we are basically good moral people, especially when we compare ourselves against crooks and criminals. But it is against God's standard that we should measure ourselves. Unless we attain God's standard of righteousness, no one is righteous enough to enter heaven.\n\nGod reveals His standard to us through His law. It is only when we measure ourselves against God's law that we begin to see how far short we are of God's righteous demands. We are all wretched sinners condemned to His wrath and just punishment. There is no way we can save ourselves. We need a Saviour.\n\nSo, this is the purpose of the law - not a means of our justification but a measure of our unworthiness. Do you see yourself as a guilty condemned sinner awaiting God's judgment? Let the law lead you to His throne of grace, where you can obtain mercy and forgiveness of sins through faith in the Lord Jesus Christ.",
        "part6": "THOUGHT",
        "part7": "No man can justify himself before God by a perfect performance of the Law's demands - indeed it is the straight-edge of the Law that shows us how crooked we are. - J. B. Phillips",
        "part8": [
            "ISAIAH 52",
            "ACTS 25"
        ]
    },
    "27 MAY": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 21 introduced the words \"but now\" in verse 21.",
        "part4": "But now the righteousness of God without the law is manifested, being witnessed by the law and the prophets.",
        "part5": "Paul established the unrighteousness of all mankind in the first three chapters of Romans. All have fallen short of God's righteous demands and stand guilty before Him. No one can be declared righteous by observing the law. The law convicts and condemns the whole human race but is unable to save anyone.\n\nJust when everything seems hopeless, as mankind awaits God's judgment and wrath, Paul introduced the words \"but now\" in verse 21. This marks the turning point in God's dealings with man. However bleak things have been in the earlier chapters, changes take place from this point onwards.\n\nWhat are these changes? We were under God's wrath and unable to save ourselves through our own work-righteousness, but now God reveals to us His righteousness which is apart from the law. All were under condemnation, but now, all who believe in the Lord Jesus Christ are justified freely by God's grace. Before, we were under the bondage of sin and unable to keep the law, but now in Christ, we are set free from sin and enabled to live holy lives. Before, Gentiles were excluded from God's covenant, but now, all who put their faith in the Lord Jesus are brought into God's covenant family.\n\nWhat wonderful news of God's grace Paul introduced with the words \"but now\"! Are you still walking down the path of sin and destruction, without hope and without God in this life? \"But now\" there is hope through faith in Christ Jesus. Now is the time to turn from sin and turn to the Lord Jesus Christ!",
        "part6": "",
        "part7": "I once was lost, but now am found; was blind, but now I see. - John Newton",
        "part8": []
    },
    "28 MAY": {
        "part1": "Romans 3:21",
        "part2": "The Righteousness of God Without the Law",
        "part3": "VERSE 21",
        "part4": "But now the righteousness of God without the law is manifested, being witnessed by the law and the prophets;",
        "part5": "When a man comes before God for judgment, he will be pronounced righteous and accepted by God, in other words, justified, if he has fulfilled all the requirements of the law. However, as Paul demonstrated, no man is able to fulfil the law perfectly. Therefore no one can be righteous before God by his works.\n\nIf man possesses no righteousness of his own, how can he ever be deemed righteous before God? The good news is God provides righteousness. Paul calls this the \"righteousness of God without the law\". This righteousness is God's righteousness: how He acts in accordance with His holy nature to put people in a right relationship with Himself. God's righteousness is revealed in the person and work of the Lord Jesus. By His sinless life of perfect obedience and by bearing the full penalty for our sins on the cross, the Lord Jesus Christ made it possible for sinners to be forgiven and declared righteous by God.\n\nThe phrase \"righteousness of God\" also means this righteousness comes from God. It is not obtained by keeping the law but given freely to men by grace through faith in the Lord Jesus. We do not deserve it and can do nothing to earn it. It is a gift of God.\n\nDo you rely on the things you are doing for yourself or even for God, for your salvation? Or do you trust in the Lord Jesus and what He has done? Cease from your work and rest in the finished work of Christ. True righteousness comes, not by the law, but through faith in Christ.",
        "part6": "THOUGHT",
        "part7": "Yea doubtless, and I count all things but loss for the excellency of the knowledge of Christ Jesus my Lord: for whom I have suffered the loss of all things, and do count them but dung, that I may win Christ, and be found in him, not having mine own righteousness, which is of the law, but that which is through the faith of Christ, the righteousness which is of God by faith. - Philippians 3:8-9",
        "part8": [
            "ISAIAH 54",
            "ACTS 27"
        ]
    },
    "29 MAY": {
        "part1": "Romans 3:21",
        "part2": "A New Old Gospel",
        "part3": "VERSE 21",
        "part4": "But now the righteousness of God without the law is manifested, being witnessed by the law and the prophets.",
        "part5": "Paul has just revealed the good news of how God's righteousness is available to all who put their faith in Christ. This gospel is new in the sense that the coming of the Lord Jesus Christ inaugurates a new stage in salvation history. Yet, Paul also reminds us that it is not entirely new. As attested to by the Law and the Prophets, that is the Old Testament, the means of salvation that God has provided for His people has remained unchanged throughout history - by grace through faith in Christ. Those born before the Lord Jesus were saved by looking forward in faith to the coming of Christ, while those born after were saved by looking back in faith to His finished work.\n\nHow does the Old Testament testify to God's grace through the Lord Jesus Christ? From the very beginning, after Adam and Eve fell into sin, God spoke of the coming of a mighty One who would destroy Satan and his works forever [Genesis 3:15]. The sacrificial system of the Mosaic Law points to the perfect sacrifice that God will ultimately provide, His own Son, the Lord Jesus Christ - the paschal lamb of God who takes away the sin of the world. The prophets gave numerous prophecies of Christ, especially His birth and His suffering and death for sinners.\n\nWhat is your attitude towards the Old Testament? Is it a history book about the bygone era of salvation by the Law, or is it a testament of God's faithfulness to His covenant as He unfolds His plan of redeeming grace culminating in the work of the Lord Jesus Christ?",
        "part6": "THOUGHT",
        "part7": "The Bible is the one Word of the one God about the one way of salvation through the one Savior, Jesus Christ. - Graeme Goldsworthy",
        "part8": [
            "ISAIAH 55",
            "ACTS 28"
        ]
    },
    "30 MAY": {
        "part1": "Romans 3:22",
        "part2": "The Righteousness of God by Faith",
        "part3": "VERSE 22",
        "part4": "Even the righteousness of God which is by faith of Jesus Christ unto all and upon all them that believe: for there is no difference.",
        "part5": "Paul writes to the Romans to stress that no one can hope to behave perfectly to achieve God's required standard of righteousness. Only those who have faith in the Lord Jesus Christ have the righteousness of God.\n\nPaul's message reveals to us the glorious hope of our salvation: the righteousness God requires is not something we can hope to attain through our own efforts. It is not righteousness earned through obedience to the law. It is righteousness received through faith in Jesus Christ. It is transformative and something which happens to us. Paul describes the righteousness of God as something \"revealed\" [Romans 1:17] and \"manifested\" (shown or demonstrated) [v. 21].\n\nA murderer stands before the judge to receive his sentence. He has no hope of redeeming himself. The verdict is obvious - this murderer's sentence is death. Facing imminent death, the murderer confesses his guilt and begs for mercy. Inexplicably, another man, a perfectly law-abiding innocent man, in the courtroom stands up to take the place of the condemned. He dies in the murderer's place. The judge deems the murderer's punishment served in the eyes of the law and he walks free.\n\nIn the same way, the Lord Jesus Christ who was perfect in all ways and \"who knew no sin\" [2 Corinthians 5:21] stood up, took our place to bear the punishment for our sins. Through Christ, we have the glorious hope of salvation - the righteousness of God through faith in our Lord.",
        "part6": "THOUGHT",
        "part7": "Amazing love! how can it be That Thou, my God, shouldst die for me? - Charles Wesley",
        "part8": [
            "ISAIAH 56",
            "ROMANS 1"
        ]
    },
    "31 MAY": {
        "part1": "Romans 3:22",
        "part2": "There is No Difference",
        "part3": "VERSE 22",
        "part4": "Even the righteousness of God which is by faith of Jesus Christ unto all and upon all them that believe: for there is no difference.",
        "part5": "There is no difference with regard to man's need of the Gospel. Superficially, it might seem some among us are morally purer and more upright. Yet the Bible tells us plainly that \"there is none righteous, no, not one\" [v. 10]. The Bible does not say some people are less sinful than others. There is no difference - all have sinned and come short of the glory of God.\n\nThere is also no difference with regard to God's salvation plan for man. It does not matter how intelligent or privileged people are, the message of salvation remains the same - we are only righteous before God through faith in the Lord Jesus Christ. No special privileges are extended to those who are wealthier, smarter or born into a Christian family. There is only one way to heaven for our Lord Jesus says, \"I am the Way, the Truth, and the Life: no man cometh unto the Father, but by Me\" [John 14:6]. Nothing can take away the stain of guilt except the blood of Jesus Christ.\n\nSome think, \"I have done all I can to be obedient in God's sight\". Others are troubled by their fears and think, \"I am such a great sinner! I am so evil, uncaring and cannot love the Lord and His people as I want to.\" There is no difference. Both groups equally need the righteousness of God, which is freely and equally available to those who believe in our Lord and Saviour Jesus Christ.",
        "part6": "PRAYER",
        "part7": "Lord, thank You that You are the righteous God who has chosen to redeem mankind by the death and resurrection of Your Son. Thank You that I am justified by the righteousness of God through faith in the Lord Jesus, the perfect and only sacrifice for the sin of the world. In Jesus' name, Amen.",
        "part8": [
            "ISAIAH 57",
            "ROMANS 2"
        ]
    },
    "1 JUNE": {
        "part1": "Romans 3:23",
        "part2": "All Have Sinned",
        "part3": "VERSE 23",
        "part4": "For all have sinned, and come short of the glory of God.",
        "part5": "Jews may have the law and circumcision; Americans may lay claim to a great religious heritage; \"good\" people may point to their works of charity; but all this makes no essential difference to one's standing before the righteous and holy God. No wonder there is no difference, when both the one and the other have the guilt of Adam's transgression imputed to them, and have original corruption inherent in them, from whence proceed very many actual transgressions.\n\nIf you are asked to try and jump to the moon, some would do no more than a foot from the ground. The world's champion high jumper will be able to jump about eight feet off the ground. With the use of a pole, the champion pole vaulter could swing himself twenty-odd feet above the ground. But that is all. No one can reach the moon by their own unaided efforts. And the man who jumps twenty feet high is not much nearer the moon than the elderly lady who manages but six inches. Likewise, we may think that we are more righteous than others, but compared to the ultimate standard of God, we fall short, abysmally short, miserably short. All have sinned and are falling short of God's glory.\n\nKnowing we all have missed the standard teaches us that all share the same need for the righteousness only God can give. Thankfully, it is available to all who believe, without distinction being made between the Jew and Gentile.",
        "part6": "THOUGHT",
        "part7": "We are all on equal standing at the foot of the cross. All have sinned and all need the Lord Jesus Christ.",
        "part8": [
            "ISAIAH 58",
            "ROMANS 3"
        ]
    },
    "2 JUNE": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 24 Here Paul uses the word \"freely\" to modify",
        "part4": "Being justified freely by his grace through the redemption that is in Christ Jesus:",
        "part5": "As Paul uses it in this verse, the verb \"justify\" does not mean to \"make righteous\" (in an ethical sense) nor simply to \"treat as righteous\" (when one is really not righteous), but to \"declare righteous\". Sinners stand condemned in God's court, and yet God declares believers not guilty because of the work our Lord Jesus has finished on the cross. What a joy! A sinner destined for eternal punishment being acquitted of all charges!\n\nHere Paul uses the word \"freely\" to modify justify. Justification is something God bestows as a gift. That which is a gift is not earned nor deserved. Your status in society, wealth, intellect, church attendance could never merit this gift. Whatever you do (or do not) can never earn this free gift. This is further emphasized when Paul adds we are justified freely by His grace. This is the real heart of the issue: merit or grace? And God's justifying verdict is totally unmerited. People have done nothing and can do nothing to earn it. God is unconstrained by anything other than His own will. This truly is the undeserved love and mercy of God.\n\nPaul has already established that all have sinned and fall short of the glory of God [v. 23] and have set the Jews and Gentiles on equal footing. All have missed the mark. Likewise, all those which \"believeth in Jesus\" [v. 26], Jew or Gentile, will be declared righteous before God.",
        "part6": "",
        "part7": "The love of God is greater far Than tongue or pen can ever tell It goes beyond the highest star And reaches to the lowest hell. - Frederick Martin Lehman",
        "part8": [
            "ISAIAH 59",
            "ROMANS 4",
            "THOUGHT The love of God ts greater far",
            "Than tongue or pen can ever tell",
            "It goes beyond the highest star",
            "And reaches to the lowest hell.",
            "-- Frederick Martin Lehman",
            "65"
        ]
    },
    "3 JUNE": {
        "part1": "Romans 3:24",
        "part2": "Grace -- Common and Unmerited",
        "part3": "VERSE 24",
        "part4": "Being justified freely by his grace through the redemption that is in Christ Jesus:",
        "part5": "Torrential rain falls upon the houses of believers and unbelievers alike; scorching rays similarly dry up the gardens of Christians and non- Christians. Likewise, the grace of God falls \"on the just and on the unjust\" [Matthew 5:45]. This is called the common grace of God.\n\nThink about the grand scale of the universe. Since God is not dependent on anything outside Himself, He did not create the universe out of necessity. That the universe continues on at all is the result of God's free will and grace to sustain it. Universal and indiscriminate towards unbelievers is God's common grace as we exist in this world. God did not set all the laws of the universe in motion like a spinning top and then let it be. It is unimaginable what the repercussions would be even if God were to take a short break from sustaining the universe. Truly \"by him all things consist\" [Colossians 1:17].\n\nIn addition to the common grace of God is the saving or special grace of God. All those that put their faith and trust in the Lord are recipients of this saving grace. Although our sinful nature resists God, God gives the Holy Spirit to the elect making them willing and able to believe. Saving grace operates in producing conviction of sin and repentance. The gift of faith in our Lord Jesus Christ is bestowed upon believers and justifies us of all sin. Completely unmerited and free is this saving grace of God.",
        "part6": "THOUGHT",
        "part7": "For by grace are ye saved through faith; and that not of yourselves: it is the gift of God. - Ephesians 2:8",
        "part8": [
            "ISAIAH 60",
            "ROMANS 5"
        ]
    },
    "4 JUNE": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 24 it required the death of His Son as the atoning",
        "part4": "Being justified freely by his grace through the redemption that is in Christ Jesus:",
        "part5": "What if God had simply swept our sin under the rug and ignored it? He would be unjust for leaving sin unjudged and not addressing its penalty. His justice demands payment for sins committed; anything short of that would have impugned His character. Our lives are the obvious payment for sin [Romans 6:23]. But God chose a different path, one in which He remained just, but also justified us. This option was very costly since it required the death of His Son as the atoning sacrifice. As a result, we are redeemed by the blood of our Lord Jesus.\n\nThe Greek word for \"redemption\" in verse 24 is a compound word (apo-lutosis), the latter of which means ransom. In the Septuagint (the Greek translation of the Old Testament), the word is used to denote the price for one's life [Exodus 21:30]. In Isaiah 45:13, it is implied that there is a ransom to be paid to liberate a slave or captive. It is along these lines Paul is using this word presenting our Lord Jesus' death as a ransom or payment that takes the place of that penalty for sins owed by all people to God. God, in our Lord Jesus, pays the price necessary to redeem His people from their slavery to sin.\n\nTo whom was the ransom paid? It would be incorrect to presume that our Lord Jesus paid a ransom to the devil, in order to buy us back from Satan's possession. The ransom or purchase price is not paid to Satan. It is paid to God, for it is to God that we are in debt.",
        "part6": "",
        "part7": "For even the Son of man came not to be ministered unto, but to minister, and to give his life a ransom for many. - Mark 10:45",
        "part8": []
    },
    "5 JUNE": {
        "part1": "Romans 3:24",
        "part2": "Redeemer",
        "part3": "VERSE 24",
        "part4": "Being justified freely by his grace through the redemption that is in Christ Jesus:",
        "part5": "Redemption comes at a price. The price was the life of our Lord Jesus Christ. It is in our Lord Jesus that \"we have redemption through his blood\" [Ephesians 1:7]. This price is illustrated in the Old Testament story of Ruth and Boaz. The tragic death of Ruth's husband, father-in-law and brother-in-law left Ruth and her mother-in-law, Naomi, without a provider and protector. To ensure that widows like Ruth were not taken advantage of, God instituted the law of the kinsman-redeemer in Deuteronomy 25:5-6. In such circumstances, the nearest male relative would take Ruth and bear a son to succeed and carry on the name of the deceased husband.\n\nBoaz, in stepping up to be the kinsman- redeemer for Ruth, is obliged to provide for Ruth and her future family. His wealth is diluted in order to carry on the name of another man. This is the price that Boaz paid in exchange for adding the surviving spouse of the deceased husband to his overall estate.\n\nJustification comes at a cost too. Sin must be punished. To save lost sinners, God sent the Lord Jesus to take on our sins as if He committed them Himself. That God sent his \"only begotten Son\" [John 3:16] whom He has been in a loving relationship with from eternity past, to die on the cross for undeserving sinners like you and me is the greatest story of mercy and redemption. Oh, how deep is His love!",
        "part6": "PRAYER",
        "part7": "Dear God, thank You for redeeming me out of darkness into Your marvellous light. Help me to witness to others of this salvation so rich and so free. In Jesus' name, Amen.",
        "part8": [
            "ISAIAH 62",
            "ROMANS 7"
        ]
    },
    "6 JUNE": {
        "part1": "Romans 3:25",
        "part2": "Propitiation",
        "part3": "VERSE 25",
        "part4": "Whom God hath set forth to be a propitiation through faith in his blood, to declare his righteousness for the remission of sins that are past, through the forbearance of God.",
        "part5": "God the Father has set forth His only begotten Son, the Lord Jesus to be a propitiation. \"Propitiation\" carries the idea of a sacrifice that appeases God's holy wrath. God being holy and righteous has to judge sin. He cannot overlook it.\n\n\"For thus saith the LORD of hosts; As I thought to punish you, when your fathers provoked me to wrath, saith the LORD of hosts, and I repented not\" [Zechariah 8:14].\n\nIt is God Himself who has put forward a means to satisfy His own righteous anger and judgment - a propitiation, an appeasing sacrifice. It is all God's work and nothing that mankind has done. God placates Himself as only He can.\n\nThis same Greek word \"propitiation\" is translated \"mercy seat\" in Hebrews 9:5. The Old Testament records in Exodus 25 and 37 how God instructed the Israelites in the construction of the tabernacle to house the ark of the covenant. The mercy seat sat as a lid over the ark and was where God dwelt between the cherubs and would meet His people [Exodus 25:22]. The High Priest would enter the Holy of Holies on the Day of Atonement and sprinkle the blood of a bullock and goat onto and around the mercy seat [Leviticus 16] as God instructed, to atone for the nation's sins.\n\nThus, propitiation also conveys the idea of a place where atonement is obtained. Being \"atoned for\" means to obtain mercy, to be wiped clean, have sin purged and be covered over, thus achieving reconciliation in order that sinners can come before an assuaged God.",
        "part6": "THOUGHT",
        "part7": "For He, being full of compassion, forgave their iniquity, and destroyed them not: yea, many a time turned He His anger away, and did not stir up all His wrath. - Psalm 78:38",
        "part8": [
            "ISAIAH 63",
            "ROMANS 8"
        ]
    },
    "7 JUNE": {
        "part1": "Romans 3:25",
        "part2": "The Price for Propitiation",
        "part3": "VERSE 25",
        "part4": "Whom God hath set forth to be a propitiation through faith in his blood, to declare his righteousness for the remission of sins that are past, through the forbearance of God.",
        "part5": "Propitiation does not come free. There is a price to be paid to appease God. A holy righteous God who has been offended demands justice or He would not be just. The system for propitiation / atonement had been laid out by God in the Old Testament. Moses was commanded by God to instruct the High Priest: \"Then shall he kill the goat of the sin offering, that is for the people, and bring his blood within the vail, and do with that blood as he did with the blood of the bullock, and sprinkle it upon the mercy seat, and before the mercy seat.\" [Leviticus 16:15]\n\nGod demands that blood be shed as the price of propitiation. The animal sacrifices by themselves were not able to atone for the people's sins. \"For it is not possible that the blood of bulls and of goats should take away sins\" [Hebrews 10:4]. The system of sacrifices in the Old Testament with blood of animals shed, were a foreshadowing [Hebrews 10:1] of God's foreordained ultimate means of atonement for His people: \"But this man, after he had offered one sacrifice for sins for ever, sat down on the right hand of God\" [Hebrews 10:12].\n\nThe Lord Jesus is the Lamb of God who takes away the sin of the world [John 1:29] by the shedding of His precious blood on the Cross of Calvary [Ephesians 1:7].",
        "part6": "THOUGHT",
        "part7": "Forasmuch as ye know that ye were not redeemed with corruptible things ... but with the precious blood of Christ, as of a lamb without blemish and without spot. - 1 Peter 1:18-19",
        "part8": [
            "ISAIAH 64",
            "ROMANS 9"
        ]
    },
    "8 JUNE": {
        "part1": "Romans 3:25",
        "part2": "Forbearance of God",
        "part3": "VERSE 25",
        "part4": "Whom God hath set forth to be a propitiation through faith in his blood, to declare his righteousness for the remission of sins that are past, through the forbearance of God.",
        "part5": "It is out of God's forbearance that the Lord Jesus is given as an appeasing sacrifice, so sinners may be reconciled. God is a forbearing God as that is His character. To forbear is to be patient, to tolerate and endure. With regards to sinful creatures who deserve righteous judgment, forbearance results in punishment being deferred for a time. In effect, God is restraining Himself from punishing the sinner at the very same moment that sin is committed. It does not mean God ignores it altogether. He is showing His willingness to delay His punishment for a time. The fact that He would purpose His own Son as a wrath-appeasing sacrifice shows that He still hates and judges sin. Because of God's forbearance, righteousness and being gracious to save, the Lord Jesus is sent to save us from His wrath.\n\nGod tolerates mankind's sin for a time, suspending punishment for a while, in order that sinners have the opportunity to be spared by exercising faith in His Son's atoning work in shedding His precious blood on Calvary's Cross. He will then remit even their past sins because they are covered by the shed blood of His foreordained sacrifice. Such forbearance must never be mocked nor spurned.\n\n\"And the times of this ignorance God winked at; but now commandeth all men every where to repent: Because he hath appointed a day, in the which he will judge the world in righteousness by that man whom he hath ordained; whereof he hath given assurance unto all men, in that he hath raised him from the dead.\" [Acts 17:30-31]",
        "part6": "THOUGHT",
        "part7": "Herein is love, not that we loved God, but that He loved us, and sent His Son to be the propitiation for our sins. - 1 John 4:10",
        "part8": [
            "ISAIAH 65",
            "ROMANS 10"
        ]
    },
    "9 JUNE": {
        "part1": "Romans 3:25",
        "part2": "Three Words -- Justification, Redemption and Propitiation",
        "part3": "VERSE 25",
        "part4": "Whom God hath set forth to be a propitiation through faith in his blood, to declare his righteousness for the remission of sins that are past, through the forbearance of God.",
        "part5": "The instruction of the Christian faith has been greatly hindered by the death of great words. In Romans 3:24-25, we have three great words - justification, redemption and propitiation. And all three words have to do with soteriology (the doctrine of salvation). Paul's writings in Romans gives the clearest and most thorough presentation of these words.\n\nJustification is the act of being pronounced righteous. God assumes the position of the righteous Judge by which He does not impute to the sinner the penalty for his sin, but by grace imputes to him righteousness by faith in Christ Jesus. The idea that righteousness can be imputed by faith in a Person and not through the Law goes against the human understanding of fairness.\n\nRedemption means deliverance by the blood of our Lord Jesus Christ [Ephesians 1:7; Colossians 1:14]. There are two aspects of redemption; redemption from sin [Ephesians 1:7] and redemption unto glory [Ephesians 1:14]. The picture is that sin has and will hold us captive, but for our Lord Jesus Christ. Sin, therefore, has no dominion over redeemed sinners. However, the full and final release from sin will not be realised until we see our Saviour face to face.\n\nThe word propitiation is also translated as \"mercy seat\" [Hebrews 9:5]. It is closely linked to sacrifice. We ought not to think of propitiation as the turning aside of God's wrath by anything that we do. Rather it is as Paul puts it - \"propitiation through faith in His blood.\" It is God Himself - being perfectly righteous and just - satisfying His wrath against sinners by demanding the sacrificial death of His only begotten Son.",
        "part6": "THOUGHT",
        "part7": "Do you realise that Christ is your Ransomer and has actually shed His blood for you as your ransom? ... Do you realise that this Christ who has thus shed His blood for you is Himself your God. - B. B. Warfield",
        "part8": [
            "ISAIAH 66",
            "ROMANS 11"
        ]
    },
    "10 JUNE": {
        "part1": "Romans 3:25",
        "part2": "What is Faith?",
        "part3": "VERSE 25",
        "part4": "Whom God hath set forth to be a propitiation through faith in his blood, to declare his righteousness for the remission of sins that are past, through the forbearance of God.",
        "part5": "What is faith? The writer of Hebrews defines faith - \"Now faith is the substance of things hoped for, the evidence of things not seen\" [Hebrews 11:1]. In the Institutes of the Christian Religion, John Calvin defines faith as the \"firm and certain knowledge of God's benevolence toward us, founded upon the truth of the freely given promise in Christ, both revealed to our minds and sealed upon our hearts by the Holy Spirit.\"\n\nBy Calvin's definition, faith comprises three elements: notitia, assensus, and fiducia. Notitia is the content of faith. True faith must be based on \"knowledge of the truth\". In order to believe, we must know something about that Someone, who is our Lord Jesus Christ. He is the object of our faith. Our faith must be in Christ. Without the right content, there can be no true faith. Thus, people who are ignorant of the true Gospel of Christ will not have true faith.\n\nAssensus simply means agreement. It speaks of our firm conviction that the content of faith is true. A person may know about the doctrines of the Christian faith, but he may not believe that they are true. Genuine faith says that the content (the notitia) revealed in Holy Scripture is true.\n\nFiducia takes one step further than assensus, from more than just agreement to personal trust. It is not enough to know and believe the content of the Christian faith because \"the devils also believe, and tremble\" [James 2:19]. True saving faith comes when a sinner knows and believes the scriptural claims of the Lord Jesus Christ, and personally appropriates Him for salvation. It is a yielding of oneself to Christ. Fiducia is seen in Thomas' confession after he had seen the resurrected Christ, he not only believed but proclaimed, \"My Lord and my God\" [John 20:28].",
        "part6": "THOUGHT",
        "part7": "There is a permanent relationship between faith and the Word ... Take away the Word, and no faith will then remain. - John Calvin",
        "part8": [
            "JEREMIAH 1",
            "ROMANS 12"
        ]
    },
    "11 JUNE": {
        "part1": "Romans 3:25",
        "part2": "Faith in His Blood",
        "part3": "VERSE 25",
        "part4": "Whom God hath set forth to be a propitiation through faith in his blood, to declare his righteousness for the remission of sins that are past, through the forbearance of God.",
        "part5": "Romans 3:25 says that our propitiation is through faith in the blood of the Lord Jesus Christ. Scripture teaches that we are redeemed by the blood of our Lord. Paul states that in Christ, \"we have redemption through his blood, the forgiveness of sins, according to the riches of his grace\" [Ephesians 1:7; see also Acts 20:28]. We are also justified by the blood of Christ [see Romans 5:8-9]. The concept of substitutionary atonement runs through the doctrine of salvation. For a sinner to live, an innocent life must die. The writer of Hebrews states that \"without shedding of blood is no remission\" [Hebrews 9:22]. The wrath of God upon sin cannot be assuaged except by a qualified substitute who is willing to die in our stead. Animals cannot be our substitute because \"it is not possible that the blood of bulls and of goats should take away sins\" [Hebrews 10:4]. Neither are we \"redeemed with corruptible things, as silver and gold\" [1 Peter 1:18-19]. Redemption comes only by the precious blood of the Lord Jesus. He is the only willing and qualified substitute in our place.\n\nHe was set forth by God to \"be a propitiation through faith in (Christ's) blood\". What do we understand by propitiation through faith in His blood? Is the blood of the Lord Jesus Christ a reference to His life, to His suffering and death, or to both? John Calvin says, \"By mentioning blood only, [Paul] did not mean to exclude other things connected with redemption, but, on the contrary, to include the whole under one word.\" The shed blood of our Lord Jesus is His life poured out, and only His poured-out life can atone for our sins.\n\nWe must be humble to accept that if we are to be saved at all, it must be - and only be - by faith in the sacrifice of Jesus Christ.",
        "part6": "THOUGHT",
        "part7": "What can wash away our sins? Nothing but the blood of Jesus. - Robert Lowry",
        "part8": [
            "JEREMIAH 2",
            "ROMANS 13"
        ]
    },
    "12 JUNE": {
        "part1": "Romans 3:26",
        "part2": "Just and Justifier",
        "part3": "VERSE 26",
        "part4": "To declare, I say, at this time his righteousness: that he might be just, and the justifier of him which believeth in Jesus.",
        "part5": "One objection we often encounter when sharing the Gospel with unbelievers, especially those who subscribe to the Buddhistic philosophy of karma, is that our Christian God is unfair. \"You mean an evil person like Hitler can go to heaven simply because he believes in Jesus Christ?\" they will ask. The philosophy of cause and effect, that \"whatsoever a man sow, so shall he reap\" enshrined even in our Holy Scriptures, demands that a wicked person should be punished for his crimes and misdeeds.\n\nIn this section of Romans, Paul provides the answer. Yes, God indeed will be unfair and unjust if He arbitrarily pardons a wicked criminal without punishment. But He did not. He sent His only begotten Son to die on the cross for the criminal and for our sins. The Lord Jesus shed His blood to satisfy God's wrath. The death of Jesus demonstrates justice has been served. The word \"righteousness\" in today's verse refers to God's justice. The righteous God did not just shrug off our sins. \"The wages of sin is death\" [Romans 6:23]; and the Lord Jesus, who was innocent of all sin, shed His precious blood on the cross and paid the penalty we deserved.\n\nTo justify is to declare the accused righteous. God, the righteous Judge, can declare us righteous because He sent His Son to die for our sins. He is therefore also our justifier. But to receive this benefit, we must believe in and accept the gift, Jesus the Christ. We need to repent of our sins and receive Him as our Lord and Saviour.",
        "part6": "THOUGHT",
        "part7": "In the doctrine of salvation by grace, man is nothing, Christ is all. - James Smith, Daily Remembrancer",
        "part8": [
            "JEREMIAH 3",
            "ROMANS 14"
        ]
    },
    "13 JUNE": {
        "part1": "Romans 3:27",
        "part2": "Where Is Boasting Then?",
        "part3": "VERSE 27",
        "part4": "Where is boasting then? It is excluded. By what law? of works? Nay: but by the law of faith.",
        "part5": "Continuing his explanation that salvation is entirely of God who is the justifier, and that man contributes no part at all, Paul asks; \"So is there any place left for boasting?\" He provides the answer - No! Man has nothing to boast of, not of observing the Law nor of doing good deeds? No, except in the principle of believing by faith [1 Corinthians 1:31].\n\nWarren Wiersbe explains it this way; \"If salvation is through the Law, then men can boast; but the principle of faith makes it impossible for men to boast. The swimmer, when he is saved from drowning, does not brag because he trusted the lifeguard. What else could he do? When a believing sinner is justified by faith, he cannot boast of his faith, but he can boast in a wonderful Saviour.\" (Wiersbe, Bible Exposition Commentary).\n\nIf any man has reason to boast, that man would be Paul, \"an Hebrew of the Hebrews; as touching the law, a Pharisee\" [Philippians 3:5]. But after the Lord opened his spiritual eyes, he realised that his pride and misplaced zeal made him the \"chief of sinners\" [1 Timothy 1:15]. Paul's teachings in this chapter is needful for many liberals of our day who are misled to think that all religions are good, teach people to be good and thus make them acceptable in God's sight. May the Lord use us as channels to point such people to the Word of Truth to see what God really thinks of our self-righteousness.",
        "part6": "THOUGHT",
        "part7": "But we are all as an unclean thing, and all our righteousnesses are as filthy rags. - Isaiah 64:6a",
        "part8": [
            "JEREMIAH 4",
            "ROMANS 15"
        ]
    },
    "14 JUNE": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 28 Paul phrased it, \"He was justified by faith\". Let us",
        "part4": "Therefore we conclude that a man is justified by faith without the deeds of the law.",
        "part5": "To one of the two thieves crucified together with Him, the Lord made this precious promise, \"Verily I say unto thee, To day shalt thou be with me in paradise.\" [Luke 23:43]. We can safely conclude this man was justified. But on what basis was he justified? Quite obviously, it was \"without (or apart from) the deeds of the law\". There was no way this dying man could save himself through good works and keeping the commandments. As Paul phrased it, \"He was justified by faith\". Let us examine in detail, this man's confession of faith in Luke 23:40-42. Firstly, he said to the other thief, \"Dost not thou fear God?\" That shows he feared God. Secondly, he admitted his own guilt - \"And we indeed justly; for we receive the due reward of our deeds\". Thirdly, he openly recognized Christ's innocence, saying, \"But this man hath done nothing amiss\". And most importantly, he begged for forgiveness; \"Lord, remember me when thou comest into thy kingdom.\" He was willing to accept Jesus Christ as his Lord and Saviour. He believed that God would raise the Lord Jesus Christ from the dead and that someday He would return to rule over His kingdom. Thus, he begged to be \"remembered\", meaning of course that he wanted the Lord Jesus to do more than remember him mentally, but to forgive his sins and admit him into heaven. Like this thief, none of us deserves a place in God's kingdom. We cannot boast of our good works to justify ourselves. We can only throw ourselves at God's mercy.",
        "part6": "",
        "part7": "For by grace are ye saved through faith; and that not of yourselves: it is the gift of God: Not of works, lest any man should boast. - Ephesians 2:8-9",
        "part8": [
            "JEREMIAH 9 outselves at God's metcy.",
            "ROMANS 16",
            "THOUGHT For by grace are ye saved through faith; and that",
            "not of yourselves: it is the gift of God: Not of",
            "works, lest any man should boast.",
            "-- Ephesians 2:8-9",
            "7/"
        ]
    },
    "15 JUNE": {
        "part1": "Romans 3:29",
        "part2": "Is God Only for Jews?",
        "part3": "VERSE 29",
        "part4": "Is he the God of the Jews only? is he not also of the Gentiles? Yes, of the Gentiles also.",
        "part5": "In today's verse, Paul begins with a question: \"Is God the God of Jews only?\" This is asking, \"Is God saving only Jews?\" He asks a second question: \"Is he not also of the Gentiles?\" He gives the answer - \"Yes, of the Gentiles also\", since there is only one God, who will justify the circumcised by faith and the uncircumcised through the same faith [v. 30]. Abraham was justified by faith; he received the righteousness of God and the covenant promises by faith before the rite of circumcision was imposed on him, and before the law was given to Israel. Romans 4:3 says, \"Abraham believed God, and it was counted unto him for righteousness.\"\n\nToday, the same principle applies to everyone, Jews and Gentiles. They can receive God's righteousness if they \"believe on Him that raised up Jesus our Lord from the dead; who was delivered for our offences and was raised again for our justification\" [Romans 4:24b-25]. He is the God of Jews as well as Gentiles because all must come to Him by faith.\n\nGod created all the nations of this world - \"And hath made of one blood all nations of men for to dwell on all the face of the earth\" [Acts 17:26a]. He is the God of all mankind. He will justify everyone through faith in the Lord Jesus Christ alone. He will redeem people for Himself out of every nation.\n\nGod is to be known by all, so let us declare His glory among the nations, His marvellous work among the people, \"For the LORD is great, and greatly to be praised: He is to be feared above all gods\" [Psalm 96:4].",
        "part6": "THOUGHT",
        "part7": "For I am not ashamed of the gospel of Christ: for it is the power of God unto salvation to every one that believeth; to the Jew first, and also to the Greek. For therein is the righteousness of God revealed from faith to faith: as it is written, The just shall live by faith. - Romans 1:16-17",
        "part8": [
            "JEREMIAH 6",
            "1 CORINTHIANS 1"
        ]
    },
    "16 JUNE": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 30 Jesus Christ confirms that He is the LORD by His",
        "part4": "Seeing it is one God, which shall justify the circumcision by faith, and uncircumcision through faith.",
        "part5": "The essence of all Jewish faith is declared in Deuteronomy 6:4 - \"The LORD our God is one LORD\". We are given here to believe that our LORD God is the one living and true GOD. \"I am the LORD, and there is none else, there is no God beside Me\" [Isaiah 45:5a]. The Jews maintained the highest conceptions of the one GOD and had contended for Him. Furthermore, the Lord Jesus Christ confirms that He is the LORD by His 'I AM' statements: \"Verily, verily, I say unto you, Before Abraham was, I am\" [John 8:58, also see John 6:35; 8:12; 10:9, 11; 11:25; 14:6; 15:1]. Clearly, God is One.\n\nAccording to the Bible, there is only one God the LORD, but with three distinct Persons in the Godhead (God the Father, God the Son and God the Holy Spirit) who are equal in Being, Power and Glory with the same Divine nature, essence and attributes. This is evident in, for example, the benediction Paul has given: \"The grace of the Lord Jesus Christ, and the love of God (the Father), and the communion of the Holy Ghost, be with you all. Amen\" [2 Corinthians 13:14].\n\nThe one God of grace justifies the circumcision by faith and the uncircumcision through faith. The word 'circumcision' here is a reference to the nation of Israel, and 'uncircumcision' refers to the Gentile nations. The Jew was already in a position for justification through the Law leading up to Christ. He had only to accept it as of faith, not of works of the Law [v. 20]. The Gentile must attain it through faith - faith in the Gospel now revealed to him.",
        "part6": "",
        "part7": "Trusting in the LORD is trusting in the perfect love of God the Father, the completed work of God the Son, and the leading of God the Holy Spirit.",
        "part8": []
    },
    "17 JUNE": {
        "part1": "Romans 3:31",
        "part2": "Is the Law Voided by Faith?",
        "part3": "VERSE 31",
        "part4": "Do we then make void the law through faith? God forbid: yea, we establish the law.",
        "part5": "The apostle Paul asks, \"Do we then make void the law through faith?\" If we are justified apart from the Law, is the Law thus made void? He is asking, \"Is the Law thus ineffective?\" His answer - \"God forbid: yea (yes), we establish the Law\". The phrase 'God forbids' (in Greek, me genioto) means 'absolutely not' or 'may it never be'. Paul declares we establish the Law. 'Establish' (histemi) is 'to cause something or someone to stand'.\n\nWhat is justification? According to the answer of Westminster shorter Catechism, Question 33, \"Justification is an act of God's free grace, wherein He pardoneth all our sins, and accepteth us as righteous in his sight, only for the righteousness of Christ imputed to us, and received by faith alone.\" Justification (being declared right with God) is by faith in Christ alone, not by works. It is impossible to attain right standing with God by keeping the Law. The Law requires perfect obedience to every commandment, not only external behaviour, but also compliance on the heart level. We cannot be saved by keeping the Law. Neither is it the Law's purpose to save us. Rather, it is to show us our sins so that we will despair of being saved by our inability to keep the Law and look to the Lord Jesus Christ instead.\n\nJustification by faith upholds the Law by showing that the punishment the Law demanded has been met by our Lord Jesus Christ [v. 25] shedding His blood as a propitiation of our sins. That means, when our Lord Jesus died on the cross for our sins, the wrath of God for our rebellion against Him fell on His Son instead. God imputed the righteousness of Christ to us. Thus today's verse teaches us that the Law is vital and operative, but not as a means of salvation.",
        "part6": "THOUGHT",
        "part7": "The doctrine of justification is by grace through faith, and our Lord Jesus upholds the Law of God rather than subverts it.",
        "part8": [
            "JEREMIAH 8",
            "1 CORINTHIANS 3"
        ]
    },
    "18 JUNE": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 1 God's favour and salvation. However, Abraham",
        "part4": "What shall we say then that Abraham our father, as pertaining to the flesh, hath found.",
        "part5": "We are saved because the righteousness of our Lord Jesus is imputed on us. This was not a new teaching and Paul illustrated this doctrine with the example of Abraham whom the Jews regarded as the model of faith and godliness.\n\nAbraham was the first patriarch and Jews believed that his inherent righteousness moved God to make him the father of His chosen people. In other words, Abraham's good works earned God's favour and salvation. However, Abraham was not sinless but despite that, God promised his seed would be as numerous as the stars. God established a covenant with Abraham and placed the obligation to fulfil its promises on Himself [Genesis 15:17]. This covenant would be an everlasting covenant between God and Abraham and all his seed. [Genesis 17:7-8]. He would be their God and Canaan would be their everlasting possession.\n\nThis covenant was initiated by God and Abraham responded in simple faith, believing God would fulfil everything He promised. God did not save Abraham on the basis of his goodness but on the righteousness of our Lord Jesus, whom God foreknew would die to save sinners one day [Genesis 15:6]. Every person who is saved before or after the advent of our Lord Jesus shares the same faith Abraham had and is saved by the same gift of God's grace. While Abraham's physical offspring secured the Promised Land of Canaan, Abraham's spiritual seed will gain an everlasting heavenly home. Thank God for His matchless grace and mercy to mankind.",
        "part6": "",
        "part7": "Thank God we are justified by Him because we cannot justify ourselves.",
        "part8": []
    },
    "19 JUNE": {
        "part1": "Romans 4:1",
        "part2": "Abraham",
        "part3": "VERSE 1",
        "part4": "What shall we say then that Abraham our father, as pertaining to the flesh, hath found.",
        "part5": "Abraham was living with his father's family in the Ur of the Chaldees when God called him to leave and go to the Promised Land. God's Word does not tell us why God chose Abraham since he had a background of idolatry, but he responded in obedience. Abraham did not know his final destination but trusted God and built altars to worship God as he journeyed southwards.\n\nGod promised Abraham on several occasions that he will be the father of many nations, have many offspring and they will possess the land of Canaan [Genesis 12:2; 15:5; 17:6]. Although he and his wife were childless and of advanced age, Abraham had faith in God and believed His promises. Finally, Isaac was born to Abraham and Sarah at the age of 100 and 90 years respectively, just as God promised.\n\nUltimately, Abraham proved his unshakeable faith when tested by God [Genesis 22]. He was willing to offer Isaac as a burnt offering even though Isaac was his only son and the only means by which God's promises would be fulfilled. God saw Abraham's faith and provided a ram to be the substitute sacrifice. Abraham was not an example of perfect obedience, but he did return to God in faith so that he was called a friend of God [Isaiah 41:8] and a hero of faith [Hebrews 11:17-19]. May we learn to have the same faith in our Almighty God and trust Him to lead us every step of our lives.",
        "part6": "THOUGHT",
        "part7": "Abraham obeyed God's call \"For he looked for a city which hath foundations, whose builder and maker is God\" [Hebrews 11:10].",
        "part8": [
            "JEREMIAH 10",
            "1 CORINTHIANS 5"
        ]
    },
    "20 JUNE": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 1 his lies when God revealed the truth to them. How",
        "part4": "What shall we say then that Abraham our father, as pertaining to the flesh, hath found.",
        "part5": "G in God.\n\nod's Word records three instances when\n\nAbraham sinned by displaying a lack of faith",
        "part6": "",
        "part7": "Sarah was attractive even in her old age and Abraham feared he would be killed if Pharaoh and Abimelech knew that Sarah was his wife. So, Abraham asked Sarah to lie about her relationship with him to Pharaoh [Genesis 12] and Abimelech [Genesis 20]. Both of them rebuked Abraham for his lies when God revealed the truth to them. How shameful it must have been when Abraham's deceit was exposed by pagans and his failure to put his trust in God was laid bare. Abraham accepted Sarah's suggestion to take Hagar to wife presuming he could assist God in giving him an heir [Genesis 16]. The resultant birth of Ishmael meant Abraham would be the Father of the Arab race, but God told Abraham His covenant would be established with Isaac, not Ishmael [Genesis 17:19]. Consequently, Abraham and Sarah's actions led to much grief in the family and to Israel, even to this day. Despite not trusting God to protect him and provide an heir in due time, God was merciful to forgive Abraham and save him from his shortcomings. Thank God for His mercy and grace towards us too. He has not reckoned our sins against us but placed them upon His Son who died in our place. God also imputed Christ's righteousness upon us so we may be justified and reconciled to Him. Hence, we are delivered from God's wrath unto eternal life in heaven.    Blessed is he whose transgression is forgiven, whose sin is covered. Blessed is the man unto whom the LORD imputeth not iniquity, and in whose spirit there is no guile. - Psalm 32:1-2",
        "part8": []
    },
    "21 JUNE": {
        "part1": "Romans 4:1-2",
        "part2": "Abraham's Salvation",
        "part3": "VERSE 2",
        "part4": "For if Abraham were justified by works, he hath whereof to glory; but not before God.",
        "part5": "Paul presses us to examine the case of Abraham to determine the basis of his justification before God. The phrase \"pertaining to the flesh\" [v. 1] indicates a reliance on human efforts to achieve justification. The Jews believed that Abraham's obedience, faith, and godliness persuaded God to save him. By calling Abraham \"our father\" [v. 1], Paul was not restricting the question to Jews only as the Book of Romans was addressed to the Christians in Rome. While the Jews regard Abraham as their physical forefather, Abraham was also the spiritual forefather of all Christians who place their faith in the Lord Jesus as their Saviour.\n\nIn effect, Paul was asking us the question, \"what did Abraham, our common physical and spiritual ancestor, discover about justifying himself before God through his own efforts?\"\n\nIf Abraham could make himself right and acceptable before God on the basis of his works, then he could save himself. By extension, any man, woman, or child could do the same with the right amount of effort. Then Abraham and anyone else who justifies himself before God has good reason to boast. However, no one can boast because none can save himself. Paul's subsequent arguments would make this clearer.\n\nEven though Abraham could not save himself by his works, yet his works showed that he was saved [James 2:21]. Abraham's act of offering his son Isaac on the altar was proof of the reality of his faith in God [Genesis 15:6]. May God strengthen our faith and may our works show clear evidence of our faith and salvation.",
        "part6": "THOUGHT",
        "part7": "God called us and saved us, not according to our works, but according to His own purpose and grace. Read 2 Timothy 1:9.",
        "part8": [
            "JEREMIAH 12",
            "1 CORINTHIANS 7"
        ]
    },
    "22 JUNE": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 3 of us who are struggling in our spiritual walk, may",
        "part4": "For what saith the scripture? Abraham believed God, and it was counted unto him for righteousness.",
        "part5": "Often, Christians consciously or subconsciously think we play a part in the matter of our salvation. Among Christian friends, we may scrutinize one another's actions and compare how close we are with God. For the self-reflective, we may have examined ourselves and seen that all our thoughts, words and deeds are tainted by sin one way or another. These comparisons and self- reflections may cause us to feel discouraged. Some of us who are struggling in our spiritual walk, may even begin to doubt whether we are truly saved.\n\nToday's verse seeks to answer those doubts. Simply put, scripture clearly states that our salvation comes from belief in God and His promises. Abraham believed God, and it was his belief in the almighty, covenant-keeping and immutable God that was counted to him for righteousness. In spite of the times when Abraham failed God by not trusting in His protection, such as lying about Sarah as his sister, Scripture here says that it was his belief in God that was key to his salvation.\n\nOftentimes we may be discouraged by the sin we see in ourselves. We may have Christian friends who share that they feel especially sinful and wonder if they are saved. The antidote to this doubt and discouragement is faith in God's Word, the Bible. While we may (and should) hunger and thirst after righteousness, let us remember our salvation is sure only because the promises of God are sure.",
        "part6": "",
        "part7": "Standing on the promises that cannot fail. When the howling storms of doubt and fear assail, By the living Word of God I shall prevail, standing on the promises of God. - R. Kelso Carter",
        "part8": [
            "JEREMIAH 13",
            "1 CORINTHIANS 8",
            "THOUGHT Standing on the promises that cannot fail.",
            "When the howling storms of doubt and fear assail,",
            "By the living Word of God I shall prevail,",
            "standing on the promises of God.",
            "--R. Kelso Carter",
            "85"
        ]
    },
    "23 JUNE": {
        "part1": "Romans 4:3",
        "part2": "What Did Abraham Believe",
        "part3": "VERSE 3",
        "part4": "For what saith the scripture? Abraham believed God, and it was counted unto him for righteousness.",
        "part5": "What did Abraham believe about God that was counted to him for his righteousness? We may wonder what exactly we should be believing in. Abraham was a prominent Old Testament figure. He did not have the complete revelation of the Word of God. In order to be saved, was what Abraham believed different from what believers today have to believe in? No, God's message of salvation has been consistent even in the Old Testament. In Genesis 12-17, God promised Abraham many things. Most importantly, we see God promised Abraham that He would be a God to Abraham and his seed forever, and they would dwell in Canaan, the promised land as their everlasting possession [Genesis 17:7-8]. Abraham's belief that God would keep this promise is in essence the same belief that Christians are to have today. Like Abraham, Christians today are to believe that God will be their God and that they will dwell in heaven, the promised land, together with Him.\n\nFor those of us who are struggling to have faith in Scripture, let us be thankful we have an additional advantage over Old Testament believers - Christians today have the complete Word of God revealed [Hebrews 11:13]. The Old Testament believers relied on their faith that God would fulfil His promise of eternal life even when God's salvation plan was not fully revealed to them. We, on the other hand, have the Gospels and the New Testament Canon telling us exactly how His salvation plan has been enacted and completed.",
        "part6": "THOUGHT",
        "part7": "Do I appreciate the Word of God so freely and comprehensively given to me?",
        "part8": [
            "JEREMIAH 14",
            "1 CORINTHIANS 9"
        ]
    },
    "24 JUNE": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 3 Instead of the sinful rags, he was clothed in, God",
        "part4": "For what saith the scripture? Abraham believed God, and it was counted unto him for righteousness.",
        "part5": "What does it mean to be counted righteous? The word \"counted\" in Greek carries the idea of \"imputed to\" or \"reckoned to\". This tells us that Abraham's belief in God did not make him inherently righteous. Rather, the righteousness of another - the Lord and Saviour Jesus Christ - would be imputed to him. This is a wonderful thing indeed! All of Abraham's sinfulness and doubt in God would be washed and dealt satisfactorily with. Instead of the sinful rags, he was clothed in, God would look upon Abraham and see, as it were, the royal robe of righteousness and pure garments of salvation of Christ - the perfect, sinless Man!\n\nWhen we believe in and accept Christ as our Lord and Saviour, we too are imputed with the righteousness of Christ. When God examines us, He will not but choose to ignore our sins and put onto our account the righteousness of Christ, which fully satisfies God's holiness, justice and love. This is something we must be eternally grateful for, because we could never have done it on our own. Man's inherent sin nature means that from conception, we were steeped in sin [Psalm 51:5]. It was impossible for us to live the perfectly sinless life that the Lord Jesus Christ did on our behalf.\n\nTherefore, let us strive to show our love for Him by leading holy lives. When we fully appreciate what God has done for us, our desire to forsake sin grows not because we want to \"earn\" salvation, but because we want to show our love and gratitude to the God who saved us.",
        "part6": "",
        "part7": "I am crucified with Christ: nevertheless I live; yet not I, but Christ liveth in me: and the life which I now live in the flesh I live by the faith of the Son of God, who loved me, and gave himself for me. - Galatians 2:20",
        "part8": []
    },
    "25 JUNE": {
        "part1": "Romans 4:4",
        "part2": "Grace, Not Debt",
        "part3": "VERSE 4",
        "part4": "Now to him that worketh is the reward not reckoned of grace, but of debt.",
        "part5": "The discourse here is addressed directly to the Jew, to prove to him that the doctrine of justification is not something new. Paul proceeds to show, in today's verse, that Abraham was not justified by works, but by faith and free grace. Hence, there are no grounds to boast about attaining justification through good works by comparing between one who works to earn his salvation and one who does not but claims it by faith. Verse 4 first supposes that to the one who works (or so he thinks) with the intent of gaining justification through his actions, salvation would be owed him. This is the general principle pertaining to legal contracts, where one who fulfils the terms is entitled to fair compensation (that is, \"debt\" in today's verse) promised, which he can rightfully claim. Hence, if one has fulfilled the contract, payment to him is not a matter of favour, but what he has duly earned. He is deserving of remuneration.\n\nTherefore, if someone was justified by his actions and works, he would have a claim on God's favour because it would be wrong not to compensate him for the works he has done. This supposition is thus contrary to the doctrine of grace (see Romans 11:6).\n\nOf course, Paul is not affirming one's ability to attain justification through his merits but speaking hypothetically of one who can fulfill the condition of perfect obedience. The fact is no one can be saved through their own efforts because none can obey perfectly. The discourse continues in verse 5.",
        "part6": "THOUGHT",
        "part7": "Grace, grace, God's grace, Grace that will pardon and cleanse within; Grace, grace, God's grace, Grace that is greater than all our sin! - Peter P. Bilhorn",
        "part8": [
            "JEREMIAH 16",
            "1 CORINTHIANS 11"
        ]
    },
    "26 JUNE": {
        "part1": "Romans 4:5",
        "part2": "All We Need Is Faith?",
        "part3": "VERSE 5",
        "part4": "But to him that worketh not, but believeth on him that justifieth the ungodly, his faith is counted for righteousness.",
        "part5": "Verse 4 presents the hypothetical scenario that if one can fulfil the condition of perfect obedience, then justification (or salvation) is not an act of God's grace, but something that the person deserves as payment. Paul continues here the contrasting scenario that instead of one's perfect adherence to the Law (by works), he seeks to be justified by believing - this is the idea of justification by all who believe in the Lord Jesus.\n\nThe expression \"believeth on him that justifieth the ungodly\" highlights an important point. The ungodly sinners (that is, all of us) are not being justified because we are righteous. We are corrupt and deserve no favour, but God unilaterally resolves to forgive the ungodly, and to treat us as His friends.\n\n\"...his faith is counted for righteousness.\" The sinners' faith in the Lord Jesus renders him to be justified by God even though he has been, and still is, and will always be, personally undeserving of this merit. This act of justification is based on the premise that our Lord Jesus died in our place to atone for our sins. The 'benefits' of the Lord Jesus Christ's atoning death is therefore imputed to believers in Christ. This act of our Lord renders it possible for God to regard all who base their faith in Christ, as righteous and treat them as though they had themselves obeyed the Law in His sight.\n\nLike Abraham, by believing in God, it will be counted to us for righteousness [v. 3].",
        "part6": "THOUGHT",
        "part7": "My faith has found a resting place, Not in device nor creed; I trust the Ever-living One, His wounds for me shall plead. I need no other argument, I need no other plea; It is enough that Jesus died, And that He died for me. - E. E. Hewitt",
        "part8": [
            "JEREMIAH 17",
            "1 CORINTHIANS 12"
        ]
    },
    "27 JUNE": {
        "part1": "Romans 4:6",
        "part2": "Imputed Righteousness",
        "part3": "VERSE 6",
        "part4": "Even as David also describeth the blessedness of the man, unto whom God imputeth righteousness without works.",
        "part5": "The word \"impute\" (Gr. logizomai) holds great theological meaning in the narrative of God's saving grace and act of salvation. It has the meaning of setting something to one's account, or to reckon something to an individual.\n\nThe act of counting (or crediting) unto Abraham righteousness [Genesis 15:6; Romans 4:3] is an ideal example of imputation where God regarded him as righteous. It reckons or attributes to an individual something which he did not have in himself. Like Abraham, David is also cited as another recipient of this free and unmerited grace, where this righteousness of the Lord Jesus Christ is imputed to him (verse 6-8). This righteousness is imputed so that while it is not the sinner's own, yet God counts it as his. Martin Luther puts it succinctly: simul justus ac peccator - justified and a sinner simultaneously.\n\nThe word imputation is also used as in reckoning man's sin to our Lord Jesus. This is where two truths of salvation converge - the burden of man's sin became Christ's burden, while God's righteousness became ours. Such is the great exchange.\n\n\"For he hath made him to be sin for us, who knew no sin; that we might be made the righteousness of God in him\" [2 Corinthians 5:21]. Of course, there was the imputation of Adam's sinfulness to all mankind based on the narrative of the fall in the beginning [Genesis 3]. Adam's sin was imputed to his posterity because he represented the human race [1 Corinthians 15:21]. But the more important question is this - Do you have the righteousness of Christ imputed to you?",
        "part6": "PRAYER",
        "part7": "Father in heaven, I thank You for the great exchange You have executed in Your great salvation plan that through the sacrifice of our Lord Jesus, His righteousness is imputed to me for my salvation. Thank You in Jesus' Name, Amen.",
        "part8": [
            "JEREMIAH 18",
            "1 CORINTHIANS 13"
        ]
    },
    "28 JUNE": {
        "part1": "Romans 4:7",
        "part2": "David's Testimony",
        "part3": "VERSE 7",
        "part4": "Saying, Blessed are they whose iniquities are forgiven, and whose sins are covered.",
        "part5": "Paul quotes David in Psalm 32:1-2a. This psalm may have been written after David's repentance for his adultery with Bathsheba. Have you committed sins you regret, sins that have resulted in sleepless nights, sins that have scarred your loved ones? Have you come before the Lord in genuine repentance yet the pain lingers?\n\nDavid has something to tell you today. Hearken to his testimony here and see how blessed the Christian is. He says in Psalm 32:1, \"Blessed is he whose transgression is forgiven, whose sin is covered.\" The word \"blessed\" means \"happy\". The Christian who realises he is forgiven is a happy Christian.\n\nInstead of wallowing in self-pity and suffering in sorrow, David calls us to experience the joy in God's forgiving grace. Our focus now ought to be on God's forgiveness and not on our past sin. God's forgiveness is a well-established biblical fact and not a 'feeling' we must attain to feel better. Surely, we have to first repent and make peace with both God and man. Thereafter, we are not to dwell on those thoughts of grief, despair and sorrow, but embrace the fact that the Lord Jesus Christ has died on the cross for a specific reason (our sins) by reading His Word and engaging in intimate prayer.\n\nDear Christian, realise the rich grace of the Lord Jesus Christ who perished for you. He died so you may live for Him and not linger in self-pity, doubt and sorrow. This day, be encouraged that God forgives all who come before Him in genuine repentance, regardless of what sins your past may be filled with.",
        "part6": "THOUGHT",
        "part7": "Christ's blood covers all our sins, no matter how grievous you think they are.",
        "part8": [
            "JEREMIAH 19",
            "1 CORINTHIANS 14"
        ]
    },
    "29 JUNE": {
        "part1": "Romans 4:7",
        "part2": "Blessed Negative",
        "part3": "VERSE 7",
        "part4": "Saying, Blessed are they whose iniquities are forgiven, and whose sins are covered.",
        "part5": "Often, we encounter God's blessings in the form of receiving something - strength, perseverance, wisdom, provision. It almost seems abnormal to get a blessing from God where we do not receive.\n\nToday we see Paul's exposition of Psalm 32:2a where God's forgiveness of sins is likened to God not reckoning judgement to people for what they deserve. Imagine yourself in a courtroom where instead of being judged and condemned for your sinful acts, you are acquitted and pronounced 'not guilty'. The reason you are acquitted has nothing to do with anything you have done or any qualities you embody. It is merely because the Judge declares so.\n\nThis is what Paul is stating here when he says, \"Blessed are they whose iniquities are forgiven.\" The forgiving of iniquities is entirely God's prerogative and has nothing to do with us. There is nothing good in us that warrants forgiveness. By not giving us the punishment we truly deserve for our sins, Paul says that this is a blessing that we ought to be happy and thankful for.\n\nWith this in mind, do we find ourselves thinking we deserve a reward for doing something good for God? Take a look at our sins and realise that even the \"smallest sin\" demands judgement. A white lie? Prideful thought? Envy at someone who has something you do not have? In our holy God's eyes, sin whether big or small, calls for the same payment - eternal damnation.\n\nWe are blessed when God does not give us what we truly deserve. We all deserve death, but the debt of our sin has been paid in full.",
        "part6": "THOUGHT",
        "part7": "Realise how many sins we have been forgiven.",
        "part8": [
            "JEREMIAH 20",
            "1 CORINTHIANS 15"
        ]
    },
    "30 JUNE": {
        "part1": "",
        "part2": "",
        "part3": "VERSE 7 to follow a set of 'rules' adopted from biblical",
        "part4": "Saying, Blessed are they whose iniquities are forgiven, and whose sins are covered.",
        "part5": "As Christians, we usually think that we need to repent of and change our old ways after we commit sin. In the attempt to do so, we apply a set of rules and boundaries to abide by in order to change. We approach other believers to help keep us accountable to our rules and we pray often for strength from God to keep us from breaking these rules.\n\nWe may do this because it seems easier for us to follow a set of 'rules' adopted from biblical principles than to have a heart fully surrendered and devoted to God. We may also do this because we do not fully understand the message of the Gospel.\n\nThe focus today is on our sins being covered. This means that when the Lord Jesus Christ died on the cross, all sin (past, present and future) is covered by His blood. As a result of His covering and we accepting this as ours, we become new beings in Christ, indwelt by the Holy Spirit and filled with new delights and desires. With God's Spirit working and active in us comes the yearning to change our sinful behaviours and emotions into those pleasing to Him. Change begins when we realise that the Lord Jesus Christ has covered our sins.\n\nWhen we sin, we have to acknowledge that we are incapable of changing our old sin nature by ourselves. Only God can change us, and God has changed us by covering us with His Son's righteousness, so we may be righteous, and live righteously and victoriously through Him.",
        "part6": "",
        "part7": "What have I done to change my sinful lifestyle? Was I relying on my own strength to change?",
        "part8": []
    }
}